
#Область ПрограммныйИнтерфейс

// Подписание данных
//
// Параметры:
//  ДанныеНаПодпись				                     - Структура:
//  	* МассивДанных                               - Массив - данные для подписи
//  		** Данные                                - Структура
//  			*** Вложения	                     - Неопределено
//  			*** Данные	                         - Строка - формат XML
//  			*** ДанныеФормата                    - Структура
//  				**** ВерсияФормата               - Строка
//  				**** Документ                    - Строка
//  				**** Идентификатор               - Строка
//  				**** Использование               - Булево
//  				**** КодТипаДокумента            - Строка
//  				**** НаименованиеВарианта        - Строка
//  				**** ПриказОВведенииФормата      - Строка
//  				**** ПространствоИмен            - Строка
//  				**** ТребуетсяПодпись            - Булево
//  				**** ФункцияУПД                  - Строка
//  			*** Дата                             - Дата
//  			*** ДоговорДата                      - Дата
//  			*** ДоговорНомер                     - Строка
//  			*** ДокументСсылка                   - Ссылка на документ
//  			*** ДопАтрибуты                      - Неопределено
//  			*** ЗапроситьПодпись                 - Булево
//  			*** ИдентификаторСвязанногоДокумента - Строка
//  			*** ИмяФайла                         - Строка
//  			*** КодТипаДокумента                 - Строка
//  			*** КодУчастникаЭДОПолучателя        - Строка
//  			*** Комментарий                      - Строка
//  			*** Контрагент                       - СправочникСсылка.Контрагенты
//  			*** Организация                      - СправочникСсылка.Организации
//  			*** Подпись                          - Неопределено
//  			*** ПредставлениеНомера              - Строка
//  			*** Ссылка                           - Ссылка на документ
//  			*** ТипСвязи                         - Строка
//  		** ИмяПоляДД                             - Строка
//  		** Представление	                     - Строка
//  	* Представление                              - Строка - представление подписываемых данных
//
//  ПараметрыАвторизации  - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//  ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации - организация ЭДО, от имени которой отправляются документы.
//  ЗаголовокОперации	  - Строка - заголовок, выводимый на форме подписания.
//  ПослеПодписания	      - ОписаниеОповещения - обработчик, который будет вызван после подписания данных, с параметрами:
//					      - Результат 				- Массив - элементы массива - Структура
//					      - ДополнительныеПараметры 	- Произвольный - дополнительные параметры, указанные при создании
//  ПередПодписанием   				 - ОписаниеОповещения - (необязательный) - описание обработчика дополнительной
//                              	 	подготовки данных, после выбора сертификата, которым будут подписаны данные.
//                              		В этом обработчике можно заполнить параметр Данные, если он зависит
//                             			от сертификата, который в момент вызова уже вставлен в ОписаниеДанных,
//                              		как ВыбранныйСертификат (см. ЭлектроннаяПодписьКлиент.Подписать)
//  Контекст				 - 	 ранее сохраненный контекст процедуры подписания. 
Процедура ПодписатьДвоичныеДанные(Знач ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, ЗаголовокОперации, ПослеПодписания, ПередПодписанием = Неопределено, Контекст = Неопределено) Экспорт
	
	Если ПараметрыАвторизации.СпособАвторизации = 
		ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка") Тогда
		ПодписатьТокеномСбербанка(ДанныеНаПодпись, ПараметрыАвторизации, ЗаголовокОперации, ПослеПодписания, ПередПодписанием);
	Иначе
		НачатьПодписание1С(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, ЗаголовокОперации, ПослеПодписания, ПередПодписанием, Контекст, "");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПодписаниеТокеномСбербанка

// Вызов процедуры подписания двоичных данных токеном
//
// Параметры:
//  ДанныеНаПодпись				                     - Структура:
//  	* МассивДанных                               - Массив - данные для подписи
//  		** Данные                                - Структура
//  			*** Вложения	                     - Неопределено
//  			*** Данные	                         - Строка - формат XML
//  			*** ДанныеФормата                    - Структура
//  				**** ВерсияФормата               - Строка
//  				**** Документ                    - Строка
//  				**** Идентификатор               - Строка
//  				**** Использование               - Булево
//  				**** КодТипаДокумента            - Строка
//  				**** НаименованиеВарианта        - Строка
//  				**** ПриказОВведенииФормата      - Строка
//  				**** ПространствоИмен            - Строка
//  				**** ТребуетсяПодпись            - Булево
//  				**** ФункцияУПД                  - Строка
//  			*** Дата                             - Дата
//  			*** ДоговорДата                      - Дата
//  			*** ДоговорНомер                     - Строка
//  			*** ДокументСсылка                   - Ссылка на документ
//  			*** ДопАтрибуты                      - Неопределено
//  			*** ЗапроситьПодпись                 - Булево
//  			*** ИдентификаторСвязанногоДокумента - Строка
//  			*** ИмяФайла                         - Строка
//  			*** КодТипаДокумента                 - Строка
//  			*** КодУчастникаЭДОПолучателя        - Строка
//  			*** Комментарий                      - Строка
//  			*** Контрагент                       - СправочникСсылка.Контрагенты
//  			*** Организация                      - СправочникСсылка.Организации
//  			*** Подпись                          - Неопределено
//  			*** ПредставлениеНомера              - Строка
//  			*** Ссылка                           - Ссылка на документ
//  			*** ТипСвязи                         - Строка
//  		** ИмяПоляДД                             - Строка
//  		** Представление	                     - Строка
//  	* Представление                              - Строка - представление подписываемых данных
//  ПараметрыАвторизации	                         - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//  ЗаголовокОперации			                     - Строка
//  ПослеПодписания			                         - Оповещение после подписания
//  ПередПодписанием			                     - Оповещение перед подписанием
//
Процедура ПодписатьТокеномСбербанка(Знач ДанныеНаПодпись, ПараметрыАвторизации, ЗаголовокОперации, ПослеПодписания, ПередПодписанием = Неопределено) Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДанныеНаПодпись", ДанныеНаПодпись); 
	ДопПараметры.Вставить("ЗаголовокОперации", ЗаголовокОперации);
	ДопПараметры.Вставить("ПослеПодписания", ПослеПодписания);
	ДопПараметры.Вставить("ПередПодписанием", ПередПодписанием);
		
	Если ПараметрыАвторизации <> Неопределено Тогда
		ПродолжитьПодписаниеТокеномСбербанка(ПараметрыАвторизации.КонтекстТокена, ДопПараметры);
	КонецЕсли;
		
КонецПроцедуры

// Инициация подписания двоичных данных токеном
//
// Параметры:
//  КонтекстТокена				                          - Контекст токена после авторизации
//  ДополнительныеПараметры                               - Структура
//		* ПередПодписанием                                - Оповещение
//  	* ДанныеНаПодпись				                  - Структура:
//  		** МассивДанных                               - Массив - данные для подписи
//		  		*** Данные                                - Структура
//  				**** Вложения	                      - Неопределено
//  				**** Данные	                          - Строка - формат XML
//  				**** ДанныеФормата                    - Структура
//  					***** ВерсияФормата               - Строка
//  					***** Документ                    - Строка
//  					***** Идентификатор               - Строка
//  					***** Использование               - Булево
//  					***** КодТипаДокумента            - Строка
//  					***** НаименованиеВарианта        - Строка
//  					***** ПриказОВведенииФормата      - Строка
//  					***** ПространствоИмен            - Строка
//  					***** ТребуетсяПодпись            - Булево
//  					***** ФункцияУПД                  - Строка
//  				**** Дата                             - Дата
//  				**** ДоговорДата                      - Дата
//  				**** ДоговорНомер                     - Строка
//		  			**** ДокументСсылка                   - Ссылка на документ
//  				**** ДопАтрибуты                      - Неопределено
//  				**** ЗапроситьПодпись                 - Булево
//  				**** ИдентификаторСвязанногоДокумента - Строка
// 		 			**** ИмяФайла                         - Строка
//  				**** КодТипаДокумента                 - Строка
//  				**** КодУчастникаЭДОПолучателя        - Строка
//  				**** Комментарий                      - Строка
//	  				**** Контрагент                       - СправочникСсылка.Контрагенты
//  				**** Организация                      - СправочникСсылка.Организации
//  				**** Подпись                          - Неопределено
//  				**** ПредставлениеНомера              - Строка
//		  			**** Ссылка                           - Ссылка на документ
//  				**** ТипСвязи                         - Строка
//  			*** ИмяПоляДД                             - Строка
//  			*** Представление	                      - Строка
//		  	** Представление                              - Строка - представление подписываемых данных
//		* ЗаголовокОперации                               - Строка
//		* ПослеПодписания                                 - Оповещение
//
Процедура ПродолжитьПодписаниеТокеномСбербанка(КонтекстТокена, ДополнительныеПараметры) Экспорт 
	
	ПередПодписанием = ДополнительныеПараметры.ПередПодписанием;
	ДанныеНаПодпись = ДополнительныеПараметры.ДанныеНаПодпись;
	ЗаголовокОперации = ДополнительныеПараметры.ЗаголовокОперации;		
	
	ОписаниеДанных = Новый Структура();
	
	// Здесь можно определить произвольный отбор для списка сертификатов ЭП токена Сбербанка
	ОтборСертификатов = Неопределено;
	ОписаниеДанных.Вставить("ОтборСертификатов", ОтборСертификатов);
	
	Если ПередПодписанием <> Неопределено И ТипЗнч(ПередПодписанием) = Тип("ОписаниеОповещения") Тогда
		ОписаниеДанных.Вставить("ПередВыполнением", ПередПодписанием); 	
	КонецЕсли; 
	
	ЗаполнитьПоляДанныхДляПодписи(ДанныеНаПодпись, ОписаниеДанных);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПослеПодписания", ДополнительныеПараметры.ПослеПодписания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПодписаниеТокеномСбербанка", ЭтотОбъект, ДопПараметры);
	
	ККСНГ_VPNKeyTLSКлиент.НачатьПодписаниеПакета(КонтекстТокена, ОписаниеДанных, ОписаниеОповещения, ЗаголовокОперации);

КонецПроцедуры

// Обработка результат подписания и вызов оповещения после подписания токеном
//
// Параметры:
//  Результат				                              - Структура
//		* Успех                                           - Булево
//		* КонтекстОперации                                - Структура
//			** AuthCookie                                 - Строка
//		* ОписаниеОшибки                                  - Строка
//  ДополнительныеПараметры                               - Структура
//		* ПередПодписанием                                - Оповещение
//  	* ДанныеНаПодпись				                  - Структура:
//  		** МассивДанных                               - Массив - данные для подписи
//		  		*** Данные                                - Структура
//  				**** Вложения	                      - Неопределено
//  				**** Данные	                          - Строка - формат XML
//  				**** ДанныеФормата                    - Структура
//  					***** ВерсияФормата               - Строка
//  					***** Документ                    - Строка
//  					***** Идентификатор               - Строка
//  					***** Использование               - Булево
//  					***** КодТипаДокумента            - Строка
//  					***** НаименованиеВарианта        - Строка
//  					***** ПриказОВведенииФормата      - Строка
//  					***** ПространствоИмен            - Строка
//  					***** ТребуетсяПодпись            - Булево
//  					***** ФункцияУПД                  - Строка
//  				**** Дата                             - Дата
//  				**** ДоговорДата                      - Дата
//  				**** ДоговорНомер                     - Строка
//		  			**** ДокументСсылка                   - Ссылка на документ
//  				**** ДопАтрибуты                      - Неопределено
//  				**** ЗапроситьПодпись                 - Булево
//  				**** ИдентификаторСвязанногоДокумента - Строка
// 		 			**** ИмяФайла                         - Строка
//  				**** КодТипаДокумента                 - Строка
//  				**** КодУчастникаЭДОПолучателя        - Строка
//  				**** Комментарий                      - Строка
//	  				**** Контрагент                       - СправочникСсылка.Контрагенты
//  				**** Организация                      - СправочникСсылка.Организации
//  				**** Подпись                          - Неопределено
//  				**** ПредставлениеНомера              - Строка
//		  			**** Ссылка                           - Ссылка на документ
//  				**** ТипСвязи                         - Строка
//  			*** ИмяПоляДД                             - Строка
//  			*** Представление	                      - Строка
//		  	** Представление                              - Строка - представление подписываемых данных
//		* ЗаголовокОперации                               - Строка
//		* ПослеПодписания                                 - Оповещение
//
Процедура ЗавершитьПодписаниеТокеномСбербанка(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ Результат.Успех Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
	Иначе
		// При последовательной авторизации токенами нескольких организаций сейчас возникает следующая проблема:
		// если выбрана организация отличная от той что на подключенном токене, но контекст для нее уже определен, то при подписании будет произведена переинициализация контекста,
		// т.к. серийный номер токена в контексте и физически подключенного будут различаться. AuthCookie также будет очищена, но ее получение будет инициировано только 
		// при следующем обращении к ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации, т.е. перед началом обработки какого-либо действия пользователя, 
		// связанного с Курьером. При такой ситуации в данном конкретном месте даже при успешной инициализации контекста токена дальнейшее выполнение обращений к API Курьер
		// будет вызывать ошибки из-за пустой AuthCookie.
		
		Если НЕ ЗначениеЗаполнено(Результат.КонтекстОперации.AuthCookie) Тогда
			ОчиститьСообщения();
			
			ТекстОшибки = "Ошибка авторизации в сервисе электронный документооборот. Убедитесь, что установлен верный токен, и повторите попытку.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			Результат.Успех = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПослеПодписания, Результат);
	
КонецПроцедуры

#КонецОбласти 

#Область Подписание1С

// Проверяет необходимость повторной попытки подписать данные сертификатом
//
// Параметры:
//  ПовторитьПопытку				 - Булево 
//  ДопПараметры                     - Данные для повторной попытки подписать двоичные данные
//
Процедура ПослеНастройкиСертификатаЭП(ПовторитьПопытку, ДопПараметры) Экспорт 
	
	ДанныеНаПодпись = ДопПараметры.ДанныеНаПодпись;
	ПараметрыАвторизации = ДопПараметры.ПараметрыАвторизации;
	ПрофильЭДООрганизации = ДопПараметры.ПрофильЭДООрганизации;
	ЗаголовокОперации = ДопПараметры.ЗаголовокОперации;
	ПослеПодписания = ДопПараметры.ПослеПодписания;
	ПередПодписанием = ДопПараметры.ПередПодписанием;
	Контекст = ДопПараметры.Контекст;
	РезультатДополнения = ДопПараметры.РезультатДополнения;
	ПрежнийКодОшибки = ДопПараметры.ПрежнийКодОшибки;
		
	Если ПовторитьПопытку = Истина Тогда
		НачатьПодписание1С(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, ЗаголовокОперации, ПослеПодписания, ПередПодписанием, Контекст, ПрежнийКодОшибки);
	Иначе 
		ВыполнитьОбработкуОповещения(ПослеПодписания, РезультатДополнения);		
	КонецЕсли;

КонецПроцедуры

// Подписание данных сертификатом
//
// Параметры:
//  ДанныеНаПодпись				                     - Структура:
//  	* МассивДанных                               - Массив - данные для подписи
//  		** Данные                                - Структура
//  			*** Вложения	                     - Неопределено
//  			*** Данные	                         - Строка - формат XML
//  			*** ДанныеФормата                    - Структура
//  				**** ВерсияФормата               - Строка
//  				**** Документ                    - Строка
//  				**** Идентификатор               - Строка
//  				**** Использование               - Булево
//  				**** КодТипаДокумента            - Строка
//  				**** НаименованиеВарианта        - Строка
//  				**** ПриказОВведенииФормата      - Строка
//  				**** ПространствоИмен            - Строка
//  				**** ТребуетсяПодпись            - Булево
//  				**** ФункцияУПД                  - Строка
//  			*** Дата                             - Дата
//  			*** ДоговорДата                      - Дата
//  			*** ДоговорНомер                     - Строка
//  			*** ДокументСсылка                   - Ссылка на документ
//  			*** ДопАтрибуты                      - Неопределено
//  			*** ЗапроситьПодпись                 - Булево
//  			*** ИдентификаторСвязанногоДокумента - Строка
//  			*** ИмяФайла                         - Строка
//  			*** КодТипаДокумента                 - Строка
//  			*** КодУчастникаЭДОПолучателя        - Строка
//  			*** Комментарий                      - Строка
//  			*** Контрагент                       - СправочникСсылка.Контрагенты
//  			*** Организация                      - СправочникСсылка.Организации
//  			*** Подпись                          - Неопределено
//  			*** ПредставлениеНомера              - Строка
//  			*** Ссылка                           - Ссылка на документ
//  			*** ТипСвязи                         - Строка
//  		** ИмяПоляДД                             - Строка
//  		** Представление	                     - Строка
//  	* Представление                              - Строка - представление подписываемых данных
//  ЗаголовокОперации			                     - Строка 
//  ПослеПодписания				                     - Описание оповещения после подписания
//  ПередВыполнением			                     - Описание оповещения перед подписанием
//  ОтборСертификатов			                     - Массив из элементов Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования 
//
Процедура Подписать1С(Знач ДанныеНаПодпись, ЗаголовокОперации, ПослеПодписания, ПередВыполнением = Неопределено, ОтборСертификатов = Неопределено, Контекст = Неопределено) Экспорт
	
	ОписаниеДанных = Новый Структура();
	
	ОписаниеДанных.Вставить("Операция", ЗаголовокОперации);
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	
	Если ПередВыполнением <> Неопределено И ТипЗнч(ПередВыполнением) = Тип("ОписаниеОповещения") Тогда
		ОписаниеДанных.Вставить("ПередВыполнением", ПередВыполнением);
	КонецЕсли; 
	
	ОписаниеДанных.Вставить("ОтборСертификатов", ОтборСертификатов);
	ОписаниеДанных.Вставить("БезПодтверждения", Ложь);
	ОписаниеДанных.Вставить("КонтекстОперации", Контекст);
	ОписаниеДанных.Вставить("ЗаголовокДанных", ЗаголовокОперации);
	
	ЗаполнитьПоляДанныхДляПодписи(ДанныеНаПодпись, ОписаниеДанных);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПослеПодписания", ПослеПодписания);
	ПослеПодписания1С = Новый ОписаниеОповещения("ПослеПодписания1С", ЭтотОбъект, ДополнительныеПараметры);
	
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , ПослеПодписания1С);
	
КонецПроцедуры

// Получает файл и сохраняет его в локальную файловую систему пользователя. 
//
// Параметры:
//  Результат				  - не используется
//  ДополнительныеПараметры   - Структура
//		* Данные              - Строка или двоичные данные
//		* ИмяФайла            - Строка
//
Процедура ОбработкаНажатияПредставленияДанныхПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("Данные")
		И ДополнительныеПараметры.Свойство("ИмяФайла") Тогда
		
		ДанныеФайла = Неопределено;
		Если ТипЗнч(ДополнительныеПараметры.Данные) = Тип("Строка") Тогда
			ДанныеФайла = ПолучитьДвоичныеДанныеИзСтроки(ДополнительныеПараметры.Данные, "windows-1251");
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.Данные) = Тип("ДвоичныеДанные") Тогда
			ДанныеФайла = ДополнительныеПараметры.Данные;
		КонецЕсли;
		
		Если НЕ ДанныеФайла = Неопределено Тогда
			АдресВоВременномХранилище =	ПоместитьВоВременноеХранилище(ДанныеФайла, Новый УникальныйИдентификатор());
			ПолучитьФайл(АдресВоВременномХранилище, ДополнительныеПараметры.ИмяФайла);
			УдалитьИзВременногоХранилища(АдресВоВременномХранилище);
		Иначе
			ДанныеФайла = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеПоИмениПоля(Знач НекиеДанные, ИмяПоляДанных)
	
	Попытка
			
	  	ПоляСтруктуры = СтрРазделить(ИмяПоляДанных,".",Ложь);
		
		Для Каждого Поле Из ПоляСтруктуры Цикл
			НекиеДанные = НекиеДанные[Поле];
		КонецЦикла;
		
		Возврат НекиеДанные;
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

Функция СоздатьОбработчикОповещенияПредставленияДанныхПодписи(ДвоичныеДанные, ИмяФайла)

	ДопПараметры = Новый Структура("Данные, ИмяФайла");
	ДопПараметры.Вставить("Данные", ДвоичныеДанные);
	ДопПараметры.Вставить("ИмяФайла", ИмяФайла);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОбработкаНажатияПредставленияДанныхПодписи", ЭтотОбъект, ДопПараметры);
	
	Возврат ОбработчикОповещения;
	
КонецФункции

Процедура ЗаполнитьПоляДанныхДляПодписи(ДанныеНаПодпись, ОписаниеДанных)
	
	Если ДанныеНаПодпись.Свойство("МассивДанных") Тогда
		
		ОписаниеДанных.Вставить("ПредставлениеНабора", ДанныеНаПодпись.Представление);
		НаборДанных = Новый Массив;
		СписокПредставлений = Новый СписокЗначений;
		
		Для Каждого ТекЭлемент Из ДанныеНаПодпись.МассивДанных Цикл
			ТекДанные = ТекЭлемент.Данные;
			ТекПредставление = ТекЭлемент.Представление;
			ЭлементНабора = Новый Структура("Данные,Представление",
								ПолучитьДанныеПоИмениПоля(ТекДанные, ТекЭлемент.ИмяПоляДД), ТекПредставление);
								
			Для Каждого ТекПоле Из ТекДанные Цикл
				ЭлементНабора.Вставить(ТекПоле.Ключ, ТекПоле.Значение);
			КонецЦикла;
			
			ЭлементНабора.Вставить("ИмяПоляДД", ТекЭлемент.ИмяПоляДД);
			НаборДанных.Добавить(ЭлементНабора);
			
			ОбработчикОповещения = СоздатьОбработчикОповещенияПредставленияДанныхПодписи(ЭлементНабора.Данные, ЭлементНабора.Представление);
			СписокПредставлений.Добавить(ОбработчикОповещения, ТекПредставление);
		КонецЦикла;	
		
		ОписаниеДанных.Вставить("НаборДанных", НаборДанных);
		ОписаниеДанных.Вставить("СписокПредставлений", СписокПредставлений);
		 
	Иначе
		
		ТекДанные = ПолучитьДанныеПоИмениПоля(ДанныеНаПодпись.Данные, ДанныеНаПодпись.ИмяПоляДД);
		ТекПредставление = Новый Структура("Значение, Представление");
		ТекПредставление.Значение      = СоздатьОбработчикОповещенияПредставленияДанныхПодписи(ТекДанные, ДанныеНаПодпись.Представление);
		ТекПредставление.Представление = ДанныеНаПодпись.Представление;
		
		ОписаниеДанных.Вставить("Данные", ТекДанные);
		ОписаниеДанных.Вставить("Представление", ТекПредставление);
		
		Для Каждого ТекПоле Из ДанныеНаПодпись.Данные Цикл
			ОписаниеДанных.Вставить(ТекПоле.Ключ, ТекПоле.Значение);
		КонецЦикла;
		
		ОписаниеДанных.Вставить("ИмяПоляДД", ДанныеНаПодпись.ИмяПоляДД);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодписание1С(Знач ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, ЗаголовокОперации, ПослеПодписания, ПередПодписанием = Неопределено, Контекст = Неопределено, ПрежнийКодОшибки = "")
	
	ОтборСертификатов = Новый Массив;
	Если Не ЗначениеЗаполнено(ПараметрыАвторизации.СертификатЭП) Тогда
		
		РезультатДополнения = ККСНГ_ДокументооборотКлиент.ДополнитьПараметрыАвторизацииСертификатомЭП(ПараметрыАвторизации);
		Если РезультатДополнения.Успех Тогда
			ККСНГ_ДокументооборотКлиент.ОбновитьПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПараметрыАвторизации);
		Иначе 
			
			ОбрабатываемыеОшибки = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ОшибкиСертификатаКлючаЭП();
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(РезультатДополнения.Журнал);
			Если ПоследняяОшибка <> Неопределено И
				ПоследняяОшибка.КодОшибки <> ПрежнийКодОшибки И
				ПоследняяОшибка.КодОшибки <> ОбрабатываемыеОшибки["ОшибкаЗапросаАктивногоСертификата"] Тогда
				
				ПараметрыНастройкиЭП = Новый Структура;
				ПараметрыНастройкиЭП.Вставить("КодОшибки", ПоследняяОшибка.КодОшибки);
				ДанныеАктивногоСертификата = РезультатДополнения.Результат;
				ПараметрыНастройкиЭП.Вставить("ДанныеАктивногоСертификата", ДанныеАктивногоСертификата);
				
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ДанныеНаПодпись", ДанныеНаПодпись);
				ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
				ДопПараметры.Вставить("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
				ДопПараметры.Вставить("ЗаголовокОперации", ЗаголовокОперации);
				ДопПараметры.Вставить("ПослеПодписания", ПослеПодписания);
				ДопПараметры.Вставить("ПередПодписанием", ПередПодписанием);
				ДопПараметры.Вставить("Контекст", Контекст);
				ДопПараметры.Вставить("РезультатДополнения", РезультатДополнения);
				ДопПараметры.Вставить("ПрежнийКодОшибки", ПоследняяОшибка.КодОшибки);
				ОповещениеПослеНастройки = Новый ОписаниеОповещения("ПослеНастройкиСертификатаЭП", ЭтотОбъект, ДопПараметры); 
				
				ОткрытьФорму("ОбщаяФорма.ККСНГ_НастройкаСертификатаЭП", ПараметрыНастройкиЭП, , Истина, , , ОповещениеПослеНастройки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
				ВыполнитьОбработкуОповещения(ПослеПодписания, РезультатДополнения);
			КонецЕсли;

			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОтборСертификатов.Добавить(ПараметрыАвторизации.СертификатЭП);
	
	Подписать1С(ДанныеНаПодпись, ЗаголовокОперации, ПослеПодписания, ПередПодписанием, ОтборСертификатов, Контекст);
	
КонецПроцедуры

Процедура ПослеПодписания1С(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("Успех") Тогда
		
		ВыбранныйСертификат = ПредопределенноеЗначение("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка");
		
		Если Результат.Свойство("ВыбранныйСертификат") Тогда
			ВыбранныйСертификат = Результат.ВыбранныйСертификат.Ссылка;
		КонецЕсли;

		// Массив структурированных документов 
		Если Результат.Свойство("НаборДанных") Тогда
			
			Для Каждого Элемент Из Результат.НаборДанных Цикл
				Элемент.Вставить("СертификатСсылка", ВыбранныйСертификат);
			КонецЦикла;
			
			// Неструктурированный документ
		Иначе
			Результат.Вставить("СертификатСсылка", ВыбранныйСертификат);
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПослеПодписания, Результат);
	
КонецПроцедуры

#КонецОбласти