
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("БизнесПроцесс", БизнесПроцесс);
	
	МассивДокументов = Неопределено;
	Если Параметры.Свойство("МассивДокументов", МассивДокументов) Тогда		
				
		Если БизнесПроцесс = "УВХД" Тогда
			
			ТаблицаДанные = Новый ТаблицаЗначений;
			ТаблицаДанные.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
			ТаблицаДанные.Колонки.Добавить("ДоговорСопоставлен", Новый ОписаниеТипов("Булево"));
			ТаблицаДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
			
			Для каждого ЭлементСтруктура Из МассивДокументов Цикл
				НоваяСтрока = ТаблицаДанные.Добавить();
				НоваяСтрока.Тип = Строка(ТипЗнч(ЭлементСтруктура.Ссылка));
				НоваяСтрока.ДоговорСопоставлен = ЭлементСтруктура.ДоговорСопоставлен;
				НоваяСтрока.Количество = 1;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ДанныеКОтправке.Тип КАК Тип,
			               |	ДанныеКОтправке.ДоговорСопоставлен КАК ДоговорСопоставлен,
			               |	ДанныеКОтправке.Количество КАК Количество
			               |ПОМЕСТИТЬ ВТ_Данные
			               |ИЗ
			               |	&ДанныеКОтправке КАК ДанныеКОтправке
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВЫБОР
			               |		КОГДА ВТ_Данные.ДоговорСопоставлен
			               |			ТОГДА ""К отправке""
			               |		ИНАЧЕ ""Договоры не сопоставлены""
			               |	КОНЕЦ КАК Наименование,
			               |	ВТ_Данные.Тип КАК Тип,
			               |	ВТ_Данные.Количество КАК Количество,
			               |	ВЫБОР
			               |		КОГДА ВТ_Данные.ДоговорСопоставлен
			               |			ТОГДА 1
			               |		ИНАЧЕ 2
			               |	КОНЕЦ КАК Порядок
			               |ИЗ
			               |	ВТ_Данные КАК ВТ_Данные
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Порядок
			               |ИТОГИ
			               |	СУММА(Количество)
			               |ПО
			               |	Наименование,
			               |	Тип";
			
			Запрос.УстановитьПараметр("ДанныеКОтправке", ТаблицаДанные);
			
			ВыборкаНаименование = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Корень = ДеревоДокументы.ПолучитьЭлементы();
			КоличествоВсего = 0;
			
			Пока ВыборкаНаименование.Следующий() Цикл
				
				СтрокаПервогоУровня = Корень.Добавить();
				СтрокаПервогоУровня.Измерение = ВыборкаНаименование.Наименование;
				СтрокаПервогоУровня.Количество = ВыборкаНаименование.Количество;
				СтрокаПервогоУровня.Отметка = Истина;
				КоличествоВсего = КоличествоВсего + ВыборкаНаименование.Количество;
				
				СтрокиВторогоУровня = СтрокаПервогоУровня.ПолучитьЭлементы();
				ВыборкаТип = ВыборкаНаименование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаТип.Следующий() Цикл
					СтрокаВторогоУровня = СтрокиВторогоУровня.Добавить();
					СтрокаВторогоУровня.Измерение = ВыборкаТип.Тип;
					СтрокаВторогоУровня.Количество = ВыборкаТип.Количество;
				КонецЦикла; 
			КонецЦикла;			
			
			СтрокаВсего = Корень.Вставить(0);
			СтрокаВсего.Измерение = "Всего";
			СтрокаВсего.Количество = КоличествоВсего;
			СтрокаВсего.Отметка = Истина;
			
		Иначе
			
			ТаблицаДанные = Новый ТаблицаЗначений;
			ТаблицаДанные.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
			ТаблицаДанные.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
			ТаблицаДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
			
			Для каждого ЭлементСтруктура Из МассивДокументов Цикл
				НоваяСтрока = ТаблицаДанные.Добавить();
				НоваяСтрока.Тип = Строка(ТипЗнч(ЭлементСтруктура.Ссылка));
				НоваяСтрока.Контрагент = ЭлементСтруктура.Контрагент;
				НоваяСтрока.Количество = 1;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ
			|	ДанныеКОтправке.Тип КАК Тип,
			|	ДанныеКОтправке.Контрагент КАК Контрагент,
			|	ДанныеКОтправке.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_Данные
			|ИЗ
			|	&ДанныеКОтправке КАК ДанныеКОтправке
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Данные.Тип КАК Тип,
			|	ВТ_Данные.Контрагент КАК Контрагент,
			|	ВТ_Данные.Количество КАК Количество
			|ИЗ
			|	ВТ_Данные КАК ВТ_Данные
			|ИТОГИ
			|	СУММА(Количество)
			|ПО
			|	Тип,
			|	Контрагент";
			Запрос.УстановитьПараметр("ДанныеКОтправке", ТаблицаДанные);
			ВыборкаТип = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Корень = ДеревоДокументы.ПолучитьЭлементы();
			КоличествоВсего = 0;
			Пока ВыборкаТип.Следующий() Цикл
				СтрокаПервогоУровня = Корень.Добавить();
				СтрокаПервогоУровня.Измерение = ВыборкаТип.Тип;
				СтрокаПервогоУровня.Количество = ВыборкаТип.Количество;
				СтрокаПервогоУровня.Отметка = Истина;
				КоличествоВсего = КоличествоВсего + ВыборкаТип.Количество;
				
				СтрокиВторогоУровня = СтрокаПервогоУровня.ПолучитьЭлементы();
				ВыборкаКонтрагент = ВыборкаТип.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					СтрокаВторогоУровня = СтрокиВторогоУровня.Добавить();
					СтрокаВторогоУровня.Измерение = ВыборкаКонтрагент.Контрагент;
					СтрокаВторогоУровня.Количество = ВыборкаКонтрагент.Количество;
				КонецЦикла; 
			КонецЦикла;		
			
			СтрокаВсего = Корень.Вставить(0);
			СтрокаВсего.Измерение = "Всего";
			СтрокаВсего.Количество = КоличествоВсего;
			СтрокаВсего.Отметка = Истина;
			
		КонецЕсли;
						
	Иначе
		Отказ = Истина; 
	КонецЕсли; 
				
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьОтправку(Команда)
	Закрыть(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОтправку(Команда)
	
	Если БизнесПроцесс = "УВХД" Тогда
		ДокументыПодтвержденныеКОтправке = Новый Массив();
		ДокументыВыбранныеКОтправке = ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.ДанныеКОтправке;
		Для каждого ДанныеДокумента Из ДокументыВыбранныеКОтправке Цикл
			Если ДанныеДокумента.ДоговорСопоставлен Тогда
				ДокументыПодтвержденныеКОтправке.Добавить(ДанныеДокумента);					
			КонецЕсли;	
		КонецЦикла;
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.ДанныеКОтправке = ДокументыПодтвержденныеКОтправке;
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти
