#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяФайла", ЭтотОбъект.Протокол);
	Параметры.Свойство("ЗаголовокДокумента", ЭтотОбъект.ЗаголовокДокумента);
	
	Если Не ПустаяСтрока(ЭтотОбъект.ЗаголовокДокумента) Тогда
		ЭтотОбъект.Заголовок = СтрШаблон("%1. Протокол передачи", СокрЛП(ЭтотОбъект.ЗаголовокДокумента));
	КонецЕсли;
	
	ИмяРеквизита = "ДокументPDF";
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СравнитьВерсиюПриложения("8.3.21") >= 0 Тогда
		
		Попытка
			
			ДобавляемыеРеквизиты = Новый Массив;
			РеквизитДокументPDF = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ДокументPDF"));
			ДобавляемыеРеквизиты.Добавить(РеквизитДокументPDF);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			ПолеДокументPDF = ЭтотОбъект.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"));
			ПолеДокументPDF.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеДокументPDF.Вид = ВидПоляФормы.ПолеPDFДокумента;
			ПолеДокументPDF.ПутьКДанным = ИмяРеквизита;
			
			ЭтотОбъект[ИмяРеквизита] = Неопределено;
			ЭтотОбъект[ИмяРеквизита].Прочитать(ЭтотОбъект.Протокол);
			
			Элементы.Протокол.Видимость = Ложь;
			Элементы.ФормаСохранитьНаДиск.Видимость = Ложь;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	Файл = Новый Файл(Протокол);
	Если Файл.Существует() Тогда
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.ПолноеИмяФайла = ЭтотОбъект.Заголовок;
		ДиалогВыбораФайла.Фильтр = "PDF|*.pdf";
		
		ОписаниеОповещенияПослеВыбораФайла = Новый ОписаниеОповещения("СохранитьНаДискПослеВыбораФайла", ЭтотОбъект);
		ДиалогВыбораФайла.Показать(ОписаниеОповещенияПослеВыбораФайла);
		
	Иначе
		ВызватьИсключение "Файл не найден";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьНаДискПослеВыбораФайла(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ОписаниеОповещенияПослеКопированияФайла = Новый ОписаниеОповещения();
		НачатьКопированиеФайла(ОписаниеОповещенияПослеКопированияФайла, Протокол, ВыбранныеФайлы[0]);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти