#Область ПрограммныйИнтерфейс

// Проверяет включение безопасного режима для расширения
//
// Параметры:
//   ИмяПроверяемогоРасширения - Строка - Имя проверяемого расширения
//
// Возвращаемое значение:
//   Булево - результат проверки
//
Функция БезопасныйРежимВключен(ИмяПроверяемогоРасширения) Экспорт

	Перем БезопасныйРежим;
	БезопасныйРежим = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		СписокРасширений = РасширенияКонфигурации.Получить(Новый Структура("Имя", ИмяПроверяемогоРасширения));
	Исключение
		БезопасныйРежим = Истина;
		СписокРасширений = Новый Массив;
	КонецПопытки;

	Для каждого Расширение Из СписокРасширений Цикл
		БезопасныйРежим = Расширение.БезопасныйРежим;
	КонецЦикла;
	
	Возврат БезопасныйРежим;
	
КонецФункции

// Проверяет право администрирования расширений для текущего пользователя
//
// Возвращаемое значение:
//   Булево - Результат проверки 
//
Функция ДоступноПравоАдминистрированияРасширений() Экспорт
	
	Возврат ПравоДоступа("АдминистрированиеРасширенийКонфигурации", Метаданные);

КонецФункции

#КонецОбласти