
#Область ПрограммныйИнтерфейс

// Возвращает структуру данных, заполненную по структурированному документу
//
// Параметры:
//	ДанныеXML - строка XML, адрес во временном хранилище или двоичные данные
//	ИмяФайла - строка, содержащая имя файла (используется для определения формата)
//
// Возвращаемое значение:
//	Структура
//
Функция ПолучитьДанныеПоСтруктурированномуXML(ДанныеXML, ИмяФайла = "") Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка данных XML структурированного документа");
	
	ЗапросОбъектаXDTO = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьОбъектXDTOПоСтруктурированномуXML(ДанныеXML);
	Если Не ЗапросОбъектаXDTO.Успех Тогда
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросОбъектаXDTO.Журнал, Ложь);
		Возврат Ответ;
	КонецЕсли;
	
	ДанныеДокумента = ПолучитьСтруктуруДокумента();
	ДанныеXML = ККСНГ_APIКурьер.ПолучитьСтруктуруПоОбъектуXDTO(ЗапросОбъектаXDTO.Результат);
	
	// Реквизиты заголовка
	СписокРеквизитов = Новый СписокЗначений();
	СписокРеквизитов.Добавить("ИдентификаторФайла", "ИдФайл");
	
	СвСчФакт = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт");
	СвКСчФ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвКСчФ");
	Если СвСчФакт = Неопределено И СвКСчФ <> Неопределено Тогда
		// Замена ветки СвСчФакт на СвКСчФ для единообразного парсинга
		ДанныеXML.Документ.Вставить("СвСчФакт", СвКСчФ);
	КонецЕсли;
	
	// УПД приказ 970
	СписокРеквизитов.Добавить("Номер", "Документ.СвСчФакт.НомерДок");
	СписокРеквизитов.Добавить("ДатаСтрокой", "Документ.СвСчФакт.ДатаДок");
	СписокРеквизитов.Добавить("КодОКВ", "Документ.СвСчФакт.ДенИзм.КодОКВ");
	
	СписокРеквизитов.Добавить("Отправитель", "СвУчДокОбор.ИдОтпр");
	СписокРеквизитов.Добавить("Получатель", "СвУчДокОбор.ИдПол");
	СписокРеквизитов.Добавить("Номер", "Документ.СвСчФакт.НомерСчФ");
	СписокРеквизитов.Добавить("ДатаСтрокой", "Документ.СвСчФакт.ДатаСчФ");
	СписокРеквизитов.Добавить("КодОКВ", "Документ.СвСчФакт.КодОКВ");
	
	СписокРеквизитов.Добавить("ПервичныйДокумент", "Документ.НаимДокОпр");
	СписокРеквизитов.Добавить("Функция", "Документ.Функция");
	СписокРеквизитов.Добавить("СуммаБезНДС", "Документ.ТаблСчФакт.ВсегоОпл.СтТовБезНДСВсего");
	СписокРеквизитов.Добавить("СуммаНДС", "Документ.ТаблСчФакт.ВсегоОпл.СумНалВсего.СумНДС");
	СписокРеквизитов.Добавить("СуммаСНДС", "Документ.ТаблСчФакт.ВсегоОпл.СтТовУчНалВсего");
	
	// Для УКД
	СписокРеквизитов.Добавить("Номер", "Документ.СвСчФакт.НомерКСчФ");
	СписокРеквизитов.Добавить("ДатаСтрокой", "Документ.СвСчФакт.ДатаКСчФ");
	СписокРеквизитов.Добавить("СуммаБезНДСУвеличение", "Документ.ТаблКСчФ.ВсегоУвел.СтТовБезНДСВсего");
	СписокРеквизитов.Добавить("СуммаНДСУвеличение", "Документ.ТаблКСчФ.ВсегоУвел.СумНал.СумНДС");
	СписокРеквизитов.Добавить("СуммаСНДСУвеличение", "Документ.ТаблКСчФ.ВсегоУвел.СтТовУчНалВсего");
	СписокРеквизитов.Добавить("СуммаБезНДСУменьшение", "Документ.ТаблКСчФ.ВсегоУм.СтТовБезНДСВсего");
	СписокРеквизитов.Добавить("СуммаНДСУменьшение", "Документ.ТаблКСчФ.ВсегоУм.СумНал.СумНДС");
	СписокРеквизитов.Добавить("СуммаСНДСУменьшение", "Документ.ТаблКСчФ.ВсегоУм.СтТовУчНалВсего");
	
	// Транспортные накладные.
	ЗаполнитьДанныеТранспортныхНакладных(ДанныеДокумента, ДанныеXML);
	
	// Платёжно-расчетные документы.
	ЗаполнитьСведенияПлатежноРасчетныхДокументов(ДанныеДокумента, ДанныеXML);
	
	// Исправление СчФ
	СписокРеквизитов.Добавить("НомерИсправления", "Документ.СвСчФакт.ИспрСчФ.НомИспрСчФ");
	СписокРеквизитов.Добавить("ДатаИсправленияСтрокой", "Документ.СвСчФакт.ИспрСчФ.ДатаИспрСчФ");
	
	// УПД 970
	СписокРеквизитов.Добавить("НомерИсправления", "Документ.СвСчФакт.ИспрДок.НомИспр");
	СписокРеквизитов.Добавить("ДатаИсправленияСтрокой", "Документ.СвСчФакт.ИспрДок.ДатаИспр");
	
	// Пока не обрабатываем.
	// Исправление КСчФ
	// СписокРеквизитов.Добавить("НомерИсправления",		"Документ.СвСчФакт.ИспрКСчФ.НомИспрКСчФ");
	// СписокРеквизитов.Добавить("ДатаИсправленияСтрокой",	"Документ.СвСчФакт.ИспрКСчФ.ДатаИспрКСчФ");
	
	// Корректировка		
	Если СвКСчФ <> Неопределено Тогда
		
		// Сведения об основаниях корректировки.
		ЗаполнитьСведенияОбОснованияхКорректировки(ДанныеДокумента, ДанныеXML);
				
		// Сведения о корректируемых документах.
		ЗаполнитьСведенияОКорректируемыхДокументах(ДанныеДокумента, ДанныеXML);
		
		ЗаполнитьСведенияОбИсправленияхИсходныхДокументов(ДанныеДокумента, ДанныеXML);
					
	// Путь "Документ.СвСчФакт.СчФ.НомерСчФ" есть только в УКД (189 приказ).
	// Иначе
	//	СписокРеквизитов.Добавить("НомерОсн",				"Документ.СвСчФакт.СчФ.НомерСчФ");
	//	СписокРеквизитов.Добавить("ДатаОснСтрокой",			"Документ.СвСчФакт.СчФ.ДатаСчФ");	
	КонецЕсли;
			
	// Сведения о продавце
	ДополнитьДанныеСведениямиОПродавце(СписокРеквизитов, ДанныеXML);
		
	// Сведения о покупателе
	ДополнитьДанныеСведениямиОПокупателе(СписокРеквизитов, ДанныеXML);
	
	// Сведения о грузоотправителе
	ДополнитьДанныеСведениямиОГрузоотправителе(СписокРеквизитов, ДанныеXML);
	
	// Сведения о перевозчике
	ДополнитьДанныеСведениямиОПеревозчике(СписокРеквизитов, ДанныеXML);
	
	СписокРеквизитов.Добавить("ОбстФормСЧФ", "Документ.СвСчФакт.ДопСвФХЖ1.ОбстФормСЧФ");
	
	Для каждого Реквизит Из СписокРеквизитов Цикл
		ТекущееЗначениеСвойства = Неопределено;
		ДанныеДокумента.Свойство(Реквизит.Значение, ТекущееЗначениеСвойства);
		НовоеЗначениеСвойства = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, Реквизит.Представление, ТекущееЗначениеСвойства);
		ДанныеДокумента.Вставить(Реквизит.Значение,	НовоеЗначениеСвойства);
	КонецЦикла;
	
	Если Не ПустаяСтрока(ДанныеДокумента.ДатаСтрокой) Тогда
		Попытка
			ДанныеДокумента.Дата = Дата(ДанныеДокумента.ДатаСтрокой + " 00:00:00");
		Исключение
			ДанныеДокумента.Дата = Дата(1, 1, 1);
		КонецПопытки;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеДокумента.ДатаИсправленияСтрокой) Тогда
		Попытка
			ДанныеДокумента.ДатаИсправления = Дата(ДанныеДокумента.ДатаИсправленияСтрокой + " 00:00:00");
		Исключение
			ДанныеДокумента.ДатаИсправления = Дата(1, 1, 1);
		КонецПопытки;
	КонецЕсли;
	
	// Таблица номенклатуры
	ЗаполнитьСведенияОТоварах(ДанныеДокумента, ДанныеXML);
	
	// Таблица номенклатуры кор
	ЗаполнитьСведенияОКорректируемыхТоварах(ДанныеДокумента, ДанныеXML);
	
	Ответ.Результат = ДанныеДокумента;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

// Заполняет таблицу ссылками на Справочник.Номенклатура из Справочник.ККСНГ_НоменклатураКонтрагентов
//
// Параметры:
//	ТаблицаНоменклатуры                - Таблица значений - таблица номенклатуры
//	Контрагент                         - Справочник.Контрагенты
//
Процедура НайтиСопоставленияНоменклатурыКонтрагента(ТаблицаНоменклатуры, Контрагент) Экспорт
	
	СписокВидовНоменклатуры = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьСписокПризнаковТоварРабота();
	
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		// TODO Вынести заполнение ставки НДС
		СтрокаНоменклатуры.СтавкаНДС = ККСНГ_ДокументооборотПовтИсп.ПолучитьСтавкуНДСДляПринятияКУчету(СтрокаНоменклатуры.СтавкаНДССтрокой);
		
		ВидНоменклатуры = СписокВидовНоменклатуры.НайтиПоЗначению(СтрокаНоменклатуры.Вид);
		СтрокаНоменклатуры.СопоставленоАвтоматически = Ложь;
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			
			ЗапросНоменклатуры = Справочники.ККСНГ_НоменклатураКонтрагентов.НайтиСоответствиеНоменклатурыПоДаннымКонтрагента(
			Контрагент,
			СтрокаНоменклатуры.Код,
			СтрокаНоменклатуры.Наименование,
			?(ВидНоменклатуры <> Неопределено, ВидНоменклатуры.Представление, ""),
			СтрокаНоменклатуры.ЕдИзм,
			СтрокаНоменклатуры.Артикул,
			СтрокаНоменклатуры.Характеристика);
			
			Если ЗапросНоменклатуры.Успех Тогда 
				
				СтрокаНоменклатуры.Номенклатура = ЗапросНоменклатуры.Результат.Номенклатура;
				СтрокаНоменклатуры.ХарактеристикаНоменклатуры = ЗапросНоменклатуры.Результат.ХарактеристикаНоменклатуры;
				СтрокаНоменклатуры.СопоставленоАвтоматически = Истина; 
				
			КонецЕсли;

		КонецЕсли;
		
		//  Заполнение ед.изм.
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.КодОКЕИ) Тогда
			ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
			ЕдИзмСсылка = ОбщийМодульПринятиеКУчету.НайтиЕдиницуИзмерения(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.КодОКЕИ);
			СтрокаНоменклатуры.ЕдИзмСсылка = ЕдИзмСсылка;
		КонецЕсли;
		
		//  Заполнение страны происхождения
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.КодСтраныПроисх) Тогда
			ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
			СтранаСсылка = ОбщийМодульПринятиеКУчету.НайтиСтрануМира(СтрокаНоменклатуры.КодСтраныПроисх);
			СтрокаНоменклатуры.СтранаПроисхожденияСсылка = СтранаСсылка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет таблицу ссылками на Справочник.Номенклатура из Справочник.ККСНГ_НоменклатураКонтрагентов для корректировки
// Параметры:
//   ТаблицаНоменклатуры                - Таблица значений - таблица номенклатуры
//   Контрагент                         - Справочник.Контрагенты
Процедура НайтиСопоставленияНоменклатурыКонтрагентаДляКорректировки(ТаблицаНоменклатуры, Контрагент) Экспорт
	
	СписокВидовНоменклатуры = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьСписокПризнаковТоварРабота();
	
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		
		// TODO Вынести заполнение ставки НДС
		СтрокаНоменклатуры.СтавкаНДСДоИзменения = ККСНГ_ДокументооборотПовтИсп.ПолучитьСтавкуНДСДляПринятияКУчету(СтрокаНоменклатуры.СтавкаНДССтрокойДоИзменения);
		СтрокаНоменклатуры.СтавкаНДС = ККСНГ_ДокументооборотПовтИсп.ПолучитьСтавкуНДСДляПринятияКУчету(СтрокаНоменклатуры.СтавкаНДССтрокой);
		
		СтрокаНоменклатуры.СопоставленоАвтоматически = Ложь;
		
		НаименованиеЕдИзм = СтрокаНоменклатуры.ЕдИзм;
		
		//  Заполнение ед.изм.
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.КодОКЕИ) Тогда
			
			ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
			ЕдИзмСсылка = ОбщийМодульПринятиеКУчету.НайтиЕдиницуИзмерения(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.КодОКЕИ);
			СтрокаНоменклатуры.ЕдИзмСсылка = ЕдИзмСсылка;
			
			Если ПустаяСтрока(НаименованиеЕдИзм) Тогда
				НаименованиеЕдИзм = ЕдИзмСсылка.Наименование;
			КонецЕсли;
			
		КонецЕсли;
		
		//  Заполнение номенклатуры.
		Если ЗначениеЗаполнено(Контрагент) Тогда
			
			ЗапросНоменклатуры = Справочники.ККСНГ_НоменклатураКонтрагентов.НайтиСоответствиеНоменклатурыПоДаннымКонтрагентаДляКорректировки(
			Контрагент,
			СтрокаНоменклатуры.Наименование,
			НаименованиеЕдИзм,
			СтрокаНоменклатуры.Характеристика);
			
			Если ЗапросНоменклатуры.Успех Тогда
				
				СтрокаНоменклатуры.Номенклатура = ЗапросНоменклатуры.Результат.Номенклатура;
				СтрокаНоменклатуры.ХарактеристикаНоменклатуры = ЗапросНоменклатуры.Результат.ХарактеристикаНоменклатуры;
				СтрокаНоменклатуры.СопоставленоАвтоматически = Истина;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет данные по электронному документу.
//
// Параметры:
//	ДокументСсылка - ссылка на документ
//
// Возвращаемое значение:
//	Структура
//
Функция ДанныеДокумента(ДокументСсылка) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка данных электронного документа для учета");
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		
	ЗапросДанных = ОбщийМодульПринятиеКУчету.ПолучитьДанныеПоСтруктурированномуДокументу(ДокументСсылка);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанных.Журнал, Ложь);
	
	Если Не ЗапросДанных.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Результат = ЗапросДанных.Результат;
	Результат.Вставить("ВидСчетаФактурыПолученного");
	
	СтруктДок = Результат.СтруктурированныйДокумент;
	
	// Счет-фактура без первичного документа Функция = СЧФ.
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(СтруктДок.НомерИсправления) Тогда
		
		СчетФактураСсылкаИсправляемый = Неопределено;
		КорректируемыйДокумент = Неопределено;
		Если СтруктДок.ОбстФормСЧФ = "2" Тогда // Счет-фактура авансовый
			ВидСчетаФактурыИсправляемого = "НаАванс";
			СчетФактураСсылкаИсправляемый = ОбщийМодульПринятиеКУчету.НайтиИсправляемыйАвансСФ(Результат.Организация, Результат.Контрагент, СтруктДок.Дата, СтруктДок.Номер);
		Иначе // Все прочие варианты пока считаем за поступление.
			
			ВидСчетаФактурыИсправляемого = ?(СтруктДок.ОбстФормСЧФ = "1", "НаПоступление", Неопределено);
			
			ДанныеИсправляемыхДокументов = СтруктДок.ОснСЧФ.СкопироватьКолонки();
			СтрокаТекДокумента = ДанныеИсправляемыхДокументов.Добавить();
			СтрокаТекДокумента.НомерОснСЧФ = СтруктДок.Номер;
			СтрокаТекДокумента.ДатаОснСЧФ = СтруктДок.Дата;
			КорректируемыйДокумент = ОбщийМодульПринятиеКУчету.НайтиКорректируемыйДокумент(Результат.Организация, Результат.Контрагент, ДанныеИсправляемыхДокументов, Ложь);
			
		КонецЕсли;
		Результат.Вставить("ВидСчетаФактурыИсправляемого", ВидСчетаФактурыИсправляемого);
		Результат.Вставить("СчетФактураСсылкаИсправляемый", СчетФактураСсылкаИсправляемый);
		Результат.Вставить("КорректируемыйДокумент", КорректируемыйДокумент);
		
	ИначеЕсли ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(Результат.ИдентификаторФайла) Тогда
		
		КорректируемыйДокумент = ОбщийМодульПринятиеКУчету.НайтиКорректируемыйДокумент(Результат.Организация, Результат.Контрагент, СтруктДок.ОснСЧФ, Истина);
		Результат.Вставить("КорректируемыйДокумент", КорректируемыйДокумент);
		
	ИначеЕсли ВРег(СтруктДок.Функция) = "СЧФ" Тогда
							
		Если СтруктДок.ОбстФормСЧФ = "1" Тогда // Счет-фактура на поступление
			Результат.ВидСчетаФактурыПолученного = "НаПоступление";
			
			ДанныеОснованийСЧФ = ТаблицаОснСЧФ();
			СтрокаТекДокумента = ДанныеОснованийСЧФ.Добавить();
			СтрокаТекДокумента.НомерОснСЧФ = СтруктДок.Номер;
			СтрокаТекДокумента.ДатаОснСЧФ = СтруктДок.Дата;
			
			ДополнитьОснованияСЧФТранспортнымиНакладными(ДанныеОснованийСЧФ, СтруктДок.ТранНакл);
			ПоступлениеТоваровУслугСсылка = ОбщийМодульПринятиеКУчету.НайтиОснованиеСФ(Результат.Организация, Результат.Контрагент, ДанныеОснованийСЧФ, Результат.ВидСчетаФактурыПолученного);
			Результат.Вставить("ПоступлениеТоваровУслугСсылка", ПоступлениеТоваровУслугСсылка);
			
		ИначеЕсли СтруктДок.ОбстФормСЧФ = "2" Или Не ЗначениеЗаполнено(СтруктДок.ОбстФормСЧФ) Тогда // Счет-фактура авансовый
			
			Результат.ВидСчетаФактурыПолученного = "НаАванс";
			ДанныеОснованийСЧФ = ТаблицаОснСЧФ();
			ДополнитьОснованияСЧФСведениямиПРД(ДанныеОснованийСЧФ, СтруктДок.СвПРД);
			ДокументОснование = ОбщийМодульПринятиеКУчету.НайтиОснованиеСФ(Результат.Организация, Результат.Контрагент, ДанныеОснованийСЧФ, Результат.ВидСчетаФактурыПолученного);
			Результат.Вставить("ДокументОснование", ДокументОснование);
			
		ИначеЕсли Результат.СтруктурированныйДокумент.ОбстФормСЧФ = "3" Тогда // Счет-фактура на аванс комитента.
			Результат.ВидСчетаФактурыПолученного = "НаАвансКомитента";
		Иначе
			Результат.ВидСчетаФактурыПолученного = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.Успех = Истина;
	Ответ.Результат = Результат;
	
	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает структуру данных ЭД
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция ПолучитьСтруктуруЭлектронногоДокумента() Экспорт
	
	СтруктураЭД = Новый Структура;
	
	СтруктураЭД.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	СтруктураЭД.Вставить("Контрагент");
	СтруктураЭД.Вставить("ДоговорКонтрагента");
	СтруктураЭД.Вставить("Склад");
	СтруктураЭД.Вставить("ВалютаДокумента");
	СтруктураЭД.Вставить("СуммаДокумента", 0);
	
	СтруктураЭД.Вставить("ДокументУчета", Неопределено);
	СтруктураЭД.Вставить("ДокументОснование", Неопределено);
	
	СтруктураЭД.Вставить("ВидСчетаФактурыПолученного", Неопределено);
	СтруктураЭД.Вставить("ИдентификаторФайла", Неопределено);
	
	СтруктураЭД.Вставить("СтруктурированныйДокумент", Неопределено);
	
	Возврат СтруктураЭД;
	
КонецФункции

// Получает структуру  данных транспортных накладных
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	ТаблицаЗначений
//   * НомТранНакл    - Строка
//   * ДатаТранНакл   - Дата
//
Функция ТаблицаТранНакл() Экспорт
	
	ТаблицаТранНакл = Новый ТаблицаЗначений;
	ТаблицаТранНакл.Колонки.Добавить("НомТранНакл", ТипСтроки());
	ТаблицаТранНакл.Колонки.Добавить("ДатаТранНакл", ТипДаты());
		
	Возврат ТаблицаТранНакл;
	
КонецФункции

// Получает структуру основания сч-ф
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	ТаблицаЗначений
//   * НомерОснСЧФ    - Строка
//   * ДатаОснСЧФ     - Дата
//
Функция ТаблицаОснСЧФ() Экспорт
	
	ТаблицаОснСЧФ = Новый ТаблицаЗначений;
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная);
	ТипСтроки = Новый ОписаниеТипов("Строка", , КвалификаторСтроки); 
	ТаблицаОснСЧФ.Колонки.Добавить("НомерОснСЧФ", ТипСтроки);
	
	ТаблицаОснСЧФ.Колонки.Добавить("ДатаОснСЧФ", ТипДаты());
	
	Возврат ТаблицаОснСЧФ;
	
КонецФункции

// Получает структуру таблицы для данных об исправлениях исходной сч-ф
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	ТаблицаЗначений
//   * НомИспрСчФ    - Число
//   * ДатаИспрСчФ     - Дата
//
Функция ТаблицаИспрСчФ() Экспорт
	
	ТаблицаИспрСчФ = Новый ТаблицаЗначений;
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(3, 0);
	ТипСтроки = Новый ОписаниеТипов("Число", КвалификаторЧисла); 
	ТаблицаИспрСчФ.Колонки.Добавить("НомИспрСчФ", ТипСтроки);
	
	ТаблицаИспрСчФ.Колонки.Добавить("ДатаИспрСчФ", ТипДаты());
	
	Возврат ТаблицаИспрСчФ;
	
КонецФункции

// Получает структуру сведений о передаче
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	ТаблицаЗначений
//   * НомерПРД    - Строка
//   * ДатаПРД     - Дата
//   * СуммаПРД    - Число
//
Функция ТаблицаСвПРД() Экспорт
	
	ТаблицаСвПРД = Новый ТаблицаЗначений;
	ТаблицаСвПРД.Колонки.Добавить("НомерПРД", ТипСтроки());
	ТаблицаСвПРД.Колонки.Добавить("ДатаПРД", ТипДаты());
	ТаблицаСвПРД.Колонки.Добавить("СуммаПРД", ТипСуммы());
	
	Возврат ТаблицаСвПРД;
	
КонецФункции

// Получает структуру метасведений документа ЭД
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция ПолучитьСтруктуруДокумента() Экспорт
	
	// Структурированный документ
	
	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("ИдентификаторФайла", "");
	
	СтруктураДокумента.Вставить("Отправитель", ""); // код ЭДО
	СтруктураДокумента.Вставить("Получатель", ""); // код ЭДО
	
	СтруктураДокумента.Вставить("Функция", "");
	СтруктураДокумента.Вставить("Номер", "");
	СтруктураДокумента.Вставить("Дата", Дата(1, 1, 1));
	СтруктураДокумента.Вставить("ДатаСтрокой", "");
	СтруктураДокумента.Вставить("КодОКВ", "");
		
	СтруктураДокумента.Вставить("ПродавецНаименование", "");
	СтруктураДокумента.Вставить("ПродавецИНН", "");
	СтруктураДокумента.Вставить("ПродавецКПП", "");
	
	СтруктураДокумента.Вставить("ПокупательНаименование", "");
	СтруктураДокумента.Вставить("ПокупательИНН", "");
	СтруктураДокумента.Вставить("ПокупательКПП", "");
	
	СтруктураДокумента.Вставить("ОбстФормСЧФ", "");
	 	
	// Исправление
	СтруктураДокумента.Вставить("НомерИсправления", Неопределено);
	СтруктураДокумента.Вставить("ДатаИсправления", Дата(1, 1, 1));
	
	КвалификаторЧисла = Новый КвалификаторыЧисла();
	ТипЧисла = Новый ОписаниеТипов("Число", , КвалификаторЧисла); 
	КвалификаторКоличества = Новый КвалификаторыЧисла(17, 3);
	ТипКоличества = Новый ОписаниеТипов("Число", , КвалификаторКоличества); 
	ТипСтроки = ТипСтроки(); 
	ТипДаты = ТипДаты();
	ТипСуммы = ТипСуммы();
	
	// Транспортные накладные
	СтруктураДокумента.Вставить("ТранНакл", ТаблицаТранНакл());
	
	// аванс
	СтруктураДокумента.Вставить("СвПРД", ТаблицаСвПРД());

	// Корректировка
	ТаблицаОснКор = Новый ТаблицаЗначений;
	ТаблицаОснКор.Колонки.Добавить("НомерОсн", ТипСтроки);
	ТаблицаОснКор.Колонки.Добавить("ДатаОсн", ТипДаты);
	СтруктураДокумента.Вставить("ОснКор", ТаблицаОснКор);
	
	СтруктураДокумента.Вставить("ОснСЧФ", ТаблицаОснСЧФ());
	СтруктураДокумента.Вставить("ИспрСчФ", ТаблицаИспрСчФ());
	
	МодульРаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("СопоставленоАвтоматически", Новый ОписаниеТипов("Булево"));
	ТаблицаНоменклатуры.Колонки.Добавить("Номер", ТипЧисла);
	ТаблицаНоменклатуры.Колонки.Добавить("Наименование", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("КодОКЕИ", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("Количество", ТипКоличества);
	ТаблицаНоменклатуры.Колонки.Добавить("Цена", ТипСуммы);
	ТаблицаНоменклатуры.Колонки.Добавить("СтавкаНДССтрокой", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("СтавкаНДС", МодульРаботаСМетаданными.ПолучитьОписаниеТипов("СтавкиНДС"));
	ТаблицаНоменклатуры.Колонки.Добавить("СуммаБезНДС", ТипСуммы);
	ТаблицаНоменклатуры.Колонки.Добавить("СуммаНДС", ТипСуммы);
	ТаблицаНоменклатуры.Колонки.Добавить("СуммаНДС2", ТипСуммы);
	ТаблицаНоменклатуры.Колонки.Добавить("Сумма", ТипСуммы);
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдИзм", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("Вид", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("Артикул", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("Код", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("НомерТД", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("КодСтраныПроисх", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("КрНаимСтраныПроисх", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("НомерСтрокиОснования", ТипЧисла);
	ТаблицаНоменклатуры.Колонки.Добавить("СведенияОМаркировке");
	ТаблицаНоменклатуры.Колонки.Добавить("ГТИН", ТипСтроки);
	ТаблицаНоменклатуры.Колонки.Добавить("СведенияОПрослеживаемости");
	ТаблицаНоменклатуры.Колонки.Добавить("ХарактеристикаНоменклатуры");
	// TODO Убрать отсюда?		
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдИзмСсылка");
	ТаблицаНоменклатуры.Колонки.Добавить("СтранаПроисхожденияСсылка");	
	
	ТаблицаНоменклатурыКор = Новый ТаблицаЗначений;
	ТаблицаНоменклатурыКор.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатурыКор.Колонки.Добавить("СопоставленоАвтоматически", Новый ОписаниеТипов("Булево"));
	ТаблицаНоменклатурыКор.Колонки.Добавить("Номер", ТипЧисла);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Наименование", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("КодОКЕИ", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("КоличествоДоИзменения", ТипКоличества);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Количество", ТипКоличества);
	ТаблицаНоменклатурыКор.Колонки.Добавить("ЦенаДоИзменения", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Цена", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СтавкаНДССтрокойДоИзменения", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СтавкаНДССтрокой", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СтавкаНДСДоИзменения", МодульРаботаСМетаданными.ПолучитьОписаниеТипов("СтавкиНДС"));
	ТаблицаНоменклатурыКор.Колонки.Добавить("СтавкаНДС", МодульРаботаСМетаданными.ПолучитьОписаниеТипов("СтавкиНДС"));
	ТаблицаНоменклатурыКор.Колонки.Добавить("СуммаБезНДСДоИзменения", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СуммаБезНДС", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СуммаНДСДо", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СуммаНДС", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СуммаДоИзменения", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Сумма", ТипСуммы);
	ТаблицаНоменклатурыКор.Колонки.Добавить("ЕдИзм", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Вид", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Характеристика", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Артикул", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("Код", ТипСтроки);
	ТаблицаНоменклатурыКор.Колонки.Добавить("НомерСтрокиОснования", ТипЧисла);
	ТаблицаНоменклатурыКор.Колонки.Добавить("СведенияОМаркировке");
	ТаблицаНоменклатурыКор.Колонки.Добавить("СведенияОПрослеживаемости");
	ТаблицаНоменклатурыКор.Колонки.Добавить("ХарактеристикаНоменклатуры");
	// TODO Убрать отсюда?
	ТаблицаНоменклатурыКор.Колонки.Добавить("ЕдИзмСсылка");
	
	СтруктураДокумента.Вставить("Номенклатура", ТаблицаНоменклатуры);
	СтруктураДокумента.Вставить("НоменклатураКор", ТаблицаНоменклатурыКор);
	
	Возврат СтруктураДокумента;
	
КонецФункции

// Получает контрагента по коду ЭДО профиля либо по ИНН / КПП
//
// Параметры:
//	КодЭдо   - Строка
//	ИНН      - Строка
//	КПП      - Строка
//
// Возвращаемое значение:
//	Справочники.Контрагенты
//
Функция НайтиКонтрагента(КодЭдо = "", ИНН = "", КПП = "") Экспорт
	
	Перем КонтрагентСсылка, ПрофильЭДОКонтрагента;
	Перем ТекстЗапроса, Запрос, Выборка;
	
	Если ЗначениеЗаполнено(КодЭдо) Тогда
		ПрофильЭДОКонтрагента = Справочники.ККСНГ_Контрагенты.НайтиПоРеквизиту("КодУчастникаЭДО", КодЭДО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрофильЭДОКонтрагента) Тогда
		КонтрагентСсылка = ПрофильЭДОКонтрагента.Контрагент;
	Иначе
		КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если КонтрагентСсылка.Пустая() И Не ПустаяСтрока(ИНН) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.КПП = &КПП
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагенты.ПометкаУдаления";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			КонтрагентСсылка = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КонтрагентСсылка;
	
КонецФункции

// Получает договор по профилю организации с контрагентом
//
// Параметры:         
//	Организация      - ККСНГ_Организации
//	Контрагент       - ККСНГ_Контрагенты
//
// Возвращаемое значение:
//	Справочники.ДоговорыКонтрагентов
//
Функция НайтиДоговорКонтрагента(Организация, Контрагент) Экспорт
	
	ПрофильЭДООрганизации = Справочники.ККСНГ_Организации.НайтиПоРеквизиту("Организация", Организация);
	
	Если ЗначениеЗаполнено(ПрофильЭДООрганизации)Тогда
		
		ПрофильЭДОКонтрагента = Справочники.ККСНГ_Контрагенты.НайтиПоРеквизиту("Контрагент", Контрагент, , ПрофильЭДООрганизации);
		
		Если ЗначениеЗаполнено(ПрофильЭДОКонтрагента) 
			И ЗначениеЗаполнено(ПрофильЭДОКонтрагента.Договор) Тогда
							
			Возврат Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(ПрофильЭДОКонтрагента, "Договор");
				
		КонецЕсли;
		
	КонецЕсли;
			
	Возврат Неопределено;
	
КонецФункции

// Получает склад по профилю организации с контрагентом
//
// Параметры:         
//	Организация      - ККСНГ_Организации
//	Контрагент       - ККСНГ_Контрагенты
//
// Возвращаемое значение:
//	Справочники.Склады
//
Функция НайтиСкладКонтрагента(Организация, Контрагент) Экспорт
	
	ПрофильЭДООрганизации = Справочники.ККСНГ_Организации.НайтиПоРеквизиту("Организация", Организация);
	
	Если ЗначениеЗаполнено(ПрофильЭДООрганизации)Тогда
		
		ПрофильЭДОКонтрагента = Справочники.ККСНГ_Контрагенты.НайтиПоРеквизиту("Контрагент", Контрагент, , ПрофильЭДООрганизации);
		Если ЗначениеЗаполнено(ПрофильЭДОКонтрагента) Тогда
			Если ЗначениеЗаполнено(ПрофильЭДОКонтрагента.Склад) Тогда
				Возврат Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(ПрофильЭДОКонтрагента, "Склад");
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПрофильЭДООрганизации.Склад) Тогда
			Возврат Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(ПрофильЭДООрганизации, "Склад");
		КонецЕсли;
			
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

// Получает номенклатуру по наименоваю/полному наименованию либо артикулу
//
// Параметры:         
//	Наименование  - Строка
//	Артикул       - Строка
//
// Возвращаемое значение:
//	СписокЗначений
//
Функция НайтиНоменклатуру(Код = "", Артикул = "", Наименование = "") Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 5
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА Номенклатура.НаименованиеПолное = &Наименование
	|			ТОГДА 1000
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА Номенклатура.Наименование = &Наименование
	|			ТОГДА 100
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА Номенклатура.Код = &Код
	|			ТОГДА 10
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА Номенклатура.Артикул = &Артикул
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	((Номенклатура.НаименованиеПолное = &Наименование
	|				ИЛИ Номенклатура.Наименование = &Наименование)
	|				И &Наименование <> """"
	|			ИЛИ Номенклатура.Артикул = &Артикул
	|				И &Артикул <> """"
	|			ИЛИ Номенклатура.Код = &Код
	|				И &Код <> """") 
	|	И НЕ Номенклатура.ЭтоГруппа 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Код", СокрЛП(Код));
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Артикул", СокрЛП(Артикул));
	
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокЗначений;
	
КонецФункции

// Получает профиль рганизации по коду ЭДО
//
// Параметры:
//	КодЭдо   - Строка
//
// Возвращаемое значение:
//	Справочники.ККСНГ_Организации
//
Функция НайтиОрганизациюПоКодуЭДО(КодЭДО) Экспорт
	
	ОрганизацияСсылка = Справочники.ККСНГ_Организации.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(КодЭДО) Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ККСНГ_Организации.Организация КАК Организация
		|ИЗ
		|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
		|ГДЕ
		|	ККСНГ_Организации.КодУчастникаЭДО = &КодУчастникаЭДО
		|	И НЕ ПометкаУдаления";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("КодУчастникаЭДО", КодЭДО);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОрганизацияСсылка = Выборка.Организация;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОрганизацияСсылка;
	
КонецФункции

// Поиск профиля ЭДО контрагента по его идентификатору. Если профиль не найден - осуществляется поиск контрагента по его регистрационным данным.
//
// Параметры:
//  ИдентификаторЭДО			 - Строка	 - идентификатор ЭДО контрагента
//  ТипСведений					 - Строка	 - наименования типа сведений из формата ФНС.
//  ИдентификационныеСведения	 - Структура - аттрибуты идентификационных сведений в формате ФНС 
// 
// Возвращаемое значение:
//  Структура - в полях структуры возвращается результат поиска или Неопределено. Поля структуры:
//	- ПрофильЭДО - СправочникСсылка.ККСНГ_Контрагенты
//	- Контрагент - СправочникСсылка.Контрагенты
Функция НайтиДанныеКонтрагента(ИдентификаторЭДО, ТипСведений, ИдентификационныеСведения) Экспорт
		
	ПрофильЭДОКонтрагента = Справочники.ККСНГ_Контрагенты.НайтиПоРеквизиту("КодУчастникаЭДО", ИдентификаторЭДО);
	Если ПрофильЭДОКонтрагента.Пустая() Тогда
		ПрофильЭДОКонтрагента = Неопределено;
		КонтрагентСсылка = ПолучитьКонтрагентаПоИдентификационнымСведениям(ИдентификационныеСведения, ТипСведений);
	Иначе
		КонтрагентСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрофильЭДОКонтрагента, "Контрагент");
	КонецЕсли; 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПрофильЭДО", ПрофильЭДОКонтрагента);
	СтруктураВозврата.Вставить("Контрагент", КонтрагентСсылка);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает склад учета для указанных профилей ЭДО. Склад, настроенный для профиля контрагента, имеет приоритет над складом, настроенным для организации.
// Варианты параметров:  
//	- профиль ЭДО контрагента
//	- код контрагента + профиль ЭДО организации/код организации
//
// Параметры:
//  ПрофильЭДООрганизации	 - СправочникСсылка.ККСНГ_Организации, Строка *Необязательный  - профиль ЭДО или код участника 
//  ПрофильЭДОКонтрагента	 - СправочникСсылка.ККСНГ_Контрагенты, Строка	 - профиль ЭДО или код участника
//
// Возвращаемое значение:
//  СправочникСсылка.Склады, Неопределено - склад из настроек профилей ЭДО или Неопределено если склад в настройках не заполнен
//
Функция СкладКонтрагента(ПрофильЭДООрганизации = Неопределено, ПрофильЭДОКонтрагента) Экспорт
	
	Склад = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ККСНГ_Контрагенты.Склад КАК СкладКонтрагента,
	|	ККСНГ_Организации.Склад КАК СкладПоУмолчанию
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ПО ККСНГ_Контрагенты.Владелец = ККСНГ_Организации.Ссылка
	|ГДЕ
	|	&УсловиеПрофильОрганизации
	|	И &УсловиеПрофильКонтрагента";
	
	ТипЗнчПрофильКонтрагента = ТипЗнч(ПрофильЭДОКонтрагента);
	Если ТипЗнчПрофильКонтрагента = Тип("СправочникСсылка.ККСНГ_Контрагенты") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильКонтрагента", "ККСНГ_Контрагенты.Ссылка = &ПрофильЭДОКонтрагента");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильОрганизации", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильКонтрагента", "ККСНГ_Контрагенты.КодУчастникаЭДО = &ПрофильЭДОКонтрагента");
		ТипЗнчПрофильОрганизации = ТипЗнч(ПрофильЭДООрганизации);
		Если ТипЗнчПрофильОрганизации = Тип("СправочникСсылка.ККСНГ_Организации") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильОрганизации", "ККСНГ_Организации.Ссылка = &ПрофильЭДООрганизации");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильОрганизации", "ККСНГ_Организации.КодУчастникаЭДО = &ПрофильЭДООрганизации");
		КонецЕсли;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	Запрос.УстановитьПараметр("ПрофильЭДОКонтрагента", ПрофильЭДОКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.СкладКонтрагента) Тогда
			Склад = Выборка.СкладКонтрагента;
		ИначеЕсли ЗначениеЗаполнено(Выборка.СкладПоУмолчанию) Тогда
			Склад = Выборка.СкладПоУмолчанию;
		КонецЕсли; 	
	КонецЕсли; 
	
	Возврат Склад;
		
КонецФункции

// Возвращает договор контрагента для указанных профилей ЭДО.
// Варианты параметров:  
//	- профиль ЭДО контрагента
//	- код контрагента + профиль ЭДО организации/код организации
//
// Параметры:
//  ПрофильЭДООрганизации	 - СправочникСсылка.ККСНГ_Организации, Строка	 - профиль ЭДО или код участника
//  ПрофильЭДОКонтрагента	 - СправочникСсылка.ККСНГ_Контрагенты, Строка	 - профиль ЭДО или код участника
// 
// Возвращаемое значение:
//  СправочникСсылка.ДоговорыКонтрагентов, Неопределено - договор контрагента из настроек профилей ЭДО или Неопределено если договор в настройках не заполнен
//
Функция ДоговорКонтрагента(ПрофильЭДООрганизации = Неопределено, ПрофильЭДОКонтрагента) Экспорт
	
	Договор = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ККСНГ_Контрагенты.Договор КАК Договор
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ПО ККСНГ_Контрагенты.Владелец = ККСНГ_Организации.Ссылка
	|ГДЕ
	|	&УсловиеПрофильОрганизации
	|	И &УсловиеПрофильКонтрагента";
	
	ТипЗнчПрофильКонтрагента = ТипЗнч(ПрофильЭДОКонтрагента);
	Если ТипЗнчПрофильКонтрагента = Тип("СправочникСсылка.ККСНГ_Контрагенты") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильКонтрагента", "ККСНГ_Контрагенты.Ссылка = &ПрофильЭДОКонтрагента");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильОрганизации", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильКонтрагента", "ККСНГ_Контрагенты.КодУчастникаЭДО = &ПрофильЭДОКонтрагента");
		ТипЗнчПрофильОрганизации = ТипЗнч(ПрофильЭДООрганизации);
		Если ТипЗнчПрофильОрганизации = Тип("СправочникСсылка.ККСНГ_Организации") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильОрганизации", "ККСНГ_Организации.Ссылка = &ПрофильЭДООрганизации");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПрофильОрганизации", "ККСНГ_Организации.КодУчастникаЭДО = &ПрофильЭДООрганизации");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	Запрос.УстановитьПараметр("ПрофильЭДОКонтрагента", ПрофильЭДОКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Договор) Тогда
			Договор = Выборка.Договор;
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат Договор;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанныхПоСтруктурированномуXML

// Заполняет в структуре данные транспортных накладных, полученные из XML документа.
//
// Параметры:
//	ДанныеДокумента - Структура - заполняемая структура (см. ПолучитьСтруктуруДокумента()).
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ЗаполнитьДанныеТранспортныхНакладных(ДанныеДокумента, ДанныеXML)
	
	ТранНакл = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвПродПер.СвПер.ТранГруз.ТранНакл");
	Если ТипЗнч(ТранНакл) = Тип("Массив") И ТранНакл.Количество() Тогда
		Для Каждого ТекТранНакл Из ТранНакл Цикл
			СтрокаТранНакл = ДанныеДокумента.ТранНакл.Добавить();
			СтрокаТранНакл.НомТранНакл = ТекТранНакл.НомТранНакл;
			ДатаТранНаклСтрокой = ТекТранНакл.ДатаТранНакл;
			Если Не ПустаяСтрока(ДатаТранНаклСтрокой) Тогда
				Попытка
					ДатаТранНакл = Дата(ДатаТранНаклСтрокой + " 00:00:00");
				Исключение
					ДатаТранНакл = Дата(1, 1, 1);
				КонецПопытки;
				СтрокаТранНакл.ДатаТранНакл = ДатаТранНакл;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	
КонецПроцедуры

// Заполняет в структуре сведения о платёжно-расчетных документах, полученные из XML документа.
//
// Параметры:
//	ДанныеДокумента - Структура - заполняемая структура (см. ПолучитьСтруктуруДокумента()).
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ЗаполнитьСведенияПлатежноРасчетныхДокументов(ДанныеДокумента, ДанныеXML)
	
	СвПРД = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПРД");
	Если ТипЗнч(СвПРД) = Тип("Массив") И СвПРД.Количество() Тогда
		Для Каждого ТекСвПРД Из СвПРД Цикл
			СтрокаСвПРД = ДанныеДокумента.СвПРД.Добавить();
			СтрокаСвПРД.НомерПРД = ТекСвПРД.НомерПРД;
			СтрокаСвПРД.СуммаПРД = ТекСвПРД.СуммаПРД;
			ДатаПРДСтрокой = ТекСвПРД.ДатаПРД;
			Если Не ПустаяСтрока(ДатаПРДСтрокой) Тогда
				Попытка
					ДатаПРД = Дата(ДатаПРДСтрокой + " 00:00:00");
				Исключение
					ДатаПРД = Дата(1, 1, 1);
				КонецПопытки;
				СтрокаСвПРД.ДатаПРД = ДатаПРД;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	
КонецПроцедуры

// Заполняет в структуре сведения об основаниях корректировки, полученные из XML документа.
//
// Параметры:
//	ДанныеДокумента - Структура - заполняемая структура (см. ПолучитьСтруктуруДокумента()).
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ЗаполнитьСведенияОбОснованияхКорректировки(ДанныеДокумента, ДанныеXML)
	
	ОснКор = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СодФХЖ3.ОснКор");
	Если ТипЗнч(ОснКор) = Тип("Массив") И ОснКор.Количество() Тогда
		Для Каждого ТекОснКор Из ОснКор Цикл
			СтрокаОснКор = ДанныеДокумента.ОснКор.Добавить();
			СтрокаОснКор.НомерОсн = ТекОснКор.НомОсн;
			ДатаОснСтрокой = ТекОснКор.ДатаОсн;
			Если Не ПустаяСтрока(ДатаОснСтрокой) Тогда
				Попытка
					ДатаОсн = Дата(ДатаОснСтрокой + " 00:00:00");
				Исключение
					ДатаОсн = Дата(1, 1, 1);
				КонецПопытки;
				СтрокаОснКор.ДатаОсн = ДатаОсн;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет в структуре сведения о корректируемых документах, полученные из XML документа.
//
// Параметры:
//	ДанныеДокумента - Структура - заполняемая структура (см. ПолучитьСтруктуруДокумента()).
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ЗаполнитьСведенияОКорректируемыхДокументах(ДанныеДокумента, ДанныеXML)
	
	ОснСЧФ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвКСчФ.СчФ");
	Если ТипЗнч(ОснСЧФ) = Тип("Массив") И ОснСЧФ.Количество() Тогда
		Для Каждого ТекОснСЧФ Из ОснСЧФ Цикл
			СтрокаОснСЧФ = ДанныеДокумента.ОснСЧФ.Добавить();
			СтрокаОснСЧФ.НомерОснСЧФ = ТекОснСЧФ.НомерСчФ;
			ДатаОснСЧФСтрокой = ТекОснСЧФ.ДатаСчФ;
			Если Не ПустаяСтрока(ДатаОснСЧФСтрокой) Тогда
				Попытка
					ДатаОснСЧФ = Дата(ДатаОснСЧФСтрокой + " 00:00:00");
				Исключение
					ДатаОснСЧФ = Дата(1, 1, 1);
				КонецПопытки;
				СтрокаОснСЧФ.ДатаОснСЧФ = ДатаОснСЧФ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьСведенияОбИсправленияхИсходныхДокументов(ДанныеДокумента, ДанныеXML)
	
	ИспрСчФ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвКСчФ.СчФ.ИспрСчФ");
	Если ТипЗнч(ИспрСчФ) = Тип("Массив") И ИспрСчФ.Количество() Тогда
		Для Каждого ТекИспрСчФ Из ИспрСчФ Цикл
			СтрокаИспрСчФ = ДанныеДокумента.ИспрСчФ.Добавить();
			СтрокаИспрСчФ.НомИспрСчФ = ТекИспрСчФ.НомИспрСчФ;
			ДатаИспрСчФСтрокой = ТекИспрСчФ.ДатаИспрСчФ;
			Если Не ПустаяСтрока(ДатаИспрСчФСтрокой) Тогда
				Попытка
					ДатаИспрСчФ = Дата(ДатаИспрСчФСтрокой + " 00:00:00");
				Исключение
					ДатаИспрСчФ = Дата(1, 1, 1);
				КонецПопытки;
				СтрокаИспрСчФ.ДатаИспрСчФ = ДатаИспрСчФ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Дополняет СписокРеквизитов и ДанныеXML элементами сведений о продавце.
//
// Параметры:
//	СписокРеквизитов - СписокЗначений - список свойств заполняемой структуры (см. ПолучитьСтруктуруДокумента()):
//     * Значение - Строка - имя заполняемого свойства;
//     * Представление - Строка - путь к значению свойства в структуре ДанныеXML.
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ДополнитьДанныеСведениямиОПродавце(СписокРеквизитов, ДанныеXML)
	
	СвПрод = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод");
	Если ТипЗнч(СвПрод) = Тип("Массив") И СвПрод.Количество() Тогда
		// Преобразуем массив в один первый элемент, так как пока умеем работать только с одним
		ДанныеXML.Документ.СвСчФакт.СвПрод = СвПрод[0];
	КонецЕсли;
	СписокРеквизитов.Добавить("ПродавецНаименование", "Документ.СвСчФакт.СвПрод.ИдСв.СвЮЛУч.НаимОрг");
	СписокРеквизитов.Добавить("ПродавецИНН", "Документ.СвСчФакт.СвПрод.ИдСв.СвЮЛУч.ИННЮЛ");
	СписокРеквизитов.Добавить("ПродавецКПП", "Документ.СвСчФакт.СвПрод.ИдСв.СвЮЛУч.КПП");
	
	СписокРеквизитов.Добавить("ПродавецНаименование", "Документ.СвСчФакт.СвПрод.ИдСв.СвИнНеУч.НаимОрг");
	СписокРеквизитов.Добавить("ПродавецНаименование", "Документ.СвСчФакт.СвПрод.ИдСв.СвЮлНеУч.НаимОрг");
	СписокРеквизитов.Добавить("ПродавецНаименование", "Документ.СвСчФакт.СвПрод.ИдСв.СвИнНеУч.Наим"); // УПД 970
	
	СписокРеквизитов.Добавить("ПродавецИНН", "Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ИННФЛ");
	СписокРеквизитов.Добавить("ПродавецИНН", "Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ИННФЛ");
	
	ПродавецФамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ФИО.Фамилия", "");
	ПродавецИмя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ФИО.Имя", "");
	ПродавецОтчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод.ИдСв.СвИП.ФИО.Отчество", "");
	ПродавецФИО = СокрЛП(ПродавецФамилия + " " + ПродавецИмя + " " + ПродавецОтчество);
	Если ПустаяСтрока(ПродавецФИО) Тогда
		ПродавецФамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ФИО.Фамилия", "");
		ПродавецИмя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ФИО.Имя", "");
		ПродавецОтчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПрод.ИдСв.СвФЛУчастФХЖ.ФИО.Отчество", "");
		ПродавецФИО = СокрЛП(ПродавецФамилия + " " + ПродавецИмя + " " + ПродавецОтчество);
	КонецЕсли;
	Если Не ПустаяСтрока(ПродавецФИО) Тогда
		ДанныеXML.Вставить("ПродавецФИО", ПродавецФИО);
		СписокРеквизитов.Добавить("ПродавецНаименование", "ПродавецФИО");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет СписокРеквизитов и ДанныеXML элементами сведений о покупателе.
//
// Параметры:
//	СписокРеквизитов - СписокЗначений - список свойств заполняемой структуры (см. ПолучитьСтруктуруДокумента()):
//     * Значение - Строка - имя заполняемого свойства;
//     * Представление - Строка - путь к значению свойства в структуре ДанныеXML.
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ДополнитьДанныеСведениямиОПокупателе(СписокРеквизитов, ДанныеXML)
	
	Перем СвПокуп, ПокупательФамилия, ПокупательИмя, ПокупательОтчество, ПокупательФИО;
	
	СвПокуп = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп");
	Если ТипЗнч(СвПокуп) = Тип("Массив") И СвПокуп.Количество() Тогда
		ДанныеXML.Документ.СвСчФакт.СвПокуп = СвПокуп[0]; // Преобразуем массив в один первый элемент, так как пока умеем работать только с одним
	КонецЕсли;
	
	СписокРеквизитов.Добавить("ПокупательНаименование", "Документ.СвСчФакт.СвПокуп.ИдСв.СвЮЛУч.НаимОрг");
	СписокРеквизитов.Добавить("ПокупательИНН", "Документ.СвСчФакт.СвПокуп.ИдСв.СвЮЛУч.ИННЮЛ");
	СписокРеквизитов.Добавить("ПокупательКПП", "Документ.СвСчФакт.СвПокуп.ИдСв.СвЮЛУч.КПП");
	
	СписокРеквизитов.Добавить("ПокупательНаименование", "Документ.СвСчФакт.СвПокуп.ИдСв.СвИнНеУч.НаимОрг");
	СписокРеквизитов.Добавить("ПокупательНаименование", "Документ.СвСчФакт.СвПокуп.ИдСв.СвЮлНеУч.НаимОрг");
	СписокРеквизитов.Добавить("ПокупательНаименование", "Документ.СвСчФакт.СвПокуп.ИдСв.СвИнНеУч.Наим"); // УПД 970
	СписокРеквизитов.Добавить("ПокупательИНН", "Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ИННФЛ");
	СписокРеквизитов.Добавить("ПокупательИНН", "Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ИННФЛ");
	
	ПокупательФамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ФИО.Фамилия", "");
	ПокупательИмя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ФИО.Имя", "");
	ПокупательОтчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп.ИдСв.СвИП.ФИО.Отчество", "");
	ПокупательФИО = СокрЛП(ПокупательФамилия + " " + ПокупательИмя + " " + ПокупательОтчество);
	Если ПустаяСтрока(ПокупательФИО) Тогда
		ПокупательФамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ФИО.Фамилия", "");
		ПокупательИмя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ФИО.Имя", "");
		ПокупательОтчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.СвПокуп.ИдСв.СвФЛУчастФХЖ.ФИО.Отчество", "");
		ПокупательФИО = СокрЛП(ПокупательФамилия + " " + ПокупательИмя + " " + ПокупательОтчество);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПокупательФИО) Тогда
		ДанныеXML.Вставить("ПокупательФИО", ПокупательФИО);
		СписокРеквизитов.Добавить("ПокупательНаименование",	"ПокупательФИО");
	КонецЕсли;
	
КонецПроцедуры

// Дополняет СписокРеквизитов и ДанныеXML элементами сведений о грузоотправителе.
//
// Параметры:
//	СписокРеквизитов - СписокЗначений - список свойств заполняемой структуры (см. ПолучитьСтруктуруДокумента()):
//     * Значение - Строка - имя заполняемого свойства;
//     * Представление - Строка - путь к значению свойства в структуре ДанныеXML.
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ДополнитьДанныеСведениямиОГрузоотправителе(СписокРеквизитов, ДанныеXML)
	
	ГрузОт = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвСчФакт.ГрузОт");
	
	Если ТипЗнч(ГрузОт) = Тип("Массив") И ГрузОт.Количество() Тогда 
	 	ДанныеXML.Документ.СвСчФакт.ГрузОт = ГрузОт[0];
	КонецЕсли;
	
	СписокРеквизитов.Добавить("ГрузоотправительОнЖе", "Документ.СвСчФакт.ГрузОт.ОнЖе");
	СписокРеквизитов.Добавить("ГрузоотправительИНН", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮЛУч.ИННЮЛ");
	СписокРеквизитов.Добавить("ГрузоотправительКПП", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮЛУч.КПП");
	СписокРеквизитов.Добавить("ГрузоотправительНаименование", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮЛУч.НаимОрг");
	
	СписокРеквизитов.Добавить("ГрузоотправительНаименование", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИнНеУч.НаимОрг");
	СписокРеквизитов.Добавить("ГрузоотправительНаименование", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвЮлНеУч.НаимОрг");

	СписокРеквизитов.Добавить("ГрузоотправительИНН", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвИП.ИННФЛ");
	СписокРеквизитов.Добавить("ГрузоотправительИНН", "Документ.СвСчФакт.ГрузОт.ГрузОтпр.ИдСв.СвФЛУчастФХЖ.ИННФЛ");
	
КонецПроцедуры	

// Дополняет СписокРеквизитов и ДанныеXML элементами сведений о перевозчике.
//
// Параметры:
//	СписокРеквизитов - СписокЗначений - список свойств заполняемой структуры (см. ПолучитьСтруктуруДокумента()):
//     * Значение - Строка - имя заполняемого свойства;
//     * Представление - Строка - путь к значению свойства в структуре ДанныеXML.
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ДополнитьДанныеСведениямиОПеревозчике(СписокРеквизитов, ДанныеXML)
	
	Перевозчик = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик");
	
	Если ТипЗнч(Перевозчик) = Тип("Массив") И Перевозчик.Количество() Тогда
		ДанныеXML.СвПродПер.СвПер.ТранГруз.Перевозчик = Перевозчик[0];
	КонецЕсли;
	
	СписокРеквизитов.Добавить("ПеревозчикИНН", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮЛУч.ИННЮЛ");
	СписокРеквизитов.Добавить("ПеревозчикКПП", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮЛУч.КПП");
	СписокРеквизитов.Добавить("ПеревозчикНаименование", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮЛУч.НаимОрг");
	
	СписокРеквизитов.Добавить("ПеревозчикНаименование", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИнНеУч.НаимОрг");
	СписокРеквизитов.Добавить("ПеревозчикНаименование", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвЮлНеУч.НаимОрг");
	
	СписокРеквизитов.Добавить("ПеревозчикИНН", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвИП.ИННФЛ");
	СписокРеквизитов.Добавить("ПеревозчикИНН", "Документ.СвПродПер.СвПер.ТранГруз.Перевозчик.ИдСв.СвФЛУчастФХЖ.ИННФЛ");
	
КонецПроцедуры
	
// Заполняет в структуре таблицу номенклатуры сведениями о товарах, полученными из XML документа.
//
// Параметры:
//	ДанныеДокумента - Структура - заполняемая структура (см. ПолучитьСтруктуруДокумента()).
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ЗаполнитьСведенияОТоварах(ДанныеДокумента, ДанныеXML)
	
	ДанныеНоменклатуры = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.ТаблСчФакт.СведТов");
	
	Если ТипЗнч(ДанныеНоменклатуры) = Тип("Структура") Тогда
		ТаблицаНоменклатуры = Новый Массив;
		ТаблицаНоменклатуры.Добавить(ДанныеНоменклатуры);
	Иначе
		ТаблицаНоменклатуры = ДанныеНоменклатуры;
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаНоменклатуры) = Тип("Массив") Тогда
		
		СписокРеквизитовТаблицы = Новый Соответствие();
		
		СписокРеквизитовТаблицы.Вставить("Номер", 						"НомСтр");
		СписокРеквизитовТаблицы.Вставить("Наименование", 				"НаимТов");
		СписокРеквизитовТаблицы.Вставить("КодОКЕИ", 					"ОКЕИ_Тов");
		СписокРеквизитовТаблицы.Вставить("Количество", 					"КолТов");
		СписокРеквизитовТаблицы.Вставить("Цена", 						"ЦенаТов");
		СписокРеквизитовТаблицы.Вставить("СуммаБезНДС", 				"СтТовБезНДС");
		СписокРеквизитовТаблицы.Вставить("СуммаНДС", 					"СумНал");
		СписокРеквизитовТаблицы.Вставить("СуммаНДС2", 					"СумНал.СумНал");
		СписокРеквизитовТаблицы.Вставить("Сумма", 						"СтТовУчНал");
		СписокРеквизитовТаблицы.Вставить("ЕдИзм", 						"НаимЕдИзм");
		СписокРеквизитовТаблицы.Вставить("Вид", 						"ДопСведТов.ПрТовРаб");
		СписокРеквизитовТаблицы.Вставить("Характеристика", 				"ДопСведТов.ХарактерТов");
		СписокРеквизитовТаблицы.Вставить("Артикул", 					"ДопСведТов.АртикулТов");
		СписокРеквизитовТаблицы.Вставить("Код", 						"ДопСведТов.КодТов");
		СписокРеквизитовТаблицы.Вставить("НомерТД", 					"СвДТ.НомерДТ");
		СписокРеквизитовТаблицы.Вставить("КодСтраныПроисх", 			"СвДТ.КодПроисх");
		СписокРеквизитовТаблицы.Вставить("КрНаимСтраныПроисх", 			"ДопСведТов.КрНаимСтрПр");
		СписокРеквизитовТаблицы.Вставить("СтавкаНДССтрокой", 			"НалСт");
		СписокРеквизитовТаблицы.Вставить("СведенияОМаркировке", 		"ДопСведТов.НомСредИдентТов");
		СписокРеквизитовТаблицы.Вставить("ГТИН", 						"ДопСведТов.ГТИН");
		СписокРеквизитовТаблицы.Вставить("СведенияОПрослеживаемости", 	"ДопСведТов.СведПрослеж");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если СтрокаТаблицы.Свойство("СвТД") Тогда
				Если ТипЗнч(СтрокаТаблицы.СвТД) = Тип("Массив") И СтрокаТаблицы.СвТД.Количество() Тогда
					СтрокаТаблицы.СвТД = СтрокаТаблицы.СвТД[0];
				КонецЕсли;
			ИначеЕсли СтрокаТаблицы.Свойство("СвДТ") Тогда // УПД приказ 970
				Если ТипЗнч(СтрокаТаблицы.СвДТ) = Тип("Массив") И СтрокаТаблицы.СвДТ.Количество() Тогда
					СтрокаТаблицы.СвДТ = СтрокаТаблицы.СвДТ[0];
				КонецЕсли;
			Иначе
				ВызватьИсключение "В строке таблицы не найдены сведения о декларации на товары";
			КонецЕсли;
			
			Если ТипЗнч(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаТаблицы, "ДопСведТов.КрНаимСтрПр")) = Тип("Массив") Тогда
				
				Если СтрокаТаблицы.ДопСведТов.КрНаимСтрПр.Количество() Тогда
					СтрокаТаблицы.ДопСведТов.КрНаимСтрПр = СтрокаТаблицы.ДопСведТов.КрНаимСтрПр[0];
				Иначе
					СтрокаТаблицы.ДопСведТов.КрНаимСтрПр = "";
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока = ДанныеДокумента.Номенклатура.Добавить();
			Для каждого Колонка Из ДанныеДокумента.Номенклатура.Колонки Цикл
				НоваяСтрока[Колонка.Имя] = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаТаблицы, СписокРеквизитовТаблицы[Колонка.Имя]);
			КонецЦикла;
			
			Если НоваяСтрока.СуммаНДС = 0 Тогда
				НоваяСтрока.СуммаНДС = ?(НоваяСтрока.СуммаБезНДС > НоваяСтрока.СуммаНДС2, НоваяСтрока.Сумма - НоваяСтрока.СуммаБезНДС, НоваяСтрока.СуммаНДС2);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет в структуре таблицу корректируемой номенклатуры 
// сведениями о корректируемых товарах, полученными из XML документа.
//
// Параметры:
//	ДанныеДокумента - Структура - заполняемая структура (см. ПолучитьСтруктуруДокумента()).
//	ДанныеXML - Структура - структура, отражающая содержимое документа XML.
//
Процедура ЗаполнитьСведенияОКорректируемыхТоварах(ДанныеДокумента, ДанныеXML)
	
	ДанныеНоменклатурыКор = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеXML, "Документ.ТаблКСчФ.СведТов");
	Если ТипЗнч(ДанныеНоменклатурыКор) = Тип("Структура") Тогда
		ТаблицаНоменклатурыКор = Новый Массив;
		ТаблицаНоменклатурыКор.Добавить(ДанныеНоменклатурыКор);
	Иначе
		ТаблицаНоменклатурыКор = ДанныеНоменклатурыКор;
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаНоменклатурыКор) = Тип("Массив") Тогда
		
		СписокРеквизитовТаблицы = Новый Соответствие();
		
		СписокРеквизитовТаблицы.Вставить("Номер", 						"НомСтр");
		СписокРеквизитовТаблицы.Вставить("Наименование", 				"НаимТов");
		СписокРеквизитовТаблицы.Вставить("КодОКЕИ", 					"ОКЕИ_ТовПосле");
		СписокРеквизитовТаблицы.Вставить("ЕдИзм", 						"ДопСведТов.НаимЕдИзмПосле");
		СписокРеквизитовТаблицы.Вставить("Характеристика",				"ДопСведТов.ХарактерТов");
		СписокРеквизитовТаблицы.Вставить("Код", 						"ДопСведТов.КодТов");
		СписокРеквизитовТаблицы.Вставить("Артикул", 					"ДопСведТов.АртикулТов");
		СписокРеквизитовТаблицы.Вставить("КоличествоДоИзменения", 		"КолТовДо");
		СписокРеквизитовТаблицы.Вставить("Количество", 					"КолТовПосле");
		СписокРеквизитовТаблицы.Вставить("ЦенаДоИзменения", 			"ЦенаТовДо");
		СписокРеквизитовТаблицы.Вставить("Цена", 						"ЦенаТовПосле");
		СписокРеквизитовТаблицы.Вставить("СтавкаНДССтрокойДоИзменения",	"НалСтДо");
		СписокРеквизитовТаблицы.Вставить("СтавкаНДССтрокой",			"НалСтПосле");
		СписокРеквизитовТаблицы.Вставить("СуммаБезНДСДоИзменения", 		"СтТовБезНДС.СтоимДоИзм");
		СписокРеквизитовТаблицы.Вставить("СуммаБезНДС", 				"СтТовБезНДС.СтоимПослеИзм");
		СписокРеквизитовТаблицы.Вставить("СуммаНДСДо",   				"СумНалДо.СумНДС");
		СписокРеквизитовТаблицы.Вставить("СуммаНДС", 					"СумНалПосле.СумНДС");
		СписокРеквизитовТаблицы.Вставить("СуммаДоИзменения", 			"СтТовУчНал.СтоимДоИзм");
		СписокРеквизитовТаблицы.Вставить("Сумма", 						"СтТовУчНал.СтоимПослеИзм");
		СписокРеквизитовТаблицы.Вставить("СведенияОМаркировке",			"НомСредИдентТовДо");
		СписокРеквизитовТаблицы.Вставить("СведенияОПрослеживаемости",	"СведПрослеж");
		
		Для Каждого СтрокаТаблицы Из ТаблицаНоменклатурыКор Цикл
			
			НоваяСтрока = ДанныеДокумента.НоменклатураКор.Добавить();
			Для Каждого Колонка Из ДанныеДокумента.НоменклатураКор.Колонки Цикл
				НоваяСтрока[Колонка.Имя] = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаТаблицы, СписокРеквизитовТаблицы[Колонка.Имя]);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры		
	
#КонецОбласти

#Область ПолучениеДанныхПоЭлектронномуДокументу

// Дополняет данные оснований СЧФ транспортными накладными.
//
// Параметры:
//	ДанныеОснованийСЧФ - ТаблицаЗначений
//   * НомерОснСЧФ    - Строка - номер основания СЧФ;
//   * ДатаОснСЧФ     - Дата - дата основания СЧФ.
//	ТранспортныеНакладные - ТаблицаЗначений
//   * НомТранНакл    - Строка - номер транспортной накладной;
//   * ДатаТранНакл   - Дата - дата транспортной накладной.
//
Процедура ДополнитьОснованияСЧФТранспортнымиНакладными(ДанныеОснованийСЧФ, ТранспортныеНакладные)
		
	Если ТранспортныеНакладные.Количество() Тогда
		Для каждого ТекТранНакл Из ТранспортныеНакладные Цикл
			СтрокаТекТранНакл = ДанныеОснованийСЧФ.Добавить();
			СтрокаТекТранНакл.НомерОснСЧФ = ТекТранНакл.НомТранНакл;
			СтрокаТекТранНакл.ДатаОснСЧФ = ТекТранНакл.ДатаТранНакл;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

// Дополняет данные оснований СЧФ сведениями о платёжно-расчетных документах.
//
// Параметры:
//	ДанныеОснованийСЧФ - ТаблицаЗначений
//   * НомерОснСЧФ    - Строка - номер основания СЧФ;
//   * ДатаОснСЧФ     - Дата - дата основания СЧФ.
//	СведениямиПРД - ТаблицаЗначений
//   * НомерПРД    - Строка - номер платёжно-расчетного документа;
//   * ДатаПРД     - Дата - дата платёжно-расчетного документа;
//   * СуммаПРД    - Число - сумма платёжно-расчетного документа.
//
Процедура ДополнитьОснованияСЧФСведениямиПРД(ДанныеОснованийСЧФ, СведениямиПРД)
		
	Если СведениямиПРД.Количество() Тогда
		Для каждого ТекСвПРД Из СведениямиПРД Цикл
			СтрокаТекПРД = ДанныеОснованийСЧФ.Добавить();
			СтрокаТекПРД.НомерОснСЧФ = ТекСвПРД.НомерПРД;
			СтрокаТекПРД.ДатаОснСЧФ = ТекСвПРД.ДатаПРД;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьКонтрагентаПоИдентификационнымСведениям(ИдентификационныеСведения, ТипСведений)
	
	КонтрагентСсылка = Неопределено;
	
	Если ТипСведений = "СвИП" Тогда
		
		ИННФЛ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИдентификационныеСведения, "ИННФЛ", "");
		
		// поиск ИП
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИННФЛ
		|	И Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)";
		Запрос.УстановитьПараметр("ИННФЛ", ИННФЛ);
		ВыборкаКонтрагент = Запрос.Выполнить().Выбрать();
		Если ВыборкаКонтрагент.Следующий() Тогда
			КонтрагентСсылка = ВыборкаКонтрагент.Ссылка;
		КонецЕсли; 
		
	ИначеЕсли ТипСведений = "СвЮЛУч" Тогда
		
		ИННЮЛ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИдентификационныеСведения, "ИННЮЛ", "");
		КПП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИдентификационныеСведения, "КПП", "");		
		
		// поиск ЮЛ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИННЮЛ
		|	И Контрагенты.КПП = &КПП";
		Запрос.УстановитьПараметр("ИННЮЛ", ИННЮЛ);
		Запрос.УстановитьПараметр("КПП", КПП);
		ВыборкаКонтрагент = Запрос.Выполнить().Выбрать();
		Если ВыборкаКонтрагент.Следующий() Тогда
			КонтрагентСсылка = ВыборкаКонтрагент.Ссылка;
		КонецЕсли; 
		
	ИначеЕсли ТипСведений = "СвФЛУчастФХЖ" Тогда
		
		ГосРегИПВыдДов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИдентификационныеСведения, "ГосРегИПВыдДов", "");
		
		// поиск ИП			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.РегистрационныйНомер = &РегистрационныйНомер
		|	И Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)";
		Запрос.УстановитьПараметр("РегистрационныйНомер", ГосРегИПВыдДов);			
		ВыборкаКонтрагент = Запрос.Выполнить().Выбрать();
		Если ВыборкаКонтрагент.Следующий() Тогда
			КонтрагентСсылка = ВыборкаКонтрагент.Ссылка;
		КонецЕсли;
		
	Иначе
		ВызватьИсключение "Не реализован поиск контрагента для типа сведений: " + Строка(ТипСведений);
	КонецЕсли; 		
	
	Возврат КонтрагентСсылка;
	
КонецФункции

Функция ТипДаты()
	
	ТипДаты = Новый ОписаниеТипов("Дата");
	
	Возврат ТипДаты;
	
КонецФункции

Функция ТипСтроки()
	
	КвалификаторСтроки = Новый КвалификаторыСтроки();
	ТипСтроки = Новый ОписаниеТипов("Строка", , КвалификаторСтроки); 

	Возврат ТипСтроки;
	
КонецФункции

Функция ТипСуммы()
	
	КвалификаторСуммы = Новый КвалификаторыЧисла(17, 2);
	ТипСуммы = Новый ОписаниеТипов("Число", , КвалификаторСуммы); 

	Возврат ТипСуммы;
	
КонецФункции

#КонецОбласти
