
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСохраненияФайлов", ЭтотОбъект);
	
	Адрес = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Content");
	Файл = Новый ОписаниеПередаваемогоФайла(Объект.Filename, Адрес);
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Файл);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДиалогОткрытияФайла, Истина);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДоступностьЭлементовФормы()
	
	ЭтотОбъект.ТолькоПросмотр = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохраненияФайлов(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ТипЗнч(ПолученныеФайлы) = Тип("Массив")) Тогда
		Для Каждого ПолученныйФайл Из ПолученныеФайлы Цикл
			Если ТипЗнч(ПолученныйФайл) = Тип("ОписаниеПереданногоФайла") Тогда
				Файл = Новый Файл(ПолученныйФайл.ПолноеИмя);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииНаСсылкуФайла", ЭтотОбъект, Файл.ПолноеИмя);
				ПоказатьОповещениеПользователя("Файл сохранен", ОписаниеОповещения, Файл.Имя, БиблиотекаКартинок.СохранитьФайл);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаСсылкуФайла(ДополнительныеПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		Если Не РаботаСФайламиСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда
			РаботаСФайламиСлужебныйКлиент.ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(Неопределено);
			Возврат;
		КонецЕсли;
	#КонецЕсли

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Строка") И Не ПустаяСтрока(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиент.ОткрытьПроводник(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти