
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПроксиСервера = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиПроксиСервера();
	
	ИспользоватьПрокси = Истина;
	ИспользоватьСистемныеНастройки = Истина;
	Если ТипЗнч(НастройкаПроксиСервера) = Тип("Соответствие") Тогда
		
		ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
		ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
		
		Если ИспользоватьПрокси И НЕ ИспользоватьСистемныеНастройки Тогда
			
			// Заполнить данные формы настройками, заданными вручную.
			ИнициализироватьЭлементыФормы(ЭтотОбъект, НастройкаПроксиСервера);
						
		КонецЕсли;
		
	КонецЕсли;
	
	// Варианты использования прокси-сервера:
	// 0 - Не использовать прокси-сервер (по умолчанию, соответствует Новый ИнтернетПрокси(Ложь)).
	// 1 - Использовать системные настройки прокси-сервера (соответствует Новый ИнтернетПрокси(Истина)).
	// 2 - Использовать свои настройки прокси-сервера (соответствует ручной настройке параметров прокси-сервера).
	// Для последнего становятся доступно ручное изменение параметров прокси-сервера.
	ВариантИспользованияПроксиСервера = ?(ИспользоватьПрокси, ?(ИспользоватьСистемныеНастройки = Истина, 1, 2), 0);
	Если ВариантИспользованияПроксиСервера = 0 Тогда
		ИнициализироватьЭлементыФормы(ЭтотОбъект, ПустыеНастройкиПроксиСервера());
	ИначеЕсли ВариантИспользованияПроксиСервера = 1 Тогда
		ИнициализироватьЭлементыФормы(ЭтотОбъект, СистемныеНастройкиПроксиСервера());
	КонецЕсли;
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВариантИспользованияПроксиСервера = 1 Тогда
		ИнициализироватьЭлементыФормы(ЭтотОбъект, СистемныеНастройкиПроксиСервера());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
		ТекстВопроса = "Данные были изменены. Сохранить изменения?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантыИспользованияПроксиСервераПриИзменении(Элемент)
	
	ИспользоватьПрокси = (ВариантИспользованияПроксиСервера > 0);
	ИспользоватьСистемныеНастройки = (ВариантИспользованияПроксиСервера = 1);
	
	// Варианты настройки прокси-сервера:
	// 0 - Не использовать прокси-сервер (по умолчанию, соответствует Новый ИнтернетПрокси(Ложь)).
	// 1 - Использовать системные настройки прокси-сервера (соответствует Новый ИнтернетПрокси(Истина)).
	// 2 - Использовать свои настройки прокси-сервера (соответствует ручной настройке параметров прокси-сервера).
	// Для последнего становятся доступно ручное изменение параметров прокси-сервера.
	
	Если ВариантИспользованияПроксиСервера = 0 Тогда
		НастройкиПрокси = ПустыеНастройкиПроксиСервера();
	ИначеЕсли ВариантИспользованияПроксиСервера = 1 Тогда
		НастройкиПрокси = СистемныеНастройкиПроксиСервераНаСервере();
	ИначеЕсли ВариантИспользованияПроксиСервера = 2 Тогда 
		НастройкиПрокси = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиПроксиСервера();
	Иначе 
		НастройкиПрокси = Неопределено;
	КонецЕсли;
	
	ИнициализироватьЭлементыФормы(ЭтотОбъект, НастройкиПрокси);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаОК(Команда)
	
	// Сохраняет настройки прокси-сервера и закрывает форму,
	// передавая в качестве возвращаемого результата параметры прокси.
	СохранитьНастройкиПроксиСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройки(Команда)
	
	ОчиститьСообщения();
	РедактируемыеНастройки = РедактируемыеНастройкиПроксиСервера();	
	ПроверитьНастройкиПрокси(РедактируемыеНастройки, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИнициализироватьЭлементыФормы(Форма, НастройкиПрокси)
	
	Если ТипЗнч(НастройкиПрокси) = Тип("Структура") Тогда
		
		Форма.Сервер = НастройкиПрокси.Сервер;
		Форма.Порт = НастройкиПрокси.Порт;
		Форма.Пользователь = НастройкиПрокси.Пользователь;
		Форма.Пароль = НастройкиПрокси.Пароль;
		Форма.ИспользоватьАутентификациюОС = ?(НастройкиПрокси.ИспользоватьАутентификациюОС, 1, 0);
		
	ИначеЕсли ТипЗнч(НастройкиПрокси) = Тип("Соответствие") Тогда
		
		Форма.Сервер       = НастройкиПрокси.Получить("Сервер");
		Форма.Пользователь = НастройкиПрокси.Получить("Пользователь");
		Форма.Пароль       = НастройкиПрокси.Получить("Пароль");
		Форма.Порт         = НастройкиПрокси.Получить("Порт");
		ЗначениеПараметра = НастройкиПрокси.Получить("ИспользоватьАутентификациюОС");
		Форма.ИспользоватьАутентификациюОС = ?(ЗначениеПараметра = Неопределено, 0, Число(ЗначениеПараметра));
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)
	
	// Изменяем доступность группы редактирования параметров прокси в зависимости
	// от варианта использования прокси-сервера.
	Форма.ДоступноРедактирование = (Форма.ВариантИспользованияПроксиСервера = 2);
	
	Форма.Элементы.ГруппаАдресСервера.Доступность = Форма.ДоступноРедактирование;
	Форма.Элементы.ГруппаАутентификация.Доступность = Форма.ДоступноРедактирование;
	
КонецПроцедуры

// Выполняет сохранение настроек прокси-сервера в интерактивном режиме в
// результате действий пользователя с отображением сообщений пользователю,
// после чего закрывает форму с возвратом настроек прокси-сервера.
//
&НаКлиенте
Процедура СохранитьНастройкиПроксиСервера(ЗакрытьФорму = Истина, ПроверитьНастройки = Истина)
	
	РедактируемыеНастройки = РедактируемыеНастройкиПроксиСервера();
	
	Если ПроверитьНастройки Тогда
		ПроверитьНастройкиПрокси(РедактируемыеНастройки, Истина);
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройкиПроксиСервера(РедактируемыеНастройки);
	
	Модифицированность = Ложь;
	
	Если ЗакрытьФорму Тогда
		Закрыть(РедактируемыеНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РедактируемыеНастройкиПроксиСервера()
	
	Если ВариантИспользованияПроксиСервера = 2 Тогда 
		РедактируемыеНастройки = Неопределено;	
	Иначе 
		РедактируемыеНастройки = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиПроксиСервера();
	КонецЕсли;

	Если РедактируемыеНастройки = Неопределено Тогда
		
		РедактируемыеНастройки = Новый Соответствие;
		
		РедактируемыеНастройки.Вставить("Пользователь", Пользователь);
		РедактируемыеНастройки.Вставить("Пароль", Пароль);
		РедактируемыеНастройки.Вставить("Сервер", НормализованныйАдресПроксиСервера(Сервер));
		РедактируемыеНастройки.Вставить("Порт", Порт);
		РедактируемыеНастройки.Вставить("ИспользоватьАутентификациюОС", Булево(ИспользоватьАутентификациюОС));
			
	КонецЕсли;
	
	РедактируемыеНастройки.Вставить("ИспользоватьПрокси", ИспользоватьПрокси);
	РедактируемыеНастройки.Вставить("ИспользоватьСистемныеНастройки", ИспользоватьСистемныеНастройки);
	
	Возврат РедактируемыеНастройки;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаОСохраненииНекорректныхНастроек(РезультатВопроса, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиПроксиСервера(, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиПрокси(НастройкаПроксиСервера, ПредложитьСохранение)
	
	ЗапросПроверки = ПроверитьНастройкиПроксиНаСервере(НастройкаПроксиСервера);
	Если Не ЗапросПроверки.Успех Тогда
		ПередаваемыеПараметры = Новый Структура;
		ТекстОшибки = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросПроверки.Журнал);
		ПередаваемыеПараметры.Вставить("ТекстОшибки", ТекстОшибки);
		ПередаваемыеПараметры.Вставить("ПредложитьСохранение", ПредложитьСохранение);
		ПослеОтвета = Новый ОписаниеОповещения("ПослеОтветаОСохраненииНекорректныхНастроек", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ККСНГ_ПроверкаПараметровПрокси", ПередаваемыеПараметры, 
				ЭтотОбъект, ,,, ПослеОтвета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ПредложитьСохранение Тогда
		СохранитьНастройкиПроксиСервера(, Ложь);
	Иначе 
		ТекстСообщения = "Проверка настроек прокси-сервера пройдена успешно.";
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНастройкиПроксиНаСервере(НастройкаПроксиСервера)
	
	ЗапросВерсии = ККСНГ_APIКурьер.v1_Version(НастройкаПроксиСервера);	
	Возврат ЗапросВерсии;

КонецФункции

// Выполняет непосредственное сохранение настроек прокси-сервера.
&НаСервереБезКонтекста
Процедура ЗаписатьНастройкиПроксиСервера(НастройкиПроксиСервера)
	
	СохранениеНастройки = РегистрыСведений.ККСНГ_Настройки.СохранитьНастройкиПроксиСервера(НастройкиПроксиСервера);
	Если СохранениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе 
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(СохранениеНастройки.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПустыеНастройкиПроксиСервера()
	
	Результат = Новый Структура;
	Результат.Вставить("Сервер", "");
	Результат.Вставить("Порт", 0);
	Результат.Вставить("Пользователь", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("ИспользоватьАутентификациюОС", Ложь);
		
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СистемныеНастройкиПроксиСервера()

	Прокси = Новый ИнтернетПрокси(Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("Сервер", Прокси.Сервер());
	Результат.Вставить("Порт", Прокси.Порт());
	Результат.Вставить("Пользователь", Прокси.Пользователь(""));
	Результат.Вставить("Пароль", Прокси.Пароль(""));
	Результат.Вставить("ИспользоватьАутентификациюОС", Прокси.ИспользоватьАутентификациюОС(""));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СистемныеНастройкиПроксиСервераНаСервере()
	
	Возврат СистемныеНастройкиПроксиСервера();
	
КонецФункции

// Возвращает нормализованный адрес прокси-сервера - без пробелов.
// Если между значащими символами встречаются пробелы, то адрес
// обрезается до первого пробела.
//
// Параметры:
//	АдресПроксиСервера (Строка) - нормализуемый адрес прокси-сервера.
//
// Возвращаемое значение: Строка - нормализованный адрес прокси-сервера.
//
&НаКлиентеНаСервереБезКонтекста
Функция НормализованныйАдресПроксиСервера(Знач АдресПроксиСервера)
	
	АдресПроксиСервера = СокрЛП(АдресПроксиСервера);
	ПозицияПробела = СтрНайти(АдресПроксиСервера, " ");
	Если ПозицияПробела > 0 Тогда
		// Если в адресе сервера присутствуют пробелы, то
		// берется часть адреса перед первым пробелом.
		АдресПроксиСервера = Лев(АдресПроксиСервера, ПозицияПробела - 1);
	КонецЕсли;
	
	Возврат АдресПроксиСервера;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкиПроксиСервера();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
