
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьДоступностьЭлементов();
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораПрофилейЭДО(ПрофильНастройкиЭДО, Элементы.ПрофильНастройкиЭДО);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьЗагрузку(Команда)
		
	ОчиститьСообщения();	
	Если Не ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ТекстОшибки = "Выберите, пожалуйста, организацию.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Период) Тогда 
		ТекстОшибки = "Выберите, пожалуйста, период создания загружаемых документов.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Период");
		Возврат;
	КонецЕсли;

	Состояние("Аутентификация");
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПродолжитьЗагрузку", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьЗагрузку(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт 
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
			
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		Состояние("Формирование фильтра");
		Filter = ФильтрЗагрузкиДокументов();
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			
			РезультатИдентификатор = ИдентификаторКонтрагента(Контрагент, ПараметрыАвторизации);	
			
			Если РезультатИдентификатор.Успех Тогда
				Filter.ParticipantId = РезультатИдентификатор.Результат;
			Иначе 
				ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
				ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(РезультатИдентификатор.Журнал); 
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Filter.CreatedFrom = Период.ДатаНачала;
		Filter.CreatedTo   = ?(ЗначениеЗаполнено(Период.ДатаОкончания), 
				Период.ДатаОкончания, ККСНГ_ОбщегоНазначенияВызовСервера.ТекущаяДатаВремяСеанса());
		
		АдресРезультатаЗагрузки = ЗагруженныеИзПапокДокументы(Filter, ПараметрыАвторизации);
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		
		ПараметрыЗагрузки = Новый Структура("АдресРезультатаЗагрузки, ПрофильНастройкиЭДО", 
													АдресРезультатаЗагрузки, ПрофильНастройкиЭДО);
													
		ОткрытьФорму("Обработка.ККСНГ_ЗагрузкаДокументов.Форма.ФормаЗагрузка", 
						ПараметрыЗагрузки, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ВидимостьДоступностьЭлементов()
		
	УжеЗапущена = ЗагрузкаЗапущена();
	Элементы.ДекорацияЗагрузкаЗапущена.Видимость = УжеЗапущена;
	Элементы.ГруппаПараметры.Видимость = Не УжеЗапущена;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузкаЗапущена()
	
	КлючЗадания = ККСНГ_ОбщегоНазначенияВызовСервера.КлючФоновогоЗаданияЗагрузкиДокументов();
	ПараметрыОтбора = Новый Структура("Ключ,Состояние", КлючЗадания, СостояниеФоновогоЗадания.Активно);
	НайденныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ПараметрыОтбора);
	Если НайденныеЗадания.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗагруженныеИзПапокДокументы(Фильтр, ПараметрыАвторизации) 
	
	РезультатыПоПапкам = Новый Соответствие;
	ЗагружаемыеПапки = ККСНГ_ОбщегоНазначенияВызовСервера.ПапкиДокументовДоступныеДляЗагрузки();
	Для каждого ТекПапка Из ЗагружаемыеПапки Цикл
		Фильтр.Folder = ТекПапка.Ключ;   
		РезультатЗагрузки = ККСНГ_APIКурьер.v1_DocumentList(ПараметрыАвторизации, Фильтр);
		Если РезультатЗагрузки.Успех Тогда
			МассивDocument = РезультатЗагрузки.Результат.Document;
			ДополнитьМассивВходящихДокументовКодомЭДО(ПараметрыАвторизации, МассивDocument);
			ККСНГ_ДокументооборотВызовСервера.ПрименитьФильтрДляМассиваДокументов(МассивDocument);
		КонецЕсли;
		ПредставлениеПапки = """" + ТекПапка.Значение + """";
		РезультатЗагрузки.Вставить("ПредставлениеПапки", ПредставлениеПапки);
		РезультатыПоПапкам.Вставить(ТекПапка.Ключ, РезультатЗагрузки);
	КонецЦикла;
	АдресРезультатаЗагрузки = ПоместитьВоВременноеХранилище(РезультатыПоПапкам);
	
	Возврат АдресРезультатаЗагрузки;
		
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьМассивВходящихДокументовКодомЭДО(ПараметрыАвторизации, МассивDocument)
	
	// Получим ID Сбербанка по коду ЭДО "2BK-7707083893-667102008-1027700132195"
	// См. спарвку по https://confluence.esphere.ru/display/SBER/Document.List
	// Поля SellerCode, BuyerCode структуры данных Document не заполняются!
	SBCode = ККСНГ_РаботаСКонтрагентамиВызовСервера.КодЭДОСбера();
	ЗапросСlientCode = ККСНГ_APIКурьер.v2_СlientCode(ПараметрыАвторизации, SBCode);
	
	Если ЗапросСlientCode.Успех Тогда			
		
		Id = ЗапросСlientCode.Результат.Id;
		Для Каждого Элем Из МассивDocument Цикл
			Если Элем.SenderId = Id Тогда
				Элем.SellerCode = SBCode;
			КонецЕсли;
			Если Элем.ReceiverId = Id Тогда
				Элем.BuyerCode = SBCode;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

#Область ВызовМетодовСфераКурьер

&НаСервереБезКонтекста
Функция ФильтрЗагрузкиДокументов()
	
	Возврат ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_ApiDocumentFilter");
	
КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторКонтрагента(Контрагент, ПараметрыАвторизации)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	ЗапросКомпании = ККСНГ_APIКурьер.v2_СlientCode(ПараметрыАвторизации, Контрагент.КодУчастникаЭДО);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКомпании.Журнал, Ложь);	
	
	Если ЗапросКомпании.Успех Тогда
		Ответ.Успех = Истина;
		Ответ.Результат = ЗапросКомпании.Результат.Id;
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти