
#Область ПрограммныйИнтерфейс

// Открывает форму выбора контрагентов 1С с отбором 
//
// Параметры:
//	Отбор - Структура - Отборы контрагентов
//	Владелец - ТаблицаФормы, ПолеФормы - Форма или элемент управления вызываемой формы
//	ОповещениеОЗавершении - ОписаниеОповещения - Описание вызова процедуры заверешения выбора контрагента
//	РежимОткрытияОкнаФормы - РежимОткрытияОкнаФормы - Вариант открытия формы выбора
//	ЗакрыватьПриВыборе - Булево - Указывает необходимость закрытия формы при выборе значения
//
Процедура ОткрытьФормуВыбораКонтрагента(Отбор = Неопределено, 
										Владелец = Неопределено, 
										ОповещениеОЗавершении = Неопределено, 
										РежимОткрытияОкна = Неопределено,
										ЗакрыватьПриВыборе = Истина) Экспорт
	
	Если РежимОткрытияОкна = Неопределено Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Владелец, , , , ОповещениеОЗавершении, РежимОткрытияОкна);
	
КонецПроцедуры

// Открывает форму элемента профиля контрагента ЭДО
//
// Параметры:
//	ПрофильКонтрагента - СправочникСсылка.ККСНГ_Контрагенты - Ссылка на открываемый профиль контрагента
//	Владелец - ТаблицаФормы, ПолеФормы - Форма или элемент управления вызываемой формы
//	ОповещениеОЗавершении - ОписаниеОповещения - Описание вызова процедуры заверешения выбора контрагента
//	РежимОткрытияОкнаФормы - РежимОткрытияОкнаФормы - Вариант открытия формы выбора
//
Процедура ОткрытьФормуПрофиляКонтрагента(ПрофильКонтрагента, 
										 Владелец = Неопределено, 
										 ОповещениеОЗавершении = Неопределено, 
										 РежимОткрытияОкна = Неопределено) Экспорт
	
	Если РежимОткрытияОкна = Неопределено Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ПрофильКонтрагента);
	ОткрытьФорму("Справочник.ККСНГ_Контрагенты.Форма.ФормаЭлемента", ПараметрыФормы, Владелец, , , , ОповещениеОЗавершении, РежимОткрытияОкна);
	
КонецПроцедуры

#КонецОбласти
