
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресРезультатаЗагрузки = Неопределено;
	ДокументыКЗагрузкеПоПапкам = Неопределено;
	Параметры.Свойство("АдресРезультатаЗагрузки", АдресРезультатаЗагрузки);
	
	Если ЗначениеЗаполнено(АдресРезультатаЗагрузки) Тогда
		ДокументыКЗагрузкеПоПапкам = ПолучитьИзВременногоХранилища(АдресРезультатаЗагрузки);
	КонецЕсли;
	
	Если ТипЗнч(ДокументыКЗагрузкеПоПапкам) = Тип("Соответствие") Тогда
		Параметры.Свойство("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
		
		ЗаполнитьСписокДокументовКЗагрузке(ДокументыКЗагрузкеПоПапкам);
	Иначе 
		ВызватьИсключение("Отсутствуют данные по загружаемым документам.");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	Если ЗначениеЗаполнено(ИДФоновогоЗадания) Тогда
		
		Отказ = Истина;
		
		Если ЗавершениеРаботы Тогда
			Возврат;
		КонецЕсли;
		
		ТекстОшибки = "Загрузка документов еще идет. Дождитесь, пожалуйста, ее завершения."; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсеПапки(Команда)
	
	ОтметитьВсеПапки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыборВсехПапок(Команда)
	
	ОтметитьВсеПапки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	
	ОчиститьСообщения();
	КоличествоВыбранныхПапок = 0;
	ПапкиДокументов = ККСНГ_ОбщегоНазначенияВызовСервера.ПапкиДокументовДоступныеДляЗагрузки();
	Для каждого ТекПапка Из ПапкиДокументов Цикл
		Если ЭтотОбъект["Загрузить" + ТекПапка.Ключ] Тогда
			КоличествоВыбранныхПапок = КоличествоВыбранныхПапок + 1;
		КонецЕсли;
		
		ЭтотОбъект.Элементы["Успешно" + ТекПапка.Ключ].Заголовок = "";
		ЭтотОбъект.Элементы["Ошибка" + ТекПапка.Ключ].Заголовок = "";
	КонецЦикла;
	
	Если КоличествоВыбранныхПапок = 0 Тогда
	    ТекстСообщения = "Выберите, пожалуйста, папки, документы которых требуется загрузить.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	    Возврат;
	КонецЕсли;

	ПослеАвторизации = Новый ОписаниеОповещения("ЗагрузитьДокументыПродолжение", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЭлектроннымДокументам(Команда)
	
	Если ККСНГ_ПодключаемыеМодулиКлиент.РаботаСПодключаемымиМодулямиДоступна() Тогда

		ПараметрыФормы = Новый Структура("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
		
		ИмяФормыОбработки = "Обработка.ККСНГ_СфераКурьер.Форма.Форма";
		
		ОткрытьФорму(ИмяФормыОбработки, ПараметрыФормы);
		Оповестить("СменитьПрофильЭДООрганизации", ПараметрыФормы);
		
		ОсновнаяФорма = ЭтотОбъект.ВладелецФормы;
		Если ТипЗнч(ОсновнаяФорма) = Тип("УправляемаяФорма") Тогда
			ОсновнаяФорма.Закрыть();
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокДокументовКЗагрузке(ДокументыКЗагрузкеПоПапкам)
	
	Для каждого ТекПапка Из ДокументыКЗагрузкеПоПапкам Цикл
		
		ИмяПапки = ТекПапка.Ключ;
		РезультатЗагрузки = ТекПапка.Значение;
		
		ТекНадписьКоличество = Элементы["Количество" + ИмяПапки];
		
		Если РезультатЗагрузки.Успех Тогда
			СтруктурыДокументов = РезультатЗагрузки.Результат.Document;
			КоличествоДокументов = СтруктурыДокументов.Количество();
			
			Если КоличествоДокументов > 0 Тогда
				ТекНадписьКоличество.Заголовок = Формат(КоличествоДокументов, "ЧДЦ=0; ЧГ=3,0") + " документов";
			Иначе 
				ТекНадписьКоличество.Заголовок = "Нет документов";
			КонецЕсли;
			
			ЗагруженныеИзПапки = ЭтотОбъект["Загруженные" + ИмяПапки];
			ЗагруженныеИзПапки.Очистить();
			
			Для каждого ТекДок Из СтруктурыДокументов Цикл
				ЗагруженныеИзПапки.Добавить(ТекДок.Id);
			КонецЦикла;
			
		Иначе 
			
			ТекНадписьКоличество.Заголовок = "Ошибка";
			
			ТекОшибка = Элементы["Количество" + ИмяПапки];
			ТекОшибка.Видимость = Истина;
			ТекОшибка.Заголовок = "Не удалось получить список документов. " 
									+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатЗагрузки.Журнал);
					
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеПапки(Отметка = Истина)
	
	ПапкиДокументов = ККСНГ_ОбщегоНазначенияВызовСервера.ПапкиДокументовДоступныеДляЗагрузки();
	Для каждого ТекПапка Из ПапкиДокументов Цикл
		ЭтотОбъект["Загрузить" + ТекПапка.Ключ] = Отметка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСостояниеЗагрузки(ИдетЗагрузка = Ложь, ЗагрузкаСОшибками = Ложь, НеобходимаПереинициализация = Ложь)
	
	Если ИдетЗагрузка Тогда
		Элементы.ЗагрузитьДокументы.Картинка = БиблиотекаКартинок.ККСНГ_СинхронизироватьАнимированная;
		Элементы.ЗагрузитьДокументы.Заголовок = "Идет загрузка документов...";
		
	Иначе
		Элементы.ЗагрузитьДокументы.Картинка = БиблиотекаКартинок.ККСНГ_Синхронизировать;
		Элементы.ЗагрузитьДокументы.Заголовок = "Загрузить документы";
		
	КонецЕсли;
	
	Элементы.ЗагрузкаЗавершенаСОшибками.Видимость = Не ИдетЗагрузка И ЗагрузкаСОшибками;
	
	Если НеобходимаПереинициализация Тогда
		ТекстЗаголовка =  "Пользовательская сессия устарела, пожалуйста, повторите действие.";	
	Иначе
		ТекстЗаголовка = "Произошли ошибки при загрузке. " 
							+ "Повторите, пожалуйста, попытку позднее или обратитесь в техническую поддержку.";
	КонецЕсли;
	
	Элементы.ЗагрузкаЗавершенаСОшибками.Заголовок = ТекстЗаголовка;
		
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипДекорацияФормы = Тип("ДекорацияФормы");
	
	Для каждого ТекЭлемент Из ЭтотОбъект.Элементы Цикл
		
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		
		Если ТипЭлемента = ТипКнопкаФормы Тогда
			ТекЭлемент.Доступность = Не ИдетЗагрузка;
			
		ИначеЕсли Не ТипЭлемента = ТипДекорацияФормы Тогда  
			ТекЭлемент.ТолькоПросмотр = ИдетЗагрузка;
			
		Иначе
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Элементы.ПерейтиКЭлектроннымДокументам.Видимость = Не ИдетЗагрузка;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументыПродолжение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации  = ЗапросПараметрыАвторизации.Результат;
		
		Состояние("Запуск загрузки документов");
		
		РезультатЗапуска = НачатьЗаписьДокументов(ПараметрыАвторизации);
		
		Если РезультатЗапуска.Успех Тогда
			ОтобразитьСостояниеЗагрузки(Истина);
			ПодключитьОбработчикОжидания("ПроверитьЗавершениеЗагрузкиДокументов", 5, Истина);		
		Иначе
			ТекстОшибки = "Не удалось запустить загрузку документов по причине: " 
								+ Символы.ПС + РезультатЗапуска.Ошибка;
									
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);	
	КонецЕсли;
	
КонецПроцедуры

#Область ФоноваяЗагрузкаДокументов

&НаСервере
Функция НачатьЗаписьДокументов(ПараметрыАвторизации)
	
	РезультатЗапуска = Новый Структура("Успех", Ложь);
	
	ПараметрыВызова = Новый Массив;
	ДокументыПоПапкам = Новый Соответствие;
	ПапкиДокументов = ККСНГ_ОбщегоНазначенияВызовСервера.ПапкиДокументовДоступныеДляЗагрузки();
	Для каждого ТекПапка Из ПапкиДокументов Цикл
		ИмяПапки = ТекПапка.Ключ;
		ДокументыПапки = ЭтотОбъект["Загруженные" + ИмяПапки];
		Если ЭтотОбъект["Загрузить" + ИмяПапки] И ДокументыПапки.Количество() > 0 Тогда
			ДокументыПоПапкам.Вставить(ИмяПапки, ДокументыПапки.ВыгрузитьЗначения());
		КонецЕсли;
	КонецЦикла;
	ПараметрыВызова.Добавить(ДокументыПоПапкам);
	ПараметрыВызова.Добавить(ПрофильНастройкиЭДО);	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПараметрыВызова.Добавить(АдресРезультата);
	ПараметрыВызова.Добавить(ПараметрыАвторизации);
	КлючЗадания = ККСНГ_ОбщегоНазначенияВызовСервера.КлючФоновогоЗаданияЗагрузкиДокументов();
	
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ККСНГ_ДокументооборотВызовСервера.ЗаписатьДокументыПоИД", 
									ПараметрыВызова, КлючЗадания, "Сервис ЭДО: Запись документов");
	Исключение
		УдалитьИзВременногоХранилища(АдресРезультата);
		РезультатЗапуска.Вставить("Ошибка", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат РезультатЗапуска;
	КонецПопытки;
	
	ИДФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	РезультатЗапуска.Успех = Истина;
	ЭтотОбъект.ТолькоПросмотр = Истина;
	Возврат РезультатЗапуска;
			
КонецФункции

&НаКлиенте
Процедура ПроверитьЗавершениеЗагрузкиДокументов() Экспорт
	
	ВывестиПрогрессЗагрузки(3);
	
	ЗаданиеВыполнено = ККСНГ_ОбщегоНазначенияВызовСервера.ЗаданиеВыполнено(ИДФоновогоЗадания);
	
	Если ЗаданиеВыполнено Тогда
				
		РезультатыПоПапкам = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Если ТипЗнч(РезультатыПоПапкам) = Тип("Соответствие") Тогда
			
			РезультатОбработки = ОбработатьРезультатыЗагрузкиПапок(РезультатыПоПапкам);
			
			НеобходимаПереинициализация = РезультатОбработки.НеобходимаПереинициализация;
			ЗагрузкаСОшибками = РезультатОбработки.ЗагрузкаСОшибками;
			
			УдалитьИзВременногоХранилища(АдресРезультата);
			ИДФоновогоЗадания = Неопределено;
			
			Если НеобходимаПереинициализация Тогда
				ПараметрыАвторизации = Новый Структура;
				ПараметрыАвторизации.Вставить("НеобходимаПереинициализация", Истина);
				ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
			КонецЕсли;
			
			ОтобразитьСостояниеЗагрузки(Ложь, ЗагрузкаСОшибками, НеобходимаПереинициализация);
			
			// Оповещаем пользователя и обновляем списки когда завершены все задания
			ОповеститьОбИзменении(Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы"));
			ОповеститьОбИзменении(Тип("СправочникСсылка.ККСНГ_ПрисоединенныеФайлы"));
			ОповеститьОбИзменении(Тип("СправочникСсылка.ККСНГ_Квитанции"));
			
		Иначе 	
			ТекстОшибки = "Не удалось получить информацию о загруженных документах.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		ИДФоновогоЗадания = Неопределено;
		
	Иначе		
		// Продолжаем наблюдения
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеЗагрузкиДокументов", 5, Истина);		
	КонецЕсли;
	                
КонецПроцедуры

&НаКлиенте
Функция ОбработатьРезультатыЗагрузкиПапок(РезультатыПоПапкам)
	
	ЗагрузкаСОшибками = Ложь;
	НеобходимаПереинициализация = Ложь;
	
	Для каждого ДанныеЗагрузкиПапки Из РезультатыПоПапкам Цикл
		
		РезультатОбработкиПапки = ОбработатьДанныеЗагрузкиПапки(ДанныеЗагрузкиПапки);
		ЗагрузкаСОшибками = ЗагрузкаСОшибками Или РезультатОбработкиПапки.ЗагрузкаСОшибками;
		НеобходимаПереинициализация = НеобходимаПереинициализация Или РезультатОбработкиПапки.НеобходимаПереинициализация;
		ИмяПапки = РезультатОбработкиПапки.ИмяПапки;
		
		Элементы["Progress" + ИмяПапки].Видимость = Ложь;
		
	КонецЦикла;
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("НеобходимаПереинициализация", НеобходимаПереинициализация);
	РезультатОбработки.Вставить("ЗагрузкаСОшибками", ЗагрузкаСОшибками);
	
	Возврат РезультатОбработки;
	
КонецФункции

&НаКлиенте
Функция ОбработатьДанныеЗагрузкиПапки(ДанныеЗагрузкиПапки)
	
	ЭтоОшибка = Ложь;
	ТекстСообщения = ""; 
	ИмяПапки = ДанныеЗагрузкиПапки.Ключ;
	ТекущийРезультат = ДанныеЗагрузкиПапки.Значение;
	ЕстьОшибкиДокументов = ТекущийРезультат.ОшибокДокументов > 0;
	ЕстьОшибкиКвитанций = ТекущийРезультат.ОшибокКвитанций > 0;
	ЭтоОшибка = ЕстьОшибкиДокументов Или ЕстьОшибкиКвитанций;

	Если ЭтоОшибка Тогда
		
		ТекстСообщения = "Загружено " + ТекущийРезультат.ЗаписанныхДокументов + " документов"
						 + ?(ЕстьОшибкиДокументов, ", ошибок загрузки документов " + ТекущийРезультат.ОшибокДокументов, "")
						 + ?(ЕстьОшибкиКвитанций, ", ошибок загрузки квитанций " + ТекущийРезультат.ОшибокКвитанций, "") + ".";
				 
		ТекНадписьРезультат = Элементы["Ошибка" + ИмяПапки];
		ТекНадписьРезультат.Заголовок = ТекстСообщения;
		ТекНадписьРезультат.Видимость = Истина;
		ТекНадписьАльтернативныйРезультат = Элементы["Успешно" + ИмяПапки];
		ТекНадписьАльтернативныйРезультат.Видимость = Ложь;
		
	КонецЕсли;

	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ИмяПапки", ИмяПапки);
	РезультатОбработки.Вставить("ЗагрузкаСОшибками", ЭтоОшибка);
	РезультатОбработки.Вставить("НеобходимаПереинициализация", ТекущийРезультат.НеобходимаПереинициализация);
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область ВыводПрогрессаЗагрузкиДО

&НаКлиенте
Процедура ВывестиПрогрессЗагрузки(ВариантВывода)
	
	ПрогрессИнфо = ПолучитьПрогрессНаСервере(ИДФоновогоЗадания);	
	Если НЕ ПрогрессИнфо = Неопределено Тогда
		
		Если ВариантВывода = 1 Тогда // Состояние
			
			Состояние(ПрогрессИнфо.Текст, ПрогрессИнфо.Процент);
			
		ИначеЕсли ВариантВывода = 2 Тогда // Поле индикатора (для каждой строки)
			
			Модуль = ККСНГ_ОбщегоНазначенияКлиентСервер;
			ДанныеПрогресса = Модуль.СвойствоСтруктуры(ПрогрессИнфо, "ДополнительныеПараметры.ДанныеПрогрессаПапки");
			Если НЕ ДанныеПрогресса = Неопределено Тогда
				Для каждого ЭлементПрогресса Из ДанныеПрогресса Цикл
					ПараметрыПрогресса = ЭлементПрогресса.Значение;
					ИмяПапки = ПараметрыПрогресса.ИмяПапки;
					Элементы["Progress" + ИмяПапки].Видимость = Истина;
					ЭтотОбъект["Progress" + ИмяПапки] = ПараметрыПрогресса.Процент;
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ВариантВывода = 3 Тогда // Поле индикатора (общее)
			
			Элементы.ПрогрессБар.Видимость = Истина;
			ПрогрессБар = ПрогрессИнфо.Процент;
			
			Элементы.ПрогрессБар.Подсказка = ПрогрессИнфо.Текст;
			Если ПрогрессИнфо.Процент = 100 Тогда
				Элементы.ПрогрессБар.Подсказка = "";		
			КонецЕсли;
		Иначе
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрогрессНаСервере(ИДФоновогоЗадания)
	Возврат ДлительныеОперации.ПрочитатьПрогресс(ИДФоновогоЗадания);
КонецФункции

#КонецОбласти

#КонецОбласти