#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрисоединенныйФайлСсылка = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, Объект.Ссылка);
	ЭтоСтруктурированныйДокумент = ККСНГ_ЭлектронныеДокументыВызовСервера.ЭтоСтруктурированныйЭД(Объект.DocumentTypeCode);
	ДоступнаВыгрузкаФНС = ККСНГ_ОбщегоНазначенияВызовСервера.ДоступнаВыгрузкаФНС(Объект.DocumentTypeCode);
	ЭтоВходящий = Объект.НаправлениеЭД = ПредопределенноеЗначение("Перечисление.ККСНГ_НаправленияЭД.Входящий");
	ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(Объект.Ссылка);
	Документ1С = ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьСвязанныйДокумент1С(Объект.Ссылка);
	Квитанции.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
	НастроитьВидимостьДополнительныхПараметров();
	Элементы.ГруппаПредупреждениеПФ.Видимость = Ложь;
	
	Если Не Отказ И ЗначениеЗаполнено(Объект.Организация) И Не ККСНГ_ОбщегоНазначенияВызовСервера.ОрганизацияДоступнаПользователю(Объект.Организация) Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	ЗапросДоступностиПринятияКУчету = ОбщийМодульПринятиеКУчету.ПринятиеКУчетуДоступно(Объект.Ссылка, Объект.DocumentTypeCode);
	Если ЗапросДоступностиПринятияКУчету.Успех Тогда
		ПринятиеКУчетуДоступно = ЗапросДоступностиПринятияКУчету.Результат;
	Иначе
		ПринятиеКУчетуДоступно = Ложь;
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросДоступностиПринятияКУчету.Журнал, "-1");
	КонецЕсли;
	
	ОбновитьДоступностьДействий();
	НастроитьВидимостьОткрытьСФЕРАКурьер();
	ОбновитьИнформациюПоОшибкамЦРПТ();
	ОбновитьОтображениеСтатусаЦРПТ();
	ОбновитьОтображениеБизнесПроцесс();
	
	ЭтотОбъект.Заголовок = ККСНГ_ЭлектронныеДокументыКлиент.СформироватьЗаголовокЭлектронногоДокумента(Объект.DocumentTypeCode, Объект.TypeName, Объект.Number, Объект.Date);
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	ОбновитьСтатусУчета();
	
	Элементы.ПечатнаяФормаЭлектронногоДокумента.Видимость = Ложь;
	
	Если Не ЭтоСтруктурированныйДокумент Тогда
		Элементы.СтраницаРеквизиты.Видимость = Истина;
		Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.СтраницаРеквизиты;
	КонецЕсли;
	
	ОбновитьДанныеПечатнойФормыЭлектронногоДокумента();
	УстановитьНастройкиОбновленияВложений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Перем ТекПрофильНастройкиЭДО;
	
	Если ИмяСобытия = "ПослеКомандыСФЕРАКурьер" И Источник = Объект.Ссылка Тогда
		ОбновитьКарточкуДокумента();
		ОбновитьСтатусУчета();
	ИначеЕсли ИмяСобытия = "Все квитанции подписаны" И Источник = УникальныйИдентификатор Тогда
		ОбновитьКарточкуДокумента();
		ВыполнитьДействиеКурьер(Параметр.Результат, Ложь);
	ИначеЕсли ИмяСобытия = "ОбновитьДоступностьКомандКурьера" Тогда
		ОбновитьДоступностьДействий();
	ИначеЕсли ИмяСобытия = "ККСНГ_ОбновлениеЭД" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		Параметр.Свойство("ПрофильНастройкиЭДО", ТекПрофильНастройкиЭДО);
		Если Параметр.Свойство("ПрофильНастройкиЭДО", ТекПрофильНастройкиЭДО) И ТекПрофильНастройкиЭДО = ПрофильЭДООрганизации Тогда 
			ОбновитьКарточкуДокумента();
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияДокумент1СНажатие(Элемент)

	Если ЗначениеЗаполнено(Документ1С) Тогда

		ПоказатьЗначение(, Документ1С);

	ИначеЕсли ЭтоВходящий И ПринятиеКУчетуДоступно Тогда
						
		МенюВыбора = Новый СписокЗначений;
	
		МенюВыбора.Добавить("Принять к учёту в 1С", "Принять к учёту в 1С",	, БиблиотекаКартинок.ККСНГ_СоздатьВ1С);
		МенюВыбора.Добавить("Выбрать ранее учтённый", "Выбрать ранее учтённый",	, БиблиотекаКартинок.ККСНГ_ДобавитьСвязь);
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ОбработчикЗавершенияВыбораДействияИзМеню", ЭтотОбъект);
		
		ПоказатьВыборИзМеню(ОбработкаОповещения, МенюВыбора, Элементы.ДекорацияДокумент1С);	
			
	Иначе
		НачатьВыборДокумента1С();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтатусЭДНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.СтраницаИсторияОбработки;
	ОбновитьТаблицуИстории();

КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ТекущаяСтраница.Имя = "СтраницаИсторияОбработки" Тогда
		ОбновитьТаблицуИстории();
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаВложения" Тогда 
		ОбновитьСписокВложенийЭД();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКвитанции

&НаКлиенте
Процедура КвитанцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрСравнить(Элемент.ТекущиеДанные.ExtendedType, "Document") = 0 Тогда
		Возврат; // Сам документ не показываем, нет смысла
	КонецЕсли;
	
	Если СтрНачинаетсяС(Элемент.ТекущиеДанные.ExtendedType, "UniversalMessageFns") Тогда
		Возврат; // Универсальные сообщения пока не поддерживаются
	КонецЕсли;
	
	ПоказатьФормуКвитанции(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КвитанцииПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Перем ДанныеКвитанции, СтрокаСписка, ДанныеСтроки;
	
	// Заполнение типа документа для квитанций, загруженных до обновления перечисления
	
	ДанныеКвитанции = Новый Структура;
	ДанныеКвитанции.Вставить("ККСНГ_ExtendedDocumentType");
	
	Для каждого СтрокаСписка Из Строки Цикл
		
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		Если Не ЗначениеЗаполнено(ДанныеСтроки.ККСНГ_ExtendedDocumentType) Тогда
			Попытка
				ДанныеКвитанции.ККСНГ_ExtendedDocumentType = Перечисления.ККСНГ_ExtendedDocumentType[СокрЛП(ДанныеСтроки.ExtendedType)];
			Исключение
				Продолжить;
			КонецПопытки;
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеКвитанции);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВложений

&НаКлиенте
Процедура ТаблицаВложенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СохранитьВыбранныеВложения(ВыбраннаяСтрока);
								
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДействиеКурьер(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПротоколПередачи(Команда)

	#Если ВебКлиент Тогда
	    Возврат;
	#КонецЕсли

	ПослеАвторизации = Новый ОписаниеОповещения("ПротоколПередачиПродолжение", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);

КонецПроцедуры

&НаКлиенте
Процедура КарточкаДокумента(Команда)

	ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
	ОткрытьФорму("Справочник.ККСНГ_ЭлектронныеДокументы.Форма.ФормаЭлемента", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеЭлектронногоДокумента(Команда)

	ПослеАвторизации = Новый ОписаниеОповещения("ОбновитьДанныеЭлектронногоДокументаПродолжение", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортДляФНС(Команда)

	НачатьВыборКаталога(Новый ОписаниеОповещения("ЭкспортДляФНСПослеВыбораКаталога", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложения(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаВложений.ВыделенныеСтроки;
	СохранитьВыбранныеВложения(ВыделенныеСтроки);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСФЕРАДокументы(Команда)
	
	Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим() Тогда
		АдресКурьера = "https://courier-demo.esphere.ru";
	Иначе
		АдресКурьера = "https://courier.esphere.ru";
	КонецЕсли;
	
	ВнешняяСсылка = АдресКурьера + "/documents/"
				  + ?(ЭтоВходящий, "1", "2") + "/"
				  + Формат(Объект.Id, "ЧГ=");
	
	ЗапуститьПриложение(ВнешняяСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОшибкиИзЦРПТНаФорме(Команда)
	
	ОбновитьИнформациюПоОшибкамЦРПТ(Истина);
	ОбновитьОтображениеСтатусаЦРПТ();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкаВидимостиДоступности

&НаКлиенте
Процедура НастроитьВидимостьОткрытьСФЕРАКурьер()

	Элементы.ФормаОткрытьСФЕРАКурьер.Видимость = Ложь;
	
	ПараметрыАвторизации = ККСНГ_ДокументооборотКлиент.ТекущиеПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации);
	СпособАвторизации    = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации,	"СпособАвторизации");
	Если СпособАвторизации = Неопределено Тогда
		СпособАвторизации = ККСНГ_ДокументооборотВызовСервера.СпособАвторизацииОрганизации(ПрофильЭДООрганизации);	
	КонецЕсли;
	
	Если СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey") Тогда
		Элементы.ФормаОткрытьСФЕРАКурьер.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеФормыДокумента

&НаКлиенте
Процедура ОбновитьКарточкуДокумента(ОбновлятьТекВкладку = Истина)

	ОбновитьКарточкуДокументаНаСервере();
	Если ОбновлятьТекВкладку Тогда
		ОбновитьТекущуюВкладку();	
	КонецЕсли;
	ОбновитьДоступностьДействий();
	ОбновитьОтображениеСтатусаЦРПТ();
	ОповеститьОбИзменении(Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ОбновитьКарточкуДокументаНаСервере()

    ЭтотОбъект.Прочитать();
	
	НастроитьВидимостьДополнительныхПараметров();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущуюВкладку()

	ТекСтраница = Элементы.ГруппаЗакладки.ТекущаяСтраница.Имя;

	Если ТекСтраница = "СтраницаКвитанции" Тогда
		Элементы.Квитанции.Обновить();
	ИначеЕсли ТекСтраница = "СтраницаИсторияОбработки" Тогда
		ОбновитьТаблицуИстории();
	ИначеЕсли ТекСтраница = "СтраницаПодписи" ИЛИ ТекСтраница = "СтраницаСодержимое" Тогда
		ОбновитьДанныеПечатнойФормыЭлектронногоДокумента();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьДействий()
	
	СписокДействийПоМаске = ККСНГ_ДокументооборотКлиент.ПолучитьСоответствиеМаскиДействийИзСтроки(Объект.Actions);
	
	КорректировкаДоступностиДействий(СписокДействийПоМаске);
	СписокДоступныхДействий.Очистить();
	Для каждого Действие Из СписокДействийПоМаске Цикл
		СписокДоступныхДействий.Добавить(Действие.Ключ);
	КонецЦикла;
	
	Для каждого ЭлементФормы Из Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") И Лев(ЭлементФормы.ИмяКоманды, 6) = "Курьер" Тогда
			
			ЭлементФормы.Пометка = Ложь;
			ЭлементФормы.Доступность = Истина;
			
			ИмяДействия = Сред(ЭлементФормы.ИмяКоманды, 7);
			ЭлементФормы.Видимость = СписокДействийПоМаске[ИмяДействия] <> Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ПротоколПередачи.ТолькоВоВсехДействиях = НЕ Объект.IsDocflowCompleted И СписокДействийПоМаске.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДоступностиДействий(СписокДействийПоМаске)
	
	НеподписанныеКвитанции = ККСНГ_ОбъектыИБВызовСервера.ПолучитьКвитанцииДокумента(Объект.Ссылка, Истина);
	
	Если НеподписанныеКвитанции.Количество() Тогда
		СписокДействийПоМаске.Вставить("ПодписатьКвитанцииДокумента", Истина);
	КонецЕсли;
	
	Если Объект.Status = "Delivered" Тогда
		
		СписокДействийПоМаске.Вставить("Accept", Истина);
		СписокДействийПоМаске.Вставить("Reject", Истина);
		
	КонецЕсли;
	
	Если СписокДействийПоМаске["AcceptWithTicket"] <> Неопределено И СписокДействийПоМаске["AcceptWithTicket"] Тогда
		
		СписокДействийПоМаске.Вставить("AcceptWithTicketNoDisaccordSign", Истина); // Подписать
		
		ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(Объект.Filename);
		Если Не ЭтоКорректировка Тогда
			СписокДействийПоМаске.Вставить("AcceptWithTicketDisaccordSign", Истина); // Подписать с расхождениями
		КонецЕсли;
	
		СписокДействийПоМаске.Удалить("Accept");
		
	КонецЕсли;
	
	Если СписокДействийПоМаске["RejectWithTicket"] <> Неопределено И СписокДействийПоМаске["RejectWithTicket"] Тогда
		
		СписокДействийПоМаске.Удалить("Reject");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеСтатусаЦРПТ()
	
	Элементы.ГруппаСтатусЦРТ.Видимость = Объект.ЕстьМаркировка И Объект.СтатусЦРПТ <> -1 И СтрСравнить(Объект.Status, "Draft") <> 0;
	
	Если Элементы.ГруппаСтатусЦРТ.Видимость Тогда
		
		Если Объект.СтатусЦРПТ = 0 Или Объект.СтатусЦРПТ = 4 Тогда
			Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка = БиблиотекаКартинок.ККСНГ_СтатусОшибкаОбработкиЦРПТ;
			Элементы.ДекорацияРасшифровкаСтатусаЦРПТ.Заголовок = "Ошибка обработки документа";
		ИначеЕсли Объект.СтатусЦРПТ = 1 Тогда
			Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка = БиблиотекаКартинок.ККСНГ_СтатусОтправленЦРПТ;
			Элементы.ДекорацияРасшифровкаСтатусаЦРПТ.Заголовок = "Документ отправлен";
		ИначеЕсли Объект.СтатусЦРПТ = 2 Тогда
			Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка = БиблиотекаКартинок.ККСНГ_СтатусУспешноОбработанЦРПТ;
			Элементы.ДекорацияРасшифровкаСтатусаЦРПТ.Заголовок = "Документ успешно обработан";
		ИначеЕсли Объект.СтатусЦРПТ = 3 Тогда
			Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка = БиблиотекаКартинок.ККСНГ_СтатусОбрабатываетсяЦРПТ;
			Элементы.ДекорацияРасшифровкаСтатусаЦРПТ.Заголовок = "Документ получен и обрабатывается";
		ИначеЕсли Объект.СтатусЦРПТ = 5 Тогда
			Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка = БиблиотекаКартинок.ККСНГ_СтатусОбрабатываетсяЦРПТ;
			Элементы.ДекорацияРасшифровкаСтатусаЦРПТ.Заголовок = "Не удалось получить статус ЦРПТ";
		Иначе
			Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка = Новый Картинка;
			Элементы.ДекорацияРасшифровкаСтатусаЦРПТ.Заголовок = "" + Объект.СтатусЦРПТ + " Неизвестный статус";
		КонецЕсли;
		Элементы.ДекорацияИконкаСтатусаЦРПТ.Видимость = Элементы.ДекорацияИконкаСтатусаЦРПТ.Картинка.Вид <> ВидКартинки.Пустая;
	КонецЕсли;
	
	Элементы.СтраницаЦРПТ.Видимость = Элементы.ГруппаСтатусЦРТ.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеБизнесПроцесс()
	
	БизнесПроцессДопПараметр = Объект.Properties.НайтиСтроки(Новый Структура("Key", "business process"));
	Элементы.ГруппаБизнесПроцесс.Видимость = БизнесПроцессДопПараметр.Количество();
	Если Элементы.ГруппаБизнесПроцесс.Видимость Тогда
		
		СоответствияИменБизнесПроцесса = Новый Соответствие();
		СоответствияИменБизнесПроцесса.Вставить("UVHD", "ЭДО с поставщиками");	
		
		БизнесПроцессКод = БизнесПроцессДопПараметр[0].Value;
		БизнесПроцессИмя = СоответствияИменБизнесПроцесса[БизнесПроцессКод];
		Если Не ЗначениеЗаполнено(БизнесПроцессИмя) Тогда
			БизнесПроцессИмя = БизнесПроцессКод;	
		КонецЕсли;
		
		Элементы.ДекорацияРасшифровкаБизнесПроцесса.Заголовок = БизнесПроцессИмя;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСписокДоступныхДействий()
	
	НеподписанныеКвитанции = ККСНГ_ОбъектыИБВызовСервера.ПолучитьКвитанцииДокумента(Объект.Ссылка, Истина);
	Если НеподписанныеКвитанции.Количество() Тогда
		СписокДоступныхДействий.Добавить("ПодписатьКвитанцииДокумента");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюПоОшибкамЦРПТ(Принудительно = Ложь)
	
	Если Не Объект.Ссылка.Пустая() И Объект.ЕстьМаркировка И СтрСравнить(Объект.Status, "Draft") <> 0 Тогда
		
		СтатусКонечный = Объект.СтатусЦРПТ = 4 Или Объект.СтатусЦРПТ = 2;
		
		Если Принудительно <> Истина И СтатусКонечный Тогда
			ИнформацияНеПустая = ОбновитьИнформациюПоОшибкамЦРПТНаСервере(Истина);
			Если ИнформацияНеПустая Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПрофильНастройкиЭДО", ПрофильЭДООрганизации);
		ДопПараметры.Вставить("Id", Объект.Id);
		ПослеАвторизации = Новый ОписаниеОповещения("ОбновитьИнформациюПоОшибкамЦРПТЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);
		
	Иначе
		Элементы.СтраницаЦРПТ.Видимость = Ложь;
	КонецЕсли;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюПоОшибкамЦРПТЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
	Если ЗапросПараметрыАвторизации.Успех Тогда
		РезультатОбновления = ОбновитьИнформациюПоОшибкамЦРПТНаСервере(Ложь, ПараметрыАвторизации, ДопПараметры.Id);
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ДопПараметры.ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьИнформациюПоОшибкамЦРПТНаСервере(ИзОбъекта, ПараметрыАвторизации = Неопределено, Id = Неопределено)
	
	Перем ОбъектЭД, ЗапросСтатусаЦРПТ, ДанныеОтЦРПТ, Ошибки, Ошибка;
	
	ОбъектЭД = РеквизитФормыВЗначение("Объект");
	
	Если ИзОбъекта Тогда
		
		ДанныеОтЦРПТ = ОбъектЭД.ОшибкиЦРПТ.Получить();
		Если ТипЗнч(ДанныеОтЦРПТ) <> Тип("Структура") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Ошибки = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОтЦРПТ, "Ошибки");
		Если ТипЗнч(Ошибки) <> Тип("Массив") Тогда
			Ошибки = Новый Массив;
			Ошибки.Добавить(ДанныеОтЦРПТ);
		КонецЕсли;
		
		ВывестиТаблицуИнформацииПоОшибкамЦРПТ(Ошибки);
		Возврат Истина;
		
	КонецЕсли;
	
	ЗапросСтатусаЦРПТ = ККСНГ_ДокументооборотВызовСервера.СтатусЦРПТДокумента(Id, ПараметрыАвторизации);
	Если ЗапросСтатусаЦРПТ.Успех Тогда
		
		Если ЗапросСтатусаЦРПТ.ДанныеПоОшибкеОтЦРПТ.Успех Тогда
			
			ОбъектЭД.СтатусЦРПТ = ЗапросСтатусаЦРПТ.Результат;
			
			ДанныеОтЦРПТ = ЗапросСтатусаЦРПТ.ДанныеПоОшибкеОтЦРПТ.Результат;
			ОбъектЭД.КодОшибкиЦРПТ = ДанныеОтЦРПТ.КодОшибки;
			ОбъектЭД.ОписаниеОшибкиЦРПТ = ДанныеОтЦРПТ.Заголовок;
			Для каждого Ошибка Из ДанныеОтЦРПТ.Ошибки Цикл
				ОбъектЭД.ОписаниеОшибкиЦРПТ = Ошибка.ОписаниеОшибки;
				Прервать;
			КонецЦикла;
			
			ВывестиТаблицуИнформацииПоОшибкамЦРПТ(ДанныеОтЦРПТ.Ошибки);
			
		КонецЕсли;
		
		Попытка
			ОбъектЭД.ОшибкиЦРПТ = Новый ХранилищеЗначения(ДанныеОтЦРПТ, Новый СжатиеДанных(9));
			ОбъектЭД.Записать();
		Исключение
		КонецПопытки;
		
		ЗначениеВРеквизитФормы(ОбъектЭД, "Объект");
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросСтатусаЦРПТ.Журнал);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиТаблицуИнформацииПоОшибкамЦРПТ(МассивДанныхИзЦРПТ)
	
	Перем ИнформацияИзЦРПТ, НоваяСтрока;
	Перем Отбор, ПустыеСтроки, ПустаяСтрока;
	
	ИнформацияПоОшибкамЦРПТ.Очистить();
	
	Для каждого ИнформацияИзЦРПТ Из МассивДанныхИзЦРПТ Цикл
		
		Если ИнформацияПоОшибкамЦРПТ.Количество() > 0 Тогда
			// Пустая строка между ошибками
			НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
			НоваяСтрока.Заголовок = "-";
		КонецЕсли;
		
		//НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		//НоваяСтрока.Заголовок = "Статус";
		//НоваяСтрока.Расшифровка = ИнформацияИзЦРПТ.Заголовок;
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Код ошибки";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "КодОшибки");
		
		Если НоваяСтрока.Расшифровка = "1" Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Описание ошибки";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "ОписаниеОшибки");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Служебная информация";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "СлужебнаяИнформация");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Дополнительная информация";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "ДополнительнаяИнформация");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "ИНН";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "ИНН");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "КПП";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "КПП");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "ФИАС";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "ФИАС");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Участники";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "Участники");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Номер и дата документа";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "НомерДатаДокумента");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Номер и дата исправления";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "НомерДатаИсправления");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "GTIN";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "GTIN");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Коды маркировки";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "КодыМаркировок");
		
		НоваяСтрока = ИнформацияПоОшибкамЦРПТ.Добавить();
		НоваяСтрока.Заголовок = "Коды упаковок";
		НоваяСтрока.Расшифровка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияИзЦРПТ, "КодыУпаковок");
		
	КонецЦикла;
	
	Отбор = Новый Структура("Расшифровка", "");
	ПустыеСтроки = ИнформацияПоОшибкамЦРПТ.НайтиСтроки(Отбор);
	Для каждого ПустаяСтрока Из ПустыеСтроки Цикл
		Если ПустаяСтрока.Заголовок <> "-" Тогда
			ИнформацияПоОшибкамЦРПТ.Удалить(ПустаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеПечатнойФормыДокумента

&НаКлиенте
Процедура ОбновитьДанныеПечатнойФормыЭлектронногоДокумента()

	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьМассивЭПОбъектаЭДОЗавершение", ЭтотОбъект, ЭтоСтруктурированныйДокумент);
	ККСНГ_ЭлектронныеДокументыКлиент.ПолучитьМассивЭПОбъектаЭДОНаКлиенте(ОписаниеОповещения, Объект.Ссылка, Объект.Type);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМассивЭПОбъектаЭДОЗавершение(МассивЭП, ЭтоСтруктурированныйДокумент) Экспорт

	ККСНГ_ЭлектронныеДокументыКлиент.ЗаполнитьТаблицуПодписиНаФорме(ТаблицаПодписи, МассивЭП);

	Если ЭтоСтруктурированныйДокумент Тогда
		СформироватьПечатнуюФормуЭлектронногоДокумента(ЭтоСтруктурированныйДокумент, МассивЭП);
	КонецЕсли;

	ОбновитьДоступностьЭкспортаДляФНС();

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПечатнуюФормуЭлектронногоДокумента(ЭтоСтруктурированныйДокумент, МассивЭП)

	СтруктураТабДок = ПолучитьТабличныйДокумент(ЭтоСтруктурированныйДокумент, МассивЭП);
	ТабДокЭД = СтруктураТабДок.ПечатнаяФормаЭД;

	Если ЗначениеЗаполнено(СтруктураТабДок.ТекстПредупреждения) Тогда
		Элементы.ПредупреждениеПФ.Заголовок = СтруктураТабДок.ТекстПредупреждения;
		Элементы.ГруппаПредупреждениеПФ.Видимость = Истина;
	Иначе
		Элементы.ГруппаПредупреждениеПФ.Видимость = Ложь;
	КонецЕсли;

	Если ТабДокЭД <> Неопределено Тогда

		ТабДокЭД.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ККСНГ_ЭлектронныеДокументы_" + Объект.Type;
		ПрисоединитьКарточкуИнфоПолейКЭлектронномуДокументу(ТабДокЭД);
		ПечатнаяФормаЭлектронногоДокумента = ТабДокЭД;
		Элементы.ПечатнаяФормаЭлектронногоДокумента.Видимость = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьТабличныйДокумент(ЭтоСтруктурированныйДокумент, МассивЭП, Квитанция = Неопределено)
	
	Результат = Неопределено;
	
	СвойстваЭлектронногоДокумента = Новый Структура;
	СвойстваЭлектронногоДокумента.Вставить("НомерИсходногоДокумента", Объект.Number);
	СвойстваЭлектронногоДокумента.Вставить("ДатаИсходногоДокумента", Объект.Date);
	СвойстваЭлектронногоДокумента.Вставить("Подписи", МассивЭП);
	СвойстваЭлектронногоДокумента.Вставить("КодТипаДокумента", Объект.DocumentTypeCode);
	
	Если Квитанция <> Неопределено Тогда
		
		СвойстваЭлектронногоДокумента.Вставить("Владелец", Квитанция.Ссылка);
		СвойстваЭлектронногоДокумента.Вставить("РасширенныйТип", Квитанция.ExtendedType);
		СвойстваЭлектронногоДокумента.Вставить("ТипТранспортногоДокумента", Квитанция.Type);
		
		ТекПрисоединенныйФайлСсылка = Квитанция.ПрисоединенныйФайлСсылка;
		
	ИначеЕсли ЭтоСтруктурированныйДокумент Тогда
		
		СвойстваЭлектронногоДокумента.Вставить("Владелец", Объект.Ссылка);
		СвойстваЭлектронногоДокумента.Вставить("РасширенныйТип", "Document");
		СвойстваЭлектронногоДокумента.Вставить("ТипТранспортногоДокумента", Объект.Type);
		
		ТекПрисоединенныйФайлСсылка = ПрисоединенныйФайлСсылка;
	Иначе
		ТекПрисоединенныйФайлСсылка = Неопределено;
	КонецЕсли;
	
	ПараметрыПредставления = Новый Структура;
	ПараметрыПредставления.Вставить("СкрыватьДопДанные", Истина);
	ПараметрыПредставления.Вставить("СкрыватьКопияВерна", Истина);
	ПараметрыПредставления.Вставить("СвойстваЭлектронногоДокумента", СвойстваЭлектронногоДокумента);
	
	Результат = ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьПредставлениеФайлаЭД(ТекПрисоединенныйФайлСсылка, ПараметрыПредставления);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеДанныхЭлектронногоДокумента

&НаКлиенте
Процедура ОбновитьДанныеЭлектронногоДокументаПродолжение(ЗапросПараметрыАвторизации, ДопПараметры)

	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;

		ОбновитьДанныеЭлектронногоДокументаНаСервере(Объект.Ссылка, ПрофильЭДООрганизации, ПараметрыАвторизации);
		ОбновитьКарточкуДокумента();
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильЭДООрганизации, ПараметрыАвторизации);
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДанныеЭлектронногоДокументаНаСервере(ЭлектронныйДокумент, ПрофильЭДООрганизации, ПараметрыАвторизации)

	ЭлектронныеДокументы = Новый Массив;
	ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);

	ККСНГ_ДокументооборотВызовСервера.ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы,
														ПрофильЭДООрганизации, ПараметрыАвторизации);

КонецПроцедуры

#КонецОбласти

#Область ВыполнениеДействийКурьер

&НаКлиенте
Процедура ВыполнитьДействиеКурьер(ИмяКоманды, ТребуетсяПодписаниеКвитанций = Неопределено)
	
	Если ТребуетсяПодписаниеКвитанций = Неопределено Тогда
		ТребуетсяПодписаниеКвитанций = ККСНГ_КвитанцииКлиент.ТребуетсяПодписаниеКвитанций(ИмяКоманды);
	КонецЕсли;
	
	ККСНГ_ДокументооборотКлиент.ВыполнитьДействиеКурьер(ИмяКоманды, ПрофильЭДООрганизации, ТребуетсяПодписаниеКвитанций, Объект.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеКоманды(ИмяКоманды)

	Возврат ЭтотОбъект.Команды.Найти(ИмяКоманды).Заголовок;

КонецФункции

#КонецОбласти

#Область ПоказатьКвитанцию

&НаКлиенте
Процедура ПоказатьФормуКвитанции(ВыбраннаяКвитанция)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьМассивЭПКвитанцииЗавершение", ЭтотОбъект, ВыбраннаяКвитанция);
	ККСНГ_ЭлектронныеДокументыКлиент.ПолучитьМассивЭПОбъектаЭДОНаКлиенте(ОписаниеОповещения, ВыбраннаяКвитанция.Ссылка, ВыбраннаяКвитанция.Type);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМассивЭПКвитанцииЗавершение(МассивЭП, Квитанция) Экспорт
	
	СтруктураТабДок = ПолучитьТабличныйДокумент(ЭтоСтруктурированныйДокумент, МассивЭП, Квитанция);
	ТабДокЭД = СтруктураТабДок.ПечатнаяФормаЭД;
	
	Если ТабДокЭД <> Неопределено Тогда
		ТабДокЭД.Показать(Квитанция.ККСНГ_ExtendedDocumentType);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПротоколПередачи

&НаКлиенте
Процедура ПротоколПередачиПродолжение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		ОтветПротокол = ПолучитьПротоколПередачиНаСервере(Объект.Id, ПараметрыАвторизации);
		
		Если ОтветПротокол.Успех Тогда
			АдресВХранилище = ОтветПротокол.Результат;
			ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
			
			ПротоколДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
			ПротоколДвоичныеДанные.Записать(ИмяФайла);
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("ИмяФайла", ИмяФайла);
			ПараметрыОповещения.Вставить("ЗаголовокДокумента", ЭтотОбъект.Заголовок);
			ОбработчикЗавершенияПросмотраПротокола = Новый ОписаниеОповещения("ОбработчикЗавершенияПросмотраПротокола", ЭтотОбъект, ПараметрыОповещения);
			
			ОткрытьФорму("Справочник.ККСНГ_ЭлектронныеДокументы.Форма.ФормаПросмотраПротокола", ПараметрыОповещения, ЭтотОбъект, , , , ОбработчикЗавершенияПросмотраПротокола, РежимОткрытияОкнаФормы.Независимый);
		Иначе
			ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильЭДООрганизации, ПараметрыАвторизации);
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтветПротокол.Журнал);
			
		КонецЕсли;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияПросмотраПротокола(Результат, ДопПараметры) Экспорт

	Попытка
		УдалитьФайлы(ДопПараметры.ИмяФайла);
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПротоколПередачиНаСервере(ДокументId, ПараметрыАвторизации)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	Результат = ККСНГ_APIКурьер.v1_DocumentProtocol(ПараметрыАвторизации, ДокументId);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, Результат.Журнал, Ложь);

	Если Результат.Успех Тогда
		ДвоичныеДанные = Результат.Результат.Content;
		Ответ.Результат = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		Ответ.Успех = Истина;
	КонецЕсли;

	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область ЭкспортДляФНС

&НаКлиенте
Процедура ОбновитьДоступностьЭкспортаДляФНС()

	Элементы.ФормаЭкспортДляФНС.Видимость = ДоступнаВыгрузкаФНС И ТаблицаПодписи.Количество() > 0;

КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборКаталога(ОповещениеПосле)

	ДопПараметры = Новый Структура("Оповещение", ОповещениеПосле);
	ОповещениеПослеВыбораКаталога = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект, ДопПараметры); 
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог сохранения архива для ФНС";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(ОповещениеПослеВыбораКаталога);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДопПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ВыбранныйКаталог = ВыбранныеФайлы[0];
		ВыполнитьОбработкуОповещения(ДопПараметры.Оповещение, ВыбранныйКаталог);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортДляФНСПослеВыбораКаталога(ВыбранныйКаталог, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(ВыбранныйКаталог) Тогда
		
		ПараметрыЭкспорта = Новый Структура("ВыбранныйКаталог", ВыбранныйКаталог);
		ПослеАвторизации = Новый ОписаниеОповещения("ЭкспортДляФНСПродолжение", ЭтотОбъект, ПараметрыЭкспорта);
		
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортДляФНСПродолжение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;

		ОтветАрхивФНС = АрхивДляФНС(Объект.Id, Объект.Type, ПараметрыАвторизации);

		Если ОтветАрхивФНС.Успех Тогда
			АрхивДвоичныеДанные = ОтветАрхивФНС.Результат;
			ВыбранныйКаталог = ДопПараметры.ВыбранныйКаталог;

			Слеш = ПолучитьРазделительПути();
			Если Прав(ВыбранныйКаталог, 1) <> Слеш Тогда
				ВыбранныйКаталог = ВыбранныйКаталог + Слеш;
			КонецЕсли;

			ДатаФормирования = Формат(ККСНГ_ОбщегоНазначенияВызовСервера.ТекущаяДатаВремяСеанса(), "ДФ=dd_MM_yyyy_ЧЧ_мм");
			ИмяАрхива = ВыбранныйКаталог + "exportFNS_" + ДатаФормирования + ".zip";
			ДопПараметры = Новый Структура("ИмяАрхива", ИмяАрхива);
			ОписаниеОповещения = Новый ОписаниеОповещения("ЭкспортПослеЗаписиАрхива", ЭтотОбъект, ДопПараметры);
			АрхивДвоичныеДанные.НачатьЗапись(ОписаниеОповещения, ИмяАрхива);

		Иначе
			ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильЭДООрганизации, ПараметрыАвторизации);
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтветАрхивФНС.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортПослеЗаписиАрхива(ДопПараметры) Экспорт

	Файл = Новый Файл(ДопПараметры.ИмяАрхива);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииНаСсылкуФайла", ЭтотОбъект, Файл.ПолноеИмя);
	ПоказатьОповещениеПользователя("Архив сохранен", ОписаниеОповещения, Файл.Имя, БиблиотекаКартинок.СохранитьФайл);

КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаСсылкуФайла(ДополнительныеПараметры) Экспорт

	#Если ВебКлиент Тогда
		Если Не РаботаСФайламиСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда
			РаботаСФайламиСлужебныйКлиент.ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(Неопределено);
			Возврат;
		КонецЕсли;
	#КонецЕсли

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Строка") И Не ПустаяСтрока(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиент.ОткрытьПроводник(ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АрхивДляФНС(ДокументId, ТипТранспортногоДокумента, ПараметрыАвторизации)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	ЗапросКвитанций = ККСНГ_APIКурьер.v1_TicketsTickets(ПараметрыАвторизации, ДокументId);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКвитанций.Журнал, Ложь);

	Если ЗапросКвитанций.Успех Тогда
		
		Квитанции = ЗапросКвитанций.Результат.TicketDetails;
		ИмяВременногоКаталога = ПолучитьИмяВременногоФайла("");
		Слеш = ПолучитьРазделительПути();
		ВнутриКаталога = ИмяВременногоКаталога + Слеш;
		ВыгружаемыеТипыКвитанций = Новый Массив;
		
		Если ККСНГ_ОбщегоНазначенияВызовСервера.ТребуютсяПодписиДвухСторон(ТипТранспортногоДокумента) Тогда
			ВыгружаемыеТипыКвитанций =
					ККСНГ_ЭлектронныеДокументыВызовСервера.МассивТиповТранспортныхДокументовТитулПокупателя();
		КонецЕсли;

		Для каждого ТекКвитанция Из Квитанции Цикл
			Если ТекКвитанция.ExtendedType = "Document"
					Или ВыгружаемыеТипыКвитанций.Найти(ТекКвитанция.Type) <> Неопределено Тогда
			    ДанныеСодержимого = ТекКвитанция.Content;
				ФайлДляИмен = Новый Файл(ВнутриКаталога + ДанныеСодержимого.Filename);
				ФайлДвоичныеДанные = ДанныеСодержимого.Content;
			    ФайлДвоичныеДанные.Записать(ФайлДляИмен.ПолноеИмя);
				ОбработатьПодписиКвитанции(ТекКвитанция.Signature, ФайлДляИмен, ВнутриКаталога);
			КонецЕсли;
		КонецЦикла;

		ЗаписьZIP = Новый ЗаписьZipФайла();
		ЗаписьZIP.Добавить(ВнутриКаталога + "*", РежимСохраненияПутейZIP.НеСохранятьПути);
		АрхивДвоичныеДанные = ЗаписьZIP.ПолучитьДвоичныеДанные();
		УдалитьФайлы(ИмяВременногоКаталога);

		Ответ.Успех = ТипЗнч(АрхивДвоичныеДанные) = Тип("ДвоичныеДанные");
		
	КонецЕсли;

	Ответ.Результат = АрхивДвоичныеДанные;

	Возврат Ответ;

КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьПодписиКвитанции(Подписи, ФайлШаблон, КаталогПуть)
	
	ИндексПодписи = 0;
	Для каждого Подпись Из Подписи Цикл
		ПодписьДвоичныеДанные = Подпись.Content;
		ИмяФайлаПодписи = КаталогПуть + ФайлШаблон.ИмяБезРасширения
								+ "SGN" + ?(ИндексПодписи > 0, ИндексПодписи, "") + ".sgn";
		ПодписьДвоичныеДанные.Записать(ИмяФайлаПодписи);
		ИндексПодписи = ИндексПодписи + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИстории

&НаКлиенте
Процедура ОбновитьТаблицуИстории()

	ПослеАвторизации = Новый ОписаниеОповещения("ОбновитьТаблицуИсторииЗавершение", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуИсторииЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ЗапросИстории = ОбновитьТаблицуИсторииНаСервере(ПараметрыАвторизации);

		Если ЗапросИстории.Успех Тогда
			ОбновитьКарточкуДокумента(Ложь);
		Иначе 
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросИстории.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьТаблицуИсторииНаСервере(ПараметрыАвторизации)

	ИсторияОбработки.Очистить();

	Ответ = ККСНГ_ДокументооборотВызовСервера.ПолучитьИсториюЭДИзКурьера(Объект.Id, ПараметрыАвторизации);

	Если Ответ.Успех Тогда

		Статусы = СтруктураСтатусовДокумента();
		МассивИстории = Ответ.Результат.DocumentHistory;

		Если ТипЗнч(МассивИстории) = Тип("Массив") Тогда

			Для Каждого ЭлементИстории Из МассивИстории Цикл
				НоваяСтрокаИстории = ИсторияОбработки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаИстории, ЭлементИстории);
				Статусы.Свойство(НоваяСтрокаИстории.Status, НоваяСтрокаИстории.СтатусКод);
			КонецЦикла;

		КонецЕсли;

	КонецЕсли;
	
	#Область ОбновлениеСтатусовВРоуминге

	СтатусыДокументаБезРоуминга = СтрРазделить("Draft,ToSign,Revoked,WaitingForSend", ",", Ложь);
	Если Объект.IsRoaming И СтатусыДокументаБезРоуминга.Найти(СокрЛП(Объект.Status)) = Неопределено Тогда 
		
		ЗапросСтатусовВРоуминге = ККСНГ_ДокументооборотВызовСервера.ПолучитьСтатусыВРоуминге(Объект.Ссылка, ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСтатусовВРоуминге.Журнал, Ложь);
		Если ЗапросСтатусовВРоуминге.Успех Тогда 
			АктуальныеСтатусы = ЗапросСтатусовВРоуминге.Результат;
			СтатусыВРоумингеСКодами = ККСНГ_ДокументооборотВызовСервера.КодыСтатусовВРоуминге();
			Для каждого ТекСтатус Из АктуальныеСтатусы Цикл
				
				НоваяСтрокаИстории = ИсторияОбработки.Добавить();
				НоваяСтрокаИстории.Date = ТекСтатус.StatusDate;
				НоваяСтрокаИстории.Status = ТекСтатус.RoamingStatus;
				НоваяСтрокаИстории.StatusName = ТекСтатус.ПредставлениеСтатуса;
				НоваяСтрокаИстории.Comment = "Роуминг: " + ТекСтатус.ПредставлениеДокумента;

				СтатусыВРоумингеСКодами.Свойство(НоваяСтрокаИстории.Status, НоваяСтрокаИстории.СтатусКод);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// ОбновлениеСтатусовВРоуминге
	#КонецОбласти
	
	ИсторияОбработки.Сортировать("Date Убыв, СтатусКод Убыв");
		
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураСтатусовДокумента()

	Статусы = Новый Структура;
	Статусы.Вставить("None", 0);
	Статусы.Вставить("Draft", 1);
	Статусы.Вставить("ToSign", 2);
	Статусы.Вставить("Prepared", 3);
	Статусы.Вставить("IsRead", 4);
	Статусы.Вставить("OnAgreement", 5);
	Статусы.Вставить("Signed", 6);
	Статусы.Вставить("Rejected", 7);
	Статусы.Вставить("Accepted", 9);
	Статусы.Вставить("OnRevocation", 10);
	Статусы.Вставить("Revoked", 11);
	Статусы.Вставить("Sended", 12);
	Статусы.Вставить("Delivered", 13);
	Статусы.Вставить("Received", 14);
	Статусы.Вставить("NoRoute", 15);
	Статусы.Вставить("RequestedAvoidance", 16);
	Статусы.Вставить("RejectedAvoidance", 17);
	Статусы.Вставить("AcceptedAvoidance", 18);
	Статусы.Вставить("ClarificationRequested", 19);
	Статусы.Вставить("WaitingForSend", 20);

	Возврат Статусы;

КонецФункции

#КонецОбласти

#Область ПринятиеКУчетуИСвязьДокументов

&НаКлиенте
Процедура ОбработчикЗавершенияВыбораДействияИзМеню(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		Если ВыбранныйЭлемент.Значение = "Принять к учёту в 1С" Тогда
			ПараметрыФормы = Новый Структура("Объект, ЕстьМаркировка", Объект.Ссылка, Объект.ЕстьМаркировка);
			ПараметрыЗавершенияПринятияКУчету = Новый Структура("Документ1С", Документ1С);
			
			ОбработчикЗавершенияПринятияКУчету = Новый ОписаниеОповещения("ОбработчикЗавершенияПринятияКУчету",
			ЭтотОбъект, ПараметрыЗавершенияПринятияКУчету);
			
			ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
			ОбщийМодульПринятиеКУчету.ОткрытьФормуПринятияКУчету(ПараметрыФормы, ЭтотОбъект, Объект.Id, ОбработчикЗавершенияПринятияКУчету);
					
		ИначеЕсли ВыбранныйЭлемент.Значение = "Выбрать ранее учтённый" Тогда
			НачатьВыборДокумента1С();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияПринятияКУчету(РезЗакрытия, ДополнительныеПараметры) Экспорт

	Документ1С = ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьСвязанныйДокумент1С(Объект.Ссылка);
	ОбновитьСтатусУчета();
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборДокумента1С()
	
	ОбщийМодуль = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	ЗапросТиповДокументов1С = ОбщийМодуль.ТипыСвязанногоДокумента1С(Объект.Ссылка, Объект.DocumentTypeCode, ЭтоВходящий);
	Если Не ЗапросТиповДокументов1С.Успех Тогда
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросТиповДокументов1С.Журнал, "-1");
		Возврат;
	КонецЕсли;
	
	ОписаниеТиповК = ЗапросТиповДокументов1С.Результат;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ОбработчикЗавершенияВыбораПринятогоКУчетуДокумента", ЭтотОбъект);

	ПоказатьВводЗначения(ОбработкаОповещения, Документ1С, "Выбор документа принятого к учёту", ОписаниеТиповК);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияВыбораПринятогоКУчетуДокумента(ВыбЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбЗначение <> Неопределено Тогда
		Документ1С = ВыбЗначение;
		
		ККСНГ_ОбъектыИБВызовСервера.ЗаписатьСвязьЭлектронногоДокумента(Объект.Ссылка, Документ1С);
		ОбновитьСтатусУчета();
		// TODO Пересмотреть оповещения электронных документов, сейчас по аналогии с принятием к учету
		ОповеститьОбИзменении(Объект.Ссылка);
		Оповестить("ПослеКомандыСФЕРАКурьер");
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусУчета()

	Если ЗначениеЗаполнено(Документ1С) Тогда
		Элементы.ДекорацияПодсказкаВыбора.Видимость = Ложь;
		Элементы.ДекорацияДокумент1С.Заголовок = СокрЛП(Документ1С);
		Элементы.ДекорацияДокумент1С.Подсказка = "Связанный документ 1С";
	Иначе
		Элементы.ДекорацияПодсказкаВыбора.Видимость = Не ПринятиеКУчетуДоступно;
		Элементы.ДекорацияДокумент1С.Заголовок = ?(ПринятиеКУчетуДоступно, "не учтён", "выбрать документ 1С");
		Элементы.ДекорацияДокумент1С.Подсказка = ?(ПринятиеКУчетуДоступно, "Связанный документ 1С", 
			"Для документа принятие к учету недоступно. Выберите созданный самостоятельно связанный документ 1С.");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаСВложениями

&НаКлиенте
Процедура ОбновитьСписокВложенийЭД()
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗаданияОбновленияВложений) Тогда
		
		УстановитьНастройкиОбновленияВложений();
			
		ПослеАвторизации = Новый ОписаниеОповещения("ПродолжитьОбновлениеВложений", ЭтотОбъект);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновлениеВложений(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;

		ФоновоеЗаданиеОбновлениеВложений = ОбновлениеВложенийНаСервере(ПараметрыАвторизации);
		
		Если ФоновоеЗаданиеОбновлениеВложений <> Неопределено Тогда
			ПодключитьОбработчикОжидания("ПроверитьЗавершениеОбновленияВложений", 1, Истина);
		КонецЕсли;
		
	Иначе
		ОписаниеОшибки = "Ошибка получения списка вложений документа. " 
							+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросПараметрыАвторизации.Журнал);
							
		ВывестиОшибкуОбновленияВложений(ОписаниеОшибки);					
			 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗавершениеОбновленияВложений() Экспорт
	
	ОписаниеОшибки = "";
	
	Если НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ЗаданиеВыполнено(ИдентификаторЗаданияОбновленияВложений, ОписаниеОшибки) Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеОбновленияВложений", 1, Истина);
		Возврат;
	КонецЕсли;
					
	Элементы.ДекорацияОжидание.Видимость = Ложь;
	ИдентификаторЗаданияОбновленияВложений = "";
	ТаблицаВложений.Очистить();
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ВывестиОшибкуОбновленияВложений(ОписаниеОшибки);
		Возврат;
	КонецЕсли;		
	
	ЗапросОбновленияВложений = ПолучитьИзВременногоХранилища(АдресХранилищаВложений);
	
	Если ТипЗнч(ЗапросОбновленияВложений) = Тип("Структура") Тогда
		
		Если ЗапросОбновленияВложений.Успех Тогда
			
			МассивВложений = ЗапросОбновленияВложений.Результат; 
			
			Для Нпп = 1 По МассивВложений.Количество() Цикл 
				СтрокаТаблицы = ТаблицаВложений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, МассивВложений[Нпп - 1]);
				СтрокаТаблицы.Нпп = Нпп;
			КонецЦикла;
			
			Если ТаблицаВложений.Количество() Тогда
				Элементы.ТаблицаВложений.Видимость = Истина;
				Элементы.СтатусПолученияВложений.Видимость = Ложь;
			Иначе
				Элементы.СтатусПолученияВложений.Заголовок = "Вложения отсутствуют.";	
			КонецЕсли;
			
		Иначе
			
			ОписаниеОшибки = "Ошибка получения списка вложений документа. " 
			+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросОбновленияВложений.Журнал);
			ВывестиОшибкуОбновленияВложений(ОписаниеОшибки);
			
		КонецЕсли;
		
	Иначе 
		
		ОписаниеОшибки = "Неизвестная ошибка получения списка вложений документа. Обратитесь к администратору.";
		ВывестиОшибкуОбновленияВложений(ОписаниеОшибки);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ОбновлениеВложенийНаСервере(ПараметрыАвторизации)

	АдресХранилищаВложений = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(АдресХранилищаВложений);
	ПараметрыВызова.Добавить(Объект.Id);
	ПараметрыВызова.Добавить(ПараметрыАвторизации);
	
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ККСНГ_ДокументооборотВызовСервера.ПолучитьВложенияЭлектронногоДокументаИзКурьераВФоновомЗадании", 
								ПараметрыВызова, УникальныйИдентификатор, "Обновление вложений ЭД");
								
		ИдентификаторЗаданияОбновленияВложений = ФоновоеЗадание.УникальныйИдентификатор;
		
	Исключение
		ИдентификаторЗаданияОбновленияВложений = "";
	КонецПопытки;
		
	Возврат ИдентификаторЗаданияОбновленияВложений;
	
КонецФункции

&НаКлиенте
Процедура УстановитьНастройкиОбновленияВложений()
	
	Элементы.ДекорацияОжидание.Видимость = Истина;
	Элементы.СтатусПолученияВложений.Видимость = Истина;
	Элементы.СтатусПолученияВложений.Заголовок = "Получение вложений, пожалуйста подождите...";
	Элементы.ОшибкаПолученияВложений.Видимость = Ложь;
	Элементы.ТаблицаВложений.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОшибкуОбновленияВложений(ОписаниеОшибки)
	
	Элементы.ОшибкаПолученияВложений.Видимость = Истина;
	Элементы.ОшибкаПолученияВложений.Заголовок = ОписаниеОшибки;
	
	Элементы.ДекорацияОжидание.Видимость = Ложь;
	Элементы.СтатусПолученияВложений.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыбранныеВложения(МассивСтрок)
	
	МассивИдентификаторов = Новый Массив;
				
	Для каждого Строка Из МассивСтрок Цикл
		СтрокаТаблицы = ТаблицаВложений.НайтиПоИдентификатору(Строка);
		МассивИдентификаторов.Добавить(СтрокаТаблицы.Id);
	КонецЦикла;
		
	ДопПараметры = Новый Структура("МассивИдентификаторов", МассивИдентификаторов);
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПродолжитьСохранениеВложений", ЭтотОбъект, ДопПараметры);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСохранениеВложений(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПараметрыАвторизации.Журнал, Ложь);
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		МассивИдентификаторов = ДопПараметры.МассивИдентификаторов;
				
		ЗапросВложений = ККСНГ_ДокументооборотВызовСервера.ПолучитьВложенияИзКурьера(МассивИдентификаторов, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросВложений.Журнал, Ложь);
		
		Если ЗапросВложений.Успех Тогда
						
			Ответ.Успех = Истина;
			МассивФайлов = ЗапросВложений.Результат;
					
			Если МассивФайлов.Количество() = 1 Тогда
				ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
				ДиалогВыбораФайла.Заголовок = "Сохранение вложения электронного документа";
				ДиалогВыбораФайла.ПолноеИмяФайла = МассивФайлов[0].Имя;
			Иначе
				ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
				ДиалогВыбораФайла.Заголовок = "Укажите каталог для сохранения файлов вложений электронного документа";	
			КонецЕсли;
						
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьСохранениеВложений", ЭтотОбъект, ДиалогВыбораФайла);
			
			НачатьПолучениеФайлов(ОписаниеОповещения, МассивФайлов, ДиалогВыбораФайла);
									
		КонецЕсли;	

	КонецЕсли;
	
	Если НЕ Ответ.Успех Тогда
		
		ОписаниеОшибки = "Ошибка сохранения вложений электронного документа. " 
								+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал);
								
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСохранениеВложений(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		КоличествоФайлов = Результат.Количество();
		
		Если КоличествоФайлов Тогда
			
			ТекстСообщения = "Сохранено " + КоличествоФайлов + " вложений";
									
			ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииНаВложения", ЭтотОбъект, ДопПараметры.Каталог);
			ПоказатьОповещениеПользователя(ТекстСообщения, ОписаниеОповещения, "Посмотреть в папке", БиблиотекаКартинок.СохранитьФайл);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаВложения(ДополнительныеПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		Если Не РаботаСФайламиСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда
			РаботаСФайламиСлужебныйКлиент.ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(Неопределено);
			Возврат;
		КонецЕсли;
	#КонецЕсли

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Строка") И Не ПустаяСтрока(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиент.ОткрытьПроводник(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область КарточкаИнфоПолей

&НаСервере
Процедура ПрисоединитьКарточкуИнфоПолейКЭлектронномуДокументу(ТабличныйДокументЭД)
	
	МодульМенеджераЭД = Справочники.ККСНГ_ЭлектронныеДокументы;
	КарточкаИнфоПолейДанныеЗаполнения = МодульМенеджераЭД.КарточкаИнфоПолейДанныеЗаполнения(Объект.Ссылка);
	Если КарточкаИнфоПолейДанныеЗаполнения.Успех Тогда
		ДанныеЗаполнения = КарточкаИнфоПолейДанныеЗаполнения.Результат;
		КарточкаИнфоПолейТабличныйДокумент = МодульМенеджераЭД.ТабличныйДокументКарточкиИнфоПолей(ДанныеЗаполнения);
		ТабличныйДокументЭД.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокументЭД.Вывести(КарточкаИнфоПолейТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПараметры

&НаСервере
Процедура НастроитьВидимостьДополнительныхПараметров()
	
	ИспользоватьБизнесПроцессУВХД = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяБизнесПроцессУВХД();
	
	Элементы.ГруппаДополнительныеПараметры.Видимость = ИспользоватьБизнесПроцессУВХД;
	
	Если НЕ ИспользоватьБизнесПроцессУВХД Тогда
		Возврат;
	КонецЕсли;
	
	КодыОтображаемыхДопПараметров = Новый Массив();
	КодыОтображаемыхДопПараметров.Добавить("document.currency");
	КодыОтображаемыхДопПараметров.Добавить("manager.email");
	КодыОтображаемыхДопПараметров.Добавить("uvhd.contract.number");
	
	Для каждого СтрокаДопПараметр Из Объект.Properties Цикл
		СтрокаДопПараметр.Видимость = Не (КодыОтображаемыхДопПараметров.Найти(СтрокаДопПараметр.Key) = Неопределено);
	КонецЦикла;	
	
	Элементы.Properties.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Видимость", Истина));	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
