#Область ПрограммныйИнтерфейс

// Отправляет ЭД в СФЕРА Курьер
//
// Параметры:
//	ДанныеКарточки                  - Структура
//										* Content	            ДвоичныеДанные
//										* Filename	            Строка
//										* MimeType	            Строка
//										* Дата	                Дата
//										* ЗапроситьПодписание	Булево
//										* КодТипаДокумента	    Строка
//										* Комментарий	        Строка
//										* Номер	                Строка
//										* Получатель	        СправочникСсылка.ККСНГ_Контрагенты
//										* Ссылка	            Неопределено
//										* Черновик	            Булево
//	ПрофильЭДООрганизации           - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации            - Структура:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Подпись                         - Строка
//	Send                            - Булево
//
Функция ОтправитьНеструктурированныйДокументВКурьер(ДанныеКарточки, ПрофильЭДООрганизации, ПараметрыАвторизации, Подпись = Неопределено, Send = Ложь, СпособОтправки = Неопределено) Экспорт
	
	ЗапросОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьНеструктурированныйДокументВКурьер(ДанныеКарточки, ПрофильЭДООрганизации, ПараметрыАвторизации, Подпись, Send, СпособОтправки);
	
	Возврат ЗапросОтправки;
	
КонецФункции

// Отправляет произвольного ЭД в СФЕРА Курьер
//
// Параметры:
//	ДанныеКарточки                  - Структура
//										* Content	            ДвоичныеДанные
//										* Filename	            Строка
//										* MimeType	            Строка
//										* Дата	                Дата
//										* ЗапроситьПодписание	Булево
//										* КодТипаДокумента	    Строка
//										* Комментарий	        Строка
//										* Номер	                Строка
//										* Получатель	        СправочникСсылка.ККСНГ_Контрагенты
//										* Ссылка	            Неопределено
//	ПрофильЭДООрганизации           - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации            - Структура:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Подпись                         - Строка
//  СпособОтправки - ПеречислениеСсылка.ККСНГ_ПМ_СпособыОтправки - Способ отправки электронного документа
//
// Возвращаемое значение:
//  Структура:
//      * Результат   - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на отправленный электронный документ. 
//      * Успех       - Булево    - Успешность отправки документа.
//      * КодОшибки   - Строка
//      * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений(). 
//   
Функция ОтправитьПроизвольныйДокументВКурьер(ДанныеКарточки, ПрофильЭДООрганизации, ПараметрыАвторизации, Подпись, СпособОтправки = Неопределено) Экспорт
	
	ЗапросОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьПроизвольныйДокументВКурьер(ДанныеКарточки, ПрофильЭДООрганизации, ПараметрыАвторизации, Подпись, СпособОтправки);
	
	Возврат ЗапросОтправки;
	
КонецФункции

// Отправляет произвольный ЭД в СФЕРА Курьер с обработкой черновика
//
// Параметры:
//  ДанныеКарточки			 - 									 - Структура
//  									* Content	            ДвоичныеДанные
//  									* Filename	            Строка
//  									* MimeType	            Строка
//  									* Дата	                Дата
//  									* ЗапроситьПодписание	Булево
//  									* КодТипаДокумента	    Строка
//  									* Комментарий	        Строка
//  									* Номер	                Строка
//  									* Получатель	        СправочникСсылка.ККСНГ_Контрагенты
//  									* Ссылка	            Неопределено
//  ПрофильЭДООрганизации	 - 									 - СправочникСсылка.ККСНГ_Организации
//  ПараметрыАвторизации	 - 									 - Структура:
//  									* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  									* AuthToken         - Строка - авторизационный токен доступа к API,
//  									* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  									СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  									Подпись                         - Строка
//  СпособОтправки			 - ПеречислениеСсылка.ККСНГ_ПМ_СпособыОтправки	 - Способ отправки электронного документа
// 
// Возвращаемое значение:
//  Структура:
//  * Результат   - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на отправленный электронный документ.
//  * Успех       - Булево    - Успешность отправки документа.
//  * КодОшибки   - Строка
//  * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений().
//
Функция ОтправитьДокументНаКурьерСОбработкойЧерновика(ДанныеКарточки, ПрофильЭДООрганизации, ПараметрыАвторизации, СпособОтправки = Неопределено) Экспорт
	
	ЗапросОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьДокументНаКурьерСОбработкойЧерновика(ДанныеКарточки, ПрофильЭДООрганизации, ПараметрыАвторизации, СпособОтправки);
	
	Возврат ЗапросОтправки;
	
КонецФункции
	
// Получает двоичные данные и названия файлов по идентификаторам документов
//
// Параметры:
//	ПараметрыАвторизации   - Структура:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  ПрофильНастройкиЭДО    - Справочник.ККСНГ_Организации - Профиль организации
//	МассивИдентификаторов  - Массив чисел - идентификаторы документов
//  АдресХранилища         - Строка  - результат Структура: 
//
// ДанныеПоФайлам -  Cоответствие:
//		Ключ     - идентификатор документа
//      Значение - Структура:
//      * Результат        - Структура:
//			** Content	   - ДвоичныеДанные
//			** Filename	   - Строка
//			** MimeType	   - Строка
//		* Успех            - Булево
//		* КодОшибки        - Строка
//		* Журнал           - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений()
//
// ИнформацияВРазрезеКонтрагентов - ТаблицаЗначений
// 		* КодЭДО           - Строка
// 		* ИНН 			   - Строка
// 		* КПП              - Строка
// 		* Наименование     - Строка
// 		* ИДДокумента      - Число
// 		* ТипДокумента     - Строка
// 		* ГодПолучения     - Строка
// 		* КварталПолучения - Строка
// 		* МесяцПолучения   - Строка
//
//	Успех - Булево - Истина 
//
Процедура ПолучитьДанныеПакетовФайловПоДокументам(ПараметрыАвторизации, ПрофильНастройкиЭДО, МассивИдентификаторов, АдресХранилища) Экспорт

	ДанныеПоФайлам = Новый Соответствие;
	ОрганизацияКодЭДО = ПрофильНастройкиЭДО.КодУчастникаЭДО;
	КоличествоВсего = МассивИдентификаторов.Количество();
	Счетчик = 1;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Квитанции.Владелец КАК ЭлектронныйДокумент,
	|	КвитанцииПрисоединенныеФайлы.Filename КАК ИмяФайла,
	|	КвитанцииПрисоединенныеФайлы.Content КАК СодержимоеДокумента,
	|	КвитанцииПодписи.Content КАК ФайлПодписи
	|ПОМЕСТИТЬ втФайлы
	|ИЗ
	|	Справочник.ККСНГ_Квитанции КАК Квитанции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Квитанции.Подписи КАК КвитанцииПодписи
	|		ПО Квитанции.Ссылка = КвитанцииПодписи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ПрисоединенныеФайлы КАК КвитанцииПрисоединенныеФайлы
	|		ПО Квитанции.Ссылка = КвитанцииПрисоединенныеФайлы.Владелец
	|ГДЕ
	|	Квитанции.Владелец В
	|			(ВЫБРАТЬ
	|				ЭлектронныеДокументы.Ссылка КАК Ссылка
	|			ИЗ
	|				Справочник.ККСНГ_ЭлектронныеДокументы КАК ЭлектронныеДокументы
	|			ГДЕ
	|				НЕ ЭлектронныеДокументы.ПометкаУдаления
	|				И ЭлектронныеДокументы.Id В (&СписокДокументов))
	|	И НЕ Квитанции.ПометкаУдаления
	|	И НЕ Квитанции.ExtendedType = ""Document""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭлектронныеДокументы.Ссылка,
	|	ЭлектронныеДокументыПрисоединенныеФайлы.Filename,
	|	ЭлектронныеДокументыПрисоединенныеФайлы.Content,
	|	ЭлектронныеДокументыПодписи.Image
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ЭлектронныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы.DocumentSigns КАК ЭлектронныеДокументыПодписи
	|		ПО ЭлектронныеДокументы.Ссылка = ЭлектронныеДокументыПодписи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ПрисоединенныеФайлы КАК ЭлектронныеДокументыПрисоединенныеФайлы
	|		ПО ЭлектронныеДокументы.Ссылка = ЭлектронныеДокументыПрисоединенныеФайлы.Владелец
	|ГДЕ
	|	НЕ ЭлектронныеДокументы.ПометкаУдаления
	|	И ЭлектронныеДокументы.Id В(&СписокДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭлектронныеДокументы.Id КАК ИдентификаторДокумента,
	|	ВЫБОР
	|		КОГДА ЭлектронныеДокументы.SellerCode = &ОрганизацияКодЭДО
	|			ТОГДА ЭлектронныеДокументы.ReceiverId
	|		ИНАЧЕ ЭлектронныеДокументы.SenderId
	|	КОНЕЦ КАК ИдентификаторКонтрагента,
	|	ЭлектронныеДокументы.IsPrintable КАК ДокументЕстьПечатнаяФорма,
	|	ЭлектронныеДокументы.DocumentTypeCode КАК ДокументТип,
	|	ЭлектронныеДокументы.ReceiveDate КАК ДокументДатаПолучения,
	|	ЭлетронныеДокументыФайлы.ИмяФайла КАК ИмяФайла,
	|	ЭлетронныеДокументыФайлы.СодержимоеДокумента КАК СодержимоеДокумента,
	|	ЭлетронныеДокументыФайлы.ФайлПодписи КАК ФайлПодписи
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ЭлектронныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втФайлы КАК ЭлетронныеДокументыФайлы
	|		ПО ЭлектронныеДокументы.Ссылка = ЭлетронныеДокументыФайлы.ЭлектронныйДокумент
	|ГДЕ
	|	ЭлектронныеДокументы.Id В(&СписокДокументов)
	|	И НЕ ЭлектронныеДокументы.ПометкаУдаления
	|ИТОГИ
	|	МАКСИМУМ(ИдентификаторКонтрагента),
	|	МАКСИМУМ(ДокументЕстьПечатнаяФорма),
	|	МАКСИМУМ(ДокументТип),
	|	МАКСИМУМ(ДокументДатаПолучения)
	|ПО
	|	ИдентификаторДокумента";
	
	Запрос.УстановитьПараметр("СписокДокументов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("ОрганизацияКодЭДО", ОрганизацияКодЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ККСНГ_ОбщегоНазначенияВызовСервера.СообщитьПрогрессЗагрузкиДокументов(КоличествоВсего, Счетчик, АдресХранилища);
		
		Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		Ответ.Успех = Истина;
		
		ИдентификаторДокумента = ВыборкаДокументы.ИдентификаторДокумента;
		
		ФайлыАрхива = Новый Массив();
		
		ВыборкаФайлы = ВыборкаДокументы.Выбрать();
		Пока ВыборкаФайлы.Следующий() Цикл
			ФайлыАрхива.Добавить(ФайлАрхива(ВыборкаФайлы.ИмяФайла, ВыборкаФайлы.СодержимоеДокумента));
			Если ЗначениеЗаполнено(ВыборкаФайлы.ФайлПодписи) Тогда
				ФайлыАрхива.Добавить(ФайлАрхива(ВыборкаФайлы.ИмяФайла + ".sgn", ВыборкаФайлы.ФайлПодписи));
			КонецЕсли;
		КонецЦикла; 
		
		Если ВыборкаДокументы.ДокументЕстьПечатнаяФорма Тогда
			ЗапросПечатнаяФорма = ККСНГ_APIКурьер.v1_DocumentPdf(ПараметрыАвторизации, ИдентификаторДокумента);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПечатнаяФорма.Журнал, Ложь);
			Ответ.Успех = Ответ.Успех И ЗапросПечатнаяФорма.Успех;
			Если ЗапросПечатнаяФорма.Успех Тогда
				ПечатнаяФорма = ЗапросПечатнаяФорма.Результат;
				ФайлыАрхива.Добавить(ФайлАрхива(ПечатнаяФорма.Filename, ПечатнаяФорма.Content));
			КонецЕсли;
		КонецЕсли;
		
		ЗапросПротокол = ККСНГ_APIКурьер.v1_DocumentProtocol(ПараметрыАвторизации, ИдентификаторДокумента);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПротокол.Журнал, Ложь);
		Ответ.Успех = Ответ.Успех И ЗапросПротокол.Успех;
		Если ЗапросПротокол.Успех Тогда
			Протокол = ЗапросПротокол.Результат;
			ФайлыАрхива.Добавить(ФайлАрхива(Протокол.Filename, Протокол.Content));
		КонецЕсли;
		
		ЗапросДанныеКонтрагента = ККСНГ_APIКурьер.v1_DictionaryClient(ПараметрыАвторизации, ВыборкаДокументы.ИдентификаторКонтрагента);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныеКонтрагента.Журнал, Ложь);
		Ответ.Успех = Ответ.Успех И ЗапросДанныеКонтрагента.Успех;
		Если ЗапросДанныеКонтрагента.Успех Тогда
			
			ДанныеКонтрагента = ЗапросДанныеКонтрагента.Результат;
			КонтрагентИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонтрагента, "Inn");
			КонтрагентКПП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонтрагента, "Kpp");
			КонтрагентКодЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонтрагента, "Code");
			
			КонтрагентКаталогИмяШаблон = ?(ЗначениеЗаполнено(КонтрагентКПП), "%1_%2_%3", "%1%2_%3");
			КонтрагентКаталогИмя = СтрШаблон(КонтрагентКаталогИмяШаблон, КонтрагентИНН, КонтрагентКПП, КонтрагентКодЭДО);
			ТипДокументаКаталогИмя = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.СокращенноеПредставлениеТипаДокумента(ВыборкаДокументы.ДокументТип);
			ГодКаталогИмя = Формат(ВыборкаДокументы.ДокументДатаПолучения, "ДФ=гггг");
			МесяцКаталогИмя = Формат(ВыборкаДокументы.ДокументДатаПолучения, "ДФ=ММММ");
			ФайлИмя = Формат(ИдентификаторДокумента, "ЧГ=0") + ".zip";		
			
			НастройкиЭкспорта = НастройкиЭкспорта();
			ГруппировкаЭкспорта = НастройкиЭкспорта.Получить("ГруппировкаЭкспорта");
			КаталогВыгрузки = НастройкиЭкспорта.Получить("КаталогВыгрузкиЭкспорта");
			
			Если ВРЕГ(ГруппировкаЭкспорта) = "ПОКОНТРАГЕНТАМ" Тогда
				ФайлПолноеИмя = КаталогВыгрузки + ПолучитьРазделительПути() 
							+ ОрганизацияКодЭДО + ПолучитьРазделительПути()
							+ ГодКаталогИмя + ПолучитьРазделительПути()
							+ КонтрагентКаталогИмя + ПолучитьРазделительПути()
							+ ТипДокументаКаталогИмя + ПолучитьРазделительПути()
							+ ФайлИмя; 
			Иначе	
				ФайлПолноеИмя = КаталогВыгрузки + ПолучитьРазделительПути()
							+ ГодКаталогИмя + ПолучитьРазделительПути()
							+ МесяцКаталогИмя + ПолучитьРазделительПути()
							+ КонтрагентКаталогИмя + ПолучитьРазделительПути()
							+ ТипДокументаКаталогИмя + ПолучитьРазделительПути()
							+ ФайлИмя; 
			КонецЕсли;
			
			ЗапросАрхив = АрхивироватьФайлы(ФайлыАрхива);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросАрхив.Журнал, Ложь);
			Ответ.Успех = Ответ.Успех И ЗапросАрхив.Успех;
			Если ЗапросАрхив.Успех Тогда
				Ответ.Результат = Новый Структура("ПолноеИмя, Данные", ФайлПолноеИмя, ЗапросАрхив.Результат);
			КонецЕсли;
			
		КонецЕсли;		
		
		ДанныеПоФайлам.Вставить(ИдентификаторДокумента, Ответ);
		
		ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(Счетчик);
		
	КонецЦикла; 
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеПоФайлам", ДанныеПоФайлам);
	Результат.Вставить("Успех", Истина);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		
КонецПроцедуры

// Отправляет массив файлов нескольким получателям 
//
// Параметры:
//  ДанныеКарточки  - Структура:
//     * Content	         - ДвоичныеДанные - данные файлов
//     * Filename	         - Строка         - имя файла
//     * MimeType	         - Строка         - тип файла
//     * Дата	             - Дата
//     * ЗапроситьПодписание - Булево
//     * КодТипаДокумента	 - Строка
//     * Комментарий	     - Строка
//     * Номер	             - Строка
//     * Ссылка	             - Неопределено
//  ПрофильНастройкиЭДО      - Справочник.ККСНГ_Организации - Профиль организации
//	ПараметрыАвторизации     - Структура:
//     * СпособАвторизации   - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken           - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена      - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Подпись                  - Двоичные данные
//  АдресХранилища           - Строка  - адрес результата 
//	Получатели               - Массив ККСНГ_Контрагенты - получатели файлов
//
//  Результат                - Структура: 
//
// РезультатПоПолучателям    -  Cоответствие:
//		Ключ                 - ККСНГ_Контрагенты
//      Значение             - Структура:
//	       * СтатусОтправки  - Число 1/2 (успех/ошибка)
//  	   * ОтправленныйЭД  - ККСНГ_ЭлектронныеДокументы
//     	   * ТекстОшибки     - Строка - текст ошибки
// ОтправленныхУспешно       -  Число
// ОтправленныхСОшибками     -  Число
//
Процедура ОтправитьДанныеПакетовФайловПолучателям(ДанныеКарточки, ПрофильНастройкиЭДО, ПараметрыАвторизации, Подпись, ВариантОтправки, АдресХранилища, Получатели, ДопРеквизитыПоПолучателям) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("РезультатПоПолучателям", Новый Соответствие);
	Результат.Вставить("ОтправленныхУспешно", 0);
	Результат.Вставить("ОтправленныхСОшибками", 0);
	
	КоличествоВсего = Получатели.Количество();
	Счетчик = 0;
	
	Для каждого Получатель Из Получатели Цикл 
		
		ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(Счетчик);
		
		КонтрагентЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Получатель, "КонтрагентЭДО");
		
		ДанныеКарточки.Вставить("Получатель", КонтрагентЭДО);
		ДанныеКарточки.Вставить("ДанныеПодписанта", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Получатель, "ДанныеПодписанта"));
		
		ДополнитьДанныеКарточки(КонтрагентЭДО, ДопРеквизитыПоПолучателям, ДанныеКарточки); 
		
		Если СтрСравнить(ВариантОтправки, "Отправить") = 0 Тогда
			ЗапросОтправки = ККСНГ_ЭлектронныеДокументыВызовСервера.ОтправитьДокументНаКурьерСОбработкойЧерновика(ДанныеКарточки, ПрофильНастройкиЭДО, ПараметрыАвторизации);
		Иначе
			ЗапросОтправки = ККСНГ_ЭлектронныеДокументыВызовСервера.ОтправитьПроизвольныйДокументВКурьер(ДанныеКарточки, ПрофильНастройкиЭДО, ПараметрыАвторизации, Подпись);
		КонецЕсли;
		
		РезультатПоПолучателю = СтруктураРезультатаПоПолучателюПриОтправкеФайла();
		
		Если ЗапросОтправки.Успех Тогда
			РезультатПоПолучателю.СтатусОтправки = 1;
			РезультатПоПолучателю.ОтправленныйЭД = ЗапросОтправки.Результат;
			РезультатПоПолучателю.ИмяСтатуса = ЗапросОтправки.Результат.StatusName;
			ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(Результат.ОтправленныхУспешно);
		Иначе 
			РезультатПоПолучателю.СтатусОтправки = 2;
			ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(Результат.ОтправленныхСОшибками);
			
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросОтправки.Журнал);
			
			Если ТипЗнч(ПоследняяОшибка) = Тип("Структура") Тогда
				
				Если СтрСравнить(ВариантОтправки, "Отправить") = 0 И СтрСравнить(ПоследняяОшибка.КодОшибки, "ER-12107") <> 0 Тогда
					ПоследняяОшибка.Комментарий = "Документ сохранен в черновики.";
					ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				Иначе
					ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				КонецЕсли; 
				
			Иначе 
				ТекстСообщения = "Ошибка отправки документа.";
			КонецЕсли;
			
			РезультатПоПолучателю.ТекстОшибки = ТекстСообщения;
		КонецЕсли;
		
		Результат.РезультатПоПолучателям.Вставить(КонтрагентЭДО, РезультатПоПолучателю);
		
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		ККСНГ_ОбщегоНазначенияВызовСервера.СообщитьПрогрессЗагрузкиДокументов(КоличествоВсего, Счетчик, АдресХранилища);
		
	КонецЦикла;
	
	Если КоличествоВсего = 0 Тогда
	
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Сформировать дерево подчиненности ЭД
//
// Параметры:
//  РеквизитыДокумента	 - Структура с полями:
//								Ссылка - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на ЭД
//								DocumentTypeCode - Строка - Код типа документа
//								StatusName - Строка - Статус документа
//								Type - Строка - Тип транспортного документа
//  ДеревоОбъект		 - ДеревоЗначений	 - объект, в который будет построено дерево подчиненности
//  ЭтоВходящий			 - Булево	 - Истина, если входящий, Ложь если исходящий.
//
Процедура СформироватьДеревоПодчиненностиЭД(РеквизитыДокумента, ДеревоОбъект, ЭтоВходящий) Экспорт
	
	// инициализация дерева
	ИнициализацияДереваПодчиненностиЭД(ДеревоОбъект, РеквизитыДокумента, ЭтоВходящий);
	
	// заполнение данными
	ЗаполнитьДеревоПодчиненностиЭД(ДеревоОбъект, РеквизитыДокумента, ЭтоВходящий);	
	
	// заполнить реквизиты в строках
	ЗаполнитьРеквизитыСтрокДерева(ДеревоОбъект);
	
КонецПроцедуры

#Область ПечатнаяФормаЭД

// Формирует представление электронного документа или квитанции в табличный документ
//
// Параметры:
//  ФайлЭД					 - СправочникСсылка.ККСНГ_ПрисоединенныеФайлы	 - Ссылка на файл электронного документа
//  ПараметрыПредставления	 - Структура, поля:
//	- СвойстваЭлектронногоДокумента - Структура - вспомогательные данные ЭД или квитанции 
//		- НомерИсходногоДокумента - Строка
//		- ДатаИсходногоДокумента - Дата
//		- Владелец - СправочникСсылка.ККСНГ_ЭлектронныеДокументы, СправочникСсылка.ККСНГ_Квитанции
//		- РасширенныйТип - Строка
//		- Подписи - Массив - данные подписей
//	- СкрыватьДопДанные - Булево - признак отражения дополнительных данных
//	- СкрыватьКопияВерна - Булево - признак отражения штапма "Копия верна"
// 
// Возвращаемое значение:
//  ТабличныйДокумент, Неопределено - Печатная форма ЭД или квитанции
//
Функция ПолучитьПредставлениеФайлаЭД(ФайлЭД, ПараметрыПредставления) Экспорт
	
	Перем Ответ, ПечатнаяФормаЭД, ТекстПредупреждения;
	Перем СвойстваДокументаПервогоТитула, СвойстваЭлектронногоДокумента, СсылкаФайлВторогоТитула;
	Перем ИмяФайлаЭД, ИмяФайлаВторогоТитула;
	Перем РезультатПроверки, ОписаниеОшибки;
	Перем ЗапросПечатнойФормы, РезультатФормирования;
	
	ПечатнаяФормаЭД = Неопределено;
	ТекстПредупреждения = "";
	
	Ответ = Новый Структура;
	Ответ.Вставить("ПечатнаяФормаЭД", ПечатнаяФормаЭД);
	Ответ.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	
	// необходимо только для корректной работы с ответными документами
	ИмяФайлаВторогоТитула = Неопределено;
	
	Если ПараметрыПредставления.СвойстваЭлектронногоДокумента.РасширенныйТип = "AcceptDocument" Тогда
		
		СвойстваДокументаПервогоТитула = Новый Структура;
		СвойстваДокументаПервогоТитула.Вставить("НомерДокументаОтправителя", ПараметрыПредставления.СвойстваЭлектронногоДокумента.НомерИсходногоДокумента);
		СвойстваДокументаПервогоТитула.Вставить("ДатаДокументаОтправителя", ПараметрыПредставления.СвойстваЭлектронногоДокумента.ДатаИсходногоДокумента);
		ПараметрыПредставления.Вставить("СвойстваДокументаПервогоТитула", СвойстваДокументаПервогоТитула);
		
	ИначеЕсли ПараметрыПредставления.СвойстваЭлектронногоДокумента.РасширенныйТип = "Document" Тогда
		
		СсылкаФайлВторогоТитула = ФайлВторогоТитула(ПараметрыПредставления.СвойстваЭлектронногоДокумента.Владелец);
		Если СсылкаФайлВторогоТитула <> Неопределено Тогда
			ИмяФайлаВторогоТитула = СохранитьФайлЭД(СсылкаФайлВторогоТитула);
			Если ИмяФайлаВторогоТитула = Неопределено Тогда
				// отсутствует файл ответного титула
				Возврат Ответ;
			Иначе
				ПараметрыПредставления.Вставить("ИмяФайлаПодчиненногоЭД", ИмяФайлаВторогоТитула);
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		ИмяФайлаВторогоТитула = Неопределено;
		
	КонецЕсли;
	
	ИмяФайлаЭД = СохранитьФайлЭД(ФайлЭД);
	Если ИмяФайлаЭД = Неопределено Тогда
		// отсутствуют данные присоединенного файла
		Возврат Ответ;
	КонецЕсли;
	
	Если ПараметрыПредставления.СвойстваЭлектронногоДокумента.КодТипаДокумента = "BILL" Тогда
		
		ЗапросПечатнойФормы = ККСНГ_ПечатьВызовСервера.ПолучитьТабличныйДокументСчета(ПараметрыПредставления.СвойстваЭлектронногоДокумента.Владелец);
		ПечатнаяФормаЭД = ЗапросПечатнойФормы.Результат;
		
	ИначеЕсли ПараметрыПредставления.СвойстваЭлектронногоДокумента.КодТипаДокумента = "UVHD_BILL" Тогда
		
		ЗапросПечатнойФормы = ККСНГ_ПечатьВызовСервера.ПолучитьТабличныйДокументСчетаУВХД(ПараметрыПредставления.СвойстваЭлектронногоДокумента.Владелец);
		ПечатнаяФормаЭД = ЗапросПечатнойФормы.Результат;
		
	Иначе
		
		РезультатПроверки = ПроверитьВозможностьСформироватьПФ(ИмяФайлаЭД, ФайлЭД);
		
		Если РезультатПроверки.Успех Тогда
			
			Если РезультатПроверки.Вариант = 1 Тогда
				
				Попытка
					РезультатФормирования = РезультатПроверки.Модуль.ПредставлениеДанныхДокумента(ФайлЭД.Content.Получить());
					Если РезультатФормирования.Успех Тогда
						ПечатнаяФормаЭД = РезультатФормирования.ПредставлениеДокумента;
					КонецЕсли;
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения печатной формы. " + ОписаниеОшибки);
				КонецПопытки;
				
			ИначеЕсли РезультатПроверки.Вариант = 2 Тогда
				
				Попытка
					ПечатнаяФормаЭД = РезультатПроверки.Модуль.СформироватьПечатнуюФормуЭД(ИмяФайлаЭД, Неопределено, ПараметрыПредставления);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения печатной формы. " + ОписаниеОшибки);
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			ТекстПредупреждения = РезультатПроверки.ТекстСообщения;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПечатнаяФормаЭД <> Неопределено Тогда
		СвойстваЭлектронногоДокумента = ПараметрыПредставления.СвойстваЭлектронногоДокумента;
		ВывестиПредставлениеЭлектроннойПодписи(ПечатнаяФормаЭД, СвойстваЭлектронногоДокумента);
	КонецЕсли; 
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьВременныеФайлы(ИмяФайлаЭД);
	Если ЗначениеЗаполнено(ИмяФайлаВторогоТитула) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьВременныеФайлы(ИмяФайлаВторогоТитула);
	КонецЕсли;
	
	Ответ.ПечатнаяФормаЭД = ПечатнаяФормаЭД;
	Ответ.ТекстПредупреждения = ТекстПредупреждения;
	
	Возврат Ответ;
	
КонецФункции 

#КонецОбласти

// Получает значение дополнительного свойства (параметра) документа
//
// Параметры:
//	ПараметрыАвторизации   - Структура:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  ИдентификаторДокумент  - Число - Идентификатор документа
//	КлючСвойстваДокумента  - Строка - Ключ параметра, которое необходимо получить	
//	ТипЗначенияРезультата  - Тип - Тип значения полученного из Сервиса	
//
// Возвращаемое значение:
//  Структура:
//      * Результат   - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на отправленный электронный документ. 
//      * Успех       - Булево    - Успешность отправки документа.
//      * КодОшибки   - Строка
//      * Журнал      - Структура - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений(). 
//   
Функция ПолучитьДополнительноеСвойствоДокумента(ПараметрыАвторизации, ИдентификаторДокумент, КлючСвойстваДокумента, 
																		Знач ТипЗначенияРезультата = Неопределено) Экспорт
	
	Если ТипЗначенияРезультата = Неопределено Тогда
		ТипЗначенияРезультата = Тип("Строка");		
	КонецЕсли;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(СтрШаблон("Получение значения свойства ""%1"" документа %2", 
																						КлючСвойстваДокумента, ИдентификаторДокумент));
	
	ЗапросСвойствоДокумента = ККСНГ_APIКурьер.v2_DocumentGetPropetryValue(ПараметрыАвторизации, ИдентификаторДокумент, КлючСвойстваДокумента);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСвойствоДокумента.Журнал, Ложь);
	
	Если Не ЗапросСвойствоДокумента.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ТекстXML = ЗапросСвойствоДокумента.Результат;
	Попытка

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		Ответ.Результат = ПрочитатьXML(ЧтениеXML, ТипЗначенияРезультата);
		ЧтениеXML.Закрыть();
		Ответ.Успех = Истина;

	Исключение

		ТекстОшибки = "Не удалось разобрать ответ сервиса по причине: "
						+ Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "DP-00000");

	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Определяет, является ли переданный электронный документ УПД с исправлением.
//
// Параметры:
//   ДокументСсылка - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Электронный документ, 
//                    для которого определяются типы 
//   КодТипаЭД - Строка - Код типа электронного документа
//
// Возвращаемое значение:
//  Ответ - Структура, см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//		В случае успеха в поле Результат Ответа возвращается Булево - 
//					Истина, если переданный ЭД является УПД с исправлением;
//					Ложь в противном случае.
//   
Функция ЭтоИправительныйУПД(ДокументСсылка, КодТипаЭД) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если КодТипаЭД = "UPD_SF" ИЛИ КодТипаЭД = "UPD_SF_DOP" Или КодТипаЭД = "UPD_DOP" Тогда
		
		ФайлСсылка = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, ДокументСсылка);
		Если Не ЗначениеЗаполнено(ФайлСсылка) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось получить вложенный файл документа", "BD-00002");
			Возврат Ответ;
		КонецЕсли;	
		
		ДвоичныеДанные = ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ФайлСсылка);
		
		ЗапросДанных = ККСНГ_ПринятиеКУчетуВызовСервера.ПолучитьДанныеПоСтруктурированномуXML(ДвоичныеДанные, ДокументСсылка.Filename);
		Если Не ЗапросДанных.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанных.Журнал, Ложь);
			Возврат Ответ;
		КонецЕсли;
		
		СтруктурированныйДокумент = ЗапросДанных.Результат;
		
		ЭтоИсправление = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(СтруктурированныйДокумент.НомерИсправления);
	Иначе 
		ЭтоИсправление = Ложь;
	КонецЕсли;
	
	Ответ.Результат = ЭтоИсправление;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
		
КонецФункции

// Возвращает результаты поиска организаций и контрагентов ЭДО,
// в вариантах настроек обмена которых присутствуют форматы с указанными идентификаторами.
//
// Параметры:
//  ИдентификаторыФорматов - Строка - Идентификаторы искомых форматов через запятую, например, "УКД_501, УКД_502".
// 
// Возвращаемое значение:
//  Структура с полями:
//	- НайденыОбъекты - Булево - Истина, если была найдена хоть одна организация или контрагент с указанными форматами.
//  - АдресИскомыхОбъектов - Строка - Если НайденыОбъекты = Истина, то содержит адрес во временном хранилище структуры:
//		- РезультатПоОрганизациям - РезультатЗапроса - найденные организации;
//		- РезультатПоКонтрагентам - РезультатЗапроса - найденные контрагенты.
//
Функция ОрганизацииКонтрагентыСФорматомДокументов(ИдентификаторыФорматов) Экспорт
	
	ВариантыНастроек = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВариантыФорматовЭлектронныхДокументов(ИдентификаторыФорматов);
	
	ТаблицаВариантовНастроек = Новый ТаблицаЗначений;	
	КвалификаторСтроки = Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная);
	ТипСтроки = Новый ОписаниеТипов("Строка", , КвалификаторСтроки); 
	ТаблицаВариантовНастроек.Колонки.Добавить("ИмяВариантаНастройки", ТипСтроки);
	Для Каждого ТекВариант Из ВариантыНастроек Цикл
		НовСтрока = ТаблицаВариантовНастроек.Добавить();
		НовСтрока.ИмяВариантаНастройки = ТекВариант;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТабВариантовНастроек.ИмяВариантаНастройки КАК СТРОКА(255)) КАК ИмяВариантаНастройки
		|ПОМЕСТИТЬ ВТ_ТабВариантовНастроек
		|ИЗ
		|	&ТабВариантовНастроек КАК ТабВариантовНастроек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ККСНГ_Организации.Ссылка КАК Ссылка,
		|	ККСНГ_Организации.Представление КАК Представление,
		|	ККСНГ_Организации.ВариантНастройкиОбмена КАК ВариантНастройкиОбмена
		|ИЗ
		|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабВариантовНастроек КАК ВТ_ТабВариантовНастроек
		|		ПО ККСНГ_Организации.ВариантНастройкиОбмена = ВТ_ТабВариантовНастроек.ИмяВариантаНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ККСНГ_Контрагенты.Ссылка КАК Ссылка,
		|	ККСНГ_Контрагенты.Представление КАК Представление,
		|	ККСНГ_Контрагенты.ВариантНастройкиОбмена КАК ВариантНастройкиОбмена
		|ИЗ
		|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабВариантовНастроек КАК ВТ_ТабВариантовНастроек
		|		ПО ККСНГ_Контрагенты.ВариантНастройкиОбмена = ВТ_ТабВариантовНастроек.ИмяВариантаНастройки";
	
	Запрос.УстановитьПараметр("ТабВариантовНастроек", ТаблицаВариантовНастроек);
	
	МассивРезультатов   = Запрос.ВыполнитьПакет();
	
	РезультатПоОрганизациям  = МассивРезультатов[1];
	РезультатПоКонтрагентам  = МассивРезультатов[2];
	
	НайденыОбъекты = Не РезультатПоОрганизациям.Пустой() Или Не РезультатПоКонтрагентам.Пустой();
	
	Результат = Новый Структура;
	Результат.Вставить("НайденыОбъекты", НайденыОбъекты);

	Если НайденыОбъекты Тогда 
		ИскомыеОбъекты = Новый Структура;
		ИскомыеОбъекты.Вставить("РезультатПоОрганизациям", РезультатПоОрганизациям);
		ИскомыеОбъекты.Вставить("РезультатПоКонтрагентам", РезультатПоКонтрагентам);
		
		АдресИскомыхОбъектов = ПоместитьВоВременноеХранилище(ИскомыеОбъекты, Новый УникальныйИдентификатор);
		Результат.Вставить("АдресИскомыхОбъектов", АдресИскомыхОбъектов);
	Иначе 
		Результат.Вставить("АдресИскомыхОбъектов", "");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает связанный документ учетной системы, связанный с электронным документом
//
// Параметры:
//   ЭлектронныйДокумент - СправоникСсылка.ККСНГ_ЭлектронныеДокументы - Электронный документ, 
//											для которого нужно найти связанный документ 1С
//
// Возвращаемое значение:
//   ДокументСсылка - Связанный документ учетной системы
//   
Функция ПолучитьСвязанныйДокумент1С(ЭлектронныйДокумент) Экспорт

	ЗапросСвязанныйДокумент = РегистрыСведений.ККСНГ_СвязанныеДокументы.НайтиОсновнойСвязанныйДокумент(ЭлектронныйДокумент);
	Если ЗапросСвязанныйДокумент.Успех Тогда
		Возврат ЗапросСвязанныйДокумент.Результат;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Определяет признак структурированного ЭД по коду типа
//
// Параметры:
//	КодТипаЭД - Строка
//
// Возвращаемое значение:
//	Булево
//
Функция ЭтоСтруктурированныйЭД(КодТипаЭД) Экспорт
	
	МассивКодовСтруктурированныхДокументов = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьКодыСтруктурированныхДокументов();
	
	Возврат МассивКодовСтруктурированныхДокументов.Найти(КодТипаЭД) <> Неопределено;
	
КонецФункции

// Определяет признак структурированного ЭД по ссылке
//
// Параметры:
//	ЭДСсылка - ККСНГ_ЭлектронныеДокументы
//
// Возвращаемое значение:
//	Булево
//
Функция ЭтоСтруктурированныйЭДПоСсылке(ЭДСсылка) Экспорт
	
	КодТипаЭД = ЭДСсылка.DocumentTypeCode;
	Возврат ЭтоСтруктурированныйЭД(КодТипаЭД);	
	
КонецФункции

// Отбор документов по фильтру действий
//
// Параметры:
//	ЭлектронныеДокументы  - ККСНГ_ЭлектронныеДокументы
//	ДействияОтбора        - Строка - доступные действия
//
// Возвращаемое значение:
//	Массив ссылок
//
Функция ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, ДействияОтбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументыDocumentActions.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы.DocumentActions КАК ККСНГ_ЭлектронныеДокументыDocumentActions
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументыDocumentActions.Ссылка В(&ЭлектронныеДокументы)
	|	И ККСНГ_ЭлектронныеДокументыDocumentActions.Action В(&Actions)";
	
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	Запрос.УстановитьПараметр("Actions", СтрРазделить(ДействияОтбора, ", ", Ложь));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получает доступность действий по документам
//
// Параметры:
//	ЭлектронныйДокумент  - ККСНГ_ЭлектронныеДокументы
//	ДействияОтбора        - Строка - доступные действия
//
// Возвращаемое значение:
//	Соответствие НазваниеДействия - Булево
//
Функция ДоступностьДействийДокумента(ЭлектронныйДокумент, ДействияОтбора) Экспорт

	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДействий.Действие КАК Действие
	|ПОМЕСТИТЬ ТаблицаДействий
	|ИЗ
	|	&ТаблицаДействий КАК ТаблицаДействий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДействий.Действие КАК Действие,
	|	ВЫБОР
	|		КОГДА ККСНГ_ЭлектронныеДокументыDocumentActions.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Доступно
	|ИЗ
	|	ТаблицаДействий КАК ТаблицаДействий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы.DocumentActions КАК ККСНГ_ЭлектронныеДокументыDocumentActions
	|		ПО ТаблицаДействий.Действие = ККСНГ_ЭлектронныеДокументыDocumentActions.Action
	|			И (ККСНГ_ЭлектронныеДокументыDocumentActions.Ссылка = &ЭлектронныйДокумент)";

	МассивДействий = СтрРазделить(ДействияОтбора, ",", Ложь);

	ТаблицаДействий = Новый ТаблицаЗначений;
	ТаблицаДействий.Колонки.Добавить("Действие", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	Для каждого ТекущееДействие Из МассивДействий Цикл
	    СтрокаДействия = ТаблицаДействий.Добавить();
		СтрокаДействия.Действие = СокрЛП(ТекущееДействие);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаДействий", ТаблицаДействий);
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Действие, Выборка.Доступно);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает возможные значения титулов для покупателя
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Массив
//
Функция МассивТиповТранспортныхДокументовТитулПокупателя() Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить("UpdBuyerInfo");
	МассивТипов.Добавить("UpdInvoiceBuyerInfo");
	МассивТипов.Добавить("Torg12BuyerTitle");
	МассивТипов.Добавить("UpdCorrectionInvoiceBuyerInfo");
	МассивТипов.Добавить("UpdCorrectionBuyerInfo");	
	
	Возврат МассивТипов; 
	
КонецФункции

// Сохраняет содержимое файла ЭД во временный файл
//
// Параметры:
//  ФайлЭД          - СправочникСсылка.ККСНГ_ПрисоединенныеФайлы	 - Ссылка на файл электронного документа
//
// Возвращаемое значение:
// Неопределено или строка - имя временного файла
//
Функция СохранитьФайлЭД(ФайлЭД)	Экспорт
	
	Результат = Неопределено;
	
	ДвоичныеДанныеФайла = ФайлЭД.Content.Получить();
	Если ДвоичныеДанныеФайла <> Неопределено Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
		Результат = ИмяВременногоФайла;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на присоединенный файл для ЭД
//
// Параметры:
//	ЭлектронныйДокумент - Справочник.ККСНГ_ЭлектронныеДокументы 
//
// Возвращаемое значение:
//	Справочник.ККСНГ_ПрисоединенныеФайлы или Неопределено 
//
Функция ФайлВторогоТитула(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ККСНГ_ПрисоединенныеФайлы.Ссылка КАК ФайлЭД
	|ИЗ
	|	Справочник.ККСНГ_ПрисоединенныеФайлы КАК ККСНГ_ПрисоединенныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Квитанции КАК ККСНГ_КвитанцииПодписи
	|		ПО ККСНГ_ПрисоединенныеФайлы.Владелец = ККСНГ_КвитанцииПодписи.Ссылка
	|ГДЕ
	|	ККСНГ_КвитанцииПодписи.Владелец = &ЭлектронныйДокумент
	|	И ККСНГ_КвитанцииПодписи.Type В(&ТитулПокупателя)";
	
	МассивТитулПокупателя = МассивТиповТранспортныхДокументовТитулПокупателя();
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТитулПокупателя", МассивТитулПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФайлЭД;
	Иначе		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НастройкиЭкспорта() Экспорт

	НастройкиЭкспорта = Новый Соответствие();
	НастройкиЭкспорта.Вставить("ТипыДокументовЭкспорта", ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТипыДокументовРасширенногоЭкспорта());
	НастройкиЭкспорта.Вставить("КаталогВыгрузкиЭкспорта", ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.КаталогВыгрузкиРасширенногоЭкспорта());
	НастройкиЭкспорта.Вставить("ГруппировкаЭкспорта", ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ГруппировкаРасширенногоЭкспорта());
	
	Возврат НастройкиЭкспорта;
	
КонецФункции

// TODO своя реализация
// Позволяет получить значения реквизитов сертификата ЭП.
//
// Параметры:
//  Сертификат ЭП - справочник-ссылка - ссылка на элемент справочника "Сертификаты ЭП".
//
// Возвращаемое значение:
//  Структура значений реквизитов.
//
Функция РеквизитыСертификата(СертификатЭП) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСертификата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СертификатЭП,
		"Фамилия, Имя, Отчество, Должность, Организация, ДанныеСертификата");
	ПараметрыСертификата.Вставить("ДвоичныеДанныеСертификата", ПараметрыСертификата.ДанныеСертификата.Получить());
	ПараметрыСертификата.Вставить("ВыбранныйСертификат", СертификатЭП);
	ПараметрыСертификата.Вставить("ПарольПолучен", Ложь);
	ПараметрыСертификата.Вставить("ПарольПользователя", Неопределено);
	
	// В БСП методах необходим параметр
	ПараметрыСертификата.Вставить("Комментарий", "");
	
	Возврат ПараметрыСертификата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыгрузкаПакетовЭД

Функция ПолучитьИмяФайлаБезРасширения(ИмяФайла)

	Составляющие = СтрРазделить(ИмяФайла, ".", Ложь);
	
	Если Составляющие.Количество() = 1 Тогда
		Возврат ИмяФайла;
	Иначе	
		РасширениеФайла = Составляющие[Составляющие.Количество() - 1];
		Возврат СтрЗаменить(ИмяФайла, "." + РасширениеФайла, "");
	КонецЕсли;

КонецФункции

Функция ОбработатьЗапросПоВложениям(ЗапросПоДокументу, ПараметрыАвторизации, Ответ)

	ОшибкиПриПолученииВложений = Ложь;
	Если ЗапросПоДокументу.Успех Тогда
		Для каждого ТекущееВложение Из ЗапросПоДокументу.Результат.Attachments.Attachment Цикл
			ЗапросВложений = ККСНГ_APIКурьер.v1_DocumentAttachment(ПараметрыАвторизации, ТекущееВложение.id);
			Если ЗапросВложений.Успех Тогда
				ДобавитьВПакетДанныхФайлов(ЗапросВложений, Ответ);
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросВложений.Журнал, Ложь);
				ОшибкиПриПолученииВложений = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПоДокументу.Журнал, Ложь);
		ОшибкиПриПолученииВложений = Истина;
	КонецЕсли;	

	Возврат НЕ ОшибкиПриПолученииВложений;	
	
КонецФункции

Функция ОбработатьЗапросПоКвитанциям(ЗапросПоКвитанциям, ТекущийИдентификатор, Ответ)
	
	Если ЗапросПоКвитанциям.Успех Тогда
		Для каждого ТекущаяКвитанция Из ЗапросПоКвитанциям.Результат.TicketDetails Цикл
			Если ТекущаяКвитанция.DocumentId = ТекущийИдентификатор Тогда
				Продолжить;
			Иначе	
				ДобавитьВПакетДанныхФайлов(ТекущаяКвитанция.Content, Ответ);
				ДобавитьПодписиВПакетДанныхФайлов(ТекущаяКвитанция.Signature, ТекущаяКвитанция.Content.Filename, "Content", Ответ, Неопределено);			
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПоКвитанциям.Журнал, Ложь);
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

Функция ДобавитьПодписиВПакетДанныхФайлов(ДанныеПодписей, ИмяФайлаСРасширением, ИмяРеквизитаДвоичныхДанных, Ответ, ДанныеЗапроса)

	Если ТипЗнч(ДанныеЗапроса) = Тип("Структура") И ДанныеЗапроса.Свойство("Успех") И ДанныеЗапроса.Успех = Ложь Тогда
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ДанныеЗапроса.Журнал, Ложь);
		Возврат Ложь;
	КонецЕсли;	
	
	ДополнениеКИмениФайла = "SGN";
	СчетчикПодписей = 0;
	Для каждого ТекущаяПодпись Из ДанныеПодписей Цикл
		
		СчетчикПодписейКакСтрока = ?(СчетчикПодписей = 0, "", Формат(СчетчикПодписей, "Ф=(ЧЦ=10; ЧДЦ=0; ЧГ=)"));
		
		ИмяФайлаПодписи = ПолучитьИмяФайлаБезРасширения(ИмяФайлаСРасширением);
		ИмяФайлаПодписи = ИмяФайлаПодписи + ДополнениеКИмениФайла + СчетчикПодписейКакСтрока + ".sgn";
		ДанныеФайла = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_FileContent");
		ДанныеФайла.Filename = ИмяФайлаПодписи;
		ДанныеФайла.Content = ТекущаяПодпись[ИмяРеквизитаДвоичныхДанных];
		Ответ.Результат.Добавить(ДанныеФайла);
		
		СчетчикПодписей = СчетчикПодписей + 1;
		
	КонецЦикла;	

	Возврат Истина;
	
КонецФункции 

Функция ДобавитьВПакетДанныхФайлов(ДанныеЗапроса, Ответ)

	// Проверка на ошибку "Документ не может быть распечатан."
	Если ДанныеЗапроса.Свойство("Журнал") Тогда
		ПоследняяОшибкаЖурнала = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ДанныеЗапроса.Журнал);
		Если ТипЗнч(ПоследняяОшибкаЖурнала) = Тип("Структура") И НРЕГ(ПоследняяОшибкаЖурнала.КодОшибки) = "er-10402" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДанныеЗапроса.Свойство("Успех") ИЛИ ДанныеЗапроса.Успех Тогда
		ДобавитьВПакет = Истина;
	Иначе
		ДобавитьВПакет = Ложь;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("Результат") Тогда
		ПолученныеДанныеФайла = ДанныеЗапроса.Результат;
	Иначе	
		ПолученныеДанныеФайла = ДанныеЗапроса;
	КонецЕсли;
	
	Если ДобавитьВПакет Тогда
		ДанныеФайла = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_FileContent");
		ЗаполнитьЗначенияСвойств(ДанныеФайла, ПолученныеДанныеФайла);
		Ответ.Результат.Добавить(ДанныеФайла);
		Возврат Истина;
	Иначе	
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ДанныеЗапроса.Журнал, Ложь);
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область ДеревоПодчиненностиДокумента

Процедура ИнициализацияДереваПодчиненностиЭД(ДеревоОбъект, РеквизитыДокумента, ЭтоВходящий)
	
	КорневойЭлемент = ДеревоОбъект.Строки.Добавить();	
	КорневойЭлемент.РасширенныйТип = "Document";
	КорневойЭлемент.Представление = Строка(РеквизитыДокумента.Ссылка);
	КорневойЭлемент.Структурирован = ЭтоСтруктурированныйЭД(РеквизитыДокумента.DocumentTypeCode);	 
	
	// TODO направление
	НаправлениеДокумента = ?(ЭтоВходящий, "In", "Out");	
	КорневойЭлемент.Направление = НаправлениеДокумента;
	
	// TODO статусы
	КорневойЭлемент.Статус = РеквизитыДокумента.StatusName;	
	
	ПараметрыФормированияСтрок = ПараметрыФормированияСтрокДерева(РеквизитыДокумента.DocumentTypeCode);
	ДобавитьСтрокиВДеревоПодчиненностиЭД(КорневойЭлемент, ЭтоВходящий, ПараметрыФормированияСтрок);
		
КонецПроцедуры

Функция ПараметрыФормированияСтрокДерева(КодТипаДокумента)
	
	Параметры = Новый Структура;
	
	Если КодТипаДокумента = "UPD_SF" Или КодТипаДокумента = "UCD_CSF" Тогда
		Параметры.Вставить("ЭтоУПД", Истина);	
		Параметры.Вставить("ЭтоСЧФ", Истина);	
	ИначеЕсли КодТипаДокумента = "UPD_SF_DOP" Или КодТипаДокумента = "UCD_CSF_DIC" Тогда 		
		Параметры.Вставить("ЭтоУПД", Истина);	
		Параметры.Вставить("ЭтоСЧФ", Истина);	
		Параметры.Вставить("ЭтоДОП", Истина);
	ИначеЕсли КодТипаДокумента = "UPD_DOP" Или КодТипаДокумента = "UCD_DIC" Тогда 
		Параметры.Вставить("ЭтоУПД", Истина);	
		Параметры.Вставить("ЭтоДОП", Истина);
	Иначе
		Возврат Параметры;
	КонецЕсли; 
	
	Возврат Параметры;
	
КонецФункции

Процедура ДобавитьСтрокиВДеревоПодчиненностиЭД(КорневойЭлемент, ЭтоВходящий, ПараметрыФомирования)
	
	ЭтоУПД = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФомирования, "ЭтоУПД", Ложь);
	ЭтоСЧФ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФомирования, "ЭтоСЧФ", Ложь);
	ЭтоДОП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФомирования, "ЭтоДОП", Ложь);
	
	Если ЭтоУПД Тогда
		
		Если ЭтоВходящий Тогда
			
			Если ЭтоСЧФ Тогда
				
				СтрокаПДО = КорневойЭлемент.Строки.Добавить();
				СтрокаПДО.РасширенныйТип = "SendConfirmation";
				СтрокаПДО.Представление = "Подтверждение даты отправки";
				СтрокаПДО.Направление = "In";
				СтрокаПДО.Структурирован = Истина;
				
				СтрокаИОППДО = СтрокаПДО.Строки.Добавить();
				СтрокаИОППДО.РасширенныйТип = "ReceiveNotificationOfSendConfirmation";
				СтрокаИОППДО.Представление = "Извещение о получении (ПДО)";
				СтрокаИОППДО.Направление = "Out";
				СтрокаИОППДО.Структурирован = Истина;
				
				СтрокаИОП = КорневойЭлемент.Строки.Добавить();
				СтрокаИОП.РасширенныйТип = "ReceiveNotificationOfDocument";
				СтрокаИОП.Представление = "Извещение о получении документа";
				СтрокаИОП.Направление = "Out";
				СтрокаИОП.Структурирован = Истина;
				
				СтрокаПДОИОП = СтрокаИОП.Строки.Добавить();
				СтрокаПДОИОП.РасширенныйТип = "SendConfirmationOfReceiveNotificationOfDocument";
				СтрокаПДОИОП.Представление = "Подтверждение даты отправки (ИОП УПД)";
				СтрокаПДОИОП.Направление = "In";
				СтрокаПДОИОП.Структурирован = Истина;
				
				СтрокаИОППДОИОП = СтрокаПДОИОП.Строки.Добавить();
				СтрокаИОППДОИОП.РасширенныйТип = "ReceiveNotificationOfSendConfirmationOfReceiveNotificationOfDocument";
				СтрокаИОППДОИОП.Представление = "Извещение о получении (ПОД ИОП УПД)";
				СтрокаИОППДОИОП.Направление = "Out";
				СтрокаИОППДОИОП.Структурирован = Истина;
				
			КонецЕсли; 
			
		Иначе
			
			Если ЭтоСЧФ Тогда
				
				СтрокаПДП = КорневойЭлемент.Строки.Добавить();
				СтрокаПДП.РасширенныйТип = "ReceiveConfirmation";
				СтрокаПДП.Представление = "Подтверждение даты получения";
				СтрокаПДП.Направление = "In";
				СтрокаПДП.Структурирован = Истина;
				
				СтрокаИОППДП = СтрокаПДП.Строки.Добавить();
				СтрокаИОППДП.РасширенныйТип = "ReceiveNotificationOfReceiveConfirmation";
				СтрокаИОППДП.Представление = "Извещение о получении (ПДП)";
				СтрокаИОППДП.Направление = "Out";
				СтрокаИОППДП.Структурирован = Истина;
				
				СтрокаИОП = КорневойЭлемент.Строки.Добавить();
				СтрокаИОП.РасширенныйТип = "ReceiveNotificationOfDocument";
				СтрокаИОП.Представление = "Извещение о получении документа";
				СтрокаИОП.Направление = "In";
				СтрокаИОП.Структурирован = Истина;
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ЭтоДОП Тогда
			
			СтрокаУПДДОППокупателя = КорневойЭлемент.Строки.Добавить();
			СтрокаУПДДОППокупателя.РасширенныйТип = "AcceptDocument";
			СтрокаУПДДОППокупателя.Представление = "Документ покупателя";
			СтрокаУПДДОППокупателя.Направление = ?(ЭтоВходящий, "Out", "In"); 
			СтрокаУПДДОППокупателя.Структурирован = Истина;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоПодчиненностиЭД(ДеревоОбъект, РеквизитыДокумента, ЭтоВходящий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ККСНГ_Квитанции.Ссылка КАК Ссылка,
	|	ККСНГ_Квитанции.ExtendedType КАК РасширенныйТип,
	|	ККСНГ_Квитанции.Id КАК Id,
	|	ККСНГ_Квитанции.NeedReply КАК ТребуетсяОтвет,
	|	ККСНГ_Квитанции.Type КАК ТипТранспортногоДокумента
	|ПОМЕСТИТЬ ВТ_ДокументКвитанции
	|ИЗ
	|	Справочник.ККСНГ_Квитанции КАК ККСНГ_Квитанции
	|ГДЕ
	|	ККСНГ_Квитанции.Владелец = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка,
	|	""Document"",
	|	ККСНГ_ЭлектронныеДокументы.Id,
	|	ЛОЖЬ,
	|	ККСНГ_ЭлектронныеДокументы.Type
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументКвитанции.Ссылка КАК Владелец,
	|	ВТ_ДокументКвитанции.РасширенныйТип КАК РасширенныйТип,
	|	ККСНГ_ПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайлСсылка,
	|	ВТ_ДокументКвитанции.Id КАК id,
	|	ВТ_ДокументКвитанции.ТребуетсяОтвет КАК ТребуетсяОтвет,
	|	ВТ_ДокументКвитанции.ТипТранспортногоДокумента КАК ТипТранспортногоДокумента,
	|	ККСНГ_ПрисоединенныеФайлы.Filename КАК ПрисоединенныйФайлИмя
	|ИЗ
	|	ВТ_ДокументКвитанции КАК ВТ_ДокументКвитанции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ПрисоединенныеФайлы КАК ККСНГ_ПрисоединенныеФайлы
	|		ПО ВТ_ДокументКвитанции.Ссылка = ККСНГ_ПрисоединенныеФайлы.Владелец
	|ГДЕ
	|	ККСНГ_ПрисоединенныеФайлы.Id = 0";
	
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДокумента.Ссылка); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("РасширенныйТип", Выборка.РасширенныйТип);
		МассивСтрокДерева = ДеревоОбъект.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Если МассивСтрокДерева.Количество() = 1 Тогда
			СтрокаДерева = МассивСтрокДерева[0];
			СтрокаДерева.ПрисоединенныйФайлСсылка = Выборка.ПрисоединенныйФайлСсылка;
			СтрокаДерева.ПрисоединенныйФайлИмя = Выборка.ПрисоединенныйФайлИмя;			
			СтрокаДерева.Владелец = Выборка.Владелец;
			СтрокаДерева.ТребуетсяОтвет = Выборка.ТребуетсяОтвет;
			СтрокаДерева.ТипТранспортногоДокумента = Выборка.ТипТранспортногоДокумента;
		КонецЕсли; 		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыСтрокДерева(УзелДерева)
	
	Для каждого ТекущаяСтрока Из УзелДерева.Строки Цикл
		ЗаполнитьРеквизитыСтрокиДерева(ТекущаяСтрока);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыСтрокиДерева(СтрокаДерева)
	
	Если Не ЗначениеЗаполнено(СтрокаДерева.Статус) Тогда
		Если ЗначениеЗаполнено(СтрокаДерева.ПрисоединенныйФайлСсылка) Тогда
			Если СтрокаДерева.Направление = "In" Тогда
				СтрокаДерева.Статус = "Получен";
			ИначеЕсли СтрокаДерева.Направление = "Out" Тогда
				СтрокаДерева.Статус = "Отправлен";
			КонецЕсли; 
		Иначе
			Если СтрокаДерева.Направление = "In" Тогда
				СтрокаДерева.Статус = "Не получен";
			ИначеЕсли СтрокаДерева.Направление = "Out" Тогда
				СтрокаДерева.Статус = "Не сформирован";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 		 
	
	ЗаполнитьРеквизитыСтрокДерева(СтрокаДерева);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатнаяФормаЭД

Процедура ВывестиПредставлениеЭлектроннойПодписи(ПечатнаяФорма, СвойстваЭлектронногоДокумента)
	
	МассивЭП = СвойстваЭлектронногоДокумента.Подписи;
	
	Если МассивЭП.Количество() > 0 Тогда
		
		МакетПодписи = Справочники.ККСНГ_ЭлектронныеДокументы.ПолучитьМакет("МакетЭП");
		ПодписьПродавца = МассивЭП[0];				
		
		Штамп = Новый ТабличныйДокумент;		
		ШтампПродавца = ПолучитьШтамп(ПодписьПродавца, МакетПодписи);		
				
		Если МассивЭП.Количество() > 1 Тогда 
			
			ПодписьПокупателя = МассивЭП[1];
			ШтампПокупателя = ПолучитьШтамп(ПодписьПокупателя, МакетПодписи);			
			
			Разделитель = МакетПодписи.ПолучитьОбласть("ОбластьШтампШапка|ОбластьРазделитель");
			ШиринаШтампа = ШиринаТабличногоДокументаВСимволах(ШтампПродавца);
			ШиринаДокумента = ШиринаТабличногоДокументаВСимволах(ПечатнаяФорма);
			Разделитель.Область().ШиринаКолонки = ШиринаДокумента - 2 * ШиринаШтампа;						
			
			ВысотаШтампаПокупателя = ШтампПокупателя.Область().Низ - ШтампПокупателя.Область().Верх;
			ВысотаШтампаПродавца = ШтампПродавца.Область().Низ - ШтампПродавца.Область().Верх;
			
			РазницаВысоты = ВысотаШтампаПокупателя - ВысотаШтампаПродавца;
			Если РазницаВысоты > 0 Тогда
				Для Инд = 1 По РазницаВысоты Цикл
					ОбластьДопСтрока = МакетПодписи.ПолучитьОбласть("ДопСтрока|ШтампКолонки");
					ШтампПродавца.Вывести(ОбластьДопСтрока);
				КонецЦикла; 
			КонецЕсли; 
			
			Штамп.Вывести(ШтампПродавца);
			Штамп.Присоединить(Разделитель); 
			Штамп.Присоединить(ШтампПокупателя);
			
		Иначе
			Штамп.Вывести(ШтампПродавца);			
		КонецЕсли;
		
		ПечатнаяФорма.Вывести(Штамп);
		
	КонецЕсли;  
	
КонецПроцедуры

Функция ШиринаТабличногоДокументаВСимволах(ТабличныйДокумент)
	
	ШиринаВСимволах = 0;
	Для н = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		
		ШаблонАдресаОбласти = "R%1C%2";
		АдресОбласти = СтрШаблон(ШаблонАдресаОбласти, ТабличныйДокумент.ВысотаТаблицы - 1, н);
		Область = ТабличныйДокумент.Область(АдресОбласти);
		ШиринаВСимволах = ШиринаВСимволах + Область.ШиринаКолонки;
		
	КонецЦикла;
	
	Возврат ШиринаВСимволах;
	
КонецФункции

Функция ПолучитьШтамп(ДанныеПодписи, МакетПодписи)
	
	Штамп = МакетПодписи.ПолучитьОбласть("ОбластьШтампШапка|ШтампКолонки");
	Штамп.Параметры.ДатаПодписи = ДанныеПодписи.ДатаПодписи;
	
	Если ЗначениеЗаполнено(ДанныеПодписи.Отпечаток) Тогда
		ОбластьШтампДанные = МакетПодписи.ПолучитьОбласть("ОбластьШтампДанные|ШтампКолонки");
		ОбластьШтампДанные.Параметры.Отпечаток = ДанныеПодписи.Отпечаток;
		ОбластьШтампДанные.Параметры.КомуВыданСертификат = ДанныеПодписи.КомуВыданСертификат;
		ОбластьШтампДанные.Параметры.СрокДействия = ДанныеПодписи.СрокДействия;		
		Штамп.Вывести(ОбластьШтампДанные);
				
		Если ЗначениеЗаполнено(ДанныеПодписи.ИздательСертификата) Тогда
			ОбластьШтампУЦ = МакетПодписи.ПолучитьОбласть("ОбластьШтампУЦ|ШтампКолонки");
			ОбластьШтампУЦ.Параметры.ИздательСертификата = ДанныеПодписи.ИздательСертификата;								
		Иначе
			ОбластьШтампУЦ = МакетПодписи.ПолучитьОбласть("ОбластьШтампПустаяСтрока|ШтампКолонки");
		КонецЕсли;			
		Штамп.Вывести(ОбластьШтампУЦ);						
	КонецЕсли;	
	
	ОбластьШтампПодвал = МакетПодписи.ПолучитьОбласть("ОбластьШтампПодвал|ШтампКолонки");
	Штамп.Вывести(ОбластьШтампПодвал);
	
	Возврат Штамп;
	
КонецФункции

Процедура ЗаменитьПрефиксПриказаЭД(ИмяФайлаЭД, ЧтоЗаменить, НаЧтоЗаменить)
	                                         
	ОбъектXML   = Новый ЧтениеXML;
	ОбъектXML.ОткрытьФайл(ИмяФайлаЭД);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ОбъектXML);
	ОбъектXML.Закрыть();

	ЭлементФайл  = ДокументDOM.ПолучитьЭлементыПоИмени("Файл");
	
	Если ЭлементФайл.Количество() Тогда
		
		АтрибутыЭлемента = ЭлементФайл[0].Атрибуты;
		
		АтрибутИдФайл = АтрибутыЭлемента.ПолучитьИменованныйЭлемент("ИдФайл");
		
		Если ТипЗнч(АтрибутИдФайл) = Тип("АтрибутDOM") Тогда
			АтрибутИдФайл.ЗначениеУзла = СтрЗаменить(АтрибутИдФайл.ЗначениеУзла, ЧтоЗаменить, НаЧтоЗаменить); 
				
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.ОткрытьФайл(ИмяФайлаЭД);
			ЗаписьDOM = Новый ЗаписьDOM;
			ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
			ЗаписьXML.Закрыть();
			
		КонецЕсли;	
					
	КонецЕсли;
	
	ДокументDOM = Неопределено;
	ПостроительDOM = Неопределено;
	
КонецПроцедуры

Функция ПроверитьВозможностьСформироватьПФ(ИмяФайлаЭД, ФайлЭД)
	
	Перем Ответ;
	Перем МодульФормированияПФ, МинимальнаяВерсияПодсистемы, ДанныеКонфигурации;
	Перем ШаблонСообщения, ТекстСообщения;
	Перем НаименованиеДокумента, ИдФайла, ВерсФормУПД;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Ложь);
	Ответ.Вставить("ТекстСообщения", "");
	Ответ.Вставить("Вариант", 0);
	Ответ.Вставить("Модуль");
	
	МинимальнаяВерсияПодсистемы = "";
	НаименованиеДокумента = "";
	ИдФайла = ФайлЭД.FileName;
	
	// Поиск общего модуля библиотеки электронных документов
	
	МодульФормированияПФ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ФорматыЭДО", Ложь);
	Если МодульФормированияПФ <> Неопределено Тогда
		Ответ.Вариант = 1;
		Ответ.Модуль = МодульФормированияПФ;
	КонецЕсли;
	
	Если МодульФормированияПФ = Неопределено Тогда
		МодульФормированияПФ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ОбменСКонтрагентамиВнутренний", Ложь);
		Если МодульФормированияПФ <> Неопределено Тогда
			Ответ.Вариант = 2;
			Ответ.Модуль = МодульФормированияПФ;
		КонецЕсли;
	КонецЕсли;
	
	Если МодульФормированияПФ = Неопределено Тогда
		Ответ.ТекстСообщения = "Не удалось найти общий модуль конфигурации для формирования печатной формы.";
		Возврат Ответ;
	КонецЕсли;
	
	// Проверка типа документа
	
	Если СтрНачинаетсяС(ИдФайла, "ON_NKORSCHFDOPPR") Тогда
		МинимальнаяВерсияПодсистемы = "1.7.2.82";
		НаименованиеДокумента = "УКД ЕД-7-26/736@";
	КонецЕсли;
	
	Если СтрНачинаетсяС(ИдФайла, "ON_NSCHFDOPPR") Тогда
		
		ВерсФормУПД = ВерсияФорматаУПД(ИмяФайлаЭД);
		Если ЗначениеЗаполнено(ВерсФормУПД) Тогда
			
			Если ККСНГ_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсФормУПД, "5.01") > 0 Тогда
				МинимальнаяВерсияПодсистемы = "1.9.12.33";
				НаименованиеДокумента = "УПД ЕД-7−26/970@";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка соответствия версии подсистемы 
	
	Если ЗначениеЗаполнено(МинимальнаяВерсияПодсистемы) Тогда
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СравнитьВерсииПодсистемы("БиблиотекаЭлектронныхДокументов", МинимальнаяВерсияПодсистемы) < 0 Тогда
			
			ДанныеКонфигурации = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОпределениеКонфигурации();
			ШаблонСообщения = "Не удалось сформировать печатную форму документа: используемая конфигурация %1 (%2) не поддерживает работу с %3 (требуется Библиотека электронных документов версии %4 или выше).";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ДанныеКонфигурации.Синоним, ДанныеКонфигурации.Версия, НаименованиеДокумента, МинимальнаяВерсияПодсистемы);
			Ответ.ТекстСообщения = ТекстСообщения;
			Возврат Ответ;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

Функция ВерсияФорматаУПД(ИмяФайлаЭД)
	
	Перем ВерсФорм;
	Перем ОбъектXML, ПостроительDOM, ДокументDOM, ЭлементФайл, АтрибутыЭлемента, АтрибутВерсФорм;
	
	ОбъектXML = Новый ЧтениеXML;
	ОбъектXML.ОткрытьФайл(ИмяФайлаЭД);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ОбъектXML);
	ОбъектXML.Закрыть();
	
	ЭлементФайл = ДокументDOM.ПолучитьЭлементыПоИмени("Файл");
	Если ЭлементФайл.Количество() Тогда
		
		АтрибутыЭлемента = ЭлементФайл[0].Атрибуты;
		АтрибутВерсФорм = АтрибутыЭлемента.ПолучитьИменованныйЭлемент("ВерсФорм");
		
		Если ТипЗнч(АтрибутВерсФорм) = Тип("АтрибутDOM") Тогда
			ВерсФорм = АтрибутВерсФорм.ЗначениеУзла;
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументDOM = Неопределено;
	ПостроительDOM = Неопределено;
	ОбъектXML = Неопределено;
	
	Возврат ВерсФорм;
	
КонецФункции

#КонецОбласти

Функция ФайлАрхива(ИмяФайла, Знач ДвоичныеДанные)
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("ХранилищеЗначения") Тогда
		ДвоичныеДанные = ДвоичныеДанные.Получить();	
	КонецЕсли;
	
	ФайлАрхива = Новый Структура();
	ФайлАрхива.Вставить("Имя", ИмяФайла);
	ФайлАрхива.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	
	Возврат ФайлАрхива;
	
КонецФункции

Функция АрхивироватьФайлы(МассивФайлов)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Архивирование файлов");
	
	Попытка
		
		ДобавленныеФайлы = Новый Массив();
		
		ИмяАрхивногоФайла =  ПолучитьИмяВременногоФайла("zip");
		МаксДлинаПолногоПути = 259;
		
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхивногоФайла);				
		КаталогВременныхФайлов = ПолучитьИмяВременногоФайла("") + ПолучитьРазделительПути();
		Для каждого ДанныеФайла Из МассивФайлов Цикл
			Если Не ТипЗнч(ДанныеФайла.ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
				Продолжить;	
			КонецЕсли;
			ФайлПолноеИмя = КаталогВременныхФайлов + ДанныеФайла.Имя;
			Если Не ДобавленныеФайлы.Найти(ФайлПолноеИмя) = Неопределено Тогда
				Продолжить;		
			КонецЕсли;
			ДанныеФайла.ДвоичныеДанные.Записать(ФайлПолноеИмя);
			ЗаписьZipФайла.Добавить(ФайлПолноеИмя);
			ДобавленныеФайлы.Добавить(ФайлПолноеИмя);
		КонецЦикла;
		ЗаписьZipФайла.Записать();				
				
		Ответ.Успех = Истина;
		Ответ.Результат = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяАрхивногоФайла));
		
		УдалитьФайлы(КаталогВременныхФайлов);
		УдалитьФайлы(ИмяАрхивногоФайла);
		
	Исключение
		ШаблонОшибки = "Ошибка записи архива ""%1"": %2";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ИмяАрхивногоФайла, ОписаниеОшибки());
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "FR-00002");
	КонецПопытки;	

	Возврат Ответ;
	
КонецФункции

Функция СтруктураРезультатаПоПолучателюПриОтправкеФайла()

	Результат = Новый Структура;
	Результат.Вставить("СтатусОтправки");
	Результат.Вставить("ОтправленныйЭД");
	Результат.Вставить("ИмяСтатуса");
	Результат.Вставить("ТекстОшибки");
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьДанныеКарточки(Получатель, ДопРеквизитыПоПолучателям, ДанныеКарточки)

	ДанныеКарточки.Вставить("ДопАтрибуты", Неопределено);
	ДанныеКарточки.Вставить("ДопПараметры", Неопределено);
	ДанныеКарточки.Вставить("Комментарий", "");
	ДанныеКарточки.Вставить("ЗапросПодписи", Ложь);
	
	ДопРеквизитыПолучателя = ДопРеквизитыПоПолучателям.Получить(Получатель);
	Если ТипЗнч(ДопРеквизитыПолучателя) = Тип("Структура") Тогда
		
		Если ЗначениеЗаполнено(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопРеквизитыПолучателя, "ДопАтрибуты")) Тогда
			ДанныеКарточки.Вставить("ДопАтрибуты", ЗначениеИзСтрокиВнутр(ДопРеквизитыПолучателя.ДопАтрибуты));
		КонецЕсли;
		Если ЗначениеЗаполнено(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопРеквизитыПолучателя, "ДопПараметры")) Тогда
			ДанныеКарточки.Вставить("ДопПараметры", ЗначениеИзСтрокиВнутр(ДопРеквизитыПолучателя.ДопПараметры));
		КонецЕсли;
		Если ЗначениеЗаполнено(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопРеквизитыПолучателя, "Комментарий")) Тогда
			ДанныеКарточки.Вставить("Комментарий", ДопРеквизитыПолучателя.Комментарий);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопРеквизитыПолучателя, "ЗапросПодписи")) Тогда
			ДанныеКарточки.Вставить("ЗапросПодписи", ДопРеквизитыПолучателя.ЗапросПодписи);
		Иначе
			ДанныеКарточки.Вставить("ЗапросПодписи", Ложь);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти