
#Область ПрограммныйИнтерфейс

#Область НастройкиОрганизации

// Есть ли хотя бы 1 профиль с контрагентом по организации
//
// Параметры:
//	ПрофильЭДООрганизации      - Справочник.ККСНГ_Организации
//
// Возвращаемое значение:
//  Булево
//
Функция НаличиеНастроенныхКонтрагентовЭДО(Знач ПрофильЭДООрганизации) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ККСНГ_Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
		|ГДЕ
		|	ККСНГ_Контрагенты.Владелец = &ПрофильЭДООрганизации
		|	И НЕ ККСНГ_Контрагенты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьКонтрагентыЭДО = ВыборкаДетальныеЗаписи.Следующий();
		
	Возврат ЕстьКонтрагентыЭДО;

КонецФункции

// Есть ли хотя бы 1 профиль организации ЭДО
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//  Булево
//
Функция НаличиеНастроенныхОрганизацийЭДО() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ККСНГ_Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
		|ГДЕ
		|	НЕ ККСНГ_Организации.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьОрганизацииЭДО = ВыборкаДетальныеЗаписи.Следующий();
		
	Возврат ЕстьОрганизацииЭДО;

КонецФункции

#КонецОбласти

#Область Авторизация

// Возвращает способ авторизации организации ЭДО
//
// Параметры:
//	ПрофильЭДООрганизации      - Справочник.ККСНГ_Организации
//
// Возвращаемое значение:
//  Перечисление ККСНГ_СпособыАвторизацииКурьер
//
Функция СпособАвторизацииОрганизации(Знач ПрофильЭДООрганизации, Знач Пользователь = Неопределено) Экспорт
	
	СпособАвторизации = Неопределено;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ПрофильЭДООрганизации.МногопользовательскийРежим Тогда
		
		СтрокаПоиска = ПрофильЭДООрганизации.НастройкиДоступа.Найти(Пользователь, "Пользователь1С");
		Если СтрокаПоиска <> Неопределено Тогда
			СпособАвторизации = СтрокаПоиска.СпособАвторизации;
		КонецЕсли;

	Иначе
		СпособАвторизации = ПрофильЭДООрганизации.СпособАвторизации;
	КонецЕсли;
	
	Возврат СпособАвторизации;

КонецФункции

// Получает новый авторизационный токен по предоставленному ключу
// См. ККСНГ_APIКурьерСервер.LogonByApiKey
//
// Параметры:
//  Key - строка, ключ доступа к API
//
// Возвращаемое значение: 
//  Токен - строка, авторизационный токен
//
Функция ПолучитьАвторизационныйТокенПоКлючу(Знач Key) Экспорт
	
	// Запомним время вызова метода
	МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Ответ = ККСНГ_ДокументооборотПовтИсп.ПолучитьАвторизационныйТокенПоКлючу(Key);
	
	Если Не Ответ.Успех Тогда
		
		// Если внутренняя ошибка сервера или ошибка сети, сбросим кеш повторно используемых значений
		// То есть, не надо кешировать эту неудачную попытку авторизации
		Результат = Ответ.Результат;
		Если ТипЗнч(Результат) = Тип("Число") И Результат >= 500 Тогда
			ОбновитьПовторноИспользуемыеЗначения();
		КонецЕсли;
		
	Иначе
		
		// Очистим журнал, если он получен из кеша повторно использованных значений
		Если Ответ.Журнал.Количество() > 0 И  Ответ.Журнал[0].ДатаВМиллисекундах < МеткаВремени Тогда
			 Ответ.Журнал.Очистить();
		КонецЕсли;

	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

// Получает новый авторизационный токен по коду участника ЭДО организации
// См. ККСНГ_APIКурьерСервер.LogonByApiKey
//
// Параметры:
//  КодУчастникаЭДО - строка, код участника ЭДО
//
// Возвращаемое значение: 
//  Токен - строка, авторизационный токен
//
Функция ПолучитьАвторизационныйТокенПоКодуЭДО(Знач КодУчастникаЭДО) Экспорт
	
	ПрофильЭДООрганизации = Справочники.ККСНГ_Организации.НайтиПоРеквизиту("КодУчастникаЭДО", КодУчастникаЭДО);
	Возврат ПолучитьАвторизационныйТокенПоПрофилюЭДООрганизации(ПрофильЭДООрганизации);
	
КонецФункции

// Получает новый авторизационный токен по настройке обмена для организации
// См. ККСНГ_APIКурьерСервер.LogonByApiKey
//
// Параметры:
//  ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации
//
// Возвращаемое значение: 
//  Токен - строка, авторизационный токен
//
Функция ПолучитьАвторизационныйТокенПоПрофилюЭДООрганизации(Знач ПрофильЭДООрганизации, Знач Пользователь = Неопределено) Экспорт
	
	КлючДоступаAPI = "";
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ПрофильЭДООрганизации.МногопользовательскийРежим Тогда
		
		СтрокаПоиска = ПрофильЭДООрганизации.НастройкиДоступа.Найти(Пользователь, "Пользователь1С");
		Если СтрокаПоиска <> Неопределено Тогда
			КлючДоступаAPI = СтрокаПоиска.КлючДоступаAPI;
		КонецЕсли;

	Иначе
		КлючДоступаAPI = ПрофильЭДООрганизации.КлючДоступаAPI;
	КонецЕсли;	
	
	Возврат ПолучитьАвторизационныйТокенПоКлючу(КлючДоступаAPI);

КонецФункции

// Проверяет соответствие ИНН/КПП из организации профиля ЭДО 1С и результата запроса к API Курьер 
// См. ККСНГ_APIКурьер.v2_ClientSelf
//
// Параметры:
//  ПрофильЭДООрганизации  - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
// Возвращаемое значение: 
//  Ответ - Структура, см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(), 
Функция ПроверитьСоответствиеОрганизацииКурьеру(ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	РезультатВызова = ККСНГ_APIКурьер.v2_ClientSelf(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, РезультатВызова.Журнал, Ложь);
	
	Если НЕ РезультатВызова.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Company = РезультатВызова.Результат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ККСНГ_Организации.Организация.ИНН КАК ИНН,
	|	ККСНГ_Организации.Организация.КПП КАК КПП,
	|	ПРЕДСТАВЛЕНИЕ(ККСНГ_Организации.Организация) КАК Организация,
	|	ВЫБОР
	|		КОГДА ККСНГ_Организации.Организация.ИНН = &ИНН
	|				И ККСНГ_Организации.Организация.КПП = &КПП
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверкаУспешна
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|ГДЕ
	|	ККСНГ_Организации.Ссылка = &ПрофильЭДООрганизации";
	
	Запрос.УстановитьПараметр("ИНН", Company.INN);
	Запрос.УстановитьПараметр("КПП", Строка(Company.KPP));
	Запрос.УстановитьПараметр("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	ОрганизацияЮрЛицо = МодульККСНГ_ПМ_РаботаСМетаданными.ЭтоЮрЛицо(ПрофильЭДООрганизации);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ПроверкаУспешна Тогда
			Ответ.Успех = Истина;
		Иначе
			
			ШаблонИНН = "ИНН %1";
			ШаблонИНН_КПП = "ИНН / КПП %1 / %2"; 
			ТекстШаблона = "Выбранная организация - %1 (%2) не соответствует сертификату на устройстве - %3 (%4)." 
			+ Символы.ПС + "Перевыберите организацию или подключите соответствующий токен.";
			
			Если ОрганизацияЮрЛицо Тогда
				ИНН_КПП_Организации	= СтрШаблон(ШаблонИНН_КПП, Выборка.ИНН, Выборка.КПП); 
			Иначе
				ИНН_КПП_Организации	= СтрШаблон(ШаблонИНН, Выборка.ИНН);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Company.KPP) Тогда
				ИНН_КПП_Сертификата	= СтрШаблон(ШаблонИНН, Company.INN);
			Иначе	
				ИНН_КПП_Сертификата	= СтрШаблон(ШаблонИНН_КПП, Company.INN, Company.KPP);
			КонецЕсли;
			
			ТекстОшибки = СтрШаблон(ТекстШаблона, Выборка.Организация, ИНН_КПП_Организации, 
			Company.Name, ИНН_КПП_Сертификата);   
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "GT-00001");	
			
		КонецЕсли;
		
	КонецЕсли;
			
	Возврат Ответ;
	
КонецФункции

Функция ПараметрыАвторизацииОрганизацииПоApiKey(ОрганизацияЭДО, Пользователь) Экспорт 
	
	Перем Ответ, СпособАвторизации, ПараметрыАвторизации;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	СпособАвторизации = СпособАвторизацииОрганизации(ОрганизацияЭДО, Пользователь);
	
	Если СпособАвторизации = Неопределено Тогда
		ТекстОшибки = "Не удалось определить способ авторизации, перейдите к настройкам профиля организации";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "AU-00115", , ОрганизацияЭДО);
		Возврат Ответ;
	КонецЕсли;
	
	Если СпособАвторизации <> Перечисления.ККСНГ_СпособыАвторизацииКурьер.ApiKey Тогда
		Если ОрганизацияЭДО.МногопользовательскийРежим Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "У пользователя установлен способ авторизации не APIKey", "AU-00116", , Пользователь);
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "У организации установлен способ авторизации не APIKey", "AU-00117", , ОрганизацияЭДО);
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;
	
	ЗапросApiKey = ПолучитьАвторизационныйТокенПоПрофилюЭДООрганизации(ОрганизацияЭДО, Пользователь);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросApiKey.Журнал);
	
	Если Не ЗапросApiKey.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ПараметрыАвторизации = Новый Структура;
	ПараметрыАвторизации.Вставить("СпособАвторизации", СпособАвторизации);
	ПараметрыАвторизации.Вставить("AuthToken", ЗапросApiKey.Результат);
	
	Ответ.Результат = ПараметрыАвторизации;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ДанныеСертификатовКурьера

// Возвращает сертификат
//
// Параметры:
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//  Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования если есть в ИБ
//  либо структура Certificate, см. https://confluence.esphere.ru/display/SBER/Certificate
//
Функция ПолучитьСертификатКлючаЭП(ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросАктивногоСертификата = ПолучитьДанныеАктивногоСертификата(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросАктивногоСертификата.Журнал, Ложь);
	
	Если ЗапросАктивногоСертификата.Успех Тогда
		
		ДанныеАктивногоСертификата = ЗапросАктивногоСертификата.Результат;
		ТипhexBinary    = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary"); 	
		ДвоичныеДанныеОтпечатка = ФабрикаXDTO.Создать(ТипhexBinary, СтрЗаменить(ДанныеАктивногоСертификата.Thumbprint, " ", ""));
		ОтпечатокСертификата = Base64Строка(ДвоичныеДанныеОтпечатка.Значение);
		ИскомыйСертификатКлючаЭП = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСертификатКлючаЭППоОтпечатку(ОтпечатокСертификата);
		Если ИскомыйСертификатКлючаЭП <> Неопределено Тогда
			Ответ.Результат = ИскомыйСертификатКлючаЭП;
			Ответ.Успех = Истина;
		Иначе 
			
			Ответ.Результат = ДанныеАктивногоСертификата;
			// Добавляем ошибку со своим кодом, по которому сможем найти ошибку в журнале.
			ОписаниеОшибки = "Отсутствует сертификат, соответствующий пользователю сервиса.";
			ОбрабатываемыеОшибки = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ОшибкиСертификатаКлючаЭП();
			КодОшибки = ОбрабатываемыеОшибки["НеНайденСертификатЭП"];
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, КодОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает данные активного зарегистрированного сертификата авторизованного пользователя.
// См. ККСНГ_APIКурьер.v1_DictionaryUserCertificate
//
// Параметры:
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение: 
//	структура Certificate, см. https://confluence.esphere.ru/display/SBER/Certificate
//
Функция ПолучитьДанныеАктивногоСертификата(ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	// Получим информацию об активном зарегистрированном сертификате пользователя.
	ЗапросАктивногоСертификата = ККСНГ_APIКурьер.v1_DictionaryUserCertificate(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросАктивногоСертификата.Журнал, Ложь);
	Ответ.Успех = ЗапросАктивногоСертификата.Успех;
	ОбрабатываемыеОшибки = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ОшибкиСертификатаКлючаЭП();
	
	Если ЗапросАктивногоСертификата.Успех Тогда
		
		ДанныеАктивногоСертификата = ЗапросАктивногоСертификата.Результат;
		Если КонецДня(ДанныеАктивногоСертификата.NotAfter) < ТекущаяДатаСеанса() Тогда
			ОписаниеОшибки = "Активный сертификат пользователя просрочен.";
			КодОшибки = ОбрабатываемыеОшибки["АктивныйСертификатПросрочен"];
		ИначеЕсли НачалоДня(ДанныеАктивногоСертификата.NotBefore) > ТекущаяДатаСеанса() Тогда
		    ОписаниеОшибки = "Срок действия активного сертификата пользователя ещё не наступил.";
			КодОшибки = ОбрабатываемыеОшибки["АктивныйСертификатПокаНеДействует"];
		Иначе 
			ОписаниеОшибки = "";
			КодОшибки = "";
		КонецЕсли;
		Если Не ПустаяСтрока(КодОшибки) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, КодОшибки);
			Ответ.Успех = Ложь;
		КонецЕсли;
		
		Ответ.Результат = ДанныеАктивногоСертификата;
		
	Иначе
		// Добавляем ошибку со своим кодом, по которому сможем найти ошибку в журнале.
		Если (ЗапросАктивногоСертификата.Результат = 400) Тогда
			ОписаниеОшибки = "У пользователя нет активных сертификатов.";
			КодОшибки = ОбрабатываемыеОшибки["НетАктивногоСертификата"];
		Иначе
			ОписаниеОшибки = "Не удалось получить информацию о сертификате пользователя. " + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал);
			КодОшибки = ОбрабатываемыеОшибки["ОшибкаЗапросаАктивногоСертификата"];
		КонецЕсли;
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, КодОшибки);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// ДанныеСертификатовКурьера
#КонецОбласти

#Область Роуминг

// Возвращает код участника ЭДО
//
// Параметры:
//	Контрагент             - СправочникСсылка.Контрагенты / СправочникСсылка.ККСНГ_Контрагенты
//	КодТипаДокумента       - Строка
//	ПрофильЭДООрганизации  - Справочник.ККСНГ_Организации - профиль ЭДО
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Строка
//
Функция ПолучитьКодЭДОПолучателя(Контрагент, КодТипаДокумента, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт

	Возврат ККСНГ_ДокументооборотПовтИсп.ПолучитьКодЭДОПолучателя(Контрагент, КодТипаДокумента, 
																	ПрофильЭДООрганизации, ПараметрыАвторизации);

КонецФункции	

// Получение информации о статусе отправки документа и связанных с ним квитанций/подписей роуминговому получателю
//
// Параметры:
//	ЭлектронныйДокументСсылка - Ссылка СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	ПрофильЭДООрганизации     - Справочник.ККСНГ_Организации - профиль ЭДО
//	ПараметрыАвторизации      - Структура - содержит:
//     * СпособАвторизации    - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken            - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена       - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура см. https://confluence.esphere.ru/display/SBER/Document.RoamingInfo
//
Функция ПолучитьСтатусыВРоуминге(ЭлектронныйДокументСсылка, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	Результат = ККСНГ_APIКурьер.v2_DocumentRoamingInfo(ПараметрыАвторизации, ЭлектронныйДокументСсылка.Id);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, Результат.Журнал, Ложь);

	Если Результат.Успех Тогда
		ПолученныеСтатусы = Результат.Результат.DocumentRoamingInfo;
		Для каждого ТекСтатус Из ПолученныеСтатусы Цикл
			ТекСтатус.Вставить("ПредставлениеДокумента");
			ТекСтатус.ПредставлениеДокумента = ПредставлениеТипаТранспортногоДокумента(ТекСтатус.DocumentType);
			ТекСтатус.Вставить("ПредставлениеСтатуса");
			ТекСтатус.ПредставлениеСтатуса = ПредставлениеСтатусаВРоуминге(ТекСтатус.RoamingStatus);
		КонецЦикла; 
		Ответ.Результат = ПолученныеСтатусы;
		Ответ.Успех = Истина;
		// Обновляем документ из Курьера.
		ЭлектронныеДокументы = Новый Массив;
		ЭлектронныеДокументы.Добавить(ЭлектронныйДокументСсылка);
		ККСНГ_ДокументооборотВызовСервера.ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы, 
																				ПрофильЭДООрганизации, 
																					ПараметрыАвторизации);
	Иначе 
		ОписаниеОшибки = "Не удалось получить актуальные статусы в роуминге: "
				+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Результат.Журнал);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, "RI-00001");
	КонецЕсли;

	Возврат Ответ;

КонецФункции

// Возвращает представление документа
//
// Параметры:
//	ТипТранспортногоДокумента - Строка - Тип документа
//
// Возвращаемое значение:
//	Строка - представление типа документа
//
Функция ПредставлениеТипаТранспортногоДокумента(ТипТранспортногоДокумента) Экспорт
	
	ПредставленияТиповДокументов = Новый Соответствие;
	ПредставленияТиповДокументов.Вставить("ReceiveNotice", 						 "Извещение о получении электронного документа");
	ПредставленияТиповДокументов.Вставить("SendConfirmation", 					 "Подтверждение даты отправки");
	ПредставленияТиповДокументов.Вставить("ReceiveConfirmation", 				 "Подтверждение даты получения");
	ПредставленияТиповДокументов.Вставить("ClarificationNotice",				 "Уведомление об уточнении");
	ПредставленияТиповДокументов.Вставить("Invoice", 							 "Счёт-фактура (основной)");
	ПредставленияТиповДокументов.Вставить("CorrectionInvoice", 	 				 "Корректировочный счёт-фактура");
	ПредставленияТиповДокументов.Вставить("Torg12SellerTitle", 	 				 "Товарно-транспортная накладная (ТОРГ-12) - Титул продавца");
	ПредставленияТиповДокументов.Вставить("Torg12BuyerTitle", 	 				 "Товарно-транспортная накладная (ТОРГ-12) - Титул покупателя");
	ПредставленияТиповДокументов.Вставить("AcceptanceCertificatePerformerTitle", "Акт о выполненных работах (услугах) - титул исполнителя");
	ПредставленияТиповДокументов.Вставить("AcceptanceCertificateCustomerTitle",  "Акт о выполненных работах (услугах) - титул заказчика");
	ПредставленияТиповДокументов.Вставить("Document", 							 "Прочий тип документа");
	ПредставленияТиповДокументов.Вставить("RejectSignature", 					 "Отказ от подписи");
	ПредставленияТиповДокументов.Вставить("AvoidanceRequest", 					 "Предложение об аннулировании электронного документа");
	ПредставленияТиповДокументов.Вставить("AcceptSignature", 					 "Уведомление о принятии (УОП)");
	ПредставленияТиповДокументов.Вставить("ReceiveNoticeRoaming", 				 "Извещение о получении (роуминг)");
	ПредставленияТиповДокументов.Вставить("ClarificationNoticeRoaming", 		 "Уведомление об уточнении (роуминг)");
	ПредставленияТиповДокументов.Вставить("UpdInvoice", 					 	 "УПД.СЧФ");
	ПредставленияТиповДокументов.Вставить("UpdInvoiceSellerInfo", 				 "УПД.СЧФДОП, информация продавца");
	ПредставленияТиповДокументов.Вставить("UpdInvoiceBuyerInfo", 				 "УПД.СЧФДОП, информация покупателя");
	ПредставленияТиповДокументов.Вставить("UpdSellerInfo", 					 	 "УПД.ДОП, информация продавца");
	ПредставленияТиповДокументов.Вставить("UpdBuyerInfo", 					 	 "УПД.ДОП, информация покупателя");
	ПредставленияТиповДокументов.Вставить("UpdCorrectionInvoice", 				 "УКД.КСЧФ");
	ПредставленияТиповДокументов.Вставить("UpdCorrectionInvoiceSellerInfo", 	 "УКД.КСЧФДИС, информация продавца");
	ПредставленияТиповДокументов.Вставить("UpdCorrectionInvoiceBuyerInfo", 		 "УКД.КСЧФДИС, информация покупателя");
	ПредставленияТиповДокументов.Вставить("UpdCorrectionSellerInfo", 			 "УКД.ДИС, информация продавца");
	ПредставленияТиповДокументов.Вставить("UpdCorrectionBuyerInfo", 			 "УКД.ДИС, информация покупателя");
	ПредставленияТиповДокументов.Вставить("DocumentOfTransferOfWorkResultsPerformerInfo", "Документ о передаче результатов работ. Информация исполнителя");
	ПредставленияТиповДокументов.Вставить("DocumentOfTransferOfWorkResultsCustomerInfo", "Документ о передаче результатов работ. Информация заказчика");
	ПредставленияТиповДокументов.Вставить("DocumentOfTransferOfGoodsSellerInfo", "Документ о передаче товаров при торговых операциях. Информация продавца");
	ПредставленияТиповДокументов.Вставить("DocumentOfTransferOfGoodsBuyerInfo", "Документ о передаче товаров при торговых операциях. Информация покупателя");
	ПредставленияТиповДокументов.Вставить("AcceptanceDiscrepancyDocumentSpecifying", "Дополнительные сведения к документу о приемке и (или) расхождениях");
		
	ПредставлениеТипаДокумента = ПредставленияТиповДокументов[СокрЛП(ТипТранспортногоДокумента)];
	Если Не ЗначениеЗаполнено(ПредставлениеТипаДокумента) Тогда
		ПредставлениеТипаДокумента = "<тип документа не определён>";
	КонецЕсли;
	
	Возврат ПредставлениеТипаДокумента;
			
КонецФункции

// Возвращает представление статуса
//
// Параметры:
//	СтатусВРоуминге - Строка - статус
//
// Возвращаемое значение:
//	Строка - представление статуса
//
Функция ПредставлениеСтатусаВРоуминге(СтатусВРоуминге) Экспорт
	
	ПредставленияСтатусов = Новый Соответствие;
	ПредставленияСтатусов.Вставить("None", 					 "<статус отсутствует>");
	ПредставленияСтатусов.Вставить("SendingInProgress",		 "В процессе отправки");
	ПредставленияСтатусов.Вставить("ErrorOfSending", 		 "Ошибка отправки");
	ПредставленияСтатусов.Вставить("InProcessingByReceiver", "Обрабатывается оператором получателя");
	ПредставленияСтатусов.Вставить("ErrorOfReceiver",		 "Ошибка обработки получателем");
	ПредставленияСтатусов.Вставить("UnknownParentDocument",  "Неизвестный родительский документ");
	ПредставленияСтатусов.Вставить("Delivered", 			 "Доставлен");
	
	ПредставлениеСтатуса = ПредставленияСтатусов[СокрЛП(СтатусВРоуминге)];
	Если Не ЗначениеЗаполнено(ПредставлениеСтатуса) Тогда
		ПредставлениеСтатуса = "<статус не определён>";
	КонецЕсли;
	
	Возврат ПредставлениеСтатуса;
			
КонецФункции

// Возвращает соответствие статусов с кодами
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция КодыСтатусовВРоуминге() Экспорт
	
	СтатусыВРоуминге = Новый Структура;
	СтатусыВРоуминге.Вставить("None", 0);
	СтатусыВРоуминге.Вставить("SendingInProgress", 1);
	СтатусыВРоуминге.Вставить("ErrorOfSending", 2);
	СтатусыВРоуминге.Вставить("InProcessingByReceiver", 3);
	СтатусыВРоуминге.Вставить("ErrorOfReceiver", 4);
	СтатусыВРоуминге.Вставить("UnknownParentDocument", 5);
	СтатусыВРоуминге.Вставить("Delivered", 6);
		
	Возврат СтатусыВРоуминге;
	
КонецФункции

#КонецОбласти

#Область ДанныеМаркировки

// Получает статус ЦРПТ ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	Id - Id документа в СФЕРА Курьер
//	ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации
//
// Возвращаемое значение:
//	Число - статус обработки документа из ЦРПТ
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция СтатусЦРПТДокумента(Id, ПараметрыАвторизации) Экспорт
	
	Перем Ответ;
	Перем ЗапросAPI, ДанныеВнешнихСервисов, ДанныеОтЦРПТ;
	Перем Чтение, ServiceCode, ДанныеЦРПТ, СтатусИзЦРПТ, ТекДанные, ТекстОшибки;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Вставить("ДанныеПоОшибкеОтЦРПТ", Неопределено);
	
	// Получаем статус ЦРПТ документа.
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение статуса ЦРПТ документа");
	ЗапросAPI = ККСНГ_APIКурьер.v2_DocumentExternalServices(ПараметрыАвторизации, Id);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если Не ЗапросAPI.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ДанныеОтЦРПТ = Неопределено;
	
	ДанныеВнешнихСервисов = ЗапросAPI.Результат.ExternalServiceData;
	Для Каждого ТекДанные Из ДанныеВнешнихСервисов Цикл
		ServiceCode = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекДанные, "ServiceCode");
		Если СтрСравнить(ServiceCode, "CZ") <> 0 И СтрСравнить(ServiceCode, "CZ.FIX") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		ДанныеОтЦРПТ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекДанные, "Data");
		Если СтрСравнить(ServiceCode, "CZ") = 0 Тогда
			Прервать; // CZ - завершающий
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ДанныеОтЦРПТ) Тогда
		
		Попытка
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(ДанныеОтЦРПТ);
			ДанныеЦРПТ = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ТекстОшибки = "Ошибка чтения данных ЦРПТ.";
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "MK-00005", ОписаниеОшибки);
		КонецПопытки;
		
		Если ТипЗнч(ДанныеЦРПТ) = Тип("Структура") Тогда
			
			СтатусИзЦРПТ = Неопределено;
			Если ДанныеЦРПТ.Свойство("status", СтатусИзЦРПТ) Тогда
				Ответ.Результат = СтатусИзЦРПТ;
				Ответ.ДанныеПоОшибкеОтЦРПТ = ККСНГ_ОтправкаЭДВызовСервера.ДанныеПоОшибкеПоМаркируемойПродукцииИзЦРПТ(ДанныеЦРПТ);
				Ответ.Успех = Истина;
			Иначе
				ТекстОшибки = "В данных ЦРПТ нет статуса обработки документа.";
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "MK-00006");
			КонецЕсли;
			
		Иначе
			ТекстОшибки = "Ошибка чтения данных ЦРПТ.";
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "MK-00007");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// ДанныеМаркировки
#КонецОбласти

#Область Подписка

// Получает идентификатор новой или существующей подписки по предоставленному токену
// См. ККСНГ_APIКурьер.v2_SubscriptionGetSubscriptions
// См. ККСНГ_APIКурьер.v2_SubscriptionAdd
//
// Параметры:
//  ИдентификаторПодписки - строка, идентификатор подписки, хранимый на данный момент в базе.
//  AuthToken - строка, авторизационный токен
//
// Возвращаемое значение: 
//	Структура Ответ, см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(),
//	в случае успешного выполнения содержащая подтвержденнный переданный идентифкатор или новый.
//
Функция ПолучитьИдентификаторПодписки(ИдентификаторПодписки, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	Если ККСНГ_ОбщегоНазначенияВызовСервера.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, 
				"Установлена блокировка работы с внешними ресурсами", "SB-00013");
		
		Возврат Ответ;
		
	КонецЕсли;
	
	// Получим список действующих подписок
	ЗапросСпискаПодписок = ККСНГ_APIКурьер.v2_SubscriptionGetSubscriptions(ПараметрыАвторизации);
	Если Не ЗапросСпискаПодписок.Успех Тогда
		
		// Не удалось получить список действующих подписок
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСпискаПодписок.Журнал, Ложь);
		ОписаниеОшибки = "Не удалось получить список подписок: " + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал);
		// Добавляем ошибку со своим кодом, по которому сможем найти ошибку подписки в журнале.
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, "SC-00001");
		
		Ответ.Результат = ЗапросСпискаПодписок.Результат;
		Возврат Ответ;
		
	КонецЕсли;
	
	СписокДействующихПодписок = ЗапросСпискаПодписок.Результат.Subscription;
	
	// Проверим, что указанная подписка ещё действует
	Если Не ПустаяСтрока(ИдентификаторПодписки) Тогда
		Для Каждого Подписка Из СписокДействующихПодписок Цикл
			Если ИдентификаторПодписки = Подписка.token Тогда
				
				// Вернем указанную подписку как действующую
				Ответ.Успех = Истина;
				Ответ.Результат = ИдентификаторПодписки;
				Возврат Ответ;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Пробуем создать новую подписку, сейчас лимит подписок в Курьере = 5
	ЗапросНовойПодписки = ККСНГ_APIКурьер.v2_SubscriptionAdd(ПараметрыАвторизации, Ложь);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросНовойПодписки.Журнал, Ложь);
	
	Если ЗапросНовойПодписки.Успех Тогда
		
		Ответ.Успех = Истина;
		Ответ.Результат = ЗапросНовойПодписки.Результат.token;
		Возврат Ответ;
		
	Иначе
		
		Ответ.Результат = ЗапросНовойПодписки.Результат;
		
		ОписаниеОшибки = "Не удалось создать подписку: " + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, "SC-00001");
		
	КонецЕсли;
			
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ЭлектронныеДокументы

#Область НеструктурированныеЭлектронныеДокументы

// Получает список возможных типов для неструктурированных документов
//
// Параметры:
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
// Возвращаемое значение:
//	СписокЗначений
//
Функция СписокДоступныхНеструктурированныхТиповДокументов(ПараметрыАвторизации) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	СписокДоступныхТипов = Новый СписокЗначений;

	СтруктурированныеТипы = Новый Массив;
	СтруктурированныеТипы.Добавить("ACTFNS");
	СтруктурированныеТипы.Добавить("INFSOOB");
	СтруктурированныеТипы.Добавить("CSF");
	СтруктурированныеТипы.Добавить("BILL");
	СтруктурированныеТипы.Добавить("SF");
	СтруктурированныеТипы.Добавить("WAYBILL");
	СтруктурированныеТипы.Добавить("UO_DPINFSOOB");
	СтруктурированныеТипы.Добавить("UPD_DOP");
	СтруктурированныеТипы.Добавить("UPD_SF");
	СтруктурированныеТипы.Добавить("UPD_SF_DOP");
	СтруктурированныеТипы.Добавить("UCD_CSF");
	СтруктурированныеТипы.Добавить("UCD_CSF_DIC");
	СтруктурированныеТипы.Добавить("UCD_DIC");
	СтруктурированныеТипы.Добавить("TOVTORG");
	СтруктурированныеТипы.Добавить("REZRU");
	СтруктурированныеТипы.Добавить("WAYBILL_TORG12");

	ЗапросТипов = ККСНГ_APIКурьер.v2_TypeDocument(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросТипов.Журнал, Ложь);

	Если ЗапросТипов.Успех Тогда
		МассивТипов = ЗапросТипов.Результат.DocumentType;

		Если ТипЗнч(МассивТипов) = Тип("Массив") Тогда
			Для Каждого ТипИзКурьера Из МассивТипов Цикл
				Если СтруктурированныеТипы.Найти(ТипИзКурьера.DocumentTypeCode) = Неопределено Тогда // Неструктурированный
					СписокДоступныхТипов.Добавить(ТипИзКурьера.DocumentTypeCode, ТипИзКурьера.Name);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если СписокДоступныхТипов.Количество() > 0 Тогда
			Ответ.Успех = Истина;
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Невозможно получить список документов для отправки.", "DC-00001");
		КонецЕсли;

	КонецЕсли;

	Ответ.Результат = СписокДоступныхТипов;

	Возврат Ответ;

КонецФункции

// НеструктурированныеЭлектронныеДокументы
#КонецОбласти 

// Получает данные ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	Id - Id документа в СФЕРА Курьер
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура Document, см. https://confluence.esphere.ru/display/SBER/Document
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьЭлектронныйДокументСВложениемИзКурьера(Id, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных документа");
	
	ЗапросAPI = ККСНГ_APIКурьер.v1_DocumentDetails(ПараметрыАвторизации, Id);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		
		СтруктураДокумента = ЗапросAPI.Результат;
		
		// Получаем данные подписи ЭД
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных электронной подписи");
		ЗапросДанныеПодписи = ККСНГ_APIКурьер.v1_DocumentGetSignatures(ПараметрыАвторизации, СтруктураДокумента.id);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныеПодписи.Журнал, Ложь);
		
		Если ЗапросДанныеПодписи.Успех Тогда
						
			Отказ = Ложь;
			
			СписокПодписейЭД = ЗапросДанныеПодписи.Результат.DocumentSign;
			Для каждого СтруктураПодписиЭД Из СписокПодписейЭД Цикл
				
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных сертификата");
				
				ЗапросДанныеСертификата = ККСНГ_APIКурьер.v1_DocumentGetSignatureDetails(
														ПараметрыАвторизации, СтруктураПодписиЭД.Id);
														
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныеСертификата.Журнал, Ложь);
				
				Если ЗапросДанныеСертификата.Успех Тогда
					ДанныеСертификата = ЗапросДанныеСертификата.Результат;											
					СтруктураПодписиЭД.Вставить("SignatureDetails", ДанныеСертификата);
				Иначе
					Отказ = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не Отказ Тогда
				
				СтруктураДокумента.Вставить("DocumentSigns", СписокПодписейЭД);
				Ответ.Результат = ЗапросAPI.Результат;
				Ответ.Успех = Истина;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
			
	Возврат Ответ;
	
КонецФункции

// Обновляет уже записанный ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	ЭлектроныйДокументСсылка - СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	ПрофильЭДООрганизации    - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации     - Структура - содержит:
//		* СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken          - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на обновленный элемент справочника
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ОбновитьЭлектронныйДокументПоДаннымИзКурьера(ЭлектронныйДокументСсылка, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Если (ТипЗнч(ЭлектронныйДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") И ЗначениеЗаполнено(ЭлектронныйДокументСсылка)) Тогда
		Возврат ЗаписатьЭлектронныйДокументПоДаннымИзКурьера(ЭлектронныйДокументСсылка.Id, ПрофильЭДООрганизации, ПараметрыАвторизации);
	КонецЕсли;
	
	Возврат ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
КонецФункции

// Обновляет уже записанные ЭД с сервера СФЕРА Курьер включая квитанции
//
// Параметры:
//	ЭлектронныеДокументы    - Массив СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	ПрофильЭДООрганизации   - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	массив обновленных элементов СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//                                                                          	
Функция ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обновление данных электронных документов");
	Ответ.Результат = Новый Массив;
	
	Если ТипЗнч(ЭлектронныеДокументы) = Тип("Массив") Тогда
		
		Для каждого ЭлектронныйДокументСсылка Из ЭлектронныеДокументы Цикл
			
			Если ЗначениеЗаполнено(ПрофильЭДООрганизации) Тогда
				
				ЗапросДокумента = ОбновитьЭлектронныйДокументПоДаннымИзКурьера(ЭлектронныйДокументСсылка, ПрофильЭДООрганизации, ПараметрыАвторизации);
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДокумента.Журнал, Ложь);
				
				Если ЗапросДокумента.Успех Тогда
					
					Ответ.Результат.Добавить(ЭлектронныйДокументСсылка);
					
					ЗапросКвитанций = ОбновитьКвитанцииЭлектронногоДокументаПоДаннымИзКурьера(ЭлектронныйДокументСсылка, ПараметрыАвторизации);
					ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКвитанций.Журнал, Ложь);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции 

// Получает данные ЭД вместе с вложенным файлом с сервера СФЕРА Курьер и записывает в ИБ
//
// Параметры:
//	Id - Id документа в СФЕРА Курьер
//	ПрофильЭДООрганизации   - СправочникСсылка.ККСНГ_Организации
//	ПрофильЭДООрганизации   - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на созданный или обновленный элемент справочника
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ЗаписатьЭлектронныйДокументПоДаннымИзКурьера(Id, ПрофильЭДООрганизации, ПараметрыАвторизации, ФильтроватьВходящие = Ложь) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обновление данных электронного документа");
	
	ЗапросДанных = ПолучитьЭлектронныйДокументСВложениемИзКурьера(Id, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанных.Журнал, Ложь);
	
	Если ЗапросДанных.Успех Тогда
		
		Если ФильтроватьВходящие И Не ПроверитьФильтрДляВходящегоДокумента(ЗапросДанных.Результат) Тогда
			Ответ.Результат = Неопределено;
			Ответ.Успех = Истина;
			Возврат Ответ;
		КонецЕсли;
		
		// TODO: Запись в транзакции 2019-05-30 Попов Д.В., Лашин И.И.: добавлена транзакция, но нужно подумать про + ЗаписатьПрисоединенныйФайл()
		ЗаписьЭД = ККСНГ_ОбъектыИБВызовСервера.ЗаписатьЭД(ЗапросДанных.Результат, ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьЭД.Журнал, Ложь);
		
		Если ЗаписьЭД.Успех Тогда
			
			ЭлектронныйДокументСсылка = ЗаписьЭД.Результат;			
			
			ЗаписьФайл = ККСНГ_ОбъектыИБВызовСервера.ЗаписатьПрисоединенныйФайл(ЗапросДанных.Результат.Content, 
																			ЭлектронныйДокументСсылка);			
																			
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьФайл.Журнал, Ложь);
			
			Ответ.Результат = ЭлектронныйДокументСсылка;
			Ответ.Успех = Истина;
			
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает историю обработки ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	Id                      - Id документа в СФЕРА Курьер
//	ПрофильЭДООрганизации   - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	СправочникСсылка.ККСНГ_ЭлектронныеДокументы - ссылка на обновленный элемент справочника
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьИсториюЭДИзКурьера(Id, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение истории документа");
	
	ЗапросAPI = ККСНГ_APIКурьер.v2_DocumentHistory(ПараметрыАвторизации, Id);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		
		Ответ.Результат = ЗапросAPI.Результат;
		Ответ.Успех = Истина;
		
	КонецЕсли;
			
	Возврат Ответ;
			
КонецФункции 

// Фильтр по принимаемым документам для Сбербанка
//
// Параметры:
//	МассивDocument - Массив - документы Справочник.ККСНГ_ЭлектронныеДокументы
//
Процедура ПрименитьФильтрДляМассиваДокументов(МассивDocument) Экспорт
	
	Инд = 0;
	Пока Инд <= МассивDocument.ВГраница() Цикл
		Если НЕ ПроверитьФильтрДляВходящегоДокумента(МассивDocument[Инд]) Тогда
			МассивDocument.Удалить(Инд);
		КонецЕсли;
		Инд = Инд + 1;
	КонецЦикла;
		
КонецПроцедуры

// Обработка отзыва документа по событию Курьера в объекте ЭД
//
// Параметры:
//	ЭлектронныйДокумент      - СправочникСсылка.ККСНГ_ЭлектронныеДокументы / СправочникСсылка.ККСНГ_Квитанции
//	ПрофильЭДООрганизации    - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации     - Структура - содержит:
//		* СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken          - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ОбработатьНештатныеСитуацииПоСобытиямДокумента(ЭлектронныйДокумент, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") 
		Или ТипЗнч(ЭлектронныйДокумент) = Тип("СправочникСсылка.ККСНГ_Квитанции") Тогда
		ИдДокумента = ЭлектронныйДокумент.Id;
	ИначеЕсли ТипЗнч(ЭлектронныйДокумент) = Тип("Число") Тогда
		ИдДокумента = ЭлектронныйДокумент;
	Иначе
		Возврат Ответ;
	КонецЕсли;
				
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение событий документа");
	СобытияПоДокументуЗапрос = ККСНГ_APIКурьер.v1_getDocumentEvents(ПараметрыАвторизации, ИдДокумента);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, СобытияПоДокументуЗапрос.Журнал, Ложь);
	
	Если СобытияПоДокументуЗапрос.Успех Тогда
		
		СобытияПоДокументу = СобытияПоДокументуЗапрос.Результат.DocumentEvent;
		
		Для Каждого Событие Из СобытияПоДокументу Цикл
			
			Если Событие.EventType = "Revoked" Тогда
				Ответ.Успех = Истина;
				Ответ.Результат = ККСНГ_ОбъектыИБВызовСервера.ОтразитьИзмененияВОбъектеЭД(ИдДокумента, 
																		ПрофильЭДООрганизации, Событие);
				
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, 
						"Документ был отозван отправителем. Действия с документом недоступны.", "CP-00001");
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает детальную информацию по ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	ИдентификаторЭД         - Идентификатор документа в СФЕРА Курьер
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура Document, см. https://confluence.esphere.ru/display/SBER/Document
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьДетальнуюИнформациюЭДИзКурьера(ИдентификаторЭД, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных документа");
	ЗапросAPI = ККСНГ_APIКурьер.v1_DocumentDetails(ПараметрыАвторизации, ИдентификаторЭД);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		
		Ответ.Результат = ЗапросAPI.Результат;
		Ответ.Успех = Истина;
				
	КонецЕсли;
			
	Возврат Ответ;
	
КонецФункции

// Возвращает реквизиты объектов ИБ
//
// Параметры:
//	ЭлектронныеДокументы   - Массив СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	ПоляДокумента          - Структура - реквизиты объекта ЭД
//
// Возвращаемое значение:
//  Массив	
//
Функция ПолучитьДанныеЭД(ЭлектронныеДокументы, ПоляДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	[ПОЛЯ]
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ЭлектронныеДокументы
	|ГДЕ
	|	ЭлектронныеДокументы.Ссылка В(&ЭлектронныеДокументы)";
	
	ПоляДокументаЗамена = Новый Массив;
	Для каждого ПолеДокумента Из ПоляДокумента Цикл
		ПоляДокументаЗамена.Добавить(ПолеДокумента.Ключ + " КАК " + ПолеДокумента.Значение);			
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "[ПОЛЯ]", СтрСоединить(ПоляДокументаЗамена, ","));
		
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных);
	
КонецФункции

#КонецОбласти 

#Область РаботаСВложениямиЭД

// Получает вложения документа ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	АдресХранилища         - Строка - адрес рузультата
//	ИдентификаторЭД        - Число - id документа
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
//	структура Document.Attachments.Attachment, см. https://confluence.esphere.ru/display/SBER/Document
//
Процедура ПолучитьВложенияЭлектронногоДокументаИзКурьераВФоновомЗадании(АдресХранилища, ИдентификаторЭД, ПараметрыАвторизации) Экспорт
				
	ЗапросВложений = ПолучитьВложенияЭлектронногоДокументаИзКурьера(ИдентификаторЭД, ПараметрыАвторизации);
					
	ПоместитьВоВременноеХранилище(ЗапросВложений, АдресХранилища); 
	 	
КонецПроцедуры

// Получает вложения документа ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	ИдентификаторЭД        - Число - id документа
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	структура Document.Attachments.Attachment, см. https://confluence.esphere.ru/display/SBER/Document
//
Функция ПолучитьВложенияЭлектронногоДокументаИзКурьера(ИдентификаторЭД, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	ЗапросПоДокументу = ПолучитьДетальнуюИнформациюЭДИзКурьера(ИдентификаторЭД, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПоДокументу.Журнал, Ложь);
	
	Если ЗапросПоДокументу.Успех Тогда
		
		МассивВложений = ЗапросПоДокументу.Результат.Attachments.Attachment;
		
		Ответ.Результат = МассивВложений;
		Ответ.Успех = Истина;
				
	КонецЕсли;
			
	Возврат Ответ;
	 	
КонецФункции

// Получает вложения документа ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	ИдентификаторыВложений - Число 
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Массив файлов во временном хранилище
//
Функция ПолучитьВложенияИзКурьера(ИдентификаторыВложений, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросВложений = ПолучитьФайлыВложенийЭлектронногоДокументаИзКурьера(ИдентификаторыВложений, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросВложений.Журнал, Ложь);
		
	Если ЗапросВложений.Успех Тогда
		
		МассивОписанийФайлов = Новый Массив;
		
		Для каждого СтруктураВложения Из ЗапросВложений.Результат Цикл
			
			Адрес = ПоместитьВоВременноеХранилище(СтруктураВложения.Content);
			ИмяФайла = Формат(СтруктураВложения.Id, "ЧГ=0") + "_" + СтруктураВложения.FileName;
			ОписаниеФайл = Новый ОписаниеПередаваемогоФайла(ИмяФайла, Адрес);
			
			МассивОписанийФайлов.Добавить(ОписаниеФайл);
			
		КонецЦикла;
		
		Ответ.Успех = Истина;
		Ответ.Результат = МассивОписанийФайлов;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает вложения документа ЭД с сервера СФЕРА Курьер
//
// Параметры:
//	ИдентификаторыВложений - Число 
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Массив , см. https://confluence.esphere.ru/display/SBER/Document.Attachment
//
Функция ПолучитьФайлыВложенийЭлектронногоДокументаИзКурьера(ИдентификаторыВложений, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	МассивВложений = Новый Массив;
	
	Для каждого Идентификатор Из ИдентификаторыВложений Цикл 
		
		ЗапросВложений = ККСНГ_APIКурьер.v1_DocumentAttachment(ПараметрыАвторизации, Идентификатор);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросВложений.Журнал, Ложь);
	
		Если ЗапросВложений.Успех Тогда
			
			СтруктураВложения = ЗапросВложений.Результат;
			СтруктураВложения.Вставить("Id", Идентификатор);
						
			МассивВложений.Добавить(СтруктураВложения);
						
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Результат = МассивВложений;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	 	
КонецФункции

// Заполняет данные подписанта в черновике на сервере СФЕРА Курьер
//	https://confluence.esphere.ru/display/SBER/Document.ChangeSigner+v.2
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Произвольный, не используется
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ЗаполнитьПодписантаВЧерновике(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПрофильЭДООрганизации, Знач ДанныеПодписанта, ПараметрыАвторизации) Экспорт
	
	Перем Ответ;
	Перем DocumentId, DocumentSigner, Person;
	Перем СертификатСсылка, Организация;
	Перем ЗапросДокумента, ЗапросМетода;
	Перем ПрофильЭДОКонтрагента, ЭтоФизЛицо, ДанныеСвидетельства;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") И ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ПрофильЭДОКонтрагента = ККСНГ_РаботаСКонтрагентамиВызовСервера.ПрофильКонтрагентаПоКодуЭДО(ПрофильЭДООрганизации, ДокументСсылка.BuyerCode);
		
		Если ПараметрыАвторизации.СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка Тогда
			СертификатСсылка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации.КонтекстТокена, "СертификатЭП");
		Иначе
			СертификатСсылка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации, "СертификатЭП");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПрофильЭДООрганизации)Или Не ЗначениеЗаполнено(СертификатСсылка) Тогда
			Возврат Ответ;
		КонецЕсли;
		
		Организация = ПрофильЭДООрганизации.Организация;
		ЭтоФизЛицо = Ложь;
		ОбменСКонтрагентамиПереопределяемый.ЭтоФизЛицо(Организация, ЭтоФизЛицо);
		
		DocumentSigner = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_DocumentSigner");
		Person = DocumentSigner.Person;
		
		// Машиночитаемые доверенности
		Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
			DocumentSigner.MchdViewType = "Meta";
		КонецЕсли;
		
		Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Пакет") = 0 Тогда
			DocumentSigner.MchdViewType = "File";
		КонецЕсли;
		
		Если Не ПустаяСтрока(DocumentSigner.MchdViewType) Тогда
			
			DocumentSigner.AccessMode = ДанныеПодписанта.МЧД.ИнформационнаяСистема;
			DocumentSigner.StartDate = Формат(ДанныеПодписанта.МЧД.ДатаНачала, "ДФ='yyyy-MM-dd'");
			DocumentSigner.Uuid = ДанныеПодписанта.МЧД.Номер;
			
		КонецЕсли;
		
		DocumentSigner.Inn = Организация.ИНН;
		DocumentSigner.Person = Person;
		DocumentSigner.Title = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта, "Должность");
		
		Person.FirstName = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта, "Имя");
		Person.LastName = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта, "Фамилия");
		Person.MiddleName = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта, "Отчество");
		
		DocumentSigner.SignerType = "Organization";
		
		Если ЭтоФизЛицо Тогда
			
			DocumentSigner.SignerType = "Individual";
			
			ДанныеСвидетельства = "";
			ОбменСКонтрагентамиПереопределяемый.ДанныеСвидетельстваОРегистрацииИП(Организация, ДанныеСвидетельства);
			
			Если Не ПустаяСтрока(ДанныеСвидетельства) Тогда
				DocumentSigner.RegistrationRequisites = ДанныеСвидетельства;
			КонецЕсли;
			
			// Обходим проверку сервиса, в блоке подписанта нет реквизита свидетельства о государственной регистрации
			Если Не ЗначениеЗаполнено(DocumentSigner.RegistrationRequisites) И ДокументСсылка.FormatVersion <> "5.01" Тогда
				DocumentSigner.RegistrationRequisites = "-";
			КонецЕсли;
			
		КонецЕсли;
		
		DocumentId = ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentChangeSigner(ПараметрыАвторизации, DocumentId, DocumentSigner);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Если Не ЗапросМетода.Успех Тогда
			Возврат Ответ;
		КонецЕсли;
		
		ЗапросДокумента = ОбновитьЭлектронныйДокументПоДаннымИзКурьера(ДокументСсылка, ПрофильЭДООрганизации, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДокумента.Журнал, Ложь);
		
		Ответ.Успех = ЗапросДокумента.Успех;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получение содержимого вложенного в документ файла
//	https://confluence.esphere.ru/display/SBER/Document.Content+v.2
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Произвольный, не используется
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьСодержимоеЭлектронногоДокументаСКурьера(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
		
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();	
	Ответ.Успех = Ложь;
		
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentContent(ПараметрыАвторизации, DocumentId);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Ответ.Результат = ЗапросМетода.Результат;
				
	КонецЕсли; 
			
	Возврат Ответ;
	 
КонецФункции

#КонецОбласти

#Область Квитанции

// Получает данные квитанции с сервера СФЕРА Курьер
//
// Параметры:
//	Id                      - Id квитанции в СФЕРА Курьер
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура TicketDetails, см. https://confluence.esphere.ru/display/SBER/TicketDetails
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьКвитанциюИзКурьера(Id, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных квитанции");
	
	ЗапросAPI = ККСНГ_APIКурьер.v1_TicketsTicket(ПараметрыАвторизации, Id);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		Ответ.Результат = ЗапросAPI.Результат;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Обновляет уже записанную квитанцию с сервера СФЕРА Курьер
//
// Параметры:
//	КвитанцияСсылка          - СправочникСсылка.ККСНГ_Квитанции
//	ПараметрыАвторизации     - Структура - содержит:
//		* СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken          - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	СправочникСсылка.ККСНГ_Квитанции - ссылка на обновленный элемент справочника
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ОбновитьКвитанциюПоДаннымИзКурьера(КвитанцияСсылка, ПараметрыАвторизации) Экспорт
	
	Если (ТипЗнч(КвитанцияСсылка) = Тип("СправочникСсылка.ККСНГ_Квитанции")
		И ЗначениеЗаполнено(КвитанцияСсылка)) Тогда
		
		Возврат ЗаписатьКвитанциюПоДаннымИзКурьера(КвитанцияСсылка.Id, КвитанцияСсылка.Владелец, ПараметрыАвторизации);

	КонецЕсли;
	                                                
КонецФункции

// Получает данные квитанции, ее содержимое (content), электронные подписи
// с сервера СФЕРА Курьер и записывает в ИБ
//
// Параметры:
//	Id - Id квитанции в СФЕРА Курьер
//	Владелец - СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	ПараметрыАвторизации  - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	СправочникСсылка.ККСНГ_Квитанции - ссылка на созданный или обновленный элемент справочника
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ЗаписатьКвитанциюПоДаннымИзКурьера(Id, Владелец, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обновление данных квитанции " + Формат(Id, "ЧГ=; ЧФ=(Ч)"));
	
	ЗапросДанных = ПолучитьКвитанциюИзКурьера(Id, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанных.Журнал, Ложь);
	
	Если ЗапросДанных.Успех Тогда
		
		// TODO: Запись в транзакции 2019-05-30 Попов Д.В., Лашин И.И.: добавлена транзакция, но нужно подумать про + ЗаписатьПрисоединенныйФайл()
		ЗаписьКвитанции = ККСНГ_ОбъектыИБВызовСервера.ЗаписатьКвитанцию(ЗапросДанных.Результат, Владелец);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьКвитанции.Журнал, Ложь);
		
		Если ЗаписьКвитанции.Успех Тогда
			
			КвитанцияСсылка = ЗаписьКвитанции.Результат;
			ЗаписьФайл = ККСНГ_ОбъектыИБВызовСервера.ЗаписатьПрисоединенныйФайл(ЗапросДанных.Результат.Content, КвитанцияСсылка);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьФайл.Журнал, Ложь);
			
			Ответ.Результат = КвитанцияСсылка;
			Ответ.Успех = Истина;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает список квитанций по ID документа сервера СФЕРА Курьер
//
// Параметры:
//	Id - Id документа в СФЕРА Курьер
//	ПараметрыАвторизации  - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Массив структур TicketDetails, см. https://confluence.esphere.ru/display/SBER/TicketDetails
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьСписокКвитанцийПоДокументуИзКурьера(Id, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных квитанции");
	
	ЗапросAPI = ККСНГ_APIКурьер.v1_TicketsTickets(ПараметрыАвторизации, Id);	
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		Ответ.Результат = ЗапросAPI.Результат;
		Ответ.Успех = Истина;
	КонецЕсли;
			
	Возврат Ответ;
	
КонецФункции

// Запись квитанций по документу ЭД в ИБ
//
// Параметры:
//	ЭлектроныйДокументСсылка - СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	ПараметрыАвторизации     - Структура - содержит:
//     * СпособАвторизации   - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken           - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена      - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ОбновитьКвитанцииЭлектронногоДокументаПоДаннымИзКурьера(ЭлектроныйДокументСсылка, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обновление квитанций электронного документа");
	
	ЗапросПоСпискуКвитанций = ПолучитьСписокКвитанцийПоДокументуИзКурьера(ЭлектроныйДокументСсылка.Id, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПоСпискуКвитанций.Журнал, Ложь);
	
	Если ЗапросПоСпискуКвитанций.Успех Тогда
		
		СписокКвитанций = ЗапросПоСпискуКвитанций.Результат.TicketDetails;
		Для каждого Квитанция Из СписокКвитанций Цикл
			
			// У квитанций DocumentId всегда Неопределено, там где задан - ЭД.
			ЗаписьКвитанции = ККСНГ_ДокументооборотВызовСервера.ЗаписатьКвитанциюПоДаннымИзКурьера(Квитанция.Id, ЭлектроныйДокументСсылка, ПараметрыАвторизации);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьКвитанции.Журнал, Ложь);
			
			Если Не ЗаписьКвитанции.Успех Тогда
				Ответ.Успех = Ложь;
				Возврат Ответ;
			КонецЕсли;
			
		КонецЦикла;
		
		Ответ.Успех = Истина;
		
	Иначе
		Ответ.Успех = Ложь;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает данные титула покупателя с сервера СФЕРА Курьер
//
// Параметры:
//	Id - Id документе в СФЕРА Курьер
//	ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации
//	СертификатСсылка - Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьТитулПокупателяИзКурьера(Id, ПрофильЭДООрганизации, СертификатСсылка, ПараметрыАвторизации, СодержаниеОперации, ИмяФайла = "", ДанныеПодписанта, ВерсияФормата = "") Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Организация = ПрофильЭДООрганизации.Организация;
	
	AcceptInfo = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_UniversalDocumentAcceptInfo");
	DocumentSignerInfo = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_UniversalDocumentAcceptInfo.DocumentSigner.DocumentSignerInfo");
	Signer = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_UniversalDocumentAcceptInfo.DocumentSigner.DocumentSignerInfo.Signer");
	Person = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_UniversalDocumentAcceptInfo.DocumentSigner.DocumentSignerInfo.Signer.Person");
	MchdFile = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_UniversalDocumentAcceptInfo.DocumentSigner.DocumentSignerInfo.MchdFile");
	
	SignerAuthority = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("type_UniversalDocumentAcceptInfo.DocumentSigner.DocumentSignerInfo.SignerAuthority");
	
	Person.LastName = СертификатСсылка.Фамилия;
	Person.FirstName = СертификатСсылка.Имя;
	Person.MiddleName = СертификатСсылка.Отчество;
	
	Signer.Inn = Организация.ИНН;
	Signer.Name = Организация.НаименованиеСокращенное;
	
	// TODO Реализовать сбор всех данных по организации в ПМ
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	
	ЭтоИП = Не МодульККСНГ_ПМ_РаботаСМетаданными.ЭтоЮрЛицо(Организация);
	
	Если ЭтоИП Тогда
		
		ОшибкаСвидетельстваИП = "";
		
		Если ПустаяСтрока(Организация.СвидетельствоСерияНомер) Тогда
			ОшибкаСвидетельстваИП = ОшибкаСвидетельстваИП + "Заполните, пожалуйста, серию и № свидетельства о государственной регистрации ИП." + Символы.ПС;
		КонецЕсли;
		
		Если Организация.СвидетельствоДатаВыдачи = Дата('00010101') Тогда
			ОшибкаСвидетельстваИП = ОшибкаСвидетельстваИП + "Заполните, пожалуйста, дату выдачи свидетельства о государственной регистрации ИП." + Символы.ПС;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОшибкаСвидетельстваИП) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СокрЛП(ОшибкаСвидетельстваИП), "DT-00004", , Организация);
			Возврат Ответ;
		КонецЕсли;
		
		Шаблон = НСтр("ru = '%1 от %2'");
		ДатаВыдачиСтрокой = Формат(Организация.СвидетельствоДатаВыдачи, "ДЛФ=D");
		Signer.RegistrationRequisites = СтрШаблон(Шаблон, СокрЛП(Организация.СвидетельствоСерияНомер), ДатаВыдачиСтрокой);
		
	Иначе
		Должность = СертификатСсылка.Должность;
		Signer.Title = ?(ЗначениеЗаполнено(Должность), Должность, "Сотрудник");
	КонецЕсли;
	
	DocumentSignerInfo.SigningDate = ТекущаяДатаСеанса(); // Дата подписания документа
	
	// Блок MchdFile заполняется только при варианте метаданные (AuthorityMethod = 3)
	Если ДанныеПодписанта.ТребуетсяМЧД = Истина И СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
		
		MchdFile.SingleNumber = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта.МЧД, "Номер");
		MchdFile.AttorneyDate = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта.МЧД, "ДатаНачала");
		MchdFile.InformationSystem = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодписанта.МЧД, "ИнформационнаяСистема");
		DocumentSignerInfo.MchdFile.Добавить(MchdFile);
		
	КонецЕсли;
	
	Если ДанныеПодписанта.ТребуетсяМЧД = Ложь Тогда
		DocumentSignerInfo.AuthorityMethod = 1; // Без доверенности
	ИначеЕсли СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Пакет") = 0 Тогда
		DocumentSignerInfo.AuthorityMethod = 2; // МЧД пакетом
	ИначеЕсли СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
		DocumentSignerInfo.AuthorityMethod = 3; // МЧД сведения об инф. системе
	Иначе
		DocumentSignerInfo.AuthorityMethod = 4; // МЧД отправляется отдельно
	КонецЕсли;
	
	Signer.SignerType = ?(ЭтоИП, "Individual", "Organization");
	Signer.Person = Person;
	
	SignerAuthority.Authority = "Должностные обязанности";
	SignerAuthority.AuthorityScope = 3;
	SignerAuthority.Condition = 5;
	
	DocumentSignerInfo.Signer.Добавить(Signer);
	DocumentSignerInfo.SignerAuthority.Добавить(SignerAuthority);
	AcceptInfo.DocumentSigner.DocumentSignerInfo.Добавить(DocumentSignerInfo);
	
	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ИмяФайла);
	
	AcceptInfo.Date = ТекущаяДатаСеанса();
	AcceptInfo.DealSummary = ?(Не ЭтоКорректировка, "Товары (работы, услуги, права) приняты без расхождений (претензий)", "С изменением стоимости согласен");
	AcceptInfo.AcceptanceCode.ResultCode = ?(Не ЭтоКорректировка, "AcceptedNoDisaccord", Неопределено);
	
	// Документ подписан с расхождениями
	Если СодержаниеОперации = "2" И Не ЭтоКорректировка Тогда
		AcceptInfo.DealSummary = "Товары (работы, услуги, права) приняты с расхождениями (претензией)";
		AcceptInfo.AcceptanceCode.ResultCode = "AcceptedDisaccord";
	КонецЕсли;
	
	ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentAcceptTitle(ПараметрыАвторизации, Id, AcceptInfo);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
	
	Если ЗапросМетода.Успех Тогда
		Ответ.Результат = ЗапросМетода.Результат;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает данные титула покупателя с сервера СФЕРА Курьер
//
// Параметры:
//	ДокументСсылка - Справочник.ККСНГ_ЭлектронныеДокументы
//	СертификатСсылка - Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьТитулПокупателяДляДокумента(Знач ДокументСсылка, Знач СертификатСсылка, ПараметрыАвторизации, Знач СодержаниеОперации, ДанныеПодписанта) Экспорт
	
	Перем ПрофильЭДООрганизации, DocumentId, ИмяФайла, ВерсияФормата;
	
	ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ДокументСсылка);
	DocumentId = ДокументСсылка.Id;
	ИмяФайла = ДокументСсылка.Filename;
	ВерсияФормата = ДокументСсылка.FormatVersion;
	
	Возврат ПолучитьТитулПокупателяИзКурьера(DocumentId, ПрофильЭДООрганизации, СертификатСсылка, ПараметрыАвторизации, СодержаниеОперации, ИмяФайла, ДанныеПодписанта, ВерсияФормата);
	
КонецФункции

// Получает уведомления с сервера СФЕРА Курьер
//
// Параметры:
//  ДокументСсылка			 - 		 - Справочник.ККСНГ_ЭлектронныеДокументы
//  ТекстПричиныОтклонения	 - 		 - Строка
//  ПараметрыАвторизации	 - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  MchdData				 - Структура - см.https://confluence.esphere.ru/display/SBER/MchdData
// 
// Возвращаемое значение:
//  Структура - FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//  см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьУведомлениеОбУточненииДляДокумента(Знач ДокументСсылка, Знач ТекстПричиныОтклонения, ПараметрыАвторизации, MchdData = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросМетода = ККСНГ_APIКурьер.v1_TicketCreateClarification(ПараметрыАвторизации, ДокументСсылка.Id, ТекстПричиныОтклонения, MchdData);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
	
	Если ЗапросМетода.Успех Тогда
		
		Ответ.Результат = ЗапросМетода.Результат;
		Ответ.Успех = Истина;
		
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

// Создание предложения об аннулировании на сервере СФЕРА Курьер
//
// Параметры:
//	ДокументСсылка - Справочник.ККСНГ_ЭлектронныеДокументы
//	ТекстПричиныАннулирования - Строка
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьПредложениеОбАннулированииДляДокумента(Знач ДокументСсылка, Знач ТекстПричиныАннулирования, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentCreateAvoidanceRequest(ПараметрыАвторизации, ДокументСсылка.Id, ТекстПричиныАннулирования);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
	
	Если ЗапросМетода.Успех Тогда
		
		Ответ.Результат = ЗапросМетода.Результат;
		Ответ.Успех = Истина;
		
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

// Получение предложений об аннулировании на сервере СФЕРА Курьер
//
// Параметры:
//	ДокументСсылка - Справочник.ККСНГ_ЭлектронныеДокументы
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура TicketDetails, см. https://confluence.esphere.ru/display/SBER/FileContent
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьПредложениеНаАннулированиеИзКвитанций(Знач ДокументСсылка, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросМетода = ККСНГ_APIКурьер.v1_TicketsTickets(ПараметрыАвторизации, ДокументСсылка.Id);	
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
	
	Если НЕ ЗапросМетода.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
		
	МассивКвитанций = ЗапросМетода.Результат.TicketDetails;
	
	Если ТипЗнч(МассивКвитанций) = Тип("Массив") Тогда
		
		AvoidanceRequest = Неопределено;
		
		Для Каждого Квитанция Из МассивКвитанций Цикл
			Если Квитанция.Type <> "AvoidanceRequest" Тогда	
				Продолжить;
			КонецЕсли;
			
			Если AvoidanceRequest = Неопределено 
				ИЛИ AvoidanceRequest.Date < Квитанция.Date Тогда
				AvoidanceRequest = Квитанция;
			КонецЕсли;	
			
		КонецЦикла;	
		
		Если AvoidanceRequest <> Неопределено Тогда 
			Ответ.Результат = AvoidanceRequest;
			Ответ.Успех = Истина;
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции

// Формирует ответную квитанцию отказ от предложения на аннулирование документа (УОУ).
//
// Параметры:
//  ДокументСсылка		 - 			 - Справочник.ККСНГ_ЭлектронныеДокументы
//  ТекстКомментария	 - 			 - Строка
//  ПараметрыАвторизации - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  MchdData			 - Структура - см.https://confluence.esphere.ru/display/SBER/MchdData
//
// Возвращаемое значение:
//  Структура - FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//  см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьУОУНаПредложениеОбАннулированииДляДокумента(Знач ДокументСсылка, Знач ТекстКомментария, ПараметрыАвторизации, MchdData = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentCreateAvoidanceRequestClarificationNotice(ПараметрыАвторизации, ДокументСсылка.Id, ТекстКомментария, MchdData);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
	
	Если ЗапросМетода.Успех Тогда
		
		Ответ.Результат = ЗапросМетода.Результат;
		Ответ.Успех = Истина;
		
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ЭлектронныеПодписи

// Получает список ЭП документа из Курьера
//
// Параметры:
//  IdДокумента				 - Число	 - Идентификатор ЭД
//  ПрофильЭДООрганизации	 - СправочникСсылка.ККСНГ_Организации	 - ссылка на профиль ЭДО организации
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
// Возвращаемое значение:
//	Структура - поля структуры;
//			Успех - Булево - Результат выполнения операции
//			Результат - Структура, содержащая массив структур DocumentSign в одноименном поле
//			Журнал -
//
Функция ПолучитьСписокЭлектронныхПодписейДокументаИзКурьера(IdДокумента, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	// Получаем данные подписи ЭД
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных электронной подписи");
	ЗапросДанныеПодписи = ККСНГ_APIКурьер.v1_DocumentGetSignatures(ПараметрыАвторизации, IdДокумента);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныеПодписи.Журнал, Ложь);
	
	Если ЗапросДанныеПодписи.Успех Тогда
		
		СоответствиеПодписиСертификаты = Новый Соответствие;
		Отказ = Ложь;
		
		СписокПодписейЭД = ЗапросДанныеПодписи.Результат.DocumentSign;
		Для каждого ПодписьЭД Из СписокПодписейЭД Цикл
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных сертификата");
			
			ЗапросДанныеСертификата = ККСНГ_APIКурьер.v1_DocumentGetSignatureDetails(
																ПараметрыАвторизации, ПодписьЭД.Id);
																
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныеСертификата.Журнал, Ложь);
			
			Если ЗапросДанныеСертификата.Успех Тогда
				ДанныеСертификата = ЗапросДанныеСертификата.Результат;					
				СоответствиеПодписиСертификаты.Вставить(ПодписьЭД, ДанныеСертификата);
			Иначе
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Отказ Тогда
			
			ЗаписьЭД = ККСНГ_ОбъектыИБВызовСервера.ДобавитьПодписиЭлектронногоДокумента(
							СоответствиеПодписиСертификаты, IdДокумента, ПрофильЭДООрганизации);
							
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьЭД.Журнал, Ложь);
			
			Если ЗаписьЭД.Успех Тогда
				
				Ответ.Результат = ЗаписьЭД.Результат;
				Ответ.Успех = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
					
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции 

// Функция - Получить данные сертификата ключа электронной подписи из курьера
//
// Параметры:
//  IdПодписи				 - Число	 - Идентификатор ЭП
//  ПрофильЭДООрганизации	 - СправочникСсылка.ККСНГ_Организации	 - ссылка на профиль ЭДО организации
//	ПараметрыАвторизации    - Структура - содержит:
//		* СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//		* AuthToken         - Строка - авторизационный токен доступа к API,
//		* КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//   							  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
// Возвращаемое значение:
//	Структура - поля структуры; 
//			Успех - Булево - Результат выполнения операции
//			Результат - Структура SignatureDetails, см. https://confluence.esphere.ru/display/SBER/SignatureDetails
//			Журнал -
//
Функция ПолучитьДанныеСертификатаКлючаЭлектроннойПодписиИзКурьера(IdПодписи, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	// Получаем данные сертификата
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получение данных сертификата");
	ЗапросAPI = ККСНГ_APIКурьер.v1_DocumentGetSignatureDetails(ПараметрыАвторизации, IdПодписи);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросAPI.Журнал, Ложь);
	
	Если ЗапросAPI.Успех Тогда
		Ответ.Результат = ЗапросAPI.Результат;
		Ответ.Успех = Истина;
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции 

#КонецОбласти 

#Область КомадыСФЕРАКурьер

// Назначает документ себе в обработку в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.SelfRoute
//
// Параметры:
//	ИмяКоманды              - Строка - Вызывает команду совершения действия в СФЕРА Курьер
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Не используется
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ВыполнитьКомандуКурьер(Знач ИмяКоманды, Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Вызов обработки команды сервиса ЭДО " + ИмяКоманды);
		 
	Попытка
		РезультатВызоваКоманды = Неопределено;
		Выполнить "РезультатВызоваКоманды = " + ИмяКоманды + "(ДокументСсылка, ДополнительныеПараметры, ПараметрыАвторизации);";
				
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, РезультатВызоваКоманды.Журнал, Ложь);
		Ответ.Успех = РезультатВызоваКоманды.Успех;
		
	Исключение
		Ошибка = ОписаниеОшибки();
		Ответ.Результат = Ошибка;
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, Ошибка, "CC-00001");
		
	КонецПопытки; 
	
	Возврат Ответ;
	
КонецФункции

// Назначает документ себе в обработку в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.SelfRoute
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Не используется
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерAssignableToSelf(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерAssignableToSelf");	
	Ответ.Успех = Ложь;
		
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentSelfRoute(ПараметрыАвторизации, DocumentId);	
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;	
				
		Если Ответ.Успех Тогда
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныйДокументПоДаннымИзКурьера(ДокументСсылка, ПрофильЭДООрганизации, ПараметрыАвторизации);
		КонецЕсли; 
			
	КонецЕсли; 
		
	Возврат Ответ;
			
КонецФункции

// Отправляет документ в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.Send
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Не используется
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерSend(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерSend");	
	Ответ.Успех = Ложь;
		
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentSend(ПараметрыАвторизации, DocumentId);	
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;	
				
		Если Ответ.Успех Тогда
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныйДокументПоДаннымИзКурьера(ДокументСсылка, ПрофильЭДООрганизации, ПараметрыАвторизации);
		КонецЕсли; 
				
	КонецЕсли; 

	Возврат Ответ;
		
КонецФункции

// Принимает документ в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.Accept
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Не используется
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерAccept(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерAccept");
	Ответ.Успех = Ложь;
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;

		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentAccept(ПараметрыАвторизации, DocumentId);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);

		Ответ.Успех = ЗапросМетода.Успех;

		Если Ответ.Успех Тогда
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
				
	КонецЕсли; 
			
	Возврат Ответ;
			
КонецФункции

// Подписывает документ и продвигает документ дальше по маршруту в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.Sign
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* Signature - структура, см. https://confluence.esphere.ru/display/SBER/SignatureWithTicket
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерSign(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерSign");	
	Ответ.Успех = Ложь;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Отсутствуют данные подписи", "CM-00001");
	КонецЕсли; 
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentSign(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.Signature);	
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
								
	КонецЕсли; 
		
	Возврат Ответ;
			
КонецФункции

// Отклоняет документ в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.Reject
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* comment - Строка
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерReject(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерReject");	
	Ответ.Успех = Ложь;
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentReject(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.comment);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Ответ;
		
КонецФункции

// Отклоняет документ и добавляет уведомление об уточнении в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.RequestClarification
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* Signature - структура, см. https://confluence.esphere.ru/display/SBER/SignedContent
//                               является параметром ticket
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерRejectWithTicket(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерReject");
	Ответ.Успех = Ложь;
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId = ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentRequestClarification(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.Signature);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции

// Принимает документ в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.Accept
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* Signature - структура, см. https://confluence.esphere.ru/display/SBER/SignedContent
//                               является параметром ticket
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерAcceptWithTicket(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерAcceptWithTicket");
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Отсутствуют данные подписи", "CM-00002");
	КонецЕсли;
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId = ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentAccept(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.Signature);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Отправляет запрос на предложение об аннулировании документа в СФЕРА Курьер
//	см. https://confluence.esphere.ru/display/SBER/Document.AvoidanceRequest+v.2
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* Signature - структура, см. https://confluence.esphere.ru/display/SBER/SignedContent
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерAvoidanceRequest(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерПредложитьАннулирование");	
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Отсутствуют данные подписи", "CM-00003");
	КонецЕсли; 
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentAvoidanceRequest(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.Signature);	
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли; 

	Возврат Ответ;

КонецФункции

// Принимает документ на аннулирование в СФЕРА Курьер
//	https://confluence.esphere.ru/display/SBER/Document.acceptAvoidanceRequest+v.2
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* Signature - структура, см. https://confluence.esphere.ru/display/SBER/Signature
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерAcceptAvoidance(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерПодтвердитьАннулирование");	
	Ответ.Успех = Ложь;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Отсутствуют данные подписи", "CM-00004");
	КонецЕсли; 
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.	v2_DocumentAcceptAvoidanceRequest(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.Signature);	
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Ответ;
		
КонецФункции

// Отменяет аннулирование документа в СФЕРА Курьер
//	https://confluence.esphere.ru/display/SBER/Document.RejectAvoidanceRequest+v.2
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* Signature - структура, см. https://confluence.esphere.ru/display/SBER/SignedContent
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерRejectAvoidance(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерОтказатьсяОтПредложенногоАннулирования");
	Ответ.Успех = Ложь;
	
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId = ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v2_DocumentRejectAvoidanceRequest(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.Signature);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка); 
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
		
КонецФункции

// Отзывает документ в СФЕРА Курьер
//	https://confluence.esphere.ru/display/SBER/Document.Revoke
//
// Параметры:
//	ДокументСсылка          - Справочник.ККСНГ_ЭлектронныеДокументы
//	ДополнительныеПараметры - Структура
// 								* comment - Строка
//	ПараметрыАвторизации    - Структура - содержит:
//     * СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken          - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция КурьерRevoke(Знач ДокументСсылка, Знач ДополнительныеПараметры, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды КурьерRevoke");	
	Ответ.Успех = Ложь;
		
	// Проверка корректности входящих параметров
	Если ЗначениеЗаполнено(ДокументСсылка) 
		И ТипЗнч(ДокументСсылка) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		
		DocumentId =  ДокументСсылка.Id;
		
		ЗапросМетода = ККСНГ_APIКурьер.v1_DocumentRevoke(ПараметрыАвторизации, DocumentId, ДополнительныеПараметры.comment);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросМетода.Журнал, Ложь);
		
		Ответ.Успех = ЗапросМетода.Успех;
		
		Если Ответ.Успех Тогда
			МассивПараметр = Новый Массив;
			МассивПараметр.Добавить(ДокументСсылка);
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(ДокументСсылка.КодЭДОВладельца);
			ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(МассивПараметр, ПрофильЭДООрганизации, ПараметрыАвторизации);
			
		КонецЕсли;
				
	КонецЕсли; 
			
	Возврат Ответ;
	 
КонецФункции

#КонецОбласти

#Область ЗагрузкаДокументов

// Запись объектов документов в ИБ по данным с сервера СФЕРА Курьер
//
// Параметры:
//	ДокументыПоПапкам      - Структура - Имя папки, массив id
//	ПрофильЭДООрганизации  - СправочникСсылка.ККСНГ_Организации
//	АдресРезультата        - Строка - Адрес хранения результата выполнения
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
Процедура ЗаписатьДокументыПоИД(ДокументыПоПапкам, ПрофильНастройкиЭДО, АдресРезультата, ПараметрыАвторизации) Экспорт 
	
	РезультатыПоПапкам = Новый Соответствие;
	СохраненныеДокументы = Новый Соответствие;
	ДанныеПрогрессаПапки = Новый Соответствие;
	
	КоличествоДоковВсего = 0;
	Для каждого ТекПапка Из ДокументыПоПапкам Цикл
		КоличествоДоковВсего = КоличествоДоковВсего + ТекПапка.Значение.Количество();	
	КонецЦикла;
	СчетчикЗагрузкиВсего = 0;
	
	Для каждого ТекПапка Из ДокументыПоПапкам Цикл
		
		ИмяПапки = ТекПапка.Ключ;
		ДокументыПапки = ТекПапка.Значение;
		ЗаписанныхДокументов = 0;
		ОшибокДокументов = 0;
		ОшибокКвитанций = 0;
		СчетчикЗагрузкиПапки = 0;
		
		Для каждого ТекИД Из ДокументыПапки Цикл 
			
			СообщитьПрогрессЗагрузкиДокументов(ИмяПапки, КоличествоДоковВсего, СчетчикЗагрузкиВсего, СчетчикЗагрузкиПапки, ДанныеПрогрессаПапки);
			
			Если СохраненныеДокументы.Получить(ТекИД) <> Неопределено Тогда
				ЗаписанныхДокументов = ЗаписанныхДокументов + 1;
				Продолжить;
			КонецЕсли;	
				
			ЗапросПоДокументу = ККСНГ_ДокументооборотВызовСервера.ЗаписатьЭлектронныйДокументПоДаннымИзКурьера(ТекИД, ПрофильНастройкиЭДО, ПараметрыАвторизации, Истина);
			
			Если ЗапросПоДокументу.Успех Тогда
				СохраненныеДокументы.Вставить(ТекИД);
				ЗаписанныхДокументов = ЗаписанныхДокументов + 1;
				ЭДСсылка = ЗапросПоДокументу.Результат;
				
				ОбновлениеКвитанций = ККСНГ_ДокументооборотВызовСервера.ОбновитьКвитанцииЭлектронногоДокументаПоДаннымИзКурьера(ЭДСсылка, ПараметрыАвторизации);
				
				Если НЕ ОбновлениеКвитанций.Успех Тогда
					ОшибокКвитанций = ОшибокКвитанций + 1;							
				КонецЕсли; 				
				
			Иначе
				ОшибокДокументов = ОшибокДокументов + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		РезультатЗаписи = Новый Структура;
		РезультатЗаписи.Вставить("ЗаписанныхДокументов", ЗаписанныхДокументов);
		РезультатЗаписи.Вставить("ОшибокДокументов", ОшибокДокументов);
		РезультатЗаписи.Вставить("ОшибокКвитанций", ОшибокКвитанций);
		РезультатЗаписи.Вставить("НеобходимаПереинициализация", ПараметрыАвторизации.Свойство("НеобходимаПереинициализация"));
				
		РезультатыПоПапкам.Вставить(ИмяПапки, РезультатЗаписи);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(РезультатыПоПапкам, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьФильтрДляВходящегоДокумента(Document)
	
	// От Сбербанка принимаем только определенные типы документов
	КодЭДОСбера = ККСНГ_РаботаСКонтрагентамиВызовСервера.КодЭДОСбера();
	
	Если Document.SellerCode = КодЭДОСбера Тогда
		
		РазрешенныеТипы = Новый Соответствие;
		РазрешенныеТипы.Вставить("UPD_SF", Истина);
		РазрешенныеТипы.Вставить("UPD_DOP", Истина);
		РазрешенныеТипы.Вставить("REZRU", Истина);
		РазрешенныеТипы.Вставить("BILL", Истина);
		РазрешенныеТипы.Вставить("ACT", Истина);
		РазрешенныеТипы.Вставить("ACCOUNT", Истина);
		РазрешенныеТипы.Вставить("AGREEMENT", Истина);
		РазрешенныеТипы.Вставить("DOCUMENT", Истина);
		РазрешенныеТипы.Вставить("UVHD_BILL", Истина);
		РазрешенныеТипы.Вставить("ACT_ECOSYSTEM", Истина);
		РазрешенныеТипы.Вставить("OTHER_REP", Истина);

		Возврат (РазрешенныеТипы[Document.DocumentTypeCode] <> Неопределено);
		
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

Процедура СообщитьПрогрессЗагрузкиДокументов(ИмяПапки, КоличествоДоковВсего, СчетчикЗагрузкиОбщий, СчетчикЗагрузкиПапки, ДанныеПрогрессаПапки)
	
	СчетчикЗагрузкиОбщий = СчетчикЗагрузкиОбщий + 1;
	СчетчикЗагрузкиПапки = СчетчикЗагрузкиПапки + 1;	
	
	ПроцентВыполнения = Цел((СчетчикЗагрузкиОбщий) * 100 / КоличествоДоковВсего);
	ИмяПапкиДляПользователя = ККСНГ_ОбщегоНазначенияВызовСервера.ПапкиДокументов().Получить(ИмяПапки);
	ТекстСообщения = СтрШаблон("[%1] Обработано: %2", ИмяПапкиДляПользователя, СчетчикЗагрузкиПапки);
	ПараметрыПрогресса = Новый Структура("ИмяПапки, Процент", ИмяПапки, ПроцентВыполнения);
	ДанныеПрогрессаПапки.Вставить(ИмяПапки, ПараметрыПрогресса);
	ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, ТекстСообщения, Новый Структура("ДанныеПрогрессаПапки", ДанныеПрогрессаПапки));
	
КонецПроцедуры

#КонецОбласти