#Область ПрограммныйИнтерфейс

// Возвращает заполненный объект XDTO по данным структурированного документа
//
// Параметры:
//	ДанныеXML - строка XML, адрес во временном хранилище или двоичные данные
//
// Возвращаемое значение:
//	Объект XDTO
//
Функция ПолучитьОбъектXDTOПоСтруктурированномуXML(ДанныеXML) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка XML структурированного документа");
	
	// Получим данные из входного параметра: XML, адрес во временном хранилище или двоичные данные
	
	Если ТипЗнч(ДанныеXML) = Тип("ДвоичныеДанные") Тогда
		ТекстXML = ПолучитьСтрокуИзДвоичныхДанных(ДанныеXML, "windows-1251");
	ИначеЕсли ТипЗнч(ДанныеXML) = Тип("Строка") И ЭтоАдресВременногоХранилища(ДанныеXML) Тогда
		ТекстXML = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьИзВременногоХранилища(ДанныеXML), "windows-1251");
	ИначеЕсли ТипЗнч(ДанныеXML) = Тип("Строка") Тогда
		ТекстXML = ДанныеXML;
	Иначе
		ТекстXML = Неопределено;
	КонецЕсли;
	
	Если ТекстXML = Неопределено Тогда
		// Не удалось определить, как обработать входные данные XML
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось определить, как обработать входные данные XML.", "XM-00002");
		Возврат Ответ;
	КонецЕсли;
	
	ИдФайл = "";
	ВерсФорм = "";
	ОписаниеОшибки = "";
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		
		Если ЧтениеXML.Прочитать() Тогда
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
				Если СтрСравнить(ЧтениеXML.Имя, "ИдФайл") = 0 Тогда
					ИдФайл = ЧтениеXML.Значение;
				КонецЕсли;
				Если СтрСравнить(ЧтениеXML.Имя, "ВерсФорм") = 0 Тогда
					ВерсФорм = ЧтениеXML.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ЧтениеXML.Закрыть();
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка при чтении данных из XML", "XM-00003", ОписаниеОшибки);
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ИдФайл) И Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ДоступныеФорматы = ПолучитьПрефиксыИменСтруктурированныхДокументов();
		ПространствоИмен = Неопределено;
		КлючФормата = Неопределено;
		
		Для каждого ДоступныйФормат Из ДоступныеФорматы Цикл
			Если ВРег(Лев(ИдФайл, СтрДлина(ДоступныйФормат.Ключ))) = ВРег(ДоступныйФормат.Ключ) Тогда
				КлючФормата = ДоступныйФормат.Ключ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Дополнительно проверяем на соответсвие 970 приказу, так как префикс такой же как у 820
		Если КлючФормата = "ON_NSCHFDOPPR_" И СтрСравнить(ВерсФорм, "5.03") = 0 Тогда
			ПространствоИмен = "KKSNG_ON_NSCHFDOPPR_970";
		Иначе
			ПространствоИмен = ДоступныеФорматы.Получить(КлючФормата);
		КонецЕсли;
		
		Если ПространствоИмен <> Неопределено Тогда
			
			Попытка
				
				ККСНГ_XDTOКлиентСервер.УстановитьПространствоИменПервогоЭлемента(ТекстXML, ПространствоИмен);
				ЧтениеXML.УстановитьСтроку(ТекстXML);
				
				ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, "Файл");
				ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
				
				ЧтениеXML.Закрыть();
				Ответ.Результат = ОбъектXDTO;
				Ответ.Успех = Истина;
				
			Исключение
				
				ОписаниеОшибки = ОписаниеОшибки();
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка при чтении данных из XML", "XM-00004", ОписаниеОшибки);
				
			КонецПопытки;
			
		Иначе
			
			// Не удалось определить формат исходных данных
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось определить формат структурированного документа.", "XM-00001" , ИдФайл);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает код типа номенклатуры по его представлению
//
// Параметры:
//	ТипНоменклатуры   - Строка / Число - код или представление
//
// Возвращаемое значение:
//	Строка / Число
//
Функция ПолучитьПризнакТоварРабота(ТипНоменклатуры) Экспорт
	
	Если ТипЗнч(ТипНоменклатуры) = Тип("Число") 
		Или ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(ТипНоменклатуры) Тогда
		
		Возврат ТипНоменклатуры;
		
	КонецЕсли;
	
	Список = ПолучитьСписокПризнаковТоварРабота();
	
	Для Каждого Элемент Из Список Цикл
		Если Элемент.Представление = ТипНоменклатуры Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат "1";
	
КонецФункции

// Возвращает соответствие кодов типов номенклатуры их представлениям 
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	СписокЗначений
//
Функция ПолучитьСписокПризнаковТоварРабота() Экспорт
	
	Список = Новый СписокЗначений;
	
	Список.Добавить("1", "Товар");
	Список.Добавить("2", "Работа");
	Список.Добавить("3", "Услуга");
	Список.Добавить("4", "Право");
	Список.Добавить("5", "Иное");

	Возврат Список;
	
КонецФункции

// Возвращает признак структурированного документа по имени файла
//
// Параметры:
//	ИмяФайла   - Строка
//
// Возвращаемое значение:
//	Булево
//
Функция ЭтоСтруктурированныйДокумент(ИмяФайла = "") Экспорт
	
	Если Не ПустаяСтрока(ИмяФайла) Тогда
		Для Каждого ДоступныйФормат Из ПолучитьПрефиксыИменСтруктурированныхДокументов() Цикл
			Если ВРег(Лев(ИмяФайла, СтрДлина(ДоступныйФормат.Ключ))) = ВРег(ДоступныйФормат.Ключ) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает соответствие префиксов ЭД их представлениям
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Соответствие
//
Функция ПолучитьПрефиксыИменСтруктурированныхДокументов() Экспорт
	
	ДоступныеФорматы = Новый Соответствие;
	ДоступныеФорматы.Вставить("ON_KORSCHFDOPPR_", "KKSNG_ON_KORSCHFDOPPR");
	ДоступныеФорматы.Вставить("ON_NSCHFDOPPR_", "KKSNG_ON_NSCHFDOPPR");
	ДоступныеФорматы.Вставить("ON_NSCHFDOPPRMARK_", "KKSNG_ON_NSCHFDOPPR");
	ДоступныеФорматы.Вставить("ON_NSCHFDOPPRPROS_", "KKSNG_ON_NSCHFDOPPR");
	ДоступныеФорматы.Вставить("ON_SCHFDOPPR_", "KKSNG_ON_SCHFDOPPR");
	ДоступныеФорматы.Вставить("DP_TOVTORGPR_", "KKSNG_DP_TOVTORGPR");
	ДоступныеФорматы.Вставить("DP_REZRUISP_", "KKSNG_DP_REZRUISP");
	ДоступныеФорматы.Вставить("BILL_", "KKSNG_BILL");
	ДоступныеФорматы.Вставить("ON_NKORSCHFDOPPR_", "KKSNG_ON_NKORSCHFDOPPR");
	ДоступныеФорматы.Вставить("ON_NKORSCHFDOPPRMARK_", "KKSNG_ON_NKORSCHFDOPPR");
	ДоступныеФорматы.Вставить("ON_NKORSCHFDOPPRPROS_", "KKSNG_ON_NKORSCHFDOPPR");
	
	Возврат ДоступныеФорматы;
	
КонецФункции

#КонецОбласти
