
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстОшибки", ТекстОшибки);
	
	ПредложитьСохранение = Ложь;
	Параметры.Свойство("ПредложитьСохранение", ПредложитьСохранение);
	Элементы.ДекорацияВопросОСохраненииНастроек.Видимость = ПредложитьСохранение;
	Элементы.ФормаДа.Видимость = ПредложитьСохранение;
	Элементы.ФормаДа.КнопкаПоУмолчанию = ПредложитьСохранение;	
	Элементы.ФормаНет.Видимость = ПредложитьСохранение;
	Элементы.ФормаОК.Видимость = Не ПредложитьСохранение;
	Элементы.ФормаОК.КнопкаПоУмолчанию = Не ПредложитьСохранение;
	Элементы.ТекстОшибки.Видимость = Ложь;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Да(Команда)
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	
	Закрыть(КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробностиОбОшибке(Команда)
	
	Элементы.ТекстОшибки.Видимость = Не Элементы.ТекстОшибки.Видимость;
	
КонецПроцедуры

#КонецОбласти
