
#Область ПрограммныйИнтерфейс

// Устанавливает/обновляет подключаемые модули
//
// Параметры:
//   МассивПодключаемыхМодулей - Массив из Структура - содержит:
//		* Имя - Строка - Имя подключаемого модуля
// 		* ДвоичныеДанные - ДвоичныеДанные, Неопределено
//		* ИмяМакета - Строка - Имя макета настройки подключаемых модулей
//
// Возвращаемое значение:
//   Структура - Результат установки подключаемых модулей 
//		* Успех - Булево
//		* ОписаниеОшибки - Строка
//   
Функция УстановитьОбновитьПодключаемыеМодули(МассивПодключаемыхМодулей) Экспорт
	
	Результат = Новый Структура("Успех, ОписаниеОшибки");
	Результат.Успех = Ложь;
	
	Для Каждого ПодключаемыйМодуль Из МассивПодключаемыхМодулей Цикл
		
		ДвоичныеДанныеПодключаемогоМодуля = Неопределено;
		ПодключаемыйМодуль.Свойство("ДвоичныеДанные", ДвоичныеДанныеПодключаемогоМодуля);
		Если ДвоичныеДанныеПодключаемогоМодуля = Неопределено Тогда 	
			ДвоичныеДанныеПодключаемогоМодуля = ПолучитьОбщийМакет(ПодключаемыйМодуль.ИмяМакета);
		КонецЕсли;

		Результат = ККСНГ_ПодключаемыеМодули.УстановитьОбновитьПодключаемыйМодуль(ПодключаемыйМодуль.Имя, ДвоичныеДанныеПодключаемогоМодуля);

		Если НЕ Результат.Успех Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет необходимость обновления подключаемых модулей
//
// Параметры:
//   МакетНастройкиПодключаемыхМодулей - Строка, Неопределено - Имя макета настройки подключаемых модулей
//
// Возвращаемое значение:
//   Структура - содержит:
//		* Успех - Булево
//		* ПоддерживаемаяКонфигурация - Булево
//		* НеобходимаПерезагрузка - Булево
//		* Отключено - Булево
//		* ПодключаемыеМодулиДляУстановки - Массив
//
Функция ПроверитьНеобходимостьОбновленияПодключаемыхМодулей(МакетНастройкиПодключаемыхМодулей = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ПоддерживаемаяКонфигурация", Истина);
	Результат.Вставить("НеобходимаПерезагрузка", Ложь);
	Результат.Вставить("Отключено", Ложь);
	Результат.Вставить("ПодключаемыеМодулиДляУстановки", Новый Массив);
	
	Если МакетНастройкиПодключаемыхМодулей = Неопределено Тогда 
		МакетНастройкиПодключаемыхМодулей = ПолучитьОбщийМакет("ККСНГ_НастройкиПодключаемыхМодулей");
	КонецЕсли;
	
	СписокПодключаемыхМодулей = ККСНГ_ПодключаемыеМодули.ПолучитьСписокПодключаемыхМодулей(МакетНастройкиПодключаемыхМодулей);
		
	Если СписокПодключаемыхМодулей.Количество() Тогда
		
		Для Каждого ПодключаемыйМодуль Из СписокПодключаемыхМодулей Цикл
			
			ПодключаемыйМодуль = ПодключаемыйМодуль.Значение;
			
			Отбор = Новый Структура("Имя", ПодключаемыйМодуль.Имя);
			СписокРасширенийКонфигурации = ККСНГ_ПодключаемыеМодули.ПолучитьСписокРасширенийКонфигурации(Отбор);
			
			Если СписокРасширенийКонфигурации.Количество() Тогда
				
				ОбработатьРасширения(СписокРасширенийКонфигурации, ПодключаемыйМодуль, Результат);
				
			Иначе
				Результат.ПодключаемыеМодулиДляУстановки.Добавить(ПодключаемыйМодуль);	
			КонецЕсли;
			
		КонецЦикла;

		Результат.Успех = НЕ (Результат.ПодключаемыеМодулиДляУстановки.Количество() ИЛИ Результат.НеобходимаПерезагрузка ИЛИ Результат.Отключено);
	Иначе
		
		//Для этой конфигурации расширений нет !! 
		Результат.ПоддерживаемаяКонфигурация = Ложь;
				
	КонецЕсли;
			
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьРасширения(СписокРасширенийКонфигурации, ПодключаемыйМодуль, Результат)

	РасширениеКонфигурации = СписокРасширенийКонфигурации[0];
	Если РасширениеКонфигурации.Имя = ПодключаемыйМодуль.Имя Тогда
		
		Если РасширениеКонфигурации.Версия <> ПодключаемыйМодуль.Версия Тогда
			Результат.ПодключаемыеМодулиДляУстановки.Добавить(ПодключаемыйМодуль);						
		ИначеЕсли НЕ РасширениеКонфигурации.ПодключеноРаботает Тогда
			Если НЕ РасширениеКонфигурации.Активно Тогда
				Результат.Отключено = Истина;
			Иначе	
				Результат.НеобходимаПерезагрузка = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
