#Область ПрограммныйИнтерфейс

#Область Авторизация

// Получает параметры авторизации по профилю
//
// Параметры:
//	ПрофильНастройкиЭДО   - Справочник.ККСНГ_Организации 
//	ОповещениеОЗавершении - Оповещение - Произвольно
//	Интерактивно          - Булево
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//  Результат - Структура:
//					* СпособАвторизации
//					* AuthToken
//					* КонтекстТокена
//					* СертификатЭП
//
Функция ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОповещениеОЗавершении = Неопределено, Интерактивно = Истина, Пользователь = Неопределено) Экспорт 
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	СпособАвторизации = ККСНГ_ДокументооборотВызовСервера.СпособАвторизацииОрганизации(ПрофильНастройкиЭДО, Пользователь);
	
	Если СпособАвторизации = Неопределено Тогда
		// Не удалось определить способ авторизации, актуально для многопользовательского режима
		ТекстОшибки = "Не удалось определить способ авторизации, перейдите к настройкам профиля организации";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "AU-00115");
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
		Возврат Ответ;
		
	КонецЕсли;
	
	АвторизацияТокеном = СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка");
	ЗапуститьАвторизациюТокеном = Ложь;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ПараметрыАвторизации = Неопределено;
	Иначе
		ПараметрыАвторизации = ТекущиеПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО);
	КонецЕсли;
	
	Если Интерактивно Тогда
		
		Если ПараметрыАвторизации = Неопределено Тогда
			
			ПараметрыАвторизации = ПустыеПараметрыАвторизации();
			ПараметрыАвторизации.СпособАвторизации = СпособАвторизации;
			
			Если АвторизацияТокеном Тогда 
				
				ЗапуститьАвторизациюТокеном = Истина;
				
			Иначе // ApiKey
				
				ЗапросApiKey = ККСНГ_ДокументооборотВызовСервера.ПолучитьАвторизационныйТокенПоПрофилюЭДООрганизации(ПрофильНастройкиЭДО, Пользователь);
				
				Если Не ЗапросApiKey.Успех Тогда
					
					ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросApiKey.Журнал, Ложь);
					
					Если ОповещениеОЗавершении <> Неопределено Тогда
						ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
					КонецЕсли;
					
					Возврат Ответ;
					
				Иначе
					
					AuthToken = ЗапросApiKey.Результат;
					ПараметрыАвторизации.AuthToken = AuthToken;
					ДополнитьПараметрыАвторизацииСертификатомЭП(ПараметрыАвторизации);
					ОбновитьПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПараметрыАвторизации);
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли АвторизацияТокеном И Не ЗначениеЗаполнено(ПараметрыАвторизации.КонтекстТокена.AuthCookie) Тогда
			
			ЗапуститьАвторизациюТокеном = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗапуститьАвторизациюТокеном Тогда
		
		Ответ.Результат = ПараметрыАвторизации;
		
		Если Интерактивно Тогда
			
			Если АвторизацияТокеном И ПараметрыАвторизации <> Неопределено Тогда // Если авторизация токеном, то параметры возвращаем только если организация соответствтует сертификату
				
				ЗапросПроверки = ККСНГ_ДокументооборотВызовСервера.ПроверитьСоответствиеОрганизацииКурьеру(ПрофильНастройкиЭДО, ПараметрыАвторизации);
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПроверки.Журнал);
				
				Ответ.Успех = ЗапросПроверки.Успех;
				Если Не Ответ.Успех Тогда 
					Ответ.Результат = Неопределено;
					ОбновитьПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, Неопределено);
				КонецЕсли;
				
			Иначе
				Ответ.Успех = Истина;
			КонецЕсли;
			
		Иначе
			
			Ответ.Успех = ПараметрыАвторизации <> Неопределено;
			
		КонецЕсли;
		
		Если ОповещениеОЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
		КонецЕсли;
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО); 
		ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации); 
		ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении); 
		
		ПослеАвторизацииЛКК = Новый ОписаниеОповещения("ЗавершитьПолучениеПараметровАвторизации", ЭтотОбъект, ДополнительныеПараметры);
		ККСНГ_VPNKeyTLSАвторизацияКлиент.НачатьАвторизациюЛКК(ПараметрыАвторизации.КонтекстТокена, ПослеАвторизацииЛКК);
		
		Ответ.Результат = ПараметрыАвторизации;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // ПараметрыАвторизацииОрганизации()

// Заполняет токен параметров авторизации
//
// Параметры:
//	ДанныеАвторизации     - Структура:
//						    	* СпособАвторизации
//						    	* КлючДоступаAPI
//						    	* ПараметрыАвторизации
//	ОповещениеОЗавершении - Оповещение - Произвольно
//
// Возвращаемое значение:
//	см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//  Результат - Структура:
//					* СпособАвторизации
//					* AuthToken
//					* КонтекстТокена
//					* СертификатЭП
//
Процедура ПараметрыАвторизацииНовойОрганизации(ДанныеАвторизации, ОповещениеОЗавершении) Экспорт 
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	СпособАвторизации = ДанныеАвторизации.СпособАвторизации;
	АвторизацияТокеном = СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка");
	ЗапуститьАвторизациюТокеном = Ложь;
	ПараметрыАвторизации = ДанныеАвторизации.ПараметрыАвторизации;
	
	Если ПараметрыАвторизации = Неопределено Тогда
		ПараметрыАвторизации = ПустыеПараметрыАвторизации();
	КонецЕсли;
	
	ПараметрыАвторизации.СпособАвторизации = СпособАвторизации;
	Если АвторизацияТокеном Тогда 
		ЗапуститьАвторизациюТокеном = Истина;
	Иначе	// ApiKey
		ЗапросApiKey = ККСНГ_ДокументооборотВызовСервера.ПолучитьАвторизационныйТокенПоКлючу(ДанныеАвторизации.КлючДоступаAPI);
		Если НЕ ЗапросApiKey.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросApiKey.Журнал, Ложь);
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
			Возврат;
		Иначе 
			AuthToken = ЗапросApiKey.Результат;
			ПараметрыАвторизации.AuthToken = AuthToken;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗапуститьАвторизациюТокеном Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации); 
		ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении); 
		
		ПослеАвторизацииЛКК = Новый ОписаниеОповещения("ЗавершитьПолучениеПараметровАвторизации", ЭтотОбъект, ДополнительныеПараметры);
		ККСНГ_VPNKeyTLSАвторизацияКлиент.НачатьАвторизациюЛКК(ПараметрыАвторизации.КонтекстТокена, ПослеАвторизацииЛКК);
		
		Ответ.Результат = ПараметрыАвторизации;	
	Иначе 
		Ответ.Успех = Истина;
		Ответ.Результат = ПараметрыАвторизации;
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
	КонецЕсли;
	
КонецПроцедуры // ПараметрыАвторизацииНовойОрганизации()

// Обновляет глобальную переменную глПараметрыАвторизацииКурьер
//
// Параметры:
//	ПрофильНастройкиЭДО     - Справочник.ККСНГ_Организации 
//	ПараметрыАвторизации    - Структура:
//								* СпособАвторизации
//								* AuthToken
//								* КонтекстТокена
//								* СертификатЭП
//
Процедура ОбновитьПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПараметрыАвторизации) Экспорт
	
	// Теперь храним контекст только по последней выбранной организации и каждый раз переопределяем его
	глПараметрыАвторизацииКурьер = Новый Соответствие;
	глПараметрыАвторизацииКурьер.Вставить(ПрофильНастройкиЭДО, ПараметрыАвторизации);
	
КонецПроцедуры

// Очищает AuthCookie
//
// Параметры:
//	ПрофильНастройкиЭДО     - Справочник.ККСНГ_Организации 
//	ПараметрыАвторизации    - Структура:
//								* СпособАвторизации
//								* AuthToken
//								* КонтекстТокена
//								* СертификатЭП
//
// Возвращаемое значение:
//	  Булево
//
Функция ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации) Экспорт
	
	Если Не ТипЗнч(ПараметрыАвторизации) = Тип("Структура") Или Не ПараметрыАвторизации.Свойство("НеобходимаПереинициализация") Тогда
		Результат = Ложь;
	Иначе
		ТекПараметрыАвторизации = ТекущиеПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО);
		Результат = Не ПустаяСтрока(ТекПараметрыАвторизации.КонтекстТокена.AuthCookie);
		ТекПараметрыАвторизации.КонтекстТокена.AuthCookie = "";	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыполнениеДействийКурьер

// Вызывает выполнение действий в СФЕРА Курьер для массива ЭД
//
// Параметры:
//	ИмяКоманды                   - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept"
//  ПрофильЭДООрганизации	     - СправочникСсылка.ККСНГ_Организации	 - ссылка на профиль ЭДО организации
//	ТребуетсяПодписаниеКвитанций - Булево
//	ЭлектронныеДокументы         - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//	УникальныйИдентификатор      - УИД для получения данных квитанций из хранилища
//	АдресХранилищаИОП            - Адрес данных квитанций
//
Процедура ВыполнитьДействиеКурьер(ИмяКоманды, Знач ПрофильЭДООрганизации, ТребуетсяПодписаниеКвитанций, Знач ЭлектронныеДокументы, УникальныйИдентификатор = Неопределено, АдресХранилищаИОП = Неопределено) Экспорт
	
	Если ТипЗнч(ЭлектронныеДокументы) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		ЭлектронныйДокумент = ЭлектронныеДокументы;
		ЭлектронныеДокументы = Новый Массив;
		ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
	ДополнительныеПараметры.Вставить("ТребуетсяПодписаниеКвитанций", ТребуетсяПодписаниеКвитанций);
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
	ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("АдресХранилищаИОП", АдресХранилищаИОП);
	
	ПослеАвторизации = Новый ОписаниеОповещения("ДействиеКурьерПродолжить", ККСНГ_ДокументооборотКлиент, ДополнительныеПараметры);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильЭДООрганизации, ПослеАвторизации);
	
КонецПроцедуры

// Обработчик команд электронного документа из Курьера
//
// Параметры:
//  ЭлектронныйДокумент - ККСНГ_ЭлектронныеДокументы - ссылка на электронный документ
//  ИмяКоманды - строка	 - имя команды СФЕРА Курьер
// 
// Возвращаемое значение:
//	Структура - поля структуры;
//			Успех - Булево - Результат выполнения операции
//			Результат - Структура, содержащая массив структур DocumentSign в одноименном поле
//			Журнал -
//
Функция ОбработатьКомандуКурьера(ИмяКоманды, ЭлектронныйДокумент, ПараметрыАвторизации, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Если ИмяКоманды = "КурьерSign" Тогда
			
			ФайлСсылка = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, ЭлектронныйДокумент);
			ДвоичныеДанные = ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ФайлСсылка);
			СтруктураДвоичныхДанных = Новый Структура("Данные", ДвоичныеДанные);
			ДанныеНаПодпись = Новый Структура("Данные,ИмяПоляДД,Представление", СтруктураДвоичныхДанных, "Данные", "Документ");
			
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияДвоичныеДанные", ЭтотОбъект, ДополнительныеПараметры);
			
			ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, "Подписание электронного документа", ПослеПодписания);
			
			Возврат Ложь;
			
		ИначеЕсли ИмяКоманды = "КурьерReject" Тогда
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляОтклонения", ЭтотОбъект, ДополнительныеПараметры);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Введите комментарий");
			
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , Оповещение);
			
			Возврат Ложь;
			
		ИначеЕсли ИмяКоманды = "КурьерRejectWithTicket" Тогда 
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляОтклоненияСКвитанцией", ЭтотОбъект, ДополнительныеПараметры);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Введите комментарий");
			
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , Оповещение);
			
			Возврат Ложь;
			
			// Подписать все квитанции документа
		ИначеЕсли ИмяКоманды = "КурьерПодписатьКвитанцииДокумента" Тогда
			
			КонтрагентыЭДО = Новый Соответствие;
			
			РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
			Если ПрофильЭДООрганизации = Неопределено Тогда
				ПрофильЭДООрганизации = РеквизитыДокумента.ОрганизацияЭДО;
			КонецЕсли;
			
			КвитанцииДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьКвитанцииДокумента(ЭлектронныйДокумент, Истина);
			Для каждого Квитанция Из КвитанцииДокумента Цикл
				КонтрагентыЭДО.Вставить(Квитанция, РеквизитыДокумента.КонтрагентЭДО);
			КонецЦикла;
			
			Если КвитанцииДокумента.Количество() Тогда
				ККСНГ_КвитанцииКлиент.ОтправитьОтветНаКвитанцию(КвитанцииДокумента, ПрофильЭДООрганизации, ПараметрыАвторизации, КонтрагентыЭДО);
			КонецЕсли;
			
			Возврат Ложь;
			
			// Титул покупателя
		ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicket" Тогда
			
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
			
			СтруктураДвоичныхДанных = Новый Структура();
			СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			СтруктураДвоичныхДанных.Вставить("Content", ПолучитьДвоичныеДанныеИзСтроки("null"));
			СтруктураДвоичныхДанных.Вставить("Filename");
			СтруктураДвоичныхДанных.Вставить("MimeType");
			
			ДанныеНаПодпись = Новый Структура("Данные,ИмяПоляДД,Представление", СтруктураДвоичныхДанных, "Content", "Документ");
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			
			ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
			ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияТитулаПокупателя", ЭтотОбъект, ДополнительныеПараметры);
			
			ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, "Подписание электронного документа с квитанцией", ПослеПодписания, ПередПодписанием);
			
			Возврат Ложь;
			
		ИначеЕсли ИмяКоманды = "КурьерAvoidanceRequest" Тогда
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляЗапросаОбАннулировании", ЭтотОбъект, ДополнительныеПараметры);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Введите причину аннулирования");
			
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , Оповещение); 
			
			Возврат Ложь;
			
		ИначеЕсли ИмяКоманды = "КурьерAcceptAvoidance" Тогда 
			
			КвитанцияПредложение = ККСНГ_ДокументооборотВызовСервера.ПолучитьПредложениеНаАннулированиеИзКвитанций(ЭлектронныйДокумент, ПараметрыАвторизации);
			
			Если КвитанцияПредложение.Успех Тогда
				
				ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
				
				ДанныеКвитанции = КвитанцияПредложение.Результат.Content;
				
				СтруктураДвоичныхДанных = Новый Структура();
				СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
				СтруктураДвоичныхДанных.Вставить("Content", ДанныеКвитанции.Content);
				СтруктураДвоичныхДанных.Вставить("Filename", ДанныеКвитанции.Filename);
				СтруктураДвоичныхДанных.Вставить("MimeType", ДанныеКвитанции.MimeType);
				
				ДанныеНаПодпись = Новый Структура("Данные,ИмяПоляДД,Представление", СтруктураДвоичныхДанных, "Content", СтруктураДвоичныхДанных.Filename);
				
				ДополнительныеПараметры = Новый Структура();
				ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
				ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
				ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
				
				ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияДвоичныеДанные", ЭтотОбъект, ДополнительныеПараметры);
				ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, "Подписание подтверждения аннулирования", ПослеПодписания);
				
			Иначе
				ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильЭДООрганизации, ПараметрыАвторизации);
				ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(КвитанцияПредложение.Журнал); 
			КонецЕсли;
			
			Возврат Ложь;
			
		ИначеЕсли ИмяКоманды = "КурьерRejectAvoidance" Тогда 
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляОтклоненияЗапросаОбАннулировании", ЭтотОбъект, ДополнительныеПараметры);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Введите причину отказа от аннулирования");
			
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , Оповещение); 
			
			Возврат Ложь;
			
		ИначеЕсли ИмяКоманды = "КурьерRevoke" Тогда 
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
			ДополнительныеПараметры.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			
			Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияОтзыва", ЭтотОбъект, ДополнительныеПараметры);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Введите причину отзыва");
			
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , Оповещение); 
			
			Возврат Ложь;
			
		Иначе
			ДополнительныеПараметры = Неопределено;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		
	КонецЕсли;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка команды " + ИмяКоманды + " для " + Строка(ЭлектронныйДокумент));
	Ошибка = "";
	РезультатВызоваКоманды = Неопределено;
	
	ВызовКоманды = ККСНГ_ДокументооборотВызовСервера.ВыполнитьКомандуКурьер(ИмяКоманды, ЭлектронныйДокумент, ДополнительныеПараметры, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ВызовКоманды.Журнал, Ложь);
	
	ОбработатьРезультатЭтапа(ВызовКоманды, ЭлектронныйДокумент, ПараметрыАвторизации);
	
	Возврат Ответ;
	
КонецФункции

// Обработчик команд электронного документа из Курьера
//
// Параметры:
//  ЭлектронныеДокументы - Массив - Массив ссылок на электронные документы
//  ИмяКоманды           - строка - Имя команды внутреннее
// 
// Возвращаемое значение:
//	Структура:
//		* Успех     - Булево - Результат выполнения операции
//		* Результат - Структура, содержащая массив структур DocumentSign в одноименном поле
//	    * Журнал    - Массив
//
Функция ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныеДокументы, ПараметрыАвторизации, ПрофильЭДООрганизации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяГруппы = "Обработка команды " + ИмяКоманды + " для массива электронных документов";
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ИмяГруппы);
	
	ЭлектронныеДокументы = ККСНГ_ОбщегоНазначенияКлиентСервер.МассивПоЗначению(ЭлектронныеДокументы);
	Если Не ЭлектронныеДокументы.Количество() Тогда
		Оповестить("ПослеКомандыСФЕРАКурьер");
		Возврат Ложь;
	КонецЕсли;
	
	КомандаОбработана = Ложь;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		
		Если ИмяКоманды = "КурьерSign" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерSign(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicket" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерAcceptWithTicket(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicketNoDisaccordSign" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерAcceptWithTicketNoDisaccordSign(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicketDisaccordSign" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерAcceptWithTicketDisaccordSign(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерReject" Тогда 
			КомандаОбработана = ОбработатьКомандуКурьерReject(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерRejectWithTicket" Тогда 
			КомандаОбработана = ОбработатьКомандуКурьерRejectWithTicket(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерПодписатьКвитанцииДокумента" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерПодписатьКвитанцииДокумента(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерAvoidanceRequest" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерAvoidanceRequest(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерAcceptAvoidance" Тогда
			КомандаОбработана = ОбработатьКомандуКурьерAcceptAvoidance(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерRejectAvoidance" Тогда 
			КомандаОбработана = ОбработатьКомандуКурьерRejectAvoidance(ЭлектронныеДокументы, ПараметрыАвторизации);
		ИначеЕсли ИмяКоманды = "КурьерRevoke" Тогда 
			КомандаОбработана = ОбработатьКомандуКурьерRevoke(ЭлектронныеДокументы, ПараметрыАвторизации);
		Иначе
			КомандаОбработана = Ложь;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		
	КонецЕсли;
	
	Если КомандаОбработана Тогда
		Ответ.Успех = Истина;
		Возврат Ответ;
	КонецЕсли;
	
	// Команда обработана и передано управление на выполнение (интерактив, подписание 1с)
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		ВызовКоманды = ККСНГ_ДокументооборотВызовСервера.ВыполнитьКомандуКурьер(ИмяКоманды, ЭлектронныйДокумент, ДополнительныеПараметры, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ВызовКоманды.Журнал, Ложь);
		
		ОбработатьРезультатЭтапа(ВызовКоманды, ЭлектронныйДокумент, ПараметрыАвторизации);
		
	КонецЦикла;
	
	Оповестить("ПослеКомандыСФЕРАКурьер");
	
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Авторизация

// Получает сертификат в настройки авторизации
//
// Параметры:
//  ПараметрыАвторизации   - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
// Возвращаемое значение: 
//  Структура, см.  ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета() 
//  Результат
//  Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования если есть в ИБ
//  либо структура Certificate, см. https://confluence.esphere.ru/display/SBER/Certificate
//
Функция ДополнитьПараметрыАвторизацииСертификатомЭП(ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросСертификатаЭП = ККСНГ_ДокументооборотВызовСервера.ПолучитьСертификатКлючаЭП(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСертификатаЭП.Журнал, Ложь);
	Ответ.Успех = ЗапросСертификатаЭП.Успех;
	Ответ.Результат = ЗапросСертификатаЭП.Результат;
	
	Если ЗапросСертификатаЭП.Успех Тогда
		
		ПараметрыАвторизации.СертификатЭП = ЗапросСертификатаЭП.Результат; 
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает настройку из глобальной переменной глПараметрыАвторизацииКурьер
//
// Параметры:
//  ПрофильНастройкиЭДО    - Справочник.ККСНГ_Организации
//
// Возвращаемое значение: 
//  ПараметрыАвторизации   - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Функция ТекущиеПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО) Экспорт
	
	ИнициализироватьПараметрыАвторизации();
	ПараметрыАвторизации = глПараметрыАвторизацииКурьер.Получить(ПрофильНастройкиЭДО);
	
	Возврат ПараметрыАвторизации;
	
КонецФункции

// Инициализация глобальной переменной глПараметрыАвторизацииКурьер
//
// Параметры:
//	нет
//
Процедура ИнициализироватьПараметрыАвторизации() Экспорт
	
	Если глПараметрыАвторизацииКурьер = Неопределено Тогда
		глПараметрыАвторизацииКурьер = Новый Соответствие;
	КонецЕсли;	
	
КонецПроцедуры

// Получение параметров авторизации ЛКК 
//
// Параметры:
//	Результат                - Структура                 - см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета() 
//	ДополнительныеПараметры  - Структура:
// 								* ПрофильНастройкиЭДО    - Справочник.ККСНГ_Организации
// 								* ОповещениеОЗавершении  - Оповещение
// 								* ПараметрыАвторизации   - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершитьПолучениеПараметровАвторизации(Результат, ДополнительныеПараметры) Экспорт
	
	ОповещениеОЗавершении = Неопределено;
	ДополнительныеПараметры.Свойство("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если Не Результат.Успех Тогда
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, Результат.ОписаниеОшибки, "GT-00000");
		
		Если ОповещениеОЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеАвторизации = Результат.Результат;
	ПараметрыАвторизации = ДополнительныеПараметры.ПараметрыАвторизации;
	ПараметрыАвторизации.КонтекстТокена = ДанныеАвторизации.КонтекстТокена;
	
	ПрофильНастройкиЭДО = Неопределено;
	
	Если ДополнительныеПараметры.Свойство("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО) Тогда
		
		// Проверяем соответствие сертификата организации 
		ЗапросПроверки = ККСНГ_ДокументооборотВызовСервера.ПроверитьСоответствиеОрганизацииКурьеру(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		Если Не ЗапросПроверки.Успех Тогда
			
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПроверки.Журнал);
			
			Если ОповещениеОЗавершении <> Неопределено Тогда
				ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
		ДополнитьПараметрыАвторизацииСертификатомЭП(ПараметрыАвторизации);
		ОбновитьПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		
	КонецЕсли;
	
	Ответ.Успех = Истина;
	Ответ.Результат = ПараметрыАвторизации;
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Ответ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиОрганизации

// Проверка на наличие хотя бы 1 настроенного профиля контрагента ЭДО в ИБ
//
// Параметры:
//	ПрофильНастройкиЭДО   - Справочник.ККСНГ_Организации 
//	Отказ                 - Булево
//
Процедура ПроверитьНаличиеКонтрагентовЭДО(Знач ПрофильЭДООрганизации, Отказ = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ПрофильЭДООрганизации) И Не ККСНГ_ДокументооборотВызовСервера.НаличиеНастроенныхКонтрагентовЭДО(ПрофильЭДООрганизации) Тогда
		Отказ = Истина;
		ТекстПредупреждения = ТекстОбОтсутствииКонтрагентовЭДО(Ложь);
		ПоказатьПредупреждение(, ТекстПредупреждения, , "Не настроены контрагенты ЭДО");
	КонецЕсли;
	
КонецПроцедуры

// Проверка на наличие хотя бы 1 настроенного профиля организации ЭДО в ИБ
//
// Параметры:
//	ОтказПриПроверке - Булево
//
Процедура ПроверитьНаличиеОрганизацийЭДО(ОтказПриПроверке = Ложь) Экспорт
	
	Если Не ККСНГ_ДокументооборотВызовСервера.НаличиеНастроенныхОрганизацийЭДО() Тогда
		
		ОтказПриПроверке = Истина;
		
		ТекстПредупреждения = ТекстОбОтсутствииОрганизацийЭДО();
		ПоказатьПредупреждение(, ТекстПредупреждения, , "Не настроены организации ЭДО");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Обновляет уже записанные ЭД с сервера СФЕРА Курьер включая квитанции
//
// Параметры:
//  ЭлектронныеДокументы   - Массив - СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//  ПрофильНастройкиЭДО    - Справочник.ККСНГ_Организации
//  ПараметрыАвторизации   - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
// Возвращаемое значение: 
//
Функция ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Запрос = ККСНГ_ДокументооборотВызовСервера.ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы, ПрофильЭДООрганизации, ПараметрыАвторизации);
	Если Запрос.Успех Тогда
		Для каждого ЭлектронныйДокумент Из Запрос.Результат Цикл
			Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

// Вызывает выполнение действий в СФЕРА Курьер для массива ЭД
//
// Параметры:
//	ЗапросПараметрыАвторизации - Структура - см ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//	ДополнительныеПараметры    - Структура:
//									* ИмяКоманды                   - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept"
//									* ПрофильЭДООрганизации	       - СправочникСсылка.ККСНГ_Организации	 - ссылка на профиль ЭДО организации
//									* ТребуетсяПодписаниеКвитанций - Булево
//									* ЭлектронныеДокументы         - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//									* УникальныйИдентификатор      - УИД для получения данных квитанций из хранилища
//									* АдресХранилищаИОП            - Адрес данных квитанций
//
Процедура ДействиеКурьерПродолжить(ЗапросПараметрыАвторизации, ДополнительныеПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
		ТребуетсяПодписаниеКвитанций = ДополнительныеПараметры.ТребуетсяПодписаниеКвитанций;
		УникальныйИдентификатор = ДополнительныеПараметры.УникальныйИдентификатор;
		ПрофильЭДООрганизации = ДополнительныеПараметры.ПрофильЭДООрганизации;
		АдресХранилищаИОП = ДополнительныеПараметры.АдресХранилищаИОП;
		ЭлектронныеДокументы = ДополнительныеПараметры.ЭлектронныеДокументы;
		
		Если ТребуетсяПодписаниеКвитанций Тогда
			
			ККСНГ_ДокументооборотКлиент.ОбработатьКомандуКурьерПодписатьКвитанцииДокумента(ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды, УникальныйИдентификатор);
			
		Иначе
			
			Если ИмяКоманды = "КурьерAccept" Тогда
				
				ЭлектронныеДокументыAccept = ККСНГ_ЭлектронныеДокументыВызовСервера.ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, "Accept");
				ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныеДокументыAccept, ПараметрыАвторизации, ПрофильЭДООрганизации);
				
			ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicketNoDisaccordSign" Тогда
				
				ОбработатьКомандуКурьераМассово("КурьерAcceptWithTicketNoDisaccordSign", ЭлектронныеДокументы, ПараметрыАвторизации, ПрофильЭДООрганизации);
				
			ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicketDisaccordSign" Тогда
				
				ОбработатьКомандуКурьераМассово("КурьерAcceptWithTicketDisaccordSign", ЭлектронныеДокументы, ПараметрыАвторизации, ПрофильЭДООрганизации);
				
			ИначеЕсли ИмяКоманды = "КурьерReject" Тогда
				
				ЭлектронныеДокументыReject = ККСНГ_ЭлектронныеДокументыВызовСервера.ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, "Reject, RejectWithTicket");
				Если ЭлектронныеДокументыReject.Количество() Тогда
					ОбработатьКомандуКурьераМассово("КурьерReject", ЭлектронныеДокументыReject, ПараметрыАвторизации, ПрофильЭДООрганизации);
				КонецЕсли;
				
			Иначе
				ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныеДокументы, ПараметрыАвторизации, ПрофильЭДООрганизации);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает команду Sign/AcceptWithTicket  в СФЕРА Курьер для массива ЭД
//
// Параметры:
//	Результат                - Структура - см описание ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные()
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеМассовогоПодписания(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ПараметрыАвторизации;
	Перем Signature, ЭлементНабораДанных, ИмяКоманды, ЭлектронныйДокумент, ПрофильЭДООрганизации;
	Перем СвойстваПодписи, Подпись, КонтекстТокена, Доверенность;
	
	ПараметрыАвторизации = ДополнительныеПараметры.ПараметрыАвторизации;
	
	Если Не Результат.Успех Тогда
		
		Если Результат.Свойство("НаборДанных") Тогда
			ОбработатьРезультатЭтапа(Результат, ДополнительныеПараметры.ЭлектронныеДокументы, ПараметрыАвторизации);
		Иначе
			ОбработатьРезультатЭтапа(Результат, ДополнительныеПараметры.ЭлектронныйДокумент, ПараметрыАвторизации);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Свойство("НаборДанных") Тогда
		
		Для каждого ЭлементНабораДанных Из Результат.НаборДанных Цикл
			
			Signature = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_Signature");
			
			Если Не ЭлементНабораДанных.Успех Тогда
				ОбработатьРезультатЭтапа(ЭлементНабораДанных.РезультатЭтапа, ЭлементНабораДанных.ЭлектронныйДокумент, ПараметрыАвторизации);
				Продолжить;
			КонецЕсли;
			
			ИмяКоманды = ЭлементНабораДанных.ИмяКоманды;
			ЭлектронныйДокумент = ЭлементНабораДанных.ЭлектронныйДокумент;
			ПрофильЭДООрганизации = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
			
			СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(ЭлементНабораДанных);
			Подпись = СвойстваПодписи.Подпись;
			
			// Машиночитаемая доверенность
			Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
				
				Signature.MchdUuid = ЭлементНабораДанных.ДанныеПодписанта.МЧД.Номер;
				Signature.MchdAccessMode = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИнформационнаяСистема;
				
				Если Не ПустаяСтрока(ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННДоверителя) Тогда
					Signature.MchdInn = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННДоверителя;
				КонецЕсли;
				
				Если Не ПустаяСтрока(ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННПредставителя) Тогда
					Signature.MchdConfidantInn = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННПредставителя;
				КонецЕсли;
				
				Для каждого Доверенность Из ЭлементНабораДанных.ДанныеПодписанта.МЧД.Цепочка Цикл
					
					SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
					
					SignatureMchd.MchdUuid = Доверенность.Номер;
					SignatureMchd.MchdAccessMode = Доверенность.ИнформационнаяСистема;
					Если Не ПустаяСтрока(Доверенность.ИННДоверителя) Тогда
						SignatureMchd.MchdInn = Доверенность.ИННДоверителя;
					КонецЕсли;
					Если Не ПустаяСтрока(Доверенность.ИННПредставителя) Тогда
						SignatureMchd.MchdConfidantInn = Доверенность.ИННПредставителя;
					КонецЕсли;
					
					Signature.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Пакет") = 0 Тогда
				
				Signature.MchdFileName = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИмяФайлаДоверенности;
				Signature.MchdFile = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ФайлДоверенности;
				Signature.MchdSignature = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ФайлПодписи;
				
				Для каждого Доверенность Из ЭлементНабораДанных.ДанныеПодписанта.МЧД.Цепочка Цикл
					
					Если Доверенность.ЕстьФайлДоверенности И Доверенность.ЕстьФайлПодписи Тогда
						
						SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
						
						SignatureMchd.MchdFileName = Доверенность.ИмяФайлаДоверенности;
						SignatureMchd.MchdFile = Доверенность.ФайлДоверенности;
						SignatureMchd.MchdSignature = Доверенность.ФайлПодписи;
						
						Signature.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ИмяКоманды = "КурьерSign" Тогда
				
				Signature.Вставить("Uuid", "");
				Signature.Вставить("SignerCode", "");
				Signature.Вставить("Content", Подпись);
				
				ДополнительныеПараметры.Вставить("Signature", Signature);
				ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныйДокумент, ПараметрыАвторизации, ПрофильЭДООрганизации, ДополнительныеПараметры);
				
			ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicket" Тогда
				
				Signature.Вставить("Filename", ЭлементНабораДанных.Filename);
				Signature.Вставить("MimeType", ЭлементНабораДанных.MimeType);
				Signature.Вставить("Content", ЭлементНабораДанных.Content);
				Signature.Вставить("Signature", Подпись);
				
				ДополнительныеПараметры.Вставить("Signature", Signature);
				ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныйДокумент, ПараметрыАвторизации, ПрофильЭДООрганизации, ДополнительныеПараметры);
				
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывает команду в СФЕРА Курьер для массива ЭД после подписания ДД
//
// Параметры:
//	Результат                - Структура - см описание ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные()
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеПодписанияДвоичныеДанные(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ПараметрыАвторизации, ИмяКоманды;
	Перем ДанныеПодписанта, Signature, ЭлементНабораДанных;
	Перем СвойстваПодписи, ЭлектронныйДокумент, РеквизитыДокумента, Доверенность;
	
	ПараметрыАвторизации = ДополнительныеПараметры.ПараметрыАвторизации;
	ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
	
	Если Результат.Успех Тогда
		
		Если Результат.Свойство("НаборДанных") Тогда
			
			Для каждого ЭлементНабораДанных Из Результат.НаборДанных Цикл
				
				Signature = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_Signature");
				
				СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(ЭлементНабораДанных);
				Signature.Content = СвойстваПодписи.Подпись;
				
				ЭлектронныйДокумент = ЭлементНабораДанных.ЭлектронныйДокумент;
				
				РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
				
				// Машиночитаемая доверенность
				Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
					
					Signature.MchdUuid = ЭлементНабораДанных.ДанныеПодписанта.МЧД.Номер;
					Signature.MchdAccessMode = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИнформационнаяСистема;
					
					Если Не ПустаяСтрока(ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННДоверителя) Тогда
						Signature.MchdInn = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННДоверителя;
					КонецЕсли;
					
					Если Не ПустаяСтрока(ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННПредставителя) Тогда
						Signature.MchdConfidantInn = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННПредставителя;
					КонецЕсли;
					
					Для каждого Доверенность Из ЭлементНабораДанных.ДанныеПодписанта.МЧД.Цепочка Цикл
						
						SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
						
						SignatureMchd.MchdUuid = Доверенность.Номер;
						SignatureMchd.MchdAccessMode = Доверенность.ИнформационнаяСистема;
						
						Если Не ПустаяСтрока(Доверенность.ИННДоверителя) Тогда
							SignatureMchd.MchdInn = Доверенность.ИННДоверителя;
						КонецЕсли;
						
						Если Не ПустаяСтрока(Доверенность.ИННПредставителя) Тогда
							SignatureMchd.MchdConfidantInn = Доверенность.ИННПредставителя;
						КонецЕсли;
						
						Signature.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Пакет") = 0 Тогда
					
					Signature.MchdFileName = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИмяФайлаДоверенности;
					Signature.MchdFile = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ФайлДоверенности;
					Signature.MchdSignature = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ФайлПодписи;
					
					Для каждого Доверенность Из ЭлементНабораДанных.ДанныеПодписанта.МЧД.Цепочка Цикл
						
						Если Доверенность.ЕстьФайлДоверенности И Доверенность.ЕстьФайлПодписи Тогда
							
							SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
							
							SignatureMchd.MchdFileName = Доверенность.ИмяФайлаДоверенности;
							SignatureMchd.MchdFile = Доверенность.ФайлДоверенности;
							SignatureMchd.MchdSignature = Доверенность.ФайлПодписи;
							
							Signature.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				ДополнительныеПараметры.Вставить("Signature", Signature);
				ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныйДокумент, ПараметрыАвторизации, РеквизитыДокумента.ОрганизацияЭДО, ДополнительныеПараметры);
				
			КонецЦикла;
			
		Иначе
			
			ВызватьИсключение("Ошибка заполнения данных для подписания одичночного документа");
			
		КонецЕсли;
		
	Иначе
		
		Если ДополнительныеПараметры.Свойство("ЭлектронныеДокументы") Тогда
			Для каждого ЭлектронныйДокумент Из ДополнительныеПараметры.ЭлектронныеДокументы Цикл
				ОбработатьРезультатЭтапа(Результат, ЭлектронныйДокумент, ПараметрыАвторизации);
			КонецЦикла;
		Иначе
			ОбработатьРезультатЭтапа(Результат, ДополнительныеПараметры.ЭлектронныйДокумент, ПараметрыАвторизации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывает команду в СФЕРА Курьер после ввода комментария
//
// Параметры:
//	Результат                - Строка
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеВводаКомментарияДляОтклонения(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды;
	Перем КомандаОтбора, ОбщийМодуль, ЭлектронныеДокументыБезПодписи, ЭлектронныеДокументыДляПодписи;
	Перем ЭлектронныеДокументНедоступные, ЭлектронныйДокументНедоступный, ЭлектронныйДокумент;
	
	ЭлектронныеДокументы = ПолучитьЭлектронныеДокументыИзДополнительныхПараметров(ДополнительныеПараметры);
	
	Если Не Результат = Неопределено Тогда
		
		ДополнительныеПараметры.Вставить("comment", Результат);
		ПараметрыАвторизации = ДополнительныеПараметры.ПараметрыАвторизации;
		ИмяКоманды = ДополнительныеПараметры.ИмяКоманды;
		
		Если ИмяКоманды = "КурьерReject" Тогда
			
			КомандаОтбора = "Reject";
			ОбщийМодуль = ККСНГ_ЭлектронныеДокументыВызовСервера;
			ЭлектронныеДокументыБезПодписи = ОбщийМодуль.ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, КомандаОтбора);
			ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныеДокументыБезПодписи, ПараметрыАвторизации, , ДополнительныеПараметры);
			
			КомандаОтбора = КомандаОтбора + "WithTicket";
			ЭлектронныеДокументыДляПодписи = ОбщийМодуль.ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, КомандаОтбора);
			ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументыДляПодписи);
			ДополнительныеПараметры.Вставить("ИмяКоманды", "Курьер" + КомандаОтбора);
			ЗавершениеВводаКомментарияДляОтклоненияСКвитанцией(Результат, ДополнительныеПараметры);
			
			ЭлектронныеДокументНедоступные = ПолучитьОтсутствующиеЭлементы(ЭлектронныеДокументы, ЭлектронныеДокументыБезПодписи, ЭлектронныеДокументыДляПодписи);
			
			Для каждого ЭлектронныйДокументНедоступный Из ЭлектронныеДокументНедоступные Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю("Команда отклонения недоступна для документа " + Строка(ЭлектронныйДокументНедоступный));	
			КонецЦикла;
			
		Иначе
			ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныеДокументы, ПараметрыАвторизации, , ДополнительныеПараметры);
		КонецЕсли;
		
	Иначе
		
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Подписание двоичных данных после ввода комментария
//
// Параметры:
//  Результат				 - 	 - Строка
//  ДополнительныеПараметры	 - 	 - Структура:
//  	* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept"
//  	* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//  	* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеВводаКомментарияДляОтклоненияСКвитанцией(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументы, ЭлектронныйДокумент;
	Перем ДанныеПодписанта, ПараметрыАвторизации, ОрганизацияЭДО;
	Перем ДанныеНаПодпись, ЗапросКвитанции, ИмяФайлаКвитанции;
	Перем ПередПодписанием, ПослеПодписания;
	Перем Сертификат, КонтекстТокена, ВыбранныйСертификат;
	Перем РеквизитыДокумента, ЗапросДанныхПодписанта, MchdData;
	
	Если ДополнительныеПараметры.Свойство("ЭлектронныеДокументы") Тогда
		ЭлектронныеДокументы = ДополнительныеПараметры.ЭлектронныеДокументы;
	Иначе
		ЭлектронныеДокументы = Новый Массив;
		ЭлектронныеДокументы.Добавить(ДополнительныеПараметры.ЭлектронныйДокумент);
	КонецЕсли;
	
	Если Не ЭлектронныеДокументы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	ПараметрыАвторизации = ДополнительныеПараметры.ПараметрыАвторизации;
	
	// Получаем сертификат из параметров авторизации
	Если ПараметрыАвторизации.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка") Тогда
		КонтекстТокена = ПараметрыАвторизации.КонтекстТокена;
		Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КонтекстТокена, "СертификатЭП", Неопределено);
	Иначе
		Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации, "СертификатЭП", Неопределено);
		Если ТипЗнч(Сертификат) <> Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Или Сертификат.Пустая() Тогда
			Сертификат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Сертификат", Сертификат);
	ДополнительныеПараметры.Вставить("comment", Результат); // Комментария для отклонения
	
	ДанныеНаПодпись = Новый Структура();
	ДанныеНаПодпись.Вставить("МассивДанных", Новый Массив);
	ДанныеНаПодпись.Вставить("Представление", "Массовое подписание электронных документов с квитанциями");
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
		Если Не ЗначениеЗаполнено(ОрганизацияЭДО) Тогда
			ОрганизацияЭДО = РеквизитыДокумента.ОрганизацияЭДО;
		КонецЕсли;
		
		Если Сертификат <> Неопределено Тогда
		
			// Машиночитаемая доверенность
			ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ОрганизацияЭДО, РеквизитыДокумента.КонтрагентЭДО, Сертификат);
			Если Не ЗапросДанныхПодписанта.Успех Тогда
				
				ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
				Если ПоследняяОшибка <> Неопределено Тогда
					ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				Иначе
					ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
				КонецЕсли;
				
				Возврат;
				
			КонецЕсли;
			
			ДанныеПодписанта = ЗапросДанныхПодписанта.Результат;
			
			// Данные МЧД для создания квитанций
			Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "НеОтправлять") <> 0 Тогда
				
				MchdData = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_MchdData");
				MchdData.Uuid = ДанныеПодписанта.МЧД.Номер;
				MchdData.StartDate = ДанныеПодписанта.МЧД.ДатаНачала;
				
				Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда 
					MchdData.MchdViewType = "Meta";
					MchdData.AccessMode = ДанныеПодписанта.МЧД.ИнформационнаяСистема;
				Иначе
					MchdData.MchdViewType = "File";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗапросКвитанции = ККСНГ_ДокументооборотВызовСервера.ПолучитьУведомлениеОбУточненииДляДокумента(ЭлектронныйДокумент, Результат, ПараметрыАвторизации, MchdData);
		
		Если ЗапросКвитанции.Успех Тогда
			
			ИмяФайлаКвитанции = ЗапросКвитанции.Результат.Filename;
			
			ЗапросКвитанции.Результат.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			ЗапросКвитанции.Результат.Вставить("ДанныеПодписанта", ДанныеПодписанта);
			
			ЭлементДанныхНаПодпись = Новый Структура();
			ЭлементДанныхНаПодпись.Вставить("Данные", ЗапросКвитанции.Результат);
			ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
			ЭлементДанныхНаПодпись.Вставить("Представление", ИмяФайлаКвитанции);
			
			ДополнительныеПараметры.Вставить("Filename", ИмяФайлаКвитанции);
			ДополнительныеПараметры.Вставить("MimeType", ЗапросКвитанции.Результат.MimeType);
			ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерRejectWithTicket");
			ДополнительныеПараметры.Вставить("Успех", Истина);
			
			ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
			ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияТитулаПокупателя", ЭтотОбъект, ДополнительныеПараметры);
			
			ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
			
		Иначе
			ОбработатьРезультатЭтапа(ЗапросКвитанции, ЭлектронныйДокумент, ПараметрыАвторизации);
		КонецЕсли;
		
	КонецЦикла;
	
	ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание уведомления об уточнении", ПослеПодписания, ПередПодписанием);
	
КонецПроцедуры

// Инициализация титула по данным электронного документа
//
// Параметры:
//  Параметры				 - 	 - Структура
//  	* ОписаниеДанных       - Структура
//  	* Оповещение
//  ДополнительныеПараметры	 - 	 - Структура:
//  	* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept"
//  	* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
//  	* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ПередПодписаниемТитуловИКвитанцийПокупателя(Параметры, ДополнительныеПараметры) Экспорт
	
	Перем ПереданныйСертификат, ВыбранныйСертификат, СодержаниеОперации;
	Перем Сертификат, ПараметрыАвторизации, ИмяКоманды, MchdData;
	Перем ЭлементНабораДанных, ЭлектронныйДокумент, РеквизитыДокумента;
	Перем ЗапросДанныхПодписанта, ПоследняяОшибка, ТекстСообщения;
	Перем ЗапросКвитанции, ЗапросТитула, СодержимоеТитула, ИмяПоляДД, ТребуетсяЗапросКвитанции;
	
	ПереданныйСертификат = Параметры.ОписаниеДанных.ВыбранныйСертификат;
	
	Если ПереданныйСертификат.Свойство("Ссылка") Тогда
		ВыбранныйСертификат = ПереданныйСертификат.Ссылка;
	Иначе
		ВыбранныйСертификат = ПереданныйСертификат;
	КонецЕсли;
	
	СодержаниеОперации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СодержаниеОперации");
	ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
	Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Сертификат"); // Сертификат из параметров авторизации
	ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяКоманды");
	
	НаборДанных = Новый Массив;
	Если Параметры.ОписаниеДанных.Свойство("НаборДанных") Тогда
		НаборДанных = Параметры.ОписаниеДанных.НаборДанных;
	Иначе
		НаборДанных.Добавить(Параметры.ОписаниеДанных);
	КонецЕсли;
	
	ТребуетсяЗапросКвитанции = Ложь;
	
	Для каждого ЭлементНабораДанных Из НаборДанных Цикл
		
		ЭлектронныйДокумент = ЭлементНабораДанных.ЭлектронныйДокумент;
		
		// Переопределям для комманды AcceptWithTicketSign. В наборе данных могут быть документы с командой КурьерSign или КурьерAcceptWithTicket
		Если ЭлементНабораДанных.Свойство("ИмяКоманды") Тогда
			ИмяКоманды = ЭлементНабораДанных.ИмяКоманды;
		КонецЕсли;
		
		// Получаем данные подписанта если был выбран сертификат отличающийся от сертификата в параметрах авторизации
		Если Сертификат <> ВыбранныйСертификат Тогда
			
			// Машиночитаемая доверенность
			РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
			
			ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(РеквизитыДокумента.ОрганизацияЭДО, РеквизитыДокумента.КонтрагентЭДО, ВыбранныйСертификат);
			Если Не ЗапросДанныхПодписанта.Успех Тогда
				
				ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
				Если ПоследняяОшибка <> Неопределено Тогда
					ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				Иначе
					ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
				КонецЕсли;
				Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
				
				Прервать;
				
			КонецЕсли;
			
			ТребуетсяЗапросКвитанции = Истина;
			
			ЭлементНабораДанных.Вставить("ДанныеПодписанта", ЗапросДанныхПодписанта.Результат);
			
			// Данные МЧД для создания квитанций
			Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "НеОтправлять") <> 0 Тогда
				
				MchdData = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_MchdData");
				MchdData.Uuid = ЭлементНабораДанных.ДанныеПодписанта.МЧД.Номер;
				MchdData.StartDate = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ДатаНачала;
				
				Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
					MchdData.MchdViewType = "Meta";
					MchdData.AccessMode = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИнформационнаяСистема;
				Иначе
					MchdData.MchdViewType = "File";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИмяКоманды = "КурьерRejectWithTicket" И ТребуетсяЗапросКвитанции Тогда // Отклонение с подписанием
			
			ЗапросКвитанции = ККСНГ_ДокументооборотВызовСервера.ПолучитьУведомлениеОбУточненииДляДокумента(ЭлектронныйДокумент, ДополнительныеПараметры.comment, ПараметрыАвторизации, MchdData);
			
			Если ЗапросКвитанции.Успех Тогда
				
				ЗаполнитьЗначенияСвойств(ЭлементНабораДанных, ЗапросКвитанции.Результат);
				ЭлементНабораДанных.Вставить("Данные", ЭлементНабораДанных.Content);
				ЭлементНабораДанных.Вставить("Представление",  ЭлементНабораДанных.Filename);
				
			КонецЕсли;
			
		ИначеЕсли ИмяКоманды = "КурьерRejectAvoidance" И ТребуетсяЗапросКвитанции Тогда // Отклонение запроса на аннулирование
			
			ЗапросКвитанции = ККСНГ_ДокументооборотВызовСервера.ПолучитьУОУНаПредложениеОбАннулированииДляДокумента(ЭлектронныйДокумент, ДополнительныеПараметры.comment, ПараметрыАвторизации, MchdData);
			
			Если ЗапросКвитанции.Успех Тогда
				
				ЗаполнитьЗначенияСвойств(ЭлементНабораДанных, ЗапросКвитанции.Результат);
				ЭлементНабораДанных.Вставить("Данные", ЭлементНабораДанных.Content);
				ЭлементНабораДанных.Вставить("Представление",  ЭлементНабораДанных.Filename);
				
			КонецЕсли;
			
		ИначеЕсли ИмяКоманды = "КурьерAvoidanceRequest" И ТребуетсяЗапросКвитанции Тогда // Запрос на аннулирование
			
			ЗапросКвитанции = ККСНГ_ДокументооборотВызовСервера.ПолучитьПредложениеОбАннулированииДляДокумента(ЭлектронныйДокумент, ДополнительныеПараметры.comment, ПараметрыАвторизации);
			
			Если ЗапросКвитанции.Успех Тогда
				
				ЗаполнитьЗначенияСвойств(ЭлементНабораДанных, ЗапросКвитанции.Результат);
				ЭлементНабораДанных.Вставить("Данные", ЭлементНабораДанных.Content);
				ЭлементНабораДанных.Вставить("Представление",  ЭлементНабораДанных.Filename);
				
			КонецЕсли;
			
		ИначеЕсли ИмяКоманды = "КурьерAcceptWithTicket" Тогда // Подписание титула покупателя
			
			ДанныеПодписанта = ЭлементНабораДанных.ДанныеПодписанта;
			ЗапросТитула = ККСНГ_ДокументооборотВызовСервера.ПолучитьТитулПокупателяДляДокумента(ЭлектронныйДокумент, ВыбранныйСертификат, ПараметрыАвторизации, СодержаниеОперации, ДанныеПодписанта);
			
			Если ЗапросТитула.Успех Тогда
				
				СодержимоеТитула = ЗапросТитула.Результат.Content;
				ЭлементНабораДанных.Данные = СодержимоеТитула;
				// Также обновляем поле, содержащее ДД (см. ОбработатьКомандуКурьера).
				ИмяПоляДД = ЭлементНабораДанных.ИмяПоляДД;
				ЭлементНабораДанных[ИмяПоляДД] = СодержимоеТитула;
				
				ЭлементНабораДанных.Filename = ЗапросТитула.Результат.Filename;
				ЭлементНабораДанных.MimeType = ЗапросТитула.Результат.MimeType;
				
				ДополнительныеПараметры.Вставить("Filename", ЗапросТитула.Результат.Filename);
				ДополнительныеПараметры.Вставить("MimeType", ЗапросТитула.Результат.MimeType);
				
			Иначе 
				
				ЭлементНабораДанных.Вставить("РезультатЭтапа", ЗапросТитула);
				
			КонецЕсли;
			ЭлементНабораДанных.Вставить("Успех", ЗапросТитула.Успех);
			
		Иначе
			ЭлементНабораДанных.Вставить("Успех", Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, Параметры);
	
КонецПроцедуры

// Вызывает выполнение действий в СФЕРА Курьер после подписания ДД 
//
// Параметры:
//	Результат                - Структура
// 							    * Успех                - Булево
// 							    * НаборДанных          - Массив - подписанные данные 
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеПодписанияТитулаПокупателя(Результат, ДополнительныеПараметры) Экспорт
	
	Перем Signature, ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды;
	Перем ЭлементНабораДанных, ЭлектронныйДокумент, ОрганизацияЭДО;
	Перем СвойстваПодписи, Подпись, Доверенность;
	Перем РезультатЭтапа, РезультатЭтапаУспех;
	
	ЭлектронныеДокументы = ПолучитьЭлектронныеДокументыИзДополнительныхПараметров(ДополнительныеПараметры);
	ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
	ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяКоманды");
	
	Если Результат.Успех И ДополнительныеПараметры.Успех Тогда
		
		Если Результат.Свойство("НаборДанных") Тогда
			
			Для каждого ЭлементНабораДанных Из Результат.НаборДанных Цикл
				
				Signature = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_Signature");
				
				ЭлектронныйДокумент = ЭлементНабораДанных.ЭлектронныйДокумент;
				ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
				
				СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(ЭлементНабораДанных);
				Подпись = СвойстваПодписи.Подпись;
				
				Signature.Вставить("Filename", ЭлементНабораДанных.Filename);
				Signature.Вставить("MimeType", ЭлементНабораДанных.MimeType);
				Signature.Вставить("Content", ЭлементНабораДанных.Content);
				Signature.Вставить("Signature", Подпись);
				
				// Машиночитаемая доверенность
				Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
					
					Signature.MchdUuid = ЭлементНабораДанных.ДанныеПодписанта.МЧД.Номер;
					Signature.MchdAccessMode = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИнформационнаяСистема;
					
					Если Не ПустаяСтрока(ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННДоверителя) Тогда
						Signature.MchdInn = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННДоверителя;
					КонецЕсли;
					
					Если Не ПустаяСтрока(ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННПредставителя) Тогда
						Signature.MchdConfidantInn = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИННПредставителя;
					КонецЕсли;
					
					Для каждого Доверенность Из ЭлементНабораДанных.ДанныеПодписанта.МЧД.Цепочка Цикл
						
						SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
						
						SignatureMchd.MchdUuid = Доверенность.Номер;
						SignatureMchd.MchdAccessMode = Доверенность.ИнформационнаяСистема;
						
						Если Не ПустаяСтрока(Доверенность.ИННДоверителя) Тогда
							SignatureMchd.MchdInn = Доверенность.ИННДоверителя;
						КонецЕсли;
						
						Если Не ПустаяСтрока(Доверенность.ИННПредставителя) Тогда
							SignatureMchd.MchdConfidantInn = Доверенность.ИННПредставителя;
						КонецЕсли;
						
						Signature.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Пакет") = 0 Тогда
					
					Signature.MchdFileName = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИмяФайлаДоверенности;
					Signature.MchdFile = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ФайлДоверенности;
					Signature.MchdSignature = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ФайлПодписи;
					
					Для каждого Доверенность Из ЭлементНабораДанных.ДанныеПодписанта.МЧД.Цепочка Цикл
						
						Если Доверенность.ЕстьФайлДоверенности И Доверенность.ЕстьФайлПодписи Тогда
							
							SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
							
							SignatureMchd.MchdFileName = Доверенность.ИмяФайлаДоверенности;
							SignatureMchd.MchdFile = Доверенность.ФайлДоверенности;
							SignatureMchd.MchdSignature = Доверенность.ФайлПодписи;
							
							Signature.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				ДополнительныеПараметры.Вставить("Signature", Signature);
				ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныйДокумент, ПараметрыАвторизации, ОрганизацияЭДО, ДополнительныеПараметры);
				
			КонецЦикла;
			
		Иначе
			
			ВызватьИсключение("Ошибка заполнения данных для подписания одичночного документа");
			
		КонецЕсли;
		
	Иначе
		
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			
			РезультатЭтапа = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "РезультатЭтапа", Новый Структура);
			РезультатЭтапаУспех = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЭтапа, "Успех", Истина);
			Если Не РезультатЭтапаУспех Тогда
				ОбработатьРезультатЭтапа(РезультатЭтапа, ЭлектронныйДокумент, ПараметрыАвторизации);
			Иначе
				Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Подписание двоичных данных после ввода комментария 
//
// Параметры:
//	Результат                - Строка                  - комментарий
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеВводаКомментарияДляЗапросаОбАннулировании(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды;
	Перем ОрганизацияЭДО, КонтекстТокена, Сертификат;
	Перем ДанныеНаПодпись, ЭлектронныйДокумент, РеквизитыДокумента;
	Перем ЗапросДанныхПодписанта, ПоследняяОшибка, ТекстСообщения, ДанныеПодписанта;
	Перем ЗапросКвитанции, ИмяФайлаКвитанции, ПередПодписанием, ПослеПодписания;
	
	ЭлектронныеДокументы = ПолучитьЭлектронныеДокументыИзДополнительныхПараметров(ДополнительныеПараметры);
	
	Если Не Результат = Неопределено Тогда
		
		ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
		ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяКоманды");
		
		// Получаем сертификат из параметров авторизации
		Если ПараметрыАвторизации.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка") Тогда
			КонтекстТокена = ПараметрыАвторизации.КонтекстТокена;
			Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КонтекстТокена, "СертификатЭП", Неопределено);
		Иначе
			Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации, "СертификатЭП", Неопределено);
			Если ТипЗнч(Сертификат) <> Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Или Сертификат.Пустая() Тогда
				Сертификат = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("Сертификат", Сертификат);
		ДополнительныеПараметры.Вставить("comment", Результат); // Комментария для отклонения
		
		ДанныеНаПодпись = Новый Структура();
		ДанныеНаПодпись.Вставить("МассивДанных", Новый Массив);
		ДанныеНаПодпись.Вставить("Представление", "Массовое подписание электронных документов");
		
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			
			РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
			Если Не ЗначениеЗаполнено(ОрганизацияЭДО) Тогда
				ОрганизацияЭДО = РеквизитыДокумента.ОрганизацияЭДО;
			КонецЕсли;
			
			Если Сертификат <> Неопределено Тогда
				
				// Машиночитаемая доверенность
				ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ОрганизацияЭДО, РеквизитыДокумента.КонтрагентЭДО, Сертификат);
				Если Не ЗапросДанныхПодписанта.Успех Тогда
					
					ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
					Если ПоследняяОшибка <> Неопределено Тогда
						ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
					Иначе
						ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
					КонецЕсли;
					
					Возврат;
					
				КонецЕсли;
				
				ДанныеПодписанта = ЗапросДанныхПодписанта.Результат;
				
			КонецЕсли;
			
			ЗапросКвитанции = ККСНГ_ДокументооборотВызовСервера.ПолучитьПредложениеОбАннулированииДляДокумента(ЭлектронныйДокумент, Результат, ПараметрыАвторизации);
			
			Если ЗапросКвитанции.Успех Тогда
				
				ЗапросКвитанции.Результат.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
				ЗапросКвитанции.Результат.Вставить("ДанныеПодписанта", ДанныеПодписанта);
				
				ИмяФайлаКвитанции = ЗапросКвитанции.Результат.Filename;
				
				ЭлементДанныхНаПодпись = Новый Структура();
				ЭлементДанныхНаПодпись.Вставить("Данные", ЗапросКвитанции.Результат);
				ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
				ЭлементДанныхНаПодпись.Вставить("Представление", ИмяФайлаКвитанции);
				
				ДополнительныеПараметры.Вставить("Filename", ИмяФайлаКвитанции);
				ДополнительныеПараметры.Вставить("MimeType", ЗапросКвитанции.Результат.MimeType);
				ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерAvoidanceRequest");
				ДополнительныеПараметры.Вставить("Успех", Истина);
				
				ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
				ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияТитулаПокупателя", ЭтотОбъект, ДополнительныеПараметры);
				
				ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
			Иначе
				ОбработатьРезультатЭтапа(ЗапросКвитанции, ЭлектронныйДокумент, ПараметрыАвторизации);
			КонецЕсли;
			
		КонецЦикла;
		
		ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание предложения об аннулировании", ПослеПодписания, ПередПодписанием);
		
	Иначе
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Подписание двоичных данных после ввода комментария 
//
// Параметры:
//	Результат                - Строка                  - комментарий
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеВводаКомментарияДляОтклоненияЗапросаОбАннулировании(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды;
	Перем КонтекстТокена, Сертификат, ДанныеНаПодпись;
	Перем ЭлектронныйДокумент, РеквизитыДокумента, ОрганизацияЭДО;
	Перем ЗапросДанныхПодписанта, ПоследняяОшибка, ТекстСообщения, ДанныеПодписанта;
	Перем MchdData, ЗапросКвитанции, ЭлементДанныхНаПодпись, ПередПодписанием, ПослеПодписания;
	
	ЭлектронныеДокументы = ПолучитьЭлектронныеДокументыИзДополнительныхПараметров(ДополнительныеПараметры);
	
	Если Не Результат = Неопределено Тогда
		
		ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
		ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяКоманды");
		
		// Получаем сертификат из параметров авторизации
		Если ПараметрыАвторизации.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка") Тогда
			КонтекстТокена = ПараметрыАвторизации.КонтекстТокена;
			Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КонтекстТокена, "СертификатЭП", Неопределено);
		Иначе
			Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации, "СертификатЭП", Неопределено);
			Если ТипЗнч(Сертификат) <> Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Или Сертификат.Пустая() Тогда
				Сертификат = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("Сертификат", Сертификат);
		ДополнительныеПараметры.Вставить("comment", Результат); // Комментария для отклонения
		
		ДанныеНаПодпись = Новый Структура();
		ДанныеНаПодпись.Вставить("МассивДанных", Новый Массив);
		ДанныеНаПодпись.Вставить("Представление", "Массовое подписание электронных документов");
		
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			
			РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
			Если Не ЗначениеЗаполнено(ОрганизацияЭДО) Тогда
				ОрганизацияЭДО = РеквизитыДокумента.ОрганизацияЭДО;
			КонецЕсли;
			
			Если Сертификат <> Неопределено Тогда
				
				// Машиночитаемая доверенность
				ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ОрганизацияЭДО, РеквизитыДокумента.КонтрагентЭДО, Сертификат);
				Если Не ЗапросДанныхПодписанта.Успех Тогда
					
					ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
					Если ПоследняяОшибка <> Неопределено Тогда
						ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
					Иначе
						ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
					КонецЕсли;
					
					Возврат;
					
				КонецЕсли;
				
				ДанныеПодписанта = ЗапросДанныхПодписанта.Результат;
				
				// Данные МЧД для создания квитанций
				Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "НеОтправлять") <> 0 Тогда
					
					MchdData = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_MchdData");
					MchdData.Uuid = ДанныеПодписанта.МЧД.Номер;
					MchdData.StartDate = ДанныеПодписанта.МЧД.ДатаНачала;
					
					Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
						MchdData.MchdViewType = "Meta";
						MchdData.AccessMode = ДанныеПодписанта.МЧД.ИнформационнаяСистема;
					Иначе
						MchdData.MchdViewType = "File";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗапросКвитанции = ККСНГ_ДокументооборотВызовСервера.ПолучитьУОУНаПредложениеОбАннулированииДляДокумента(ЭлектронныйДокумент, Результат, ПараметрыАвторизации, MchdData);
			
			Если ЗапросКвитанции.Успех Тогда
				
				ЗапросКвитанции.Результат.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
				ЗапросКвитанции.Результат.Вставить("ДанныеПодписанта", ДанныеПодписанта);
				
				ИмяФайлаКвитанции = ЗапросКвитанции.Результат.Filename;
				
				ЭлементДанныхНаПодпись = Новый Структура();
				ЭлементДанныхНаПодпись.Вставить("Данные", ЗапросКвитанции.Результат);
				ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
				ЭлементДанныхНаПодпись.Вставить("Представление", ИмяФайлаКвитанции);
				
				ДополнительныеПараметры.Вставить("Filename", ИмяФайлаКвитанции);
				ДополнительныеПараметры.Вставить("MimeType", ЗапросКвитанции.Результат.MimeType);
				ДополнительныеПараметры.Вставить("Успех", Истина);
				ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерRejectAvoidance");
				
				ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
				ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияТитулаПокупателя", ЭтотОбъект, ДополнительныеПараметры);
				
				ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
				
			Иначе
				ОбработатьРезультатЭтапа(ЗапросКвитанции, ЭлектронныйДокумент, ПараметрыАвторизации);
			КонецЕсли;
			
		КонецЦикла;
		
		ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание отклонения предложения об аннулировании", ПослеПодписания, ПередПодписанием);
		
	Иначе
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Вызывает команду в СФЕРА Курьер после ввода комментария для массива ЭД 
//
// Параметры:
//	Результат                - Строка                  - комментарий
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "КурьерAccept" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ЗавершениеВводаКомментарияОтзыва(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды, ЭлектронныйДокумент;
	
	Если ДополнительныеПараметры.Свойство("ЭлектронныеДокументы") Тогда
		ЭлектронныеДокументы = ДополнительныеПараметры.ЭлектронныеДокументы;
	Иначе
		ЭлектронныеДокументы = Новый Массив;
		ЭлектронныеДокументы.Добавить(ДополнительныеПараметры.ЭлектронныйДокумент);
	КонецЕсли;
	
	Если Не Результат = Неопределено Тогда
		
		ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
		ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяКоманды");
		
		ДополнительныеПараметры.Вставить("comment", Результат);
		ОбработатьКомандуКурьераМассово(ИмяКоманды, ЭлектронныеДокументы, ПараметрыАвторизации, , ДополнительныеПараметры);
		
	Иначе
		Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
			Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет команды "AcceptWithTicket", "Sign" (Подписание) для списка электронных документов
//
// Параметры:
//  СодержаниеОперации		 - Строка - содержание операции
//	ДополнительныеПараметры  - Структура:
// 								* ИмяКоманды           - Строка - команда действия в СФЕРА Курьер, внутренне представление, пример "AcceptWithTicketSign" 
// 								* ЭлектронныеДокументы - Массив или СправочникСсылка.ККСНГ_ЭлектронныеДокументы
// 								* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
Процедура ПродолжитьКомандуКурьерAcceptWithTicketSign(СодержаниеОперации, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументыAccept, ЭлектронныеДокументыSign;
	Перем ЭлектронныеДокументы, ПараметрыАвторизации;
	Перем ДанныеНаПодпись, ОрганизацияЭДО, ФайлСсылка, ДвоичныеДанные;
	Перем СтруктураДвоичныхДанных, ЭлементДанныхНаПодпись, ПараметрыОповещения;
	Перем ПередПодписанием, ПослеПодписания;
	
	ЭлектронныеДокументы = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЭлектронныеДокументы");
	ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
	
	ДанныеНаПодпись = Новый Структура();
	ДанныеНаПодпись.Вставить("МассивДанных", Новый Массив);
	ДанныеНаПодпись.Вставить("Представление", "Массовое подписание электронных документов (с квитанциями)");
	
	ДополнительныеПараметры = Новый Структура();
	
	ЭлектронныеДокументыSign = ККСНГ_ЭлектронныеДокументыВызовСервера.ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, "Sign");
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументыSign Цикл
		
		Если ОрганизацияЭДО = Неопределено Тогда
			ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
		КонецЕсли;
		
		ФайлСсылка = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, ЭлектронныйДокумент);
		ДвоичныеДанные = ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ФайлСсылка);
		
		СтруктураДвоичныхДанных = Новый Структура();
		СтруктураДвоичныхДанных.Вставить("Content", ДвоичныеДанные);
		СтруктураДвоичныхДанных.Вставить("Filename");
		СтруктураДвоичныхДанных.Вставить("MimeType");
		СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
		СтруктураДвоичныхДанных.Вставить("ИмяКоманды", "КурьерSign");
		СтруктураДвоичныхДанных.Вставить("Успех", Истина);
		
		ЭлементДанныхНаПодпись = Новый Структура();
		ЭлементДанныхНаПодпись.Вставить("Данные", СтруктураДвоичныхДанных);
		ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
		ЭлементДанныхНаПодпись.Вставить("Представление", "Документ");
		
		ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
		
	КонецЦикла;
	
	ЭлектронныеДокументыAccept = ККСНГ_ЭлектронныеДокументыВызовСервера.ОтобратьЭлектронныеДокументыПоДействию(ЭлектронныеДокументы, "AcceptWithTicket");
	
	Если ЭлектронныеДокументыAccept.Количество() > 0 И ПустаяСтрока(СодержаниеОперации) Тогда
		// Отсутсвует содержание операции, отменяем действие.
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументыAccept Цикл
		
		Если ОрганизацияЭДО = Неопределено Тогда
			ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
		КонецЕсли;
		
		СтруктураДвоичныхДанных = Новый Структура();
		СтруктураДвоичныхДанных.Вставить("Content", ПолучитьДвоичныеДанныеИзСтроки("null"));
		СтруктураДвоичныхДанных.Вставить("Filename");
		СтруктураДвоичныхДанных.Вставить("MimeType");
		СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
		СтруктураДвоичныхДанных.Вставить("ИмяКоманды", "КурьерAcceptWithTicket");
		
		ЭлементДанныхНаПодпись = Новый Структура();
		ЭлементДанныхНаПодпись.Вставить("Данные", СтруктураДвоичныхДанных);
		ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
		ЭлементДанныхНаПодпись.Вставить("Представление", "Документ");
		
		ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерAcceptWithTicket");
		ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		ДополнительныеПараметры.Вставить("ИмяПоляДД", "Content");
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
		ДополнительныеПараметры.Вставить("СодержаниеОперации", СодержаниеОперации);
		
		ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
		
	КонецЦикла;
	
	Если ДанныеНаПодпись.МассивДанных.Количество() = 0 Тогда
		// Нет данных на подпись
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
	ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеМассовогоПодписания", ЭтотОбъект, ДополнительныеПараметры);
	
	ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание электронного документа", ПослеПодписания, ПередПодписанием);
	
КонецПроцедуры

// Возвращает строку предупреждения
//
// Параметры:
//  ЭтоНоваяОрганизация - Булево
//
// Возвращаемое значение: 
//  Строка
//
Функция ТекстОбОтсутствииКонтрагентовЭДО(ЭтоНоваяОрганизация = Ложь) Экспорт
	
	Перем ЧастиПредупреждения, ТекстСсылкиНаНастройку, СсылкаНаНастройку, ТекстПредупреждения;
	
	ЧастиПредупреждения = Новый Массив;
	Если ЭтоНоваяОрганизация Тогда
		ЧастиПредупреждения.Добавить("Вы успешно завершили настройки организации. ");
	Иначе
		ЧастиПредупреждения.Добавить("У организации нет настроенных контрагентов ЭДО. ");
	КонецЕсли;
	ТекстСсылкиНаНастройку = "Перейти к настройке";
	СсылкаНаНастройку = "e1cib/app/Обработка.ККСНГ_СинхронизацияКонтрагентов";
	ЧастиПредупреждения.Добавить(Новый ФорматированнаяСтрока(ТекстСсылкиНаНастройку, , , , СсылкаНаНастройку));
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(ЧастиПредупреждения);
	
	Возврат ТекстПредупреждения;
	
КонецФункции

// Возвращает строку предупреждения
//
// Параметры:
//  нет
//
// Возвращаемое значение: 
//  Строка
//
Функция ТекстОбОтсутствииОрганизацийЭДО() Экспорт
	
	Перем ЧастиПредупреждения, ТекстСсылкиНаНастройку, СсылкаНаНастройку, ТекстПредупреждения;
	
	ЧастиПредупреждения = Новый Массив;
	ЧастиПредупреждения.Добавить("В базе отсутствуют настроенные организации ЭДО." + Символы.ПС);
	ТекстСсылкиНаНастройку = "Перейти к настройке";
	СсылкаНаНастройку = "e1cib/command/ОбщаяКоманда.ККСНГ_ОткрытьККСНГ_Организации";
	ЧастиПредупреждения.Добавить(Новый ФорматированнаяСтрока(ТекстСсылкиНаНастройку, , , , СсылкаНаНастройку));
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(ЧастиПредупреждения);
	
	Возврат ТекстПредупреждения;
	
КонецФункции 

// Заполняет подписанта в xml черновика
//
// Параметры:
//	Параметры                - Структура:
// 								* ОписаниеДанных - Структура:
//                                  ** ВыбранныйСертификат
//                                  ** НаборДанных           - Массив - данные для подписи
//	ДопПараметры             - Структура:
//								* ПараметрыАвторизации    - Структура:
//     								** СпособАвторизации  - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     								** AuthToken          - Строка - авторизационный токен доступа к API,
//     								** КонтекстТокена     - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  									СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
Процедура ПередПодписаниемЧерновика(Параметры, ДополнительныеПараметры) Экспорт
	
	Перем ПереданныйСертификат, ПараметрыАвторизации, ВыбранныйСертификат;
	Перем ПодписываемыеДанные, ЭлектронныйДокумент, ПрисоединенныйФайлДокумента;
	Перем ЗапросИзмененияПодписанта;
	Перем ИзменениеПодписантаДоступно, Actions;
	Перем РеквизитыЭД, КодТипаДокумента, НомерЭД, ДатаЭД;
	Перем ПоследняяОшибка, ТекстСообщения;
	Перем РеквизитыДокумента, ОрганизацияЭДО, ДанныеПодписанта;
	
	ПереданныйСертификат = Параметры.ОписаниеДанных.ВыбранныйСертификат;
	ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
	
	Если ПереданныйСертификат.Свойство("Ссылка") Тогда
		ВыбранныйСертификат = ПереданныйСертификат.Ссылка;
	Иначе
		ВыбранныйСертификат = ПереданныйСертификат;
	КонецЕсли;
	
	Для каждого ПодписываемыеДанные Из Параметры.ОписаниеДанных.НаборДанных Цикл
		
		ЭлектронныйДокумент = ПодписываемыеДанные.ЭлектронныйДокумент;
		Если ТипЗнч(ЭлектронныйДокумент) <> Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Или Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		ПодписываемыеДанные.Вставить("ДанныеПодписанта", ККСНГ_ОтправкаЭДВызовСервера.ПолучитьСтруктуруДанныхПодписанта());
		
		РеквизитыЭД = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИмеющегосяРеквизитаОбъекта(ЭлектронныйДокумент, "DocumentTypeCode, BuyerCode, Status, НаправлениеЭД, Number, Date, Actions, КодЭДОВладельца");
		
		РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
		Если Не ЗначениеЗаполнено(ОрганизацияЭДО) Тогда
			ОрганизацияЭДО = РеквизитыДокумента.ОрганизацияЭДО;
		КонецЕсли;
		
		КодТипаДокумента = РеквизитыЭД.Получить("DocumentTypeCode");
		НомерЭД = РеквизитыЭД.Получить("Number");
		ДатаЭД = Формат(РеквизитыЭД.Получить("Date"), "ДФ=dd.MM.yy");
		Actions = СтрРазделить(ВРег(РеквизитыЭД.Получить("Actions")), " ", Ложь);
		
		ИзменениеПодписантаДоступно = Actions.Найти(ВРег("SubstituteSigner")) <> Неопределено;
		
		// Машиночитаемая доверенность
		ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ОрганизацияЭДО, РеквизитыДокумента.КонтрагентЭДО, ВыбранныйСертификат);
		Если Не ЗапросДанныхПодписанта.Успех Тогда
			
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
			Если ПоследняяОшибка <> Неопределено Тогда
				ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
			Иначе
				ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
			КонецЕсли;
			Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
			
			Прервать;
			
		КонецЕсли;
		
		ПодписываемыеДанные.Вставить("ДанныеПодписанта", ЗапросДанныхПодписанта.Результат);
		
		Если ИзменениеПодписантаДоступно Тогда
			
			ЗапросИзмененияПодписанта = ККСНГ_ДокументооборотВызовСервера.ЗаполнитьПодписантаВЧерновике(ЭлектронныйДокумент, Неопределено, ОрганизацияЭДО, ПодписываемыеДанные.ДанныеПодписанта, ПараметрыАвторизации);
			Если ЗапросИзмененияПодписанта.Успех Тогда
				
				ПрисоединенныйФайлДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, ЭлектронныйДокумент);
				ПодписываемыеДанные[ПодписываемыеДанные.ИмяПоляДД] = ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ПрисоединенныйФайлДокумента);
				
			Иначе
				
				ТекстСообщения = СтрШаблон("Ошибка при заполнении подписанта в xml электронного документа (%1) № %2 от %3", КодТипаДокумента, НомерЭД, ДатаЭД);
				ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросИзмененияПодписанта.Журнал);
				Если ПоследняяОшибка <> Неопределено Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				КонецЕсли;
				Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, Параметры);
	
КонецПроцедуры

#Область МаскаДействийДокумента

// Возвращает соответствие доступных действий из строки маски действий СФЕРА Курьер
// см. https://confluence.esphere.ru/pages/viewpage.action?pageId=123469030 
//
// Параметры:
//	СтрокаМаскиДействий - строка - маска действий
//	Разделитель         - строка - разделитель для СтрРазделить
//
// Возвращаемое значение: 
//	ДоступныеДействия - Соответствие - ключ = действие, значение = доступность
//
Функция ПолучитьСоответствиеМаскиДействийИзСтроки(Знач СтрокаМаскиДействий, Разделитель = " ") Экспорт
	
	Перем МассивДействий, ДоступныеДействия, Элемент, СтрокаДействие;
	
	МассивДействий = СтрРазделить(СтрокаМаскиДействий, Разделитель, Ложь);
	ДоступныеДействия = Новый Соответствие;
	
	Для каждого Элемент Из МассивДействий Цикл
		
		СтрокаДействие = СокрЛП(Элемент);
		Если ККСНГ_ДокументооборотКлиентПовтИсп.ДействиеДоступно(СтрокаДействие) Тогда
			ДоступныеДействия.Вставить(СтрокаДействие, Истина);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныеДействия;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаКомандКурьера

// Выполняет команду "Sign" (Подписание) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерSign(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ОрганизацияЭДО, ДанныеНаПодпись;
	Перем ЭлектронныйДокумент, ФайлСсылка, ДвоичныеДанные;
	Перем СтруктураДвоичныхДанных, ЭлементДанныхНаПодпись;
	Перем ДополнительныеПараметры, ПередПодписанием, ПослеПодписания;
	
	ДанныеНаПодпись = Новый Структура();
	ДанныеНаПодпись.Вставить("МассивДанных", Новый Массив);
	ДанныеНаПодпись.Вставить("Представление", "Массовое подписание электронных документов");
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		Если ОрганизацияЭДО = Неопределено Тогда
			ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
		КонецЕсли;
		
		ФайлСсылка = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, ЭлектронныйДокумент);
		ДвоичныеДанные = ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ФайлСсылка);
		
		СтруктураДвоичныхДанных = Новый Структура();
		СтруктураДвоичныхДанных.Вставить("Данные", ДвоичныеДанные);
		СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
		
		ЭлементДанныхНаПодпись = Новый Структура();
		ЭлементДанныхНаПодпись.Вставить("Данные", СтруктураДвоичныхДанных);
		ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Данные");
		ЭлементДанныхНаПодпись.Вставить("Представление", "Документ");
		
		ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
		
	КонецЦикла;

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерSign");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемЧерновика", ЭтотОбъект, ДополнительныеПараметры);
	ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияДвоичныеДанные", ЭтотОбъект, ДополнительныеПараметры);
	
	ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание электронного документа", ПослеПодписания, ПередПодписанием);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "AcceptWithTicket" (Подписание) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерAcceptWithTicket(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ОрганизацияЭДО, ДанныеНаПодпись;
	Перем ЭлектронныйДокумент, СтруктураДвоичныхДанных, ЭлементДанныхНаПодпись;
	Перем ДополнительныеПараметры, ПередПодписанием, ПослеПодписания;
	
	ДанныеНаПодпись = Новый Структура();
	ДанныеНаПодпись.Вставить("МассивДанных", Новый Массив);
	ДанныеНаПодпись.Вставить("Представление", "Массовое подписание электронных документов с квитанциями");
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		Если ОрганизацияЭДО = Неопределено Тогда
			ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
		КонецЕсли;
		
		СтруктураДвоичныхДанных = Новый Структура();
		СтруктураДвоичныхДанных.Вставить("Content", ПолучитьДвоичныеДанныеИзСтроки("null"));
		СтруктураДвоичныхДанных.Вставить("Filename");
		СтруктураДвоичныхДанных.Вставить("MimeType");
		СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
		
		ЭлементДанныхНаПодпись = Новый Структура();
		ЭлементДанныхНаПодпись.Вставить("Данные", СтруктураДвоичныхДанных);
		ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
		ЭлементДанныхНаПодпись.Вставить("Представление", "Документ");
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерAcceptWithTicket");
		ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		ДополнительныеПараметры.Вставить("ИмяПоляДД", "Content");
		ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
		
		ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
		ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияТитулаПокупателя", ЭтотОбъект, ДополнительныеПараметры);
		
		ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
		
	КонецЦикла;
	
	ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание электронного документа с квитанцией", ПослеПодписания, ПередПодписанием);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команды "AcceptWithTicket", "Sign" (Подписание) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерAcceptWithTicketNoDisaccordSign(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ЭлектронныеДокументыAccept, ПараметрыФормы, СодержаниеОперации;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "AcceptWithTicketSign");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьКомандуКурьерAcceptWithTicketSign", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, "1");
	
	Возврат Истина;
	
КонецФункции

// Выполняет команды "AcceptWithTicket", "Sign" (Подписание) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерAcceptWithTicketDisaccordSign(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ЭлектронныеДокументыAccept, ПараметрыФормы, СодержаниеОперации;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "AcceptWithTicketSign");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьКомандуКурьерAcceptWithTicketSign", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, "2");
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "Reject" (Отклонение без подписания) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерReject(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ПараметрыФормы;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерReject");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляОтклонения", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите общий комментарий");
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , ОписаниеОповещения);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "RejectWithTicket" (Отклонение с подписанием) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерRejectWithTicket(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ПараметрыФормы;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерRejectWithTicket");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляОтклоненияСКвитанцией", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите общий комментарий");
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , ОписаниеОповещения);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "AvoidanceRequest" (Запроса на аннулирование) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерAvoidanceRequest(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ПараметрыФормы;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерAvoidanceRequest");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляЗапросаОбАннулировании", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите причину аннулирования");
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , ОписаниеОповещения);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "AcceptAvoidance" (Принятие запроса на аннулирование) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерAcceptAvoidance(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ОрганизацияЭДО, ДанныеНаПодпись;
	Перем ЭлектронныйДокумент, КвитанцияПредложение, ДанныеКвитанции;
	Перем СтруктураДвоичныхДанных, ЭлементДанныхНаПодпись;
	Перем ДополнительныеПараметры, ПередПодписанием, ПослеПодписания;
	
	ДанныеНаПодпись = Новый Структура("МассивДанных, Представление", Новый Массив, "Массовое подписание подтверждений аннулирования");
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		Если ОрганизацияЭДО = Неопределено Тогда
			ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
		КонецЕсли;
		
		КвитанцияПредложение = ККСНГ_ДокументооборотВызовСервера.ПолучитьПредложениеНаАннулированиеИзКвитанций(ЭлектронныйДокумент, ПараметрыАвторизации);
		
		Если КвитанцияПредложение.Успех Тогда
			
			ДанныеКвитанции = КвитанцияПредложение.Результат.Content;
			
			СтруктураДвоичныхДанных = Новый Структура();
			СтруктураДвоичныхДанных.Вставить("ЭлектронныйДокумент", ЭлектронныйДокумент);
			СтруктураДвоичныхДанных.Вставить("Content", ДанныеКвитанции.Content);
			СтруктураДвоичныхДанных.Вставить("Filename", ДанныеКвитанции.Filename);
			СтруктураДвоичныхДанных.Вставить("MimeType", ДанныеКвитанции.MimeType);
			
			ЭлементДанныхНаПодпись = Новый Структура();
			ЭлементДанныхНаПодпись.Вставить("Данные", СтруктураДвоичныхДанных);
			ЭлементДанныхНаПодпись.Вставить("ИмяПоляДД", "Content");
			ЭлементДанныхНаПодпись.Вставить("Представление", СтруктураДвоичныхДанных.Filename);
			
			ДанныеНаПодпись.МассивДанных.Добавить(ЭлементДанныхНаПодпись);
			
		Иначе
			
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(КвитанцияПредложение.Журнал);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерAcceptAvoidance");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемТитуловИКвитанцийПокупателя", ЭтотОбъект, ДополнительныеПараметры);
	ПослеПодписания = Новый ОписаниеОповещения("ЗавершениеПодписанияДвоичныеДанные", ЭтотОбъект, ДополнительныеПараметры);
	
	ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание подтверждения аннулирования", ПослеПодписания, ПередПодписанием);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "RejectAvoidance" (Отклонение запроса на аннулирование) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерRejectAvoidance(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ПараметрыФормы;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерRejectAvoidance");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияДляОтклоненияЗапросаОбАннулировании", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите причину отказа от аннулирования");
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , ОписаниеОповещения);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду "Revoke" (Отзыв) для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерRevoke(ЭлектронныеДокументы, ПараметрыАвторизации)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения, ПараметрыФормы;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяКоманды", "КурьерRevoke");
	ДополнительныеПараметры.Вставить("ЭлектронныеДокументы", ЭлектронныеДокументы);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаКомментарияОтзыва", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Введите причину отзыва");
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ЗапросКомментария", ПараметрыФормы, , , , , ОписаниеОповещения);
	
	Возврат Истина;
	
КонецФункции

// Выполняет команду подписания квитанций документа для списка электронных документов
//
// Параметры:
//  ЭлектронныеДокументы - Массив из СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Список обрабатываемых электронных документов
//	ПараметрыАвторизации - Структура - см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации
//
// Возвращаемое значение:
//   Булево - Истина
//   
Функция ОбработатьКомандуКурьерПодписатьКвитанцииДокумента(ЭлектронныеДокументы, ПараметрыАвторизации, ИмяКоманды = "", УникальныйИдентификатор = "") Экспорт
	
	Перем ОрганизацияЭДО, КонтрагентЭДОКвитанции, ДанныеПодписантаКвитанции;
	Перем КонтекстТокена, Сертификат, Квитанция;
	Перем КвитанцииДокументов, ЭлектронныйДокумент, ОбновлениеКвитанции, КвитанцииДокумента;
	Перем РеквизитыДокумента, ПоследняяОшибка, ТекстСообщения, ЗапросДанныхПодписанта;
	
	КвитанцииДокументов = Новый Массив;
	КонтрагентЭДОКвитанции = Новый Соответствие;
	ДанныеПодписантаКвитанции = Новый Соответствие;
	
	// Получаем сертификат из параметров авторизации
	Если ПараметрыАвторизации.СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка") Тогда
		КонтекстТокена = ПараметрыАвторизации.КонтекстТокена;
		Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КонтекстТокена, "СертификатЭП", Неопределено);
	Иначе
		Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации, "СертификатЭП", Неопределено);
		Если ТипЗнч(Сертификат) <> Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Или Сертификат.Пустая() Тогда
			Сертификат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		ОбновлениеКвитанции = ККСНГ_ДокументооборотВызовСервера.ОбновитьКвитанцииЭлектронногоДокументаПоДаннымИзКурьера(ЭлектронныйДокумент, ПараметрыАвторизации);
		
		РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ЭлектронныйДокумент);
		Если ОрганизацияЭДО = Неопределено Тогда
			ОрганизацияЭДО = РеквизитыДокумента.ОрганизацияЭДО;
		КонецЕсли;
		
		КвитанцииДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьКвитанцииДокумента(ЭлектронныйДокумент, Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КвитанцииДокументов, КвитанцииДокумента);
		
		Для каждого Квитанция Из КвитанцииДокумента Цикл
			
			ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьСтруктуруДанныхПодписанта();
			
			Если Сертификат <> Неопределено Тогда
				// Машиночитаемая доверенность
				ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ОрганизацияЭДО, РеквизитыДокумента.КонтрагентЭДО, Сертификат);
				Если Не ЗапросДанныхПодписанта.Успех Тогда
					
					ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
					Если ПоследняяОшибка <> Неопределено Тогда
						ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
					Иначе
						ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
					КонецЕсли;
					
					ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросДанныхПодписанта.Журнал);
					
					Возврат Ложь;
					
				КонецЕсли;
				
				ЗапросДанныхПодписанта = ЗапросДанныхПодписанта.Результат;
				
			КонецЕсли;
			
			КонтрагентЭДОКвитанции.Вставить(Квитанция, РеквизитыДокумента.КонтрагентЭДО);
			ДанныеПодписантаКвитанции.Вставить(Квитанция, ЗапросДанныхПодписанта);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если КвитанцииДокументов.Количество() Тогда
		ККСНГ_КвитанцииКлиент.ОтправитьОтветНаКвитанцию(КвитанцииДокументов, ОрганизацияЭДО, ПараметрыАвторизации, Сертификат, КонтрагентЭДОКвитанции, ДанныеПодписантаКвитанции, ИмяКоманды, УникальныйИдентификатор);
	Иначе
		ККСНГ_ДокументооборотВызовСервера.ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы, ОрганизацияЭДО, ПараметрыАвторизации);
		Параметры = Новый Структура("Результат", ИмяКоманды);
		Оповестить("Все квитанции подписаны", Параметры, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Авторизация

Функция ПустыеПараметрыАвторизации()
	
	Возврат Новый Структура("СпособАвторизации,AuthToken,КонтекстТокена,СертификатЭП");
	
КонецФункции

#КонецОбласти

Процедура ОбработатьРезультатЭтапа(РезультатЭтапа, ЭлектронныйДокумент, ПараметрыАвторизации)
	
	Перем ЭлектронныеДокументы;
	Перем ОрганизацияЭДО, ОбработкаНештатнойСитуации;
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("Массив") Тогда
		ЭлектронныеДокументы = ЭлектронныйДокумент;
	Иначе
		ЭлектронныеДокументы = Новый Массив;
		ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);
	КонецЕсли;
	
	Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		
		Если Не РезультатЭтапа.Успех Тогда
			
			ОрганизацияЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииДокумента(ЭлектронныйДокумент);
			ККСНГ_ДокументооборотВызовСервера.ОбновитьЭлектронныйДокументПоДаннымИзКурьера(ЭлектронныйДокумент, ОрганизацияЭДО, ПараметрыАвторизации);
			
			ОбработкаНештатнойСитуации = ККСНГ_ДокументооборотВызовСервера.ОбработатьНештатныеСитуацииПоСобытиямДокумента(ЭлектронныйДокумент, ОрганизацияЭДО, ПараметрыАвторизации);
			
			Если ОбработкаНештатнойСитуации.Успех Тогда
				ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ОбработкаНештатнойСитуации.Журнал, "-1");
			Иначе
				Если РезультатЭтапа.Свойство("Журнал") Тогда
					ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЭтапа.Журнал, "-1");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОтсутствующиеЭлементы(МассивОбщий, МассивПоиска1, МассивПоиска2)
	
	Перем МассивРезультат, ЭлементПоиска;
	
	МассивРезультат = Новый Массив;
	Для каждого ЭлементПоиска Из МассивОбщий Цикл
		Если Не ЭлементВходитВ(ЭлементПоиска, МассивПоиска1, МассивПоиска2) Тогда
			МассивРезультат.Добавить(ЭлементПоиска);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

Функция ЭлементВходитВ(ЭлементПоиска, Массив1, Массив2 = Неопределено)
	
	Для каждого ЭлементПоиска Из Массив1 Цикл
		Если Не Массив1.Найти(ЭлементПоиска) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Массив2 = Неопределено Тогда
		Если Не Массив2.Найти(ЭлементПоиска) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьЭлектронныеДокументыИзДополнительныхПараметров(ДополнительныеПараметры)
	
	Перем ЭлектронныеДокументы;
	
	Если ДополнительныеПараметры.Свойство("ЭлектронныеДокументы") Тогда
		ЭлектронныеДокументы = ДополнительныеПараметры.ЭлектронныеДокументы;
	Иначе
		ЭлектронныеДокументы = Новый Массив;
		ЭлектронныеДокументы.Добавить(ДополнительныеПараметры.ЭлектронныйДокумент);
	КонецЕсли;
	
	Возврат ЭлектронныеДокументы;
	
КонецФункции

#КонецОбласти