#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	
	НастроитьСписокДокументовОтправке();
	НастроитьСписокДокументовСКвитанциями();
	НастроитьСписокИсходящихДокументов();
	НастроитьСписокВходящихДокументов();
	НастроитьСписокОбработанныхДокументов();
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораПрофилейЭДО(ПрофильНастройкиЭДО, Элементы.ПрофильНастройкиЭДО);
	
	// Отображение кнопки "+" при выборе профиля только если ещё нет ни одного
	Для Каждого ПараметрВыбора Из Элементы.ПрофильНастройкиЭДО.ПараметрыВыбора Цикл
		Если ПараметрВыбора.Имя = "Отбор.Ссылка" И ТипЗнч(ПараметрВыбора.Значение) = Тип("Массив") Тогда
			Элементы.ПрофильНастройкиЭДО.КнопкаСоздания = (ПараметрВыбора.Значение.Количество() = 0);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ИнициализироватьСлужебныеРеквизитыФормы();
	ИнициализироватьДеревоРазделов();
	ИнициализироватьРазделы();
	
	Если ДоступнаРаботаПоБизнесПроцессуУВХД Тогда
		ЗагрузитьСписокСопоставленийДоговоровУВХД();
		СписокСопоставленныхДоговоров = ПолучитьСписокСопоставленныхДоговоров();
		ДокументыКОтправке.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СопоставленныеДоговора", СписокСопоставленныхДоговоров);
	КонецЕсли;
	
	Элементы.ГруппаРазделов.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Элементы.СообщениеОбОшибке.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Не ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим() Тогда
		ПодключитьОбработчикОжидания("ПроверитьОбновление", 60, Истина);
	КонецЕсли;
	
	УстановитьПрофильОрганизации();
		
	УстановитьНастройкиПрофиляЭДОДляСписковДокументов();
	УстановитьПериодСпискаДокументовКОтправке();
	УстановитьПометкуАктивногоФильтраПоДокументам(Элементы.ДокументыКОтправкеКомандаПоказатьНовые);
	УстановитьНастройкиСписковТекущегоРаздела(Неопределено);
	
	Если ДоступнаРаботаСПриглашениями И ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ОбновитьТекущиеПриглашения("All");
	КонецЕсли;
	
	ОтказПриПроверкеОрганизации = Ложь;
	ККСНГ_ДокументооборотКлиент.ПроверитьНаличиеОрганизацийЭДО(ОтказПриПроверкеОрганизации);
	
	Если Не ОтказПриПроверкеОрганизации Тогда
		ККСНГ_ДокументооборотКлиент.ПроверитьНаличиеКонтрагентовЭДО(ПрофильНастройкиЭДО);
	КонецЕсли;
	
	ПоказатьСтраницуРаздела("КОтправке");
	ОбновитьДеревоНавигации(ДеревоДействийРазделов.ПолучитьЭлементы());
	
	//ККСНГ_ЭлектронныеДокументыКлиент.ПредложитьОбновитьФорматУКД(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// Обработка событий в системе
	Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ПрофильЭДООрганизации") И Параметр.ПрофильЭДООрганизации = ПрофильНастройкиЭДО Тогда
		Если ИмяСобытия = "ОбновитьКОтправке" Тогда
			Элементы.ДокументыКОтправке.Обновить();
		КонецЕсли;
	КонецЕсли;
	
	// Переход из загрузки документооборота
	Если ИмяСобытия = "СменитьПрофильЭДООрганизации" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ПрофильНастройкиЭДО") Тогда
			ПрофильНастройкиЭДО = Параметр.ПрофильНастройкиЭДО;
			УстановитьНастройкиПрофиляЭДОДляСписковДокументов();
		КонецЕсли;
	КонецЕсли;

	Если ИмяСобытия = "Все квитанции подписаны" И Источник = УникальныйИдентификатор Тогда
		
		ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Результат");
		Если Не ПустаяСтрока(ИмяКоманды) Тогда
			ВыполнитьДействиеКурьер(ИмяКоманды, , Ложь);
		Иначе
			Элементы.ДокументыСКвитанциями.ВыделенныеСтроки.Очистить();
			Элементы.ДокументыСКвитанциями.Обновить();
			ОбновитьСчетчикиРазделовДокументов();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеКомандыСФЕРАКурьер" И Источник = Неопределено Тогда
		УстановитьНастройкиСписковТекущегоРаздела(ТекущийРаздел);
		ОбновитьСчетчикиРазделовДокументов();
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписьКонтрагентаЭДО" Тогда
		Если ДоступнаРаботаПоБизнесПроцессуУВХД Тогда
			ЗагрузитьСписокСопоставленийДоговоровУВХД(Параметр);
			СписокСопоставленныхДоговоров = ПолучитьСписокСопоставленныхДоговоров();
			ДокументыКОтправке.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СопоставленныеДоговора", СписокСопоставленныхДоговоров);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)

	СохраненныйПрофильЭДО = Настройки.Получить("ПрофильНастройкиЭДО");

	Если СохраненныйПрофильЭДО <> Неопределено
			И (ЗначениеЗаполнено(ПрофильНастройкиЭДО)
               		ИЛИ НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ПрофильЭДОДоступенПользователю(СохраненныйПрофильЭДО)) Тогда
		Настройки.Удалить("ПрофильНастройкиЭДО");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрофильНастройкиЭДОПриИзменении(Элемент)
	
	УстановитьНастройкиПрофиляЭДОДляСписковДокументов();
	
	Если Элементы.ГруппаРазделов.ТекущаяСтраница = Элементы.ГруппаРазделов.ПодчиненныеЭлементы.ГруппаДокументыКОтправке Тогда
		ККСНГ_ДокументооборотКлиент.ПроверитьНаличиеКонтрагентовЭДО(ПрофильНастройкиЭДО, Ложь);
	КонецЕсли;
	
	ОбновитьТекущиеПриглашения("All");
	ОбновитьСоответствияРазделовДаннымФормированияЗапросов(, Истина);
	ОбновитьСчетчикиРазделовДокументов(Истина);
	ОбновитьСчетчикиРазделовПриглашений(Истина);
	ВыполнитьОбновлениеДанныхКурьера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодКОтправкеПриИзменении(Элемент)

	УстановитьПериодСпискаДокументовКОтправке();
	ОбновитьСоответствияРазделовДаннымФормированияЗапросов(ТекущийРаздел);
	ОбновитьСчетчикиРазделовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборВидыЭДПоказатьОтметкуЗавершение", ЭтотОбъект);
	ОтборВидыЭД.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Виды документов");

КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыЭДПриИзменении(Элемент)

	ВыбранныеВидыЭД = Новый Массив;

	Для каждого ЭлементСписка Из ОтборВидыЭД Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеВидыЭД.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "ВидЭД", ВыбранныеВидыЭД, , , Истина);
	ОбновитьСоответствияРазделовДаннымФормированияЗапросов(ТекущийРаздел);
	ОбновитьСчетчикиРазделовДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеОбОшибкеНажатие(Элемент, СтандартнаяОбработка)
	
	ТаблицаОшибокКопия = ТаблицаОшибок;
	АдресТаблицыОшибок = АдресТаблицыОшибок(ТаблицаОшибокКопия);
	ПараметрыОткрытия = Новый Структура("АдресТаблицыОшибок", АдресТаблицыОшибок);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаЛогаОшибокЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ККСНГ_СфераКурьер.Форма.ФормаЛогОшибок",
					ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещения
						, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область СобытияФормыПриглашений

&НаКлиенте
Процедура ФильтрСтатусовИсходящихПриИзменении(Элемент)
	ПолучитьСписокПриглашений(Неопределено);
	ОбновитьСчетчикиРазделовПриглашений();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусовВходящихПриИзменении(Элемент)
	ПолучитьСписокПолученныхПриглашений(Неопределено);
	ОбновитьСчетчикиРазделовПриглашений();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбрабатыватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПриглашенийОтправленные.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Обрабатывать Тогда
		Если Не (НРЕГ(ТекДанные.Status) = "processed" И НРЕГ(ТекДанные.Side) = "sender") Тогда
			ТекДанные.Обрабатывать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДействийРазделов

&НаКлиенте
Процедура ДеревоДействийРазделовПриАктивизацииСтроки(Элемент)
	
	ОчиститьИСкрытьТаблицуОшибок();
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйРаздел = Элемент.ТекущиеДанные.Значение;
	Если Не НовыйРаздел = ТекущийРаздел Тогда
		
		ТекущийРаздел = НовыйРаздел;
		
		БизнесПроцессРаздела = ?(НовыйРаздел = "ПодписатьИОтправитьУВХД", "УВХД", Неопределено);
		ДокументыКОтправке.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("БизнесПроцесс", БизнесПроцессРаздела);
				
		УстановитьНастройкиСписковТекущегоРаздела(ТекущийРаздел);
		УстановитьПометкуАктивногоФильтраПоДокументам(Элементы.ДокументыКОтправкеКомандаПоказатьНовые);
		УстановитьФильтрПоДокументам(Команды.Найти(Элементы.ДокументыКОтправкеКомандаПоказатьНовые.ИмяКоманды));
		
		ОбновитьСоответствияРазделовДаннымФормированияЗапросов(НовыйРаздел);
		//ОбновитьСчетчикиРазделовДокументов();
		ВыполнитьОбновлениеДанныхКурьера();
		
		ПоказатьРаздел(НовыйРаздел);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыКОтправке

&НаКлиенте
Процедура ДокументыКОтправкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ДанныеСтроки = Элементы.ДокументыКОтправке.ДанныеСтроки(ВыбраннаяСтрока);
	ПоказатьЗначение(, ДанныеСтроки.Ссылка);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДокументыКОтправкеПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	БизнесПроцесс = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки.ДополнительныеСвойства, "БизнесПроцесс");
	Если БизнесПроцесс = "УВХД" Тогда
		СопоставленныеДоговора = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки.ДополнительныеСвойства, "СопоставленныеДоговора", Новый Массив());
		Для каждого Строка Из Строки Цикл
			ДоговорСопоставлен = Не (СопоставленныеДоговора.Найти(Строка.Значение.Данные.ДоговорКонтрагента) = Неопределено);
			Если Не ДоговорСопоставлен Тогда
				Для каждого ОформлениеЯчейки Из Строка.Значение.Оформление Цикл
					ОформлениеЯчейки.Значение.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(160, 160, 160));
					Если ОформлениеЯчейки.Ключ = "Примечание" Тогда
						ОформлениеЯчейки.Значение.УстановитьЗначениеПараметра("Текст", "Необходимо сопоставить договор");
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсходящиеДокументы

&НаКлиенте
Процедура ИсходящиеДокументыПриАктивизацииСтроки(Элемент)
	
	ИсходящиеДокументыОбработатьАктивизациюСтроки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсходящиеДокументыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЭлектронныеДокументПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВходящиеДокументы

&НаКлиенте
Процедура ВходящиеДокументыПриАктивизацииСтроки(Элемент)
	
	ВходящиеДокументыОбработатьАктивизациюСтроки();
	 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВходящиеДокументыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЭлектронныеДокументПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбработанныеДокументы

&НаСервереБезКонтекста
Процедура ОбработанныеДокументыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЭлектронныеДокументПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПриглашенийПринятые

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаПриглашенийПринятыеSenderName"
			И Не Элемент.ТекущиеДанные = Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Профиль) Тогда
		ККСНГ_ПриглашенияКлиент.ОткрытьФормуПрофиляКонтрагента(Элемент.ТекущиеДанные.Профиль, Элементы.ТаблицаПриглашенийПринятые);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НРЕГ(ТекДанные.Side) = "receiver" И (НРЕГ(ТекДанные.Status) = "rejected" Или НРЕГ(ТекДанные.Status) = "accepted") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеКонтрагентПриИзменении(Элемент, ВыбранныеЗначения = Неопределено)
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		НовыйКонтрагент = ?(ВыбранныеЗначения = Неопределено, ТекДанные.Контрагент, ВыбранныеЗначения);
		ЗапросЗаписьПриглашения = ККСНГ_ПриглашенияВызовСервера.ЗаписатьКонтрагентаОтправителя(ТекДанные.Id, ПрофильНастройкиЭДО, НовыйКонтрагент);
		Если Не ЗапросЗаписьПриглашения.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросЗаписьПриглашения.Журнал);
		КонецЕсли;
		ТекДанные.Профиль = ККСНГ_РаботаСКонтрагентамиВызовСервера.ПрофильКонтрагента(ПрофильНастройкиЭДО, НовыйКонтрагент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	ОтправительИНН = ?(ТекДанные = Неопределено, "", ТекДанные.SenderInn);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИНН", ОтправительИНН);
	
	ПослеВыбораКонтрагента = Новый ОписаниеОповещения("ОбработкаВыбораПолучателя", ЭтотОбъект, Неопределено);
		
	ККСНГ_ПриглашенияКлиент.ОткрытьФормуВыбораКонтрагента(Отбор, Элементы.ТаблицаПриглашенийПринятые, ПослеВыбораКонтрагента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийПринятыеОбрабатыватьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Обрабатывать Тогда
		Если НРЕГ(ТекДанные.Status) = "processed" И НРЕГ(ТекДанные.Side) = "receiver" Тогда
			
			ПутьКПолю = "ТаблицаПриглашенийПринятые[" + ТаблицаПриглашенийПринятые.Индекс(Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные) + "].Контрагент";
			Если НЕ ЗначениеЗаполнено(ТекДанные.Контрагент) Тогда
				ТекДанные.Обрабатывать = Ложь;
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен контрагент. Заполните контрагента и повторно примите приглашение", , ПутьКПолю);
			Иначе
				РеквизитыКонтрагента = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИмеющегосяРеквизитаОбъекта(ТекДанные.Контрагент, "ИНН, КПП");
				Если НЕ ТекДанные.SenderInn = РеквизитыКонтрагента["ИНН"] ИЛИ НЕ ТекДанные.SenderKpp = РеквизитыКонтрагента["КПП"] Тогда
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ИНН/КПП выбранного контрагента не совпадает с ИНН/КПП отправителя", , ПутьКПолю);
				КонецЕсли;
			КонецЕсли;

		Иначе
			ТекДанные.Обрабатывать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПриглашенийОтправленные

&НаКлиенте
Процедура ТаблицаПриглашенийОтправленныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОтправитьReceiverName" И НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		
		ПрофильКонтрагента = ККСНГ_РаботаСКонтрагентамиВызовСервера.ПрофильКонтрагента(ПрофильНастройкиЭДО, Элемент.ТекущиеДанные.Контрагент);
		Если Не ПрофильКонтрагента.Пустая() Тогда
			ККСНГ_ПриглашенияКлиент.ОткрытьФормуПрофиляКонтрагента(ПрофильКонтрагента, Элементы.ТаблицаПриглашенийОтправленные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриглашенийОтправленныеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныеКонтрагенты1С = ВыбранноеЗначение;
	
	Если Не ВыбранныеКонтрагенты1С = Неопределено  Тогда
		Если ВыбранныеКонтрагенты1С.Количество() > 1 Тогда
			ПараметрыОткрытия = Новый Структура("Контрагенты1С, ПрофильОрганизацииЭДО", ВыбранныеКонтрагенты1С, ПрофильНастройкиЭДО);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаПриглашенийЗакрытие", ЭтотОбъект);
			ОткрытьФорму("Обработка.ККСНГ_СинхронизацияКонтрагентов.Форма.ОтправкаПриглашений", ПараметрыОткрытия,
				Элементы.ТаблицаПриглашенийОтправленные, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ПослеАвторизации = Новый ОписаниеОповещения("ПригласитьКонтрагентовЗавершение", ЭтотОбъект, ВыбранныеКонтрагенты1С);
			ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодписатьИОтправить(Команда)

	НачатьОтправкуДокументов(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьБезПодписи(Команда)
	
	НачатьОтправкуДокументов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФайлы(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	ПараметрыОткрытия.Вставить("БизнесПроцесс", БизнесПроцессРаздела);
	
	ОткрытьФорму("Обработка.ККСНГ_СфераКурьер.Форма.ОтправкаФайлов", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)

	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
		
	Если Элементы.ДокументыКОтправке.ВыделенныеСтроки.Количество() Тогда
		
		Для Каждого ИдентификаторСтроки Из Элементы.ДокументыКОтправке.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ДокументыКОтправке.ДанныеСтроки(ИдентификаторСтроки);
			Прервать;
		КонецЦикла;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
		ДопПараметры.Вставить("ДокументСсылка", ДанныеСтроки.Ссылка);
		ДопПараметры.Вставить("ВидЭД", ДанныеСтроки.ВидЭД);
		ДопПараметры.Вставить("Контрагент", ДанныеСтроки.Контрагент);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеАвторизацииДополнительныеРеквизиты", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрПоДокументам(Команда)

	АктивныйФильтр = ПолучитьАктивныйФильтрПоДокументам();
	ИмяАктивногоФильтра = ?(АктивныйФильтр = Неопределено, "", АктивныйФильтр.Имя);
	ИмяУстанавливаемогоФильтра = Команда.Имя;
	
	Если Не ИмяАктивногоФильтра = ИмяУстанавливаемогоФильтра Тогда
		
		Если ИмяУстанавливаемогоФильтра = "ФильтрВсеДокументы" Тогда
			ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке,
										"Новый", Истина, ВидСравненияКомпоновкиДанных.Равно, , Ложь);
			
			УстановитьПометкуАктивногоФильтраПоДокументам(Элементы.ДокументыКОтправкеПоказатьВсеДокументы);
							
		ИначеЕсли ИмяУстанавливаемогоФильтра = "ФильтрРанееОтправленные" Тогда
			ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке,
										"Новый", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
			
			УстановитьПометкуАктивногоФильтраПоДокументам(Элементы.ДокументыКОтправкеКомандаПоказатьРанееОтправленные);
			
		Иначе
			ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке,
										"Новый", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);

			УстановитьПометкуАктивногоФильтраПоДокументам(Элементы.ДокументыКОтправкеКомандаПоказатьНовые);
			
		КонецЕсли;
		
	КонецЕсли;
	
	МассивОтправленныхДокументов.Очистить();
	ОтправленныеДокументы = МассивОтправленныхДокументов.ВыгрузитьЗначения();

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "Ссылка",
										ОтправленныеДокументы, ВидСравненияКомпоновкиДанных.НеВСписке, , Ложь);
										
	ОбновитьСоответствияРазделовДаннымФормированияЗапросов(ТекущийРаздел);
	ОбновитьСчетчикиРазделовДокументов();
										
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьКвитанции(Команда)
	
	ДанныеЭД = Новый Массив;
	
	Для каждого ИдентификаторСтроки Из Элементы.ДокументыСКвитанциями.ВыделенныеСтроки Цикл
		
		ТекДанные = Элементы.ДокументыСКвитанциями.ДанныеСтроки(ИдентификаторСтроки);
		
		ТекДанныеЭД = Новый Структура;
		ТекДанныеЭД.Вставить("ИдДокумента", ТекДанные.Id);
		ТекДанныеЭД.Вставить("ЭДСсылка", ТекДанные.Ссылка);
		ТекДанныеЭД.Вставить("ЭтоРоуминг", ТекДанные.IsRoaming);
		
		ДанныеЭД.Добавить(ТекДанныеЭД);
		
	КонецЦикла;
	
	Если ДанныеЭД.Количество() > 0 Тогда
		
		ПараметрыПодписания = Новый Структура;
		ПараметрыПодписания.Вставить("ДанныеЭД", ДанныеЭД);
		
		ПослеАвторизации = Новый ОписаниеОповещения("ПродолжитьПодписаниеКвитанций", ЭтотОбъект, ПараметрыПодписания);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурьерAvoidanceRequest(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерAcceptAvoidance(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерRejectAvoidance(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерAccept(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерReject(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерAcceptWithTicketNoDisaccordSign(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерAcceptWithTicketDisaccordSign(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерSign(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерSend(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерRejectWithTicket(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КурьерRevoke(Команда)
	ВыполнитьДействиеКурьер(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКУчетуВх(Команда)
	
	ТекущиеДанные = Элементы.ВходящиеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	    Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Объект, ЕстьМаркировка", ТекущиеДанные.Ссылка, ТекущиеДанные.Маркированный);
			
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	ОбщийМодульПринятиеКУчету.ОткрытьФормуПринятияКУчету(ПараметрыФормы, ЭтотОбъект, ТекущиеДанные.Id, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРанееУчтенныйВх(Команда)
	
	ТекущиеДанные = Элементы.ВходящиеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("ЭлектронныйДокумент", ТекущиеДанные.Ссылка);
	ДанныеДокумента.Вставить("ЭтоВходящий", Истина);
	ДанныеДокумента.Вставить("КодТипаДокумента", ТекущиеДанные.DocumentTypeCode);
	
	// TODO Вынести в общий модуль
	НачатьВыборДокумента1С(ДанныеДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеКурьер(Команда)
	
	ВыполнитьОбновлениеДанныхКурьера();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеструктурированныйДокумент(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;

	ПродолжитьОтправкуДокумента = Новый ОписаниеОповещения("ПослеАвторизацииОтправитьДокумент", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПродолжитьОтправкуДокумента);
				
КонецПроцедуры

#Область КомандыПриглашений

&НаКлиенте
Процедура ОтклонитьПриглашения(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;

	ИДПриглашений = ИДВыделенныхПриглашений(ТаблицаПриглашенийПринятые);
	Если ИДПриглашений.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИДПриглашений", ИДПриглашений);
		ПослеАвторизации = Новый ОписаниеОповещения("ОтклонитьПриглашенияЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтозватьПриглашения(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;

	ИДПриглашений = ИДВыделенныхПриглашений(ТаблицаПриглашенийОтправленные);
	Если ИДПриглашений.Количество() > 0 Тогда
		Элементы.ОтозватьПриглашения.Доступность = Ложь;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИДПриглашений", ИДПриглашений);
		ПослеАвторизации = Новый ОписаниеОповещения("ОтозватьПриглашениеЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПригласитьКонтрагентов(Команда)
	
	Если Элементы.ПригласитьКонтрагентов.Доступность = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;

	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Истина, Истина);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыПодбора,
		Элементы.ТаблицаПриглашенийОтправленные, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
												
КонецПроцедуры
											
&НаКлиенте
Процедура ПринятьПриглашения(Команда)
	
	Если Элементы.ПринятьПриглашения.Доступность = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;

	ИДПриглашений = ИДВыделенныхПриглашений(ТаблицаПриглашенийПринятые);
	Если ИДПриглашений.Количество() > 0 Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПрофильЭДООрганизации", ПрофильНастройкиЭДО);
		ДопПараметры.Вставить("ИДПриглашений", ИДПриглашений);
		ПослеАвторизации = Новый ОписаниеОповещения("ПринятьПриглашенияЗавершение", ЭтотОбъект, ДопПараметры);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокПриглашений(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСписокПриглашенийЗавершение", ЭтотОбъект, "Sender");
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокПолученныхПриглашений(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСписокПриглашенийЗавершение", ЭтотОбъект, "Receiver");
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПрофильОрганизации()

	Если Не ЭтотОбъект.ПрофильНастройкиЭДО.Пустая()
		И (ЭтотОбъект.ПрофильНастройкиЭДО.ПолучитьОбъект() = Неопределено
		ИЛИ ЭтотОбъект.ПрофильНастройкиЭДО.ПометкаУдаления) Тогда
		
		ЭтотОбъект.ПрофильНастройкиЭДО = Неопределено;
		
	КонецЕсли;
	
	ДоступныеПрофилиЭДО = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДоступныеПрофилиЭДОПользователя();
	
	Если ЭтотОбъект.ПрофильНастройкиЭДО.Пустая()
		И ДоступныеПрофилиЭДО.Количество() > 0 Тогда
		
		Для Каждого СтрДоступныйПрофиль Из ДоступныеПрофилиЭДО Цикл
			
			Если НЕ СтрДоступныйПрофиль.ПометкаУдаления Тогда
				
				ЭтотОбъект.ПрофильНастройкиЭДО = СтрДоступныйПрофиль;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПодписание(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ДанныеКОтправке = ДопПараметры.ДанныеКОтправке;
		ПодписатьДанные = ДопПараметры.ПодписатьДанные;
		
		ДопДанные = Новый Структура;
		ДопДанные.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		ДопДанные.Вставить("ДанныеКОтправке", ДанныеКОтправке);
		ДопДанные.Вставить("ПодписатьДанные", ПодписатьДанные);
		
		Если ДанныеКОтправке.Количество() = 1 Тогда
			ПодтвердитьОтправкуДокументовЗавершение(Истина, ДопДанные);
		Иначе
			
			НовыйОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодтвердитьОтправкуДокументовЗавершение", ЭтотОбъект, ДопДанные);
			СтруктураОтбора = Новый Структура("МассивДокументов, БизнесПроцесс", ДанныеКОтправке, БизнесПроцессРаздела);
			
			ОткрытьФорму("Обработка.ККСНГ_СфераКурьер.Форма.ФормаПодтвержденияОтправки", СтруктураОтбора, ЭтотОбъект, , , , НовыйОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	Иначе
		
		Элементы.ДокументыКОтправкеПодписатьИОтправить.Доступность = Истина;
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПодписаниеКвитанций(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Перем ПараметрыАвторизации;
	Перем ЭлектронныеДокументы, ДанныеДокумента;
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		ЭлектронныеДокументы = Новый Массив;
		Для каждого ДанныеДокумента Из ДопПараметры.ДанныеЭД Цикл
			ЭлектронныеДокументы.Добавить(ДанныеДокумента.ЭДСсылка);
		КонецЦикла;
		
		ККСНГ_ДокументооборотКлиент.ОбработатьКомандуКурьерПодписатьКвитанцииДокумента(ЭлектронныеДокументы, ПараметрыАвторизации, , УникальныйИдентификатор);
		
	Иначе
		
		Элементы.ДокументыКОтправкеПодписатьИОтправить.Доступность = Истина;
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиЗначениеБизнесПроцесса(Строки)
	
	МассивДокументов = Новый Массив;
	СоответствиеСтрок = Новый Соответствие;
	
	Для каждого ТекущаяСтрока Из Строки Цикл
		
		ДанныеСтроки = ТекущаяСтрока.Значение.Данные;
		МассивДокументов.Добавить(ДанныеСтроки.Ссылка);
		
		СоответствиеСтрок.Вставить(ДанныеСтроки.Ссылка, ТекущаяСтрока.Значение.Данные);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ККСНГ_ЭлектронныеДокументыProperties.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументыProperties.Value КАК СТРОКА(10))) = ""UVHD""
	               |			ТОГДА ""ЭДО с поставщиками""
	               |		ИНАЧЕ ККСНГ_ЭлектронныеДокументыProperties.Value
	               |	КОНЕЦ КАК Value
	               |ИЗ
	               |	Справочник.ККСНГ_ЭлектронныеДокументы.Properties КАК ККСНГ_ЭлектронныеДокументыProperties
	               |ГДЕ
	               |	(ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументыProperties.Key КАК СТРОКА(50))) = &Key
	               |	И ККСНГ_ЭлектронныеДокументыProperties.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Key", "business process");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультат = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаРезультат.Следующий() Цикл
			
			ДанныеСтроки = СоответствиеСтрок.Получить(ВыборкаРезультат.Ссылка);
			
			Если ДанныеСтроки <> Неопределено Тогда
				ДанныеСтроки.БизнесПроцесс = ВыборкаРезультат.Value;
			КонецЕсли;
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресТаблицыОшибок(ТаблицаОшибокКопия)

	ТаблицаОшибок = ДанныеФормыВЗначение(ТаблицаОшибокКопия, Тип("ТаблицаЗначений"));
	АдресТаблицы = ПоместитьВоВременноеХранилище(ТаблицаОшибок);
	
	Возврат АдресТаблицы;
	
КонецФункции

&НаКлиенте
Процедура ПослеАвторизацииДополнительныеРеквизиты(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		ДопПараметры.Вставить("БизнесПроцесс", БизнесПроцессРаздела);
		
		ОткрытьФорму("Обработка.ККСНГ_ДополнительныеРеквизитыЭД.Форма.Форма", ДопПараметры, ЭтотОбъект);

	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		Элементы.ДокументыКОтправкеПодписатьИОтправить.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПолучателя(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		ТаблицаПриглашенийПринятыеКонтрагентПриИзменении(Неопределено, ВыбранноеЗначение);
		
		ТекДанные = Элементы.ТаблицаПриглашенийПринятые.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда
			ТекДанные.Контрагент = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыЭДПоказатьОтметкуЗавершение(Список, ДопПараметры) Экспорт

	Если Список <> Неопределено Тогда

		ВыбранныеВидыЭД = Новый Массив;

		Для каждого ЭлементСписка Из ОтборВидыЭД Цикл
			Если ЭлементСписка.Пометка Тогда
				ВыбранныеВидыЭД.Добавить(ЭлементСписка.Значение);
			КонецЕсли;

		КонецЦикла;

		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "ВидЭД", ВыбранныеВидыЭД, , , Истина);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОтправкуДокументовЗавершение(Результат, ДопДанные) Экспорт
	
	Если Результат = Истина Тогда
		
		МассивДокументов = Новый Массив;
		ДанныеКОтправке = ДопДанные.ДанныеКОтправке;
		
		Для каждого ДанныеСтруктура Из ДанныеКОтправке Цикл
			МассивДокументов.Добавить(ДанныеСтруктура.Ссылка);
		КонецЦикла;
		
		// Проверим заполнение доп. реквизитов документов
		ЗапросПроверкиДопРеквизитов = ККСНГ_ОтправкаЭДКлиент.ПроверкаЗаполненияДопРеквизитовДокументов(МассивДокументов);
		
		ПодписатьДанные = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопДанные, "ПодписатьДанные", Истина);
		
		Если ЗапросПроверкиДопРеквизитов.Успех Тогда
			
			ПараметрыАвторизации = ДопДанные.ПараметрыАвторизации;
			
			ПараметрыОповещения = Новый Структура("БизнесПроцесс", БизнесПроцессРаздела);
			
			ОповещениеЗавершения = Новый ОписаниеОповещения("ПодписатьИОтправитьЭлектронныеДокументыЗавершение", ЭтотОбъект, ПараметрыОповещения);
			
			ККСНГ_ОтправкаЭДКлиент.ПодписатьИОтправитьЭлектронныеДокументы(ДанныеКОтправке, ПрофильНастройкиЭДО, ПараметрыАвторизации, ПодписатьДанные, ОповещениеЗавершения);
			
		Иначе // Пока просто вывод
			Элементы.ДокументыКОтправкеПодписатьИОтправить.Доступность = Истина;
			ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросПроверкиДопРеквизитов.Журнал, "-1");
		КонецЕсли;
		
	Иначе
		ПодписатьИОтправитьЭлектронныеДокументыЗавершение(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиСписковТекущегоРаздела(Раздел)

	Если ДоступнаРаботаПоБизнесПроцессуУВХД И БизнесПроцессРаздела = "УВХД" Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "ЭтоКонтрагентСбер",
																		Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "ДоступенПоУВХД",
																		Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе
		ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ДокументыКОтправке.Отбор, "ЭтоКонтрагентСбер");
		ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ДокументыКОтправке.Отбор, "ДоступенПоУВХД");
	КонецЕсли;
	
	НастройкиОтбораДляВходящихИсходящих = НастройкиОтбораСписковРаздела(Раздел);
	
	// TODO Пересмотреть подход к установке фильтров
	Если Раздел = "Исходящие" Или Раздел = "ОтозватьИсх"
			Или Раздел = "ЗапроситьАннулированиеИсх" Или Раздел = "АннулироватьИсх" Или Раздел = "ОтклоненныеИсх"
				Или Раздел = "ОтправитьИсх" Или Раздел = "ПодписатьИсх"
				Или Раздел = "Черновики" Или Не ЗначениеЗаполнено(Раздел) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсходящиеДокументы, "ИспользоватьОтборДействий",
																						НастройкиОтбораДляВходящихИсходящих.ИспользоватьОтборДействий);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсходящиеДокументы, "Actions",
																						НастройкиОтбораДляВходящихИсходящих.Actions);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсходящиеДокументы, "ИспользоватьОтборСтатусов",
																						НастройкиОтбораДляВходящихИсходящих.ИспользоватьОтборСтатусов);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсходящиеДокументы, "Statuses",
																						НастройкиОтбораДляВходящихИсходящих.Statuses);
	КонецЕсли;
	
	Если Раздел = "Входящие" Или Раздел = "ПринятьВх"
			Или Раздел = "ПодписатьВх" Или Раздел = "АннулироватьВх"
				Или Раздел = "ЗапроситьАннулированиеВх" Или Раздел = "ПринятьКУчетуВх" Или Не ЗначениеЗаполнено(Раздел) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы, "ИспользоватьОтборДействий",
																						НастройкиОтбораДляВходящихИсходящих.ИспользоватьОтборДействий);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы, "Actions",
																						НастройкиОтбораДляВходящихИсходящих.Actions);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы, "ИспользоватьОтборСтатусов",
																						НастройкиОтбораДляВходящихИсходящих.ИспользоватьОтборСтатусов);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы, "Statuses",
																						НастройкиОтбораДляВходящихИсходящих.Statuses);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы, "ОтборПоНеПринятымКУчету",
																						НастройкиОтбораДляВходящихИсходящих.ОтборПоНеПринятымКУчету);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы, "ОтборПоЗавершенным",
																						НастройкиОтбораДляВходящихИсходящих.ОтборПоЗавершенным);
	КонецЕсли;
	
	Если ДоступнаРаботаСПриглашениями Тогда
		ФильтрСтатусовИсходящих = "Processed";
		ФильтрСтатусовВходящих = "Processed";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиОтбораСписковРаздела(Раздел = Неопределено)

	Результат = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Раздел) Тогда
		
		Результат.Вставить("ИспользоватьОтборДействий", Ложь);
		Результат.Вставить("Actions", Новый Массив);
		Результат.Вставить("Statuses", Новый Массив);
		Результат.Вставить("ИспользоватьОтборСтатусов", Ложь);
		Результат.Вставить("ОтборПоНеПринятымКУчету", Ложь);
		Результат.Вставить("ОтборПоЗавершенным", Ложь);
		
	Иначе
		
		ДействияРаздела = СоответствиеДействияРаздела(Раздел);
		ЕстьОтборПоДействиям = ДействияРаздела.Количество() > 0;
		СтатусыРаздела = СоответствиеСтатусыРаздела(Раздел);
		ЕстьОтборПоСтатусам = СтатусыРаздела.Количество() > 0;
		ЕстьОтборПоНеПринятымКУчету = СоответствиеЕстьОтборПоНеПринятымКУчету(Раздел);
		ЕстьОтборПоЗавершенным = СоответствиеЕстьОтборПоЗавершенным(Раздел);
		
		Результат.Вставить("Actions", ДействияРаздела);
		Результат.Вставить("ИспользоватьОтборДействий", ЕстьОтборПоДействиям);
		Результат.Вставить("Statuses", СтатусыРаздела);
		Результат.Вставить("ИспользоватьОтборСтатусов", ЕстьОтборПоСтатусам);
		Результат.Вставить("ОтборПоНеПринятымКУчету", ЕстьОтборПоНеПринятымКУчету);
		Результат.Вставить("ОтборПоЗавершенным", ЕстьОтборПоЗавершенным);
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПометкуАктивногоФильтраПоДокументам(АктивныйЭлемент)
	
	Для каждого ТекЭлемент Из Элементы.ДокументыКОтправкеГруппаФильтрДокументов.ПодчиненныеЭлементы Цикл
		Если АктивныйЭлемент = ТекЭлемент Тогда
			ТекЭлемент.Пометка = Истина;
		Иначе
			ТекЭлемент.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьАктивныйФильтрПоДокументам()
	
	Для каждого ТекЭлемент Из Элементы.ДокументыКОтправкеГруппаФильтрДокументов.ПодчиненныеЭлементы Цикл
		Если ТекЭлемент.Пометка Тогда
			Возврат ТекЭлемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьДеревоРазделов()

	Дерево = РеквизитФормыВЗначение("ДеревоДействийРазделов");
	
	// Документы
	СтрокаПодписатьИОтправить = Дерево.Строки.Добавить();
	СтрокаПодписатьИОтправить.Значение = "ПодписатьИОтправить";
	СтрокаПодписатьИОтправить.ЭтоДокумент = Истина;
	
	Если ДоступнаРаботаПоБизнесПроцессуУВХД Тогда
		СтрокаПодписатьИОтправитьУВХД = Дерево.Строки.Добавить();
		СтрокаПодписатьИОтправитьУВХД.Значение = "ПодписатьИОтправитьУВХД";
		СтрокаПодписатьИОтправитьУВХД.ЭтоДокумент = Истина;
	КонецЕсли;
	
	Если ДоступнаРаботаСЧерновиками Тогда
		СтрокаЧерновики = Дерево.Строки.Добавить();
		СтрокаЧерновики.Значение = "Черновики";
		СтрокаЧерновики.ЭтоДокумент = Истина;
	КонецЕсли;
	
	СтрокаПодписатьКвитанции = Дерево.Строки.Добавить();
	СтрокаПодписатьКвитанции.Значение = "ПодписатьКвитанции";
	СтрокаПодписатьКвитанции.ЭтоДокумент = Истина;
	
	СтрокаВходящие = Дерево.Строки.Добавить();
	СтрокаВходящие.Значение = "Входящие";
	СтрокаВходящие.ЭтоДокумент = Истина;
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = "ПринятьВх";
	НовЗапись.ЭтоДокумент = Истина;
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = "ПодписатьВх";
	НовЗапись.ЭтоДокумент = Истина;
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = "АннулироватьВх";
	НовЗапись.ЭтоДокумент = Истина;
	НовЗапись = СтрокаВходящие.Строки.Добавить();
	НовЗапись.Значение = "ПринятьКУчетуВх";
	НовЗапись.ЭтоДокумент = Истина;
	
	СтрокаИсходящие = Дерево.Строки.Добавить();
	СтрокаИсходящие.Значение = "Исходящие";
	СтрокаИсходящие.ЭтоДокумент = Истина;
	
	Если ДоступнаРаботаСЧерновиками Тогда
		НовЗапись = СтрокаИсходящие.Строки.Добавить();
		НовЗапись.Значение = "ПодписатьИсх";
		НовЗапись.ЭтоДокумент = Истина;
		НовЗапись = СтрокаИсходящие.Строки.Добавить();
		НовЗапись.Значение = "ОтправитьИсх";
		НовЗапись.ЭтоДокумент = Истина;
	КонецЕсли;
	
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = "ОтозватьИсх";
	НовЗапись.ЭтоДокумент = Истина;
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = "АннулироватьИсх";
	НовЗапись.ЭтоДокумент = Истина;
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = "ОтклоненныеИсх";
	НовЗапись.ЭтоДокумент = Истина;
	
	СтрокаОбработанные = Дерево.Строки.Добавить();
	СтрокаОбработанные.Значение = "Обработанные";
	СтрокаОбработанные.ЭтоДокумент = Истина;
	
	// Приглашения
	Если ДоступнаРаботаСПриглашениями Тогда
		
		СтрокаПриглашения = Дерево.Строки.Добавить();
		СтрокаПриглашения.Значение = "Приглашения";
		СтрокаПриглашения.ЭтоПриглашение = Истина;
		
		ВходящиеПриглашенияСтрока = СтрокаПриглашения.Строки.Добавить();
		ВходящиеПриглашенияСтрока.Значение = "ВходящиеПригл";
		ВходящиеПриглашенияСтрока.ЭтоПриглашение = Истина;
		ИсходящиеПриглашенияСтрока = СтрокаПриглашения.Строки.Добавить();
		ИсходящиеПриглашенияСтрока.Значение = "ИсходящиеПригл";
		ИсходящиеПриглашенияСтрока.ЭтоПриглашение = Истина;
		ОбработанныеПриглашенияСтрока = СтрокаПриглашения.Строки.Добавить();
		ОбработанныеПриглашенияСтрока.Значение = "ОбработанныеПригл";
		ОбработанныеПриглашенияСтрока.ЭтоПриглашение = Истина;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДействийРазделов");
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьДеревоНавигации(ЭлементыДереваНавигации, ОбновлятьРазделыДокументов = Истина, ОбновлятьРазделыПриглашений = Истина)
	
	Для каждого СтрокаНавигации Из ЭлементыДереваНавигации Цикл
		
		//Если Не ОбновлятьРазделыДокументов И СтрокаНавигации.ЭтоДокумент Тогда
		//	Продолжить;
		//КонецЕсли;
		//
		//Если Не ОбновлятьРазделыПриглашений И СтрокаНавигации.ЭтоПриглашение Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ОтборРаздела = Новый Структура("Имя", СтрокаНавигации.Значение);
		НайденныеСтроки = ОписаниеРазделов.НайтиСтроки(ОтборРаздела);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		Раздел = НайденныеСтроки[0];
		
		СтрокаНавигации.Представление = Раздел.Представление;
		
		ВложенныеЭлементы = СтрокаНавигации.ПолучитьЭлементы();
		ЕстьВложенныеЭлементы = (ВложенныеЭлементы.Количество() > 0);
		
		Если ЕстьВложенныеЭлементы Тогда
			ОбновитьДеревоНавигации(ВложенныеЭлементы);
		Иначе
			
			Если Раздел.РассчитыватьКоличество И Раздел.КоличествоРассчитано И Раздел.Количество > 0 Тогда
				КоличествоПредставление = ?(Раздел.Количество > 999, "999+", Раздел.Количество);
				СтрокаНавигации.Представление = СтрокаНавигации.Представление + " (" + КоличествоПредставление + ")";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьРазделы()
	
	ОписаниеРазделов.Очистить();
	
	ДобавитьОписаниеРаздела("КОтправке", "К отправке", , Ложь);
	ДобавитьОписаниеРаздела("ПодписатьИОтправить", "Подписать и отправить");
	ДобавитьОписаниеРаздела("Входящие", "Входящие", , Ложь);
	ДобавитьОписаниеРаздела("ПринятьВх", "Принять");
	ДобавитьОписаниеРаздела("ПодписатьВх", "Подписать");
	ДобавитьОписаниеРаздела("АннулироватьВх", "Аннулировать");
	ДобавитьОписаниеРаздела("ЗапроситьАннулированиеВх", "Запросить аннулирование");
	ДобавитьОписаниеРаздела("ПринятьКУчетуВх", "Принять к учету");
	
	ДобавитьОписаниеРаздела("Исходящие", "Исходящие", , Ложь);
	ДобавитьОписаниеРаздела("ОтозватьИсх", "Отозвать");
	ДобавитьОписаниеРаздела("ЗапроситьАннулированиеИсх", "Запросить аннулирование");
	ДобавитьОписаниеРаздела("АннулироватьИсх", "Аннулировать");
	ДобавитьОписаниеРаздела("ОтклоненныеИсх", "Отклоненные");
	
	ДобавитьОписаниеРаздела("Обработанные", "Обработанные", , Ложь);
	
	Если ДоступнаРаботаСПриглашениями Тогда
		ДобавитьОписаниеРаздела("Приглашения", "Приглашения", , Ложь, "Приглашение");
		ДобавитьОписаниеРаздела("ИсходящиеПригл", "Исходящие", , , "Приглашение");
		ДобавитьОписаниеРаздела("ВходящиеПригл", "Входящие", , , "Приглашение");
		ДобавитьОписаниеРаздела("ОбработанныеПригл", "Обработанные", , , "Приглашение");
	КонецЕсли;
	
	Если ДоступнаРаботаСЧерновиками Тогда
		ДобавитьОписаниеРаздела("Черновики", "Черновики");
		ДобавитьОписаниеРаздела("ПодписатьИсх", "Подписать");
		ДобавитьОписаниеРаздела("ОтправитьИсх", "Отправить");
	КонецЕсли;
	
	ДобавитьОписаниеРаздела("ПодписатьКвитанции", "Подписать квитанции");
	
	Если ДоступнаРаботаПоБизнесПроцессуУВХД Тогда
		ДобавитьОписаниеРаздела("ПодписатьИОтправитьУВХД", "ЭДО с поставщиками");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьОписаниеРаздела(Знач Имя, Знач Представление = "", Знач Видимость = Истина, Знач РассчитыватьКоличество = Истина, ТипРаздела = "Документ")
	
	НовыйРаздел = ОписаниеРазделов.Добавить();
	НовыйРаздел.Имя = Имя;
	НовыйРаздел.Представление = Представление;
	НовыйРаздел.Видимость = Видимость;
	НовыйРаздел.РассчитыватьКоличество = РассчитыватьКоличество;
	НовыйРаздел.КоличествоРассчитано = Ложь;
	НовыйРаздел.ЭтоДокумент = ТипРаздела = "Документ";
	НовыйРаздел.ЭтоПриглашение = ТипРаздела = "Приглашение";
	
	Возврат НовыйРаздел;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьРаздел(Знач Раздел)
	ПоказатьКомандыРаздела(Раздел);
	ПоказатьСписокРаздела(Раздел);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКомандыРаздела(Знач Раздел)
	
	КомандыРазделов = Новый Соответствие();
	КомандыРазделов.Вставить("КОтправке", "");
	КомандыРазделов.Вставить("ПодписатьИОтправить", "ДокументыКОтправкеПодписатьИОтправить, ДокументыКОтправкеГруппаНеструктурированные, ДокументыКОтправкеОтправитьФайлы, ДокументыКОтправкеОтправитьНеструктурированныйДокумент" + ?(ДоступнаРаботаСЧерновиками, ", ДокументыКОтправкеОтправитьБезПодписи", ""));
	КомандыРазделов.Вставить("ПодписатьИОтправитьУВХД", "ДокументыКОтправкеПодписатьИОтправить, ДокументыКОтправкеГруппаНеструктурированные, ДокументыКОтправкеОтправитьФайлы"+ ?(ДоступнаРаботаСЧерновиками, ", ДокументыКОтправкеОтправитьБезПодписи", ""));
	КомандыРазделов.Вставить("ПодписатьКвитанции", "ДокументыСКвитанциямиПодписатьКвитанции");
	КомандыРазделов.Вставить("Входящие", "");
	КомандыРазделов.Вставить("ПринятьВх", "КурьерAccept");
	КомандыРазделов.Вставить("ПодписатьВх", "КурьерAcceptWithTicketNoDisaccordSign, КурьерAcceptWithTicketDisaccordSign");
	КомандыРазделов.Вставить("АннулироватьВх", "КурьерAcceptAvoidance, КурьерRejectAvoidance");
	КомандыРазделов.Вставить("ЗапроситьАннулированиеВх", "КурьерAvoidanceRequest");
	КомандыРазделов.Вставить("ПринятьКУчетуВх", "ВходящиеДокументыПринятьКУчетуВх, ВходящиеДокументыОткрытьРанееУчтенныйВх");
	КомандыРазделов.Вставить("Исходящие", "");
	КомандыРазделов.Вставить("ОтозватьИсх", "КурьерRevoke");
	КомандыРазделов.Вставить("ЗапроситьАннулированиеИсх", "КурьерAvoidanceRequestOut");
	КомандыРазделов.Вставить("АннулироватьИсх", "КурьерAcceptAvoidanceOut, КурьерRejectAvoidanceOut");
	КомандыРазделов.Вставить("ОтклоненныеИсх", "");
	КомандыРазделов.Вставить("Обработанные", "");
	
	Если ДоступнаРаботаСПриглашениями Тогда
		КомандыРазделов.Вставить("Приглашения", "");
		КомандыРазделов.Вставить("ИсходящиеПригл", "ПриглашенияОтозвать, ПриглашенияОтправить");
		КомандыРазделов.Вставить("ВходящиеПригл", "ПриглашенияПринять, ПриглашенияОтклонить");
		КомандыРазделов.Вставить("ОбработанныеПригл", "");
	КонецЕсли;
	
	Если ДоступнаРаботаСЧерновиками Тогда
	 	КомандыРазделов.Вставить("Черновики", "");
		КомандыРазделов.Вставить("ПодписатьИсх", "КурьерИсхSign");
		КомандыРазделов.Вставить("ОтправитьИсх", "КурьерSend");
	КонецЕсли;
	
	ЭлементыКоманд = Новый Соответствие();
	ЭлементыКоманд.Вставить("ДокументыКОтправкеПодписатьИОтправить", Элементы.ДокументыКОтправкеПодписатьИОтправить);
	ЭлементыКоманд.Вставить("ДокументыКОтправкеГруппаНеструктурированные", Элементы.ДокументыКОтправкеГруппаНеструктурированные);
	ЭлементыКоманд.Вставить("ДокументыКОтправкеОтправитьФайлы", Элементы.ДокументыКОтправкеОтправитьФайлы);
	ЭлементыКоманд.Вставить("ДокументыКОтправкеОтправитьНеструктурированныйДокумент", Элементы.ДокументыКОтправкеОтправитьНеструктурированныйДокумент);
	ЭлементыКоманд.Вставить("ДокументыСКвитанциямиПодписатьКвитанции", Элементы.ДокументыСКвитанциямиПодписатьКвитанции);
	ЭлементыКоманд.Вставить("КурьерRevoke", Элементы.КурьерRevoke);
	ЭлементыКоманд.Вставить("КурьерAccept", Элементы.КурьерAccept);
	ЭлементыКоманд.Вставить("КурьерAcceptWithTicketNoDisaccordSign", Элементы.КурьерAcceptWithTicketNoDisaccordSign);
	ЭлементыКоманд.Вставить("КурьерAcceptWithTicketDisaccordSign", Элементы.КурьерAcceptWithTicketDisaccordSign);
	ЭлементыКоманд.Вставить("КурьерSign", Элементы.КурьерSign);
	ЭлементыКоманд.Вставить("КурьерSend", Элементы.КурьерSend);
	ЭлементыКоманд.Вставить("ВходящиеДокументыПринятьКУчетуВх", Элементы.ВходящиеДокументыПринятьКУчетуВх);
	ЭлементыКоманд.Вставить("ВходящиеДокументыОткрытьРанееУчтенныйВх", Элементы.ВходящиеДокументыОткрытьРанееУчтенныйВх);
	ЭлементыКоманд.Вставить("КурьерReject", Элементы.КурьерReject);
	ЭлементыКоманд.Вставить("КурьерRejectWithTicket", Элементы.КурьерRejectWithTicket);
	
	Если ДоступнаРаботаСПриглашениями Тогда
		ЭлементыКоманд.Вставить("ПриглашенияОтправить", Элементы.ПригласитьКонтрагентов);
		ЭлементыКоманд.Вставить("ПриглашенияОтозвать", Элементы.ОтозватьПриглашения);
		ЭлементыКоманд.Вставить("ПриглашенияПринять", Элементы.ПринятьПриглашения);
		ЭлементыКоманд.Вставить("ПриглашенияОтклонить", Элементы.ОтклонитьПриглашения);
	КонецЕсли;
	
	ЭлементыКоманд.Вставить("ДокументыКОтправкеОтправитьБезПодписи", Элементы.ДокументыКОтправкеОтправитьБезПодписи);
	ЭлементыКоманд.Вставить("КурьерИсхSign", Элементы.КурьерИсхSign);
	ЭлементыКоманд.Вставить("КурьерAvoidanceRequest", Элементы.КурьерAvoidanceRequest);
	ЭлементыКоманд.Вставить("КурьерAcceptAvoidance", Элементы.КурьерAcceptAvoidance);
	ЭлементыКоманд.Вставить("КурьерRejectAvoidance", Элементы.КурьерRejectAvoidance);
	ЭлементыКоманд.Вставить("КурьерAvoidanceRequestOut", Элементы.КурьерAvoidanceRequestOut);
	ЭлементыКоманд.Вставить("КурьерAcceptAvoidanceOut", Элементы.КурьерAcceptAvoidanceOut);
	ЭлементыКоманд.Вставить("КурьерRejectAvoidanceOut", Элементы.КурьерRejectAvoidanceOut);
	
	КомандыРаздела = СтрРазделить(КомандыРазделов.Получить(Раздел), ", ", Ложь);
	
	Для каждого КлючЗначение Из ЭлементыКоманд Цикл
		
		ИмяКоманды = КлючЗначение.Ключ;
		ЭлементФормы = КлючЗначение.Значение;
		КомандаНайдена = Не КомандыРаздела.Найти(ИмяКоманды) = Неопределено;
		КомандаДоступна = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементФормы.Имя, "Видимость", КомандаНайдена И КомандаДоступна);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокРаздела(Знач Раздел)
	ПоказатьСтраницуРаздела(Раздел);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуРаздела(Знач Раздел)
	
	ИмяСтраницы = СтраницаРаздела(Раздел);
	
	Если ЗначениеЗаполнено(ИмяСтраницы) Тогда
		Элементы.ГруппаРазделов.ТекущаяСтраница = Элементы[ИмяСтраницы];
		УстановитьРазрешениеМножественногоВыделения(Раздел);
	КонецЕсли;
	
	Если Элементы.ГруппаРазделов.ТекущаяСтраница = Элементы.ГруппаВходящиеДокументы Тогда
		ВходящиеДокументыОбработатьАктивизациюСтроки();
	ИначеЕсли Элементы.ГруппаРазделов.ТекущаяСтраница = Элементы.ГруппаИсходящиеДокументы Тогда
		ИсходящиеДокументыОбработатьАктивизациюСтроки();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеДокументыОбработатьАктивизациюСтроки()
	
	ТекДанные = Элементы.ИсходящиеДокументы.ТекущиеДанные;
	
	Если ТекущийРаздел = "Черновики" И НЕ ТекДанные = Неопределено Тогда
		
		МассивДействий = "Sign,Send";
		
		ДействияДокумента = ККСНГ_ЭлектронныеДокументыВызовСервера.ДоступностьДействийДокумента(ТекДанные.Ссылка, МассивДействий);
		
		Элементы.КурьерИсхSign.Видимость = ДействияДокумента.Получить("Sign");
		Элементы.КурьерSend.Видимость = ДействияДокумента.Получить("Send");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеДокументыОбработатьАктивизациюСтроки()
	
	ТекущиеДанные = Элементы.ВходящиеДокументы.ТекущиеДанные;
	Если Не ТекущийРаздел = "ПринятьКУчетуВх" Или ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	ЗапросДоступностиПринятияКУчету = ОбщийМодульПринятиеКУчету.ПринятиеКУчетуДоступно(ТекущиеДанные.Ссылка, ТекущиеДанные.DocumentTypeCode);
	Если ЗапросДоступностиПринятияКУчету.Успех Тогда
		ПринятиеКУчетуДоступно = ЗапросДоступностиПринятияКУчету.Результат;
	Иначе
		ПринятиеКУчетуДоступно = Ложь;
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросДоступностиПринятияКУчету.Журнал, "-1");
	КонецЕсли;
	
	Элементы.ВходящиеДокументыПринятьКУчетуВх.Видимость = ПринятиеКУчетуДоступно;
	 
КонецПроцедуры

&НаКлиенте
Функция СтраницаРаздела(Знач Раздел)
	
	Страница = Неопределено;
	
	СтраницыРазделов = Новый Соответствие;
	СтраницыРазделов.Вставить("КОтправке", "ГруппаДокументыКОтправке");
	СтраницыРазделов.Вставить("ПодписатьИОтправить", "ГруппаДокументыКОтправке");
	СтраницыРазделов.Вставить("ПодписатьИОтправитьУВХД", "ГруппаДокументыКОтправке");
	
	СтраницыРазделов.Вставить("ПодписатьКвитанции", "ГруппаПодписатьКвитанции");
	
	СтраницыРазделов.Вставить("Входящие", "ГруппаВходящиеДокументы");
	СтраницыРазделов.Вставить("ПринятьВх", "ГруппаВходящиеДокументы");
	СтраницыРазделов.Вставить("ПодписатьВх", "ГруппаВходящиеДокументы");
	СтраницыРазделов.Вставить("АннулироватьВх", "ГруппаВходящиеДокументы");
	СтраницыРазделов.Вставить("ЗапроситьАннулированиеВх", "ГруппаВходящиеДокументы");
	СтраницыРазделов.Вставить("ПринятьКУчетуВх", "ГруппаВходящиеДокументы");
	
	СтраницыРазделов.Вставить("Исходящие", "ГруппаИсходящиеДокументы");
	СтраницыРазделов.Вставить("ОтозватьИсх", "ГруппаИсходящиеДокументы");
	СтраницыРазделов.Вставить("ЗапроситьАннулированиеИсх", "ГруппаИсходящиеДокументы");
	СтраницыРазделов.Вставить("АннулироватьИсх", "ГруппаИсходящиеДокументы");
	СтраницыРазделов.Вставить("ОтклоненныеИсх", "ГруппаИсходящиеДокументы");
	
	СтраницыРазделов.Вставить("Обработанные", "ГруппаОбработанныеДокументы");
	
	Если ДоступнаРаботаСПриглашениями Тогда
		СтраницыРазделов.Вставить("Приглашения", "ГруппаПриглашения");
		СтраницыРазделов.Вставить("ИсходящиеПригл", "ГруппаИсходящиеПриглашения");
		СтраницыРазделов.Вставить("ВходящиеПригл", "ГруппаВходящиеПриглашения");
		СтраницыРазделов.Вставить("ОбработанныеПригл", "ГруппаПриглашения");
	КонецЕсли;
	
	Если ДоступнаРаботаСЧерновиками Тогда
		СтраницыРазделов.Вставить("Черновики", "ГруппаИсходящиеДокументы");
		СтраницыРазделов.Вставить("ПодписатьИсх", "ГруппаИсходящиеДокументы");
		СтраницыРазделов.Вставить("ОтправитьИсх", "ГруппаИсходящиеДокументы");
	КонецЕсли;
	
	Страница = СтраницыРазделов.Получить(Раздел);

	Если ЗначениеЗаполнено(Страница) Тогда
		Страница = СтраницыРазделов.Получить(Раздел);
	КонецЕсли;
	
	Возврат Страница;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРазрешениеМножественногоВыделения(Раздел)
	
	ЗапрещенныеРазделы = РазделыЗапрещеноМножественноеВыделение();
	ИмяТаблицы = ПолучитьИмяТаблицыРаздела(Раздел);
	Если Не ИмяТаблицы = Неопределено Тогда
		РазделЗапрещен = Не ЗапрещенныеРазделы.Найти(Раздел) = Неопределено;
		Если РазделЗапрещен Тогда
			Элементы[ИмяТаблицы].РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		Иначе
			Элементы[ИмяТаблицы].РежимВыделения = РежимВыделенияТаблицы.Множественный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПрофиляЭДОДляСписковДокументов()

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыКОтправке,
																				"ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыСКвитанциями,
																				"ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсходящиеДокументы,
																				"ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ВходящиеДокументы,
																				"ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОбработанныеДокументы,
																				"ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуОшибокНаКлиенте(Журнал)

	ДанныеОшибок = Новый Массив;
	ЗаполнитьТаблицуОшибокНаСервере(Журнал, ДанныеОшибок, ПрофильНастройкиЭДО);
	
	Для каждого СтрокаДанных Из ДанныеОшибок Цикл
		НоваяСтрока = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.Обработать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТаблицуОшибокНаСервере(Журнал, ДанныеОшибок, ПрофильНастройкиЭДО)

	Для Каждого Сообщение Из Журнал Цикл
		Если ТипЗнч(Сообщение) = Тип("Массив") Тогда
			ЗаполнитьТаблицуОшибокНаСервере(Сообщение, ДанныеОшибок, ПрофильНастройкиЭДО);
		ИначеЕсли ТипЗнч(Сообщение) = Тип("Структура") Тогда
			Если Строка(Сообщение.Статус) = "-1" И ЗначениеЗаполнено(Сообщение.КодОшибки) Тогда
				
				ОтветПоОшибке = ККСНГ_ЛогированиеВызовСервера.ПолучитьСтруктуруИнформацииОбОшибкеПриОтправкеДокумента();
				
				ККСНГ_ЛогированиеВызовСервера.ИнициализироватьДанныеОшибки(ОтветПоОшибке, Сообщение, ПрофильНастройкиЭДО);
				
				ДанныеОшибок.Добавить(ОтветПоОшибке);
				
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтправкаЛогаОшибокЗавершение(Результат, ДопДанные) Экспорт

	АдресТаблицыОшибок = Неопределено;
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("АдресТаблицыОшибок", АдресТаблицыОшибок) Тогда
		
		Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
			Возврат;
		КонецЕсли;
		
		ТекстСсылки = ОбработатьВыбранныеОшибкиНаСервере(АдресТаблицыОшибок, ПрофильНастройкиЭДО);
		
		Если НЕ ТекстСсылки = Неопределено Тогда
			
		    ЗапуститьПриложение(ТекстСсылки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработатьВыбранныеОшибкиНаСервере(АдресТаблицыОшибок, ПрофильНастройкиЭДО)

	Если НЕ АдресТаблицыОшибок = Неопределено Тогда
	
		ТаблицаОшибок = ПолучитьИзВременногоХранилища(АдресТаблицыОшибок);
		
		ИтоговаяИнформацияПоОшибкам = ИтоговаяИнформацияПоОшибкам(ТаблицаОшибок);
		
		ТемаПисьма = "Ошибка при отправке и подписании документов от " + ПрофильНастройкиЭДО.Наименование
			+ "(" + ПрофильНастройкиЭДО.КодУчастникаЭДО + ")";
		ТекстПисьма = "Добрый день, при попытке отправить документы из Интеграционного модуля ЭДО 1С, возникли следующие ошибки:";
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + ИтоговаяИнформацияПоОшибкам;
		
		ОпределениеКонфигурации = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОпределениеКонфигурации();
		НаименованиеВерсииМодуля = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НаименованиеВерсииМодуля();
		Конфигурация = "Конфигурация: " + ОпределениеКонфигурации.Синоним + ",версия " + ОпределениеКонфигурации.Версия;
		
		ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + Конфигурация + Символы.ПС + НаименованиеВерсииМодуля;
		ТекстПисьма = ТекстПисьма + Символы.ПС + Символы.ПС + "Так же прикладываю файл с описанием логов.";
		
		ТемаПисьмаURL = КодироватьСтроку(ТемаПисьма, СпособКодированияСтроки.КодировкаURL);
		ТекстПисьмаURL = КодироватьСтроку(ТекстПисьма, СпособКодированияСтроки.КодировкаURL);
		
		ТестовыйРежим = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим();
		Если ТестовыйРежим Тогда
			Емейл = "intpro@esphere.ru";
		Иначе
			Емейл = "1C_hd@esphere.ru";
		КонецЕсли;
		
		ТекстСсылки = "mailto:" + Емейл + "?subject=%ТемаПисьмаURL%&body=%ТекстПисьмаURL%";
		ТекстСсылки = СтрЗаменить(ТекстСсылки, "%ТемаПисьмаURL%", ТемаПисьмаURL);
		ТекстСсылки = СтрЗаменить(ТекстСсылки, "%ТекстПисьмаURL%", ТекстПисьмаURL);
		
		Возврат ТекстСсылки;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

&НаСервереБезКонтекста
Функция ИтоговаяИнформацияПоОшибкам(Таблица)

	Результат = "";

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ИННПолучателя КАК ИННПолучателя,
	|	Таблица.ТипДокумента КАК ТипДокумента,
	|	Таблица.ОтветСервера КАК ОтветСервера,
	|	Таблица.ТекстСообщенияБезДокумента КАК ТекстСообщенияБезДокумента
	|ПОМЕСТИТЬ Ошибки
	|ИЗ
	|	&ТаблицаОшибок КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ошибки.ИННПолучателя КАК ИННПолучателя,
	|	Ошибки.ТипДокумента КАК ТипДокумента,
	|	Ошибки.ОтветСервера КАК ОтветСервера
	|ИЗ
	|	Ошибки КАК Ошибки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ошибки.ОтветСервера КАК ОтветСервера,
	|	Ошибки.ТекстСообщенияБезДокумента КАК ТекстСообщенияБезДокумента
	|ИЗ
	|	Ошибки КАК Ошибки";
	Запрос.УстановитьПараметр("ТаблицаОшибок", Таблица);

	ПакетЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаПоОшибкам = ПакетЗапроса[1].Выбрать();
	ВыборкаРасшифровкаОшибок = ПакетЗапроса[2].Выбрать();
	
	Пока ВыборкаПоОшибкам.Следующий() Цикл
		Результат = Результат + "Получатель ИНН " + ВыборкаПоОшибкам.ИННПолучателя + ", тип: " + ВыборкаПоОшибкам.ТипДокумента + ", ответ: "
					+ ВыборкаПоОшибкам.ОтветСервера + Символы.ПС;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьИСкрытьТаблицуОшибок()

	Элементы.СообщениеОбОшибке.Видимость = Ложь;
	ТаблицаОшибок.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура НачатьОтправкуДокументов(ПодписатьДанные)
	
	Если Не ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
	
	ДанныеКОтправке = Новый Массив();
	
	Если Не БизнесПроцессРаздела = "УВХД" Тогда
		ДанныеКОтправкеУВХД = Новый Массив();
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из Элементы.ДокументыКОтправке.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.ДокументыКОтправке.ДанныеСтроки(ИдентификаторСтроки);
		
		СтруктураДанныеОтправки = Новый Структура();
		СтруктураДанныеОтправки.Вставить("Ссылка", ДанныеСтроки.Ссылка);
		СтруктураДанныеОтправки.Вставить("Контрагент", ДанныеСтроки.Контрагент);
		
		Если БизнесПроцессРаздела = "УВХД" Тогда
			
			ДанныеПоиска = Новый Структура("Договор", ДанныеСтроки.ДоговорКонтрагента);
			ДоговорСопоставлен = СопоставленияДоговоров.НайтиСтроки(ДанныеПоиска).Количество();
			Если Не ДоговорСопоставлен Тогда
				Продолжить;
			КонецЕсли;
			СтруктураДанныеОтправки.Вставить("ДоговорСопоставлен", ДоговорСопоставлен);
			
		ИначеЕсли ДанныеСтроки.ЭтоКонтрагентСбер И ДанныеСтроки.ДоступенПоУВХД Тогда
			ДанныеКОтправкеУВХД.Добавить(ДанныеСтроки.Ссылка);
		КонецЕсли;
		
		ДанныеКОтправке.Добавить(СтруктураДанныеОтправки);
		
	КонецЦикла;
	
	Если Не БизнесПроцессРаздела = "УВХД" И ДанныеКОтправкеУВХД.Количество() Тогда
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("ДанныеКОтправке", ДанныеКОтправке);
		ПараметрыОповещения.Вставить("ПодписатьДанные", ПодписатьДанные);
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроверитьДокументыПоПроцессуУВХД", ЭтотОбъект, ПараметрыОповещения);
		ТекстВопроса = "Возможно, некоторые документы требуется отправить по процессу ""ЭДО с поставщиками"".
		|Для этого необходимо переключиться в соответствуюй раздел ""ЭДО с поставщиками"" в дереве.
		|Продолжить отправку документов по обычному процессу?";
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОтправки = Новый Структура();
	ПараметрыОтправки.Вставить("ПодписатьДанные", ПодписатьДанные);
	ПродолжитьОтправкуДокументов(ДанныеКОтправке, ПараметрыОтправки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтправкуДокументов(ДанныеКОтправке, ДопПараметры = Неопределено)
	
	Если ДанныеКОтправке.Количество() > 0 Тогда
		
		ПараметрыОтправки = Новый Структура;
		ПараметрыОтправки.Вставить("ДанныеКОтправке", ДанныеКОтправке);
		ПараметрыОтправки.Вставить("ПодписатьДанные", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ПодписатьДанные", Ложь));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПодписание", ЭтотОбъект, ПараметрыОтправки);
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСлужебныеРеквизитыФормы()
	
	ДоступнаРаботаСПриглашениями = ПравоДоступа("Чтение", Метаданные.НайтиПоПолномуИмени("Справочник.Контрагенты"));
	ДоступнаРаботаСЧерновиками = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяОтправкаЧерновиков();
	ДоступнаРаботаПоБизнесПроцессуУВХД = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяБизнесПроцессУВХД();
	
КонецПроцедуры

#Область ЭлектронныйДокумент

&НаКлиенте
Процедура ПодписатьИОтправитьЭлектронныеДокументыЗавершение(Результат, ДопПараметры) Экспорт
	
	ОчиститьИСкрытьТаблицуОшибок();
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если ТипЗнч(ДопПараметры) = Тип("Массив") Тогда

			Если ДопПараметры.Количество() Тогда
				
				Для Каждого Элем Из ДопПараметры Цикл
					МассивОтправленныхДокументов.Добавить(Элем);
				КонецЦикла;

				ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "Ссылка",
						МассивОтправленныхДокументов.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
				
			КонецЕсли;
			
		КонецЕсли;

		Элементы.ДокументыКОтправке.ВыделенныеСтроки.Очистить();
		Элементы.ДокументыКОтправке.Обновить();

		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(Результат.Журнал, "-1");
		
		ЗаполнитьТаблицуОшибокНаКлиенте(Результат.Журнал);
		Элементы.СообщениеОбОшибке.Видимость = ТаблицаОшибок.Количество() > 0;
		
	КонецЕсли;

	//УстановитьНастройкиПрофиляЭДО();
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСПодпиской

&НаКлиенте
Процедура ОбновитьСостояниеКнопкиОбновления(ИдетОбновление = Ложь)

	Если ИдетОбновление Тогда
		Элементы.ОбновитьДанныеКурьер.Картинка = БиблиотекаКартинок.ККСНГ_СинхронизироватьАнимированная;
		Элементы.ОбновитьДанныеКурьер.Заголовок = "Идет обновление...";
	Иначе
		Элементы.ОбновитьДанныеКурьер.Картинка = БиблиотекаКартинок.ККСНГ_Синхронизировать;
		Элементы.ОбновитьДанныеКурьер.Заголовок = "Обновить данные сервиса";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьДанныеКурьераВФоне(ПрофильНастройкиЭДО, ЗаданияОбновленияИзПодписок, УникальныйИдентификатор, ПараметрыАвторизации)

	Если ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда

		КодУчастникаЭДО = ПрофильНастройкиЭДО.КодУчастникаЭДО;

		// Проверим, есть ли уже запущенное задание
		ТекущееЗадание = ЗаданияОбновленияИзПодписок.НайтиПоЗначению(ПрофильНастройкиЭДО);
		Если ТекущееЗадание <> Неопределено Тогда
			Если ТекущееЗадание.Пометка Тогда
				ЗаданияОбновленияИзПодписок.Удалить(ТекущееЗадание);
			Иначе
				Возврат СтрРазделить(ТекущееЗадание.Представление, "|")[0];
			КонецЕсли;
		КонецЕсли;

		КлючФЗ = "ОбновлениеПодписки_" + КодУчастникаЭДО;
		ДанныеФЗ = ДанныеЗапущенногоЗаданияОбработкиСобытий(КлючФЗ);
		Если ДанныеФЗ = Неопределено Тогда
			
			АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(ПрофильНастройкиЭДО);
			ПараметрыФЗ.Добавить(АдресХранилища);
			ПараметрыФЗ.Добавить(ПараметрыАвторизации);
			
			ИмяМетодаФЗ = "ККСНГ_Подписки.ПолучитьИОбработатьСобытияИзСфераКурьер";
			ОписаниеФЗ = "Обновление событий по подписке " + КодУчастникаЭДО;
			
			ИдентификаторЗаданияОбновленияПодписки = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьФоновоеЗадание(ИмяМетодаФЗ, ПараметрыФЗ, КлючФЗ, ОписаниеФЗ);
		
		Иначе
		    ИдентификаторЗаданияОбновленияПодписки = ДанныеФЗ.ИДЗадания;
			АдресХранилища = ДанныеФЗ.АдресХранилища;
		КонецЕсли;
				
		ЗаданияОбновленияИзПодписок.Добавить(ПрофильНастройкиЭДО, "" + ИдентификаторЗаданияОбновленияПодписки + "|" + АдресХранилища);

		Возврат ИдентификаторЗаданияОбновленияПодписки;

	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПродолжитьОбновлениеПодписки(ПараметрыАвторизации, ДопПараметры) Экспорт

	ИдентификаторФЗ = ОбновитьДанныеКурьераВФоне(ПрофильНастройкиЭДО, ЗаданияОбновленияИзПодписок, УникальныйИдентификатор, ПараметрыАвторизации);
	
	Если ЗначениеЗаполнено(ИдентификаторФЗ) Тогда
		ОбновитьСостояниеКнопкиОбновления(Истина);
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗадания", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеЗапущенногоЗаданияОбработкиСобытий(Ключ)
	
	Перем АктивноеЗадание, ДанныеЗадания, ИДАктивногоЗадания, ОтборФоновогоЗадания, ПодходящиеЗадания;
	Перем СообщенияЗадания, СообщениеЗадания, ТекстСообщения;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗадания = Неопределено;
	ОтборФоновогоЗадания = Новый Структура;
	ОтборФоновогоЗадания.Вставить("Ключ", Ключ);
	ОтборФоновогоЗадания.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ПодходящиеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФоновогоЗадания);
	
	Если ПодходящиеЗадания.Количество() > 0 Тогда
		
		АктивноеЗадание = ПодходящиеЗадания[0];
		ДанныеЗадания = Новый Структура("ИДЗадания,АдресХранилища");
		ИДАктивногоЗадания = АктивноеЗадание.УникальныйИдентификатор;
		ДанныеЗадания.ИДЗадания = ИДАктивногоЗадания;
		СообщенияЗадания = АктивноеЗадание.ПолучитьСообщенияПользователю(Ложь);
		
		Для каждого СообщениеЗадания Из СообщенияЗадания Цикл
			ТекстСообщения = СообщениеЗадания.Текст;
			Если ЭтоАдресВременногоХранилища(ТекстСообщения) Тогда
				ДанныеЗадания.АдресХранилища = ТекстСообщения;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеЗадания;

КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьСостояниеФоновыхЗаданий(ЗаданияОбновленияИзПодписок)

	СоответствиеРезультатов = Новый Соответствие;

	Для Каждого Задание Из ЗаданияОбновленияИзПодписок Цикл

		ДанныеЗадания = СтрРазделить(Задание.Представление, "|");
		Если ДанныеЗадания.ВГраница() > 0 Тогда
			ИдентификаторЗаданияОбновленияПодписки = ДанныеЗадания[0];
			АдресХранилища = ДанныеЗадания[1];
		Иначе
			Задание.Пометка = Истина;
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ИдентификаторЗаданияОбновленияПодписки) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатВыполнения = ККСНГ_ОбщегоНазначенияВызовСервера.РезультатВыполненияФоновогоЗадания(ИдентификаторЗаданияОбновленияПодписки);
		Если Не РезультатВыполнения.Завершено Тогда
			Продолжить;
		КонецЕсли;
		
		// Ставим пометку
		Задание.Пометка = Истина;

		Если РезультатВыполнения.ОписаниеОшибки = Неопределено Тогда
			Если ЗначениеЗаполнено(АдресХранилища) Тогда
				Ответ = ПолучитьИзВременногоХранилища(АдресХранилища);
				
				// Очищаем хранилище
				УдалитьИзВременногоХранилища(АдресХранилища);
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
			ОписаниеОшибки = "Обновление документооборота завершено с ошибками: " + РезультатВыполнения.ОписаниеОшибки;
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, "BJ-00001");
		КонецЕсли;
		СоответствиеРезультатов.Вставить(Задание.Значение, Ответ);
		
	КонецЦикла;

	Возврат СоответствиеРезультатов;
КонецФункции

&НаКлиенте
Процедура ПроверитьЗавершениеФоновогоЗадания() Экспорт

	Если ЗаданияОбновленияИзПодписок.Количество() Тогда
		
		СоответствиеРезультатов = ОбновитьСостояниеФоновыхЗаданий(ЗаданияОбновленияИзПодписок);

		Для Каждого Результат Из СоответствиеРезультатов Цикл
			
			ЖурналВыполнения = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат.Значение, "Журнал");
			
			Если ЖурналВыполнения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КодОшибкиАвторизации = "AU-00002";
			ОшибкаВыполнения = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЖурналВыполнения, КодОшибкиАвторизации);
			
			Если ОшибкаВыполнения <> Неопределено И ОшибкаВыполнения.КодОшибки = КодОшибкиАвторизации Тогда
				
				ПараметрыАвторизации = Новый Структура("НеобходимаПереинициализация", Истина);
				ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Результат.Ключ, ПараметрыАвторизации);

				Если Результат.Ключ = ПрофильНастройкиЭДО Тогда
					ККСНГ_ЛогированиеКлиентСервер.ВывестиСообщениеПользователю(ОшибкаВыполнения);
				КонецЕсли;
				
			КонецЕсли;
			
			Если Результат.Ключ <> ПрофильНастройкиЭДО Тогда
				Продолжить;
			КонецЕсли;
			
			// Выводим "нужные" сообщения об ошибках: пока что ошибки подписок и фоновых заданий.
			КодыВыводимыхОшибок = СтрРазделить("SC-00001,BJ-00001", ",", Ложь);
			
			Для Каждого КодОшибки Из КодыВыводимыхОшибок Цикл
				
				ОшибкаПоКоду = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЖурналВыполнения, КодОшибки);
				
				Если ОшибкаПоКоду <> Неопределено И ОшибкаПоКоду.КодОшибки = КодОшибки Тогда
					ККСНГ_ЛогированиеКлиентСервер.ВывестиСообщениеПользователю(ОшибкаПоКоду);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

	ЗаданияКУдалению = Новый Массив;

	Для Каждого Задание Из ЗаданияОбновленияИзПодписок Цикл
		
		Если Задание.Пометка Тогда
			ЗаданияКУдалению.Добавить(Задание);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Задание Из ЗаданияКУдалению Цикл
		ЗаданияОбновленияИзПодписок.Удалить(Задание);
	КонецЦикла;

	Если ЗаданияОбновленияИзПодписок.Количество() Тогда

		ОбновитьСостояниеКнопкиОбновления(Истина);
		
		// Продолжаем наблюдения
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗадания", 15, Истина);
		
	Иначе

		// Оповещаем пользователя и обновляем списки когда завершены все задания
		ОповеститьОбИзменении(Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.ККСНГ_ПрисоединенныеФайлы"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.ККСНГ_Квитанции"));

		Элементы.ДокументыКОтправке.Обновить();
		Элементы.ВходящиеДокументы.Обновить();
		Элементы.ИсходящиеДокументы.Обновить();
		
		ОбновитьСчетчикиРазделовДокументов();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обновление

&НаКлиенте
Процедура ПроверитьОбновление()

	ИдентификаторЗаданияПроверкиОбновления = ВыполнитьПроверкуОбновленияВФоне();
	Если ЗначениеЗаполнено(ИдентификаторЗаданияПроверкиОбновления) Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеПроверкиОбновления", 5, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПроверкуОбновленияВФоне()

	ИдентификаторЗаданияПроверкиОбновления = Неопределено;
	
	АдресХранилищаПроверкиОбновления = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(АдресХранилищаПроверкиОбновления);
	
	ИмяМетодаФЗ = "ККСНГ_ОбновлениеВызовСервера.ПроверитьНаличиеОбновленияВФоновомЗадании";
	ОписаниеФЗ = "Поиск обновлений";
	
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(АдресХранилищаПроверкиОбновления);
	
	ИдентификаторФЗ = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьФоновоеЗадание(ИмяМетодаФЗ, ПараметрыФЗ, , ОписаниеФЗ);
	
	Если Не ЗначениеЗаполнено(ИдентификаторФЗ) Тогда
		УдалитьИзВременногоХранилища(АдресХранилищаПроверкиОбновления);
	КонецЕсли;

	Возврат ИдентификаторФЗ;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗавершениеПроверкиОбновления() Экспорт
		
	Если ККСНГ_ОбщегоНазначенияВызовСервера.ЗаданиеВыполнено(ИдентификаторЗаданияПроверкиОбновления) Тогда

		Ответ = ПолучитьИзВременногоХранилища(АдресХранилищаПроверкиОбновления);
		ИдентификаторЗаданияПроверкиОбновления = "";
		АдресХранилищаПроверкиОбновления = "";
		
		Если Ответ.Успех И Ответ.Результат Тогда
			ПоказатьОповещениеПользователя("Доступна новая версия Модуля ЭДО", "e1cib/app/Обработка.ККСНГ_Обновление",
				"Перейти к обновлению", БиблиотекаКартинок.ККСНГ_Внимание, СтатусОповещенияПользователя.Важное, ЭтотОбъект.УникальныйИдентификатор);
		КонецЕсли;

	Иначе

		ПодключитьОбработчикОжидания("ПроверитьЗавершениеПроверкиОбновления", 15, Истина);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОтправкаНеструктурированногоДокумента

&НаКлиенте
Процедура ПослеАвторизацииОтправитьДокумент(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		ЗапросТиповДокументов = ККСНГ_ДокументооборотВызовСервера.СписокДоступныхНеструктурированныхТиповДокументов(ПараметрыАвторизации);

		Если ЗапросТиповДокументов.Успех Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
			ПараметрыОткрытия.Вставить("СписокНеструктурированныхТипов", ЗапросТиповДокументов.Результат);
			
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ОтправкаПечатнойФормы", ПараметрыОткрытия);
		Иначе
			ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросТиповДокументов.Журнал);
		КонецЕсли;

	Иначе
		
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Приглашения

&НаКлиенте
Процедура ОтправкаПриглашенийЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ОбновитьСписокПриглашений", Ложь) Тогда
		ПослеАвторизации = Новый ОписаниеОповещения("ПолучитьСписокПриглашенийЗавершение", ЭтотОбъект, "Sender");
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
	КонецЕсли;
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ОткрытьВыборКонтрагентов", Ложь) Тогда
		ПригласитьКонтрагентов(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьПриглашенияЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ИДПриглашений = ДопПараметры.ИДПриглашений;
		ОтклонениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ОтклонитьПриглашения(ИДПриглашений, ПрофильНастройкиЭДО, ПараметрыАвторизации);

		Если ОтклонениеПриглашений.Успех Тогда
			ПоказатьОповещениеПользователя(, , "Приглашения отклонены");
			ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(ПрофильНастройкиЭДО, ПараметрыАвторизации);
			ОбновитьТекущиеПриглашения("Receiver");
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтклонениеПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
	//ОбновитьСчетчикиРазделовПриглашений();

КонецПроцедуры

&НаКлиенте
Функция ИДВыделенныхПриглашений(ТекущаяТаблица = Неопределено)
	
	ИДПриглашений = Новый Массив;

	Если НЕ ТекущаяТаблица = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ТекущаяТаблица Цикл
			Если ТекущаяСтрока.Обрабатывать Тогда
				ИДПриглашений.Добавить(ТекущаяСтрока.Id);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИДПриглашений;

КонецФункции

&НаКлиенте
Процедура ОтозватьПриглашениеЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ИДПриглашений = ДопПараметры.ИДПриглашений;
		ОтзывПриглашений = ККСНГ_ПриглашенияВызовСервера.ОтозватьПриглашение(ИДПриглашений, ПрофильНастройкиЭДО, ПараметрыАвторизации);

		Если ОтзывПриглашений.Успех Тогда
			ПоказатьОповещениеПользователя(, , "Приглашения отозваны");
			ОбновитьТекущиеПриглашения("Sender");
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтзывПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
	Элементы.ОтозватьПриглашения.Доступность = Истина;
	
	//ОбновитьСчетчикиРазделовПриглашений();

КонецПроцедуры

&НаКлиенте
Процедура ПринятьПриглашенияЗавершение(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		РезультатОбработки = ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ДопПараметры.ИДПриглашений,
										ПараметрыАвторизации, ДопПараметры.ПрофильЭДООрганизации);
		
		Если РезультатОбработки.ИДПриглашений.Количество() > 0 Тогда
		
			ПринятиеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПринятьПриглашения(РезультатОбработки.ИДПриглашений,
										ДопПараметры.ПрофильЭДООрганизации, ПараметрыАвторизации);
			
			КоличествоНовыхПрофилей = РезультатОбработки.КоличествоНовыхПрофилей;
			Если НЕ КоличествоНовыхПрофилей = 0 Тогда
				Пояснение = "Принято приглашений - " + КоличествоНовыхПрофилей;
				ПоказатьОповещениеПользователя("Обновлены статусы приглашений:", , Пояснение);
			КонецЕсли;
			
			Если ПринятиеПриглашений.Успех Тогда
				ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(ПрофильНастройкиЭДО, ПараметрыАвторизации);
				ОбновитьТекущиеПриглашения("Receiver");
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ПринятиеПриглашений.Журнал);
			КонецЕсли;
		
		КонецЕсли;
	
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
	//ОбновитьСчетчикиРазделовПриглашений();
	
КонецПроцедуры

&НаСервере
Функция ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ИДПриглашений, ПараметрыАвторизации, ПрофильЭДООрганизации)
	
	ТаблицаПриглашений = РеквизитФормыВЗначение("ТаблицаПриглашенийПринятые");
	
	Возврат ККСНГ_ПриглашенияВызовСервера.ОбработатьДанныеПриглашенийЗарегистрированныхКонтрагентовЭДО(ИДПриглашений,
				ТаблицаПриглашений, ПараметрыАвторизации, ПрофильЭДООрганизации);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСписокПриглашенийЗавершение(ЗапросПараметрыАвторизации, ДопПараметры = Неопределено) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ОбновитьТекущиеПриглашения(?(ДопПараметры = Неопределено, "", ДопПараметры));
		Если ОбновлениеПриглашений.Успех Тогда
			КоличествоНовыхПрофилей = ОбновлениеПриглашений.Результат.КоличествоНовыхПрофилей;
			КоличествоНовыхПриглашений = ОбновлениеПриглашений.Результат.КоличествоНовыхПриглашений;
			Если НЕ КоличествоНовыхПрофилей = 0 ИЛИ НЕ КоличествоНовыхПриглашений = 0 Тогда
				Пояснение = "Получено новых приглашений - " + КоличествоНовыхПриглашений + Символы.ПС
				 + "Одобрено приглашений - " + КоличествоНовыхПрофилей;
				ПоказатьОповещениеПользователя("Обновлены статусы приглашений:", , Пояснение);
			КонецЕсли;
			
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОбновлениеПриглашений.Журнал);
		КонецЕсли;
		
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
	//ОбновитьСчетчикиРазделовПриглашений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСпискиПолученныхОтправленныхЗавершение(ПараметрыАвторизации, ДопПараметры = Неопределено) Экспорт

	ОбновлениеПриглашений = ККСНГ_ПриглашенияВызовСервера.ПолучитьСписокПриглашений(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		
	НаправлениеЗапросаОбновленияПриглашений = НаправлениеЗапросаОбновленияПриглашений();
		
	ОбновитьТекущиеПриглашения(НаправлениеЗапросаОбновленияПриглашений);
	
	Если ОбновлениеПриглашений.Успех Тогда
			
		КоличествоНовыхПрофилей = ОбновлениеПриглашений.Результат.КоличествоНовыхПрофилей;
		КоличествоНовыхПриглашений = ОбновлениеПриглашений.Результат.КоличествоНовыхПриглашений;
		Если НЕ КоличествоНовыхПрофилей = 0 ИЛИ НЕ КоличествоНовыхПриглашений = 0 Тогда
			Пояснение = "Получено новых приглашений - " + КоличествоНовыхПриглашений + Символы.ПС
			 + "Одобрено приглашений - " + КоличествоНовыхПрофилей;
			ПоказатьОповещениеПользователя("Обновлены статусы приглашений:", , Пояснение);
		КонецЕсли;
		
		ОбновитьСчетчикиРазделовПриглашений();
		
	Иначе
		ПоследняяОшибкаЖурнала = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ОбновлениеПриглашений.Журнал);
		Если Не ПоследняяОшибкаЖурнала = Неопределено Тогда
			ПоказатьОповещениеПользователя(, , ПоследняяОшибкаЖурнала.Событие);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция НаправлениеЗапросаОбновленияПриглашений()

	Если ТекущийРаздел = "ВходящиеПригл" Тогда
		Возврат "Receiver";
	ИначеЕсли ТекущийРаздел = "ИсходящиеПригл" Тогда
		Возврат "Sender";
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ОбновитьТекущиеПриглашения(НаправлениеЗапроса = Неопределено)

	Если НаправлениеЗапроса = Неопределено Тогда
		ЗначениеВРеквизитФормы(ПолучитьТекущиеПриглашения(ПрофильНастройкиЭДО), "Приглашения");
	ИначеЕсли НаправлениеЗапроса = "Sender" Тогда
		ЗначениеВРеквизитФормы(ПолучитьТекущиеПриглашенияКакОтправитель(ПрофильНастройкиЭДО, НРЕГ(ФильтрСтатусовИсходящих)), "ТаблицаПриглашенийОтправленные");
	ИначеЕсли НаправлениеЗапроса = "Receiver" Тогда
		ЗначениеВРеквизитФормы(ПолучитьТекущиеПриглашенияКакПолучатель(ПрофильНастройкиЭДО, НРЕГ(ФильтрСтатусовВходящих)), "ТаблицаПриглашенийПринятые");
	ИначеЕсли НаправлениеЗапроса = "All" Тогда
		ЗначениеВРеквизитФормы(ПолучитьТекущиеПриглашенияКакОтправитель(ПрофильНастройкиЭДО, "Processed"), "ТаблицаПриглашенийОтправленные");
		ЗначениеВРеквизитФормы(ПолучитьТекущиеПриглашенияКакПолучатель(ПрофильНастройкиЭДО, "Processed"), "ТаблицаПриглашенийПринятые");
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущиеПриглашения(ПрофильНастройкиЭДО)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	РегистрСведенийККСНГ_Приглашения.Обработано КАК Обработано,
	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
	|	РегистрСведенийККСНГ_Приглашения.SenderName КАК SenderName,
	|	РегистрСведенийККСНГ_Приглашения.SenderKpp КАК SenderKpp,
	|	РегистрСведенийККСНГ_Приглашения.SenderInn КАК SenderInn,
	|	РегистрСведенийККСНГ_Приглашения.Status КАК Status,
	|	РегистрСведенийККСНГ_Приглашения.Date КАК Date,
	|	РегистрСведенийККСНГ_Приглашения.AcceptionDate КАК AcceptionDate,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverId КАК ReceiverId,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverName КАК ReceiverName,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverKpp КАК ReceiverKpp,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverInn КАК ReceiverInn,
	|	РегистрСведенийККСНГ_Приглашения.Contacts КАК Contacts,
	|	РегистрСведенийККСНГ_Приглашения.Email КАК Email,
	|	ЛОЖЬ КАК Обрабатывать,
	|	РегистрСведенийККСНГ_Приглашения.Side КАК Side,
	|	РегистрСведенийККСНГ_Приглашения.КонтрагентОтправитель КАК КонтрагентОтправитель,
	|	РегистрСведенийККСНГ_Приглашения.StatusName КАК StatusName
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ
	|	РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
	|ГДЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильНастройкиЭДО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Количество,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП
	|ПОМЕСТИТЬ КоличествоКонтрагентов
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН В
	|			(ВЫБРАТЬ
	|				Т.SenderInn КАК SenderInn
	|			ИЗ
	|				ДанныеРегистра КАК Т
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|
	|			ВЫБРАТЬ
	|				ДанныеРегистра.ReceiverInn
	|			ИЗ
	|				ДанныеРегистра КАК ДанныеРегистра)
	|	И НЕ Контрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	ДанныеРегистра.Обработано КАК Обработано,
	|	ДанныеРегистра.Id КАК Id,
	|	ДанныеРегистра.SenderName КАК SenderName,
	|	ДанныеРегистра.SenderKpp КАК SenderKpp,
	|	ДанныеРегистра.SenderInn КАК SenderInn,
	|	ДанныеРегистра.Status КАК Status,
	|	ДанныеРегистра.Date КАК Date,
	|	ДанныеРегистра.AcceptionDate КАК AcceptionDate,
	|	ДанныеРегистра.ReceiverId КАК ReceiverId,
	|	ДанныеРегистра.ReceiverName КАК ReceiverName,
	|	ДанныеРегистра.ReceiverKpp КАК ReceiverKpp,
	|	ДанныеРегистра.ReceiverInn КАК ReceiverInn,
	|	ДанныеРегистра.Contacts КАК Contacts,
	|	ДанныеРегистра.Email КАК Email,
	|	ДанныеРегистра.Обрабатывать КАК Обрабатывать,
	|	КоличествоКонтрагентов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.КонтрагентОтправитель = ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|				И КоличествоКонтрагентов.Количество = 1
	|				И (ДанныеРегистра.Status = ""processed""
	|					ИЛИ ДанныеРегистра.Status = ""Accepted"")
	|				И ДанныеРегистра.Side = ""Receiver""
	|			ТОГДА Контрагенты.Ссылка
	|		КОГДА НЕ ДанныеРегистра.КонтрагентОтправитель = ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|			ТОГДА ДанныеРегистра.КонтрагентОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|	КОНЕЦ КАК КонтрагентОтправитель,
	|	ДанныеРегистра.Side КАК Side,
	|	ДанныеРегистра.StatusName КАК StatusName
	|ПОМЕСТИТЬ ДанныеСКонтрагентом
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоКонтрагентов КАК КоличествоКонтрагентов
	|		ПО ДанныеРегистра.SenderInn = КоличествоКонтрагентов.ИНН
	|			И ДанныеРегистра.SenderKpp = КоличествоКонтрагентов.КПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеРегистра.SenderInn = Контрагенты.ИНН
	|			И ДанныеРегистра.SenderKpp = Контрагенты.КПП
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСКонтрагентом.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	ДанныеСКонтрагентом.Обработано КАК Обработано,
	|	ДанныеСКонтрагентом.Id КАК Id,
	|	ДанныеСКонтрагентом.SenderName КАК SenderName,
	|	ВЫБОР
	|		КОГДА ДанныеСКонтрагентом.Side = ""Sender""
	|			ТОГДА ДанныеСКонтрагентом.ReceiverName
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеСКонтрагентом.Side = ""Receiver""
	|					ТОГДА ДанныеСКонтрагентом.SenderName
	|			КОНЕЦ
	|	КОНЕЦ КАК НаименованиеВСервисеЭДО,
	|	ДанныеСКонтрагентом.SenderKpp КАК SenderKpp,
	|	ДанныеСКонтрагентом.SenderInn КАК SenderInn,
	|	ДанныеСКонтрагентом.Status КАК Status,
	|	ДанныеСКонтрагентом.Date КАК Date,
	|	ДанныеСКонтрагентом.AcceptionDate КАК AcceptionDate,
	|	ДанныеСКонтрагентом.ReceiverId КАК ReceiverId,
	|	ДанныеСКонтрагентом.ReceiverName КАК ReceiverName,
	|	ДанныеСКонтрагентом.ReceiverKpp КАК ReceiverKpp,
	|	ДанныеСКонтрагентом.ReceiverInn КАК ReceiverInn,
	|	ДанныеСКонтрагентом.Contacts КАК Contacts,
	|	ДанныеСКонтрагентом.Email КАК Email,
	|	ДанныеСКонтрагентом.Обрабатывать КАК Обрабатывать,
	|	ДанныеСКонтрагентом.КонтрагентОтправитель КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА (ДанныеСКонтрагентом.Status = ""processed""
	|					ИЛИ ДанныеСКонтрагентом.Status = ""Accepted"")
	|					И ДанныеСКонтрагентом.Side = ""Receiver""
	|				ТОГДА ККСНГ_Контрагенты.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ККСНГ_Контрагенты.ПустаяСсылка)
	|		КОНЕЦ) КАК Профиль,
	|	ДанныеСКонтрагентом.StatusName КАК StatusName,
	|	ДанныеСКонтрагентом.Side КАК Side,
	|	ВЫБОР
	|		КОГДА ДанныеСКонтрагентом.Side = ""Receiver""
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК SideImage
	|ИЗ
	|	ДанныеСКонтрагентом КАК ДанныеСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ПО ДанныеСКонтрагентом.КонтрагентОтправитель = ККСНГ_Контрагенты.Контрагент
	|			И (НЕ ККСНГ_Контрагенты.ПометкаУдаления)
	|			И ДанныеСКонтрагентом.ПрофильЭДООрганизации = ККСНГ_Контрагенты.Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеСКонтрагентом.ПрофильЭДООрганизации,
	|	ДанныеСКонтрагентом.Обработано,
	|	ДанныеСКонтрагентом.Id,
	|	ДанныеСКонтрагентом.SenderName,
	|	ДанныеСКонтрагентом.SenderKpp,
	|	ДанныеСКонтрагентом.SenderInn,
	|	ДанныеСКонтрагентом.Status,
	|	ДанныеСКонтрагентом.Date,
	|	ДанныеСКонтрагентом.AcceptionDate,
	|	ДанныеСКонтрагентом.ReceiverId,
	|	ДанныеСКонтрагентом.ReceiverName,
	|	ДанныеСКонтрагентом.ReceiverKpp,
	|	ДанныеСКонтрагентом.ReceiverInn,
	|	ДанныеСКонтрагентом.Contacts,
	|	ДанныеСКонтрагентом.Email,
	|	ДанныеСКонтрагентом.Обрабатывать,
	|	ДанныеСКонтрагентом.КонтрагентОтправитель,
	|	ДанныеСКонтрагентом.StatusName,
	|	ДанныеСКонтрагентом.Side";
	
	Запрос.УстановитьПараметр("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущиеПриглашенияКакПолучатель(ПрофильНастройкиЭДО, ВыбранныйСтатус)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	РегистрСведенийККСНГ_Приглашения.Обработано КАК Обработано,
	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
	|	РегистрСведенийККСНГ_Приглашения.SenderName КАК SenderName,
	|	РегистрСведенийККСНГ_Приглашения.SenderKpp КАК SenderKpp,
	|	РегистрСведенийККСНГ_Приглашения.SenderInn КАК SenderInn,
	|	РегистрСведенийККСНГ_Приглашения.Status КАК Status,
	|	РегистрСведенийККСНГ_Приглашения.Date КАК Date,
	|	РегистрСведенийККСНГ_Приглашения.AcceptionDate КАК AcceptionDate,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverId КАК ReceiverId,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverName КАК ReceiverName,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverKpp КАК ReceiverKpp,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverInn КАК ReceiverInn,
	|	РегистрСведенийККСНГ_Приглашения.Contacts КАК Contacts,
	|	РегистрСведенийККСНГ_Приглашения.Email КАК Email,
	|	ЛОЖЬ КАК Обрабатывать,
	|	РегистрСведенийККСНГ_Приглашения.Side КАК Side,
	|	РегистрСведенийККСНГ_Приглашения.КонтрагентОтправитель КАК КонтрагентОтправитель,
	|	РегистрСведенийККСНГ_Приглашения.StatusName КАК StatusName
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ
	|	РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
	|ГДЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильНастройкиЭДО
	|	И РегистрСведенийККСНГ_Приглашения.Side = &Side
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтр
	|				ТОГДА РегистрСведенийККСНГ_Приглашения.Status = &ВыбранныйСтатус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК Количество,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП
	|ПОМЕСТИТЬ КоличествоКонтрагентов
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН В
	|			(ВЫБРАТЬ
	|				Т.SenderInn
	|			ИЗ
	|				ДанныеРегистра КАК Т)
	|	И НЕ Контрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	ДанныеРегистра.Обработано КАК Обработано,
	|	ДанныеРегистра.Id КАК Id,
	|	ДанныеРегистра.SenderName КАК SenderName,
	|	ДанныеРегистра.SenderKpp КАК SenderKpp,
	|	ДанныеРегистра.SenderInn КАК SenderInn,
	|	ДанныеРегистра.Status КАК Status,
	|	ДанныеРегистра.Date КАК Date,
	|	ДанныеРегистра.AcceptionDate КАК AcceptionDate,
	|	ДанныеРегистра.ReceiverId КАК ReceiverId,
	|	ДанныеРегистра.ReceiverName КАК ReceiverName,
	|	ДанныеРегистра.ReceiverKpp КАК ReceiverKpp,
	|	ДанныеРегистра.ReceiverInn КАК ReceiverInn,
	|	ДанныеРегистра.Contacts КАК Contacts,
	|	ДанныеРегистра.Email КАК Email,
	|	ДанныеРегистра.Обрабатывать КАК Обрабатывать,
	|	КоличествоКонтрагентов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.КонтрагентОтправитель = ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|				И КоличествоКонтрагентов.Количество = 1
	|				И (ДанныеРегистра.Status = ""processed"" ИЛИ ДанныеРегистра.Status = ""Accepted"")
	|				И ДанныеРегистра.Side = ""Receiver""
	|			ТОГДА Контрагенты.Ссылка
	|		КОГДА НЕ ДанныеРегистра.КонтрагентОтправитель = ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|			ТОГДА ДанныеРегистра.КонтрагентОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(справочник.Контрагенты.пустаяссылка)
	|	КОНЕЦ КАК КонтрагентОтправитель,
	|	ДанныеРегистра.Side КАК Side,
	|	ДанныеРегистра.StatusName КАК StatusName
	|ПОМЕСТИТЬ ДанныеСКонтрагентом
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоКонтрагентов КАК КоличествоКонтрагентов
	|		ПО ДанныеРегистра.SenderInn = КоличествоКонтрагентов.ИНН
	|			И ДанныеРегистра.SenderKpp = КоличествоКонтрагентов.КПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеРегистра.SenderInn = Контрагенты.ИНН
	|			И ДанныеРегистра.SenderKpp = Контрагенты.КПП
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСКонтрагентом.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	ДанныеСКонтрагентом.Обработано КАК Обработано,
	|	ДанныеСКонтрагентом.Id КАК Id,
	|	ДанныеСКонтрагентом.SenderName КАК SenderName,
	|	ДанныеСКонтрагентом.SenderKpp КАК SenderKpp,
	|	ДанныеСКонтрагентом.SenderInn КАК SenderInn,
	|	ДанныеСКонтрагентом.Status КАК Status,
	|	ДанныеСКонтрагентом.Date КАК Date,
	|	ДанныеСКонтрагентом.AcceptionDate КАК AcceptionDate,
	|	ДанныеСКонтрагентом.ReceiverId КАК ReceiverId,
	|	ДанныеСКонтрагентом.ReceiverName КАК ReceiverName,
	|	ДанныеСКонтрагентом.ReceiverKpp КАК ReceiverKpp,
	|	ДанныеСКонтрагентом.ReceiverInn КАК ReceiverInn,
	|	ДанныеСКонтрагентом.Contacts КАК Contacts,
	|	ДанныеСКонтрагентом.Email КАК Email,
	|	ДанныеСКонтрагентом.Обрабатывать КАК Обрабатывать,
	|	ДанныеСКонтрагентом.КонтрагентОтправитель КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА (ДанныеСКонтрагентом.Status = ""processed""
	|					ИЛИ ДанныеСКонтрагентом.Status = ""Accepted"")
	|						И ДанныеСКонтрагентом.Side = ""Receiver""
	|				ТОГДА ККСНГ_Контрагенты.Ссылка
	|			ИНАЧЕ ЗНАЧЕНИЕ(справочник.ККСНГ_Контрагенты.пустаяСсылка)
	|		КОНЕЦ) КАК Профиль,
	|	ДанныеСКонтрагентом.StatusName КАК StatusName,
	|	ДанныеСКонтрагентом.Side КАК Side
	|ИЗ
	|	ДанныеСКонтрагентом КАК ДанныеСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ПО ДанныеСКонтрагентом.КонтрагентОтправитель = ККСНГ_Контрагенты.Контрагент
	|			И (НЕ ККСНГ_Контрагенты.ПометкаУдаления)
	|			И ДанныеСКонтрагентом.ПрофильЭДООрганизации = ККСНГ_Контрагенты.Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеСКонтрагентом.ПрофильЭДООрганизации,
	|	ДанныеСКонтрагентом.Обработано,
	|	ДанныеСКонтрагентом.Id,
	|	ДанныеСКонтрагентом.SenderName,
	|	ДанныеСКонтрагентом.SenderKpp,
	|	ДанныеСКонтрагентом.SenderInn,
	|	ДанныеСКонтрагентом.Status,
	|	ДанныеСКонтрагентом.Date,
	|	ДанныеСКонтрагентом.AcceptionDate,
	|	ДанныеСКонтрагентом.ReceiverId,
	|	ДанныеСКонтрагентом.ReceiverName,
	|	ДанныеСКонтрагентом.ReceiverKpp,
	|	ДанныеСКонтрагентом.ReceiverInn,
	|	ДанныеСКонтрагентом.Contacts,
	|	ДанныеСКонтрагентом.Email,
	|	ДанныеСКонтрагентом.Обрабатывать,
	|	ДанныеСКонтрагентом.КонтрагентОтправитель,
	|	ДанныеСКонтрагентом.StatusName,
	|	ДанныеСКонтрагентом.Side";
	
	Запрос.УстановитьПараметр("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	Запрос.УстановитьПараметр("side", "Receiver");
	
	Если НЕ ВыбранныйСтатус = "all" Тогда
		Запрос.УстановитьПараметр("ВыбранныйСтатус", ВыбранныйСтатус);
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Истина);
	Иначе
		Запрос.УстановитьПараметр("ВыбранныйСтатус", "");
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Ложь);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущиеПриглашенияКакОтправитель(ПрофильНастройкиЭДО, ВыбранныйСтатус)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации КАК ПрофильЭДООрганизации,
	|	РегистрСведенийККСНГ_Приглашения.Обработано КАК Обработано,
	|	РегистрСведенийККСНГ_Приглашения.Id КАК Id,
	|	РегистрСведенийККСНГ_Приглашения.SenderName КАК SenderName,
	|	РегистрСведенийККСНГ_Приглашения.SenderKpp КАК SenderKpp,
	|	РегистрСведенийККСНГ_Приглашения.SenderInn КАК SenderInn,
	|	РегистрСведенийККСНГ_Приглашения.StatusName КАК StatusName,
	|	РегистрСведенийККСНГ_Приглашения.Date КАК Date,
	|	РегистрСведенийККСНГ_Приглашения.AcceptionDate КАК AcceptionDate,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverId КАК ReceiverId,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverName КАК ReceiverName,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverKpp КАК ReceiverKpp,
	|	РегистрСведенийККСНГ_Приглашения.ReceiverInn КАК ReceiverInn,
	|	РегистрСведенийККСНГ_Приглашения.Contacts КАК Contacts,
	|	РегистрСведенийККСНГ_Приглашения.Email КАК Email,
	|	ЛОЖЬ КАК Обрабатывать,
	|	РегистрСведенийККСНГ_Приглашения.КонтрагентПолучатель КАК Контрагент,
	|	РегистрСведенийККСНГ_Приглашения.Status КАК Status,
	|	РегистрСведенийККСНГ_Приглашения.Side КАК Side
	|ИЗ
	|	РегистрСведений.ККСНГ_Приглашения КАК РегистрСведенийККСНГ_Приглашения
	|ГДЕ
	|	РегистрСведенийККСНГ_Приглашения.ПрофильЭДООрганизации = &ПрофильНастройкиЭДО
	|	И РегистрСведенийККСНГ_Приглашения.Side = &Side
	|	И ВЫБОР
	|			КОГДА &ИспользоватьФильтр
	|				ТОГДА РегистрСведенийККСНГ_Приглашения.Status = &ВыбранныйСтатус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	Запрос.УстановитьПараметр("side", "Sender");
	
	Если НЕ ВыбранныйСтатус = "all" Тогда
		Запрос.УстановитьПараметр("ВыбранныйСтатус", ВыбранныйСтатус);
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Истина);
	Иначе
		Запрос.УстановитьПараметр("ВыбранныйСтатус", "");
		Запрос.УстановитьПараметр("ИспользоватьФильтр", Ложь);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ПригласитьКонтрагентовЗавершение(ЗапросПараметрыАвторизации, ВыбранныеКонтрагенты1С) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		РезультатПроверки = ККСНГ_ПриглашенияВызовСервера.КонтрагентыЗарегистрированыВКурьере(ПараметрыАвторизации, ВыбранныеКонтрагенты1С);
		Если НЕ РезультатПроверки.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(РезультатПроверки.Журнал);
			Возврат;
		КонецЕсли;
		
		ЗарегистрированныеКонтрагентыЭДО = РезультатПроверки.Результат.ЗарегистрированныеКонтрагентыЭДО;
		
		ОтправкаПриглашений = ККСНГ_ПриглашенияВызовСервера.ПригласитьКонтрагентов(ВыбранныеКонтрагенты1С,
																					ЗарегистрированныеКонтрагентыЭДО,
																					ПрофильНастройкиЭДО,
																					ПараметрыАвторизации);
		
		Если ОтправкаПриглашений.Успех Тогда
			ПоказатьОповещениеПользователя(, , "Приглашения отправлены");
			ОбновитьТекущиеПриглашения("Sender");
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтправкаПриглашений.Журнал);
		КонецЕсли;
	Иначе
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
	//ОбновитьСчетчикиРазделовПриглашений();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеКурьер(ИмяКоманды, ВыделенныеСтроки = Неопределено, ТребуетсяПодписаниеКвитанций = Неопределено)
	
	Если ВыделенныеСтроки = Неопределено И Элементы.ГруппаРазделов.ТекущаяСтраница.Имя = "ГруппаВходящиеДокументы" Тогда
		ВыделенныеСтроки = Элементы.ВходящиеДокументы.ВыделенныеСтроки;
	КонецЕсли;
	
	Если ВыделенныеСтроки = Неопределено И Элементы.ГруппаРазделов.ТекущаяСтраница.Имя = "ГруппаИсходящиеДокументы" Тогда
		ВыделенныеСтроки = Элементы.ИсходящиеДокументы.ВыделенныеСтроки;
	КонецЕсли;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуетсяПодписаниеКвитанций = Неопределено Тогда
		ТребуетсяПодписаниеКвитанций = ККСНГ_КвитанцииКлиент.ТребуетсяПодписаниеКвитанций(ИмяКоманды);
	КонецЕсли;
	
	ККСНГ_ДокументооборотКлиент.ВыполнитьДействиеКурьер(ИмяКоманды, ПрофильНастройкиЭДО, ТребуетсяПодписаниеКвитанций, ВыделенныеСтроки, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСчетчиковРазделов

&НаКлиенте
Процедура ВыполнитьОбновлениеДанныхКурьера()
	
	Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеПоПодпискеИПриглашений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчикиРазделовДокументов(ОбнулитьСчетчики = Ложь)
	
	Если ОбнулитьСчетчики Тогда
		ОбнулитьСчетчикиРазделовДокументов();
	КонецЕсли;
	
	ИдентификаторЗаданияОбновленияСчетчиков = ВыполнитьОбновлениеСчетчиковРазделовДокументовВФоне();
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОбновленияСчетчиков) Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеОбновленияСчетчиков", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчикиРазделовПриглашений(ОбнулитьСчетчики = Ложь)
	
	Если ОбнулитьСчетчики Тогда
		ОбнулитьСчетчикиРазделовПриглашений();
	КонецЕсли;
	
	Элементы.ТаблицаПриглашенийОтправленные.Обновить();
	ОтборПриглашений = Новый Структура("Status", ФильтрСтатусовИсходящих);
	ПриглашенияСтроки = ТаблицаПриглашенийОтправленные.НайтиСтроки(ОтборПриглашений);
	УстановитьЗначениеСчетчикаОписанияРаздела("ИсходящиеПригл", ПриглашенияСтроки.Количество());
	
	Элементы.ТаблицаПриглашенийПринятые.Обновить();
	ОтборПриглашений = Новый Структура("Status", ФильтрСтатусовВходящих);
	ПриглашенияСтроки = ТаблицаПриглашенийПринятые.НайтиСтроки(ОтборПриглашений);
	УстановитьЗначениеСчетчикаОписанияРаздела("ВходящиеПригл", ПриглашенияСтроки.Количество());
	
	ОбновитьДеревоНавигации(ДеревоДействийРазделов.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьОбновлениеСчетчиковРазделовДокументовВФоне()
	
	АдресХранилищаРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(СоответствияРазделовДаннымФормированияЗапросов);
	ПараметрыФЗ.Добавить(АдресХранилищаРезультата);
	
	ИмяМетодаФЗ = "ККСНГ_ЭлектронныеДокументы.ПолучитьЗначенияСчетчиковРазделов";
	КлючФЗ = "ОбновлениеСчетчиковРазделов__" + Строка(ПрофильНастройкиЭДО.УникальныйИдентификатор());
	ОписаниеФЗ = "Обновление счетчиков разделов " + Строка(ПрофильНастройкиЭДО);
	
	ИдентификаторФЗ = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьФоновоеЗадание(ИмяМетодаФЗ, ПараметрыФЗ, КлючФЗ, ОписаниеФЗ);
	
	Если Не ЗначениеЗаполнено(ИдентификаторФЗ) Тогда
		УдалитьИзВременногоХранилища(АдресХранилищаРезультата);
	КонецЕсли;
	
	Возврат ИдентификаторФЗ;
	
КонецФункции

&НаСервере
Процедура ОбновитьСоответствияРазделовДаннымФормированияЗапросов(Знач Раздел = Неопределено, ОчиститьСоответствия = Ложь)
	
	Если СоответствияРазделовДаннымФормированияЗапросов = Неопределено Или ОчиститьСоответствия Тогда
		СоответствияРазделовДаннымФормированияЗапросов = Новый Структура;
		Раздел = Неопределено;
	Иначе
		СоответствияРазделовДаннымФормированияЗапросов = ЗначениеИзСтрокиВнутр(СоответствияРазделовДаннымФормированияЗапросов);
	КонецЕсли;
	
	СоответствияРазделовТаблицамДанных = СоответствияРазделовТаблицамДанных();
	СоответствияРазделовТаблицамФормы = СоответствияРазделовТаблицамФормы();
	
	Если Раздел = Неопределено Тогда
		
		Для каждого СоответствиеРазделаТаблицеДанных Из СоответствияРазделовТаблицамДанных Цикл
			
			Раздел = СоответствиеРазделаТаблицеДанных.Ключ;
			ИмяТаблицы = СоответствиеРазделаТаблицеДанных.Значение;
			ТаблицаФормы = СоответствияРазделовТаблицамФормы.Получить(ИмяТаблицы);
			Если Не ИмяТаблицы = Неопределено И Не ТаблицаФормы = Неопределено Тогда
				ДанныеФормированияЗапроса = ПолучитьДанныеФормированияЗапросаРаздела(Раздел, ИмяТаблицы, ТаблицаФормы, ПрофильНастройкиЭДО);
				СоответствияРазделовДаннымФормированияЗапросов.Вставить(Раздел, ДанныеФормированияЗапроса);
			КонецЕсли;
				
		КонецЦикла;
		
	Иначе
		
		ИмяТаблицы = СоответствияРазделовТаблицамДанных.Получить(Раздел);
		ТаблицаФормы = СоответствияРазделовТаблицамФормы.Получить(ИмяТаблицы);
		Если Не ИмяТаблицы = Неопределено И Не ТаблицаФормы = Неопределено Тогда
			ДанныеФормированияЗапроса = ПолучитьДанныеФормированияЗапросаРаздела(Раздел, ИмяТаблицы, ТаблицаФормы, ПрофильНастройкиЭДО);
			СоответствияРазделовДаннымФормированияЗапросов.Вставить(Раздел, ДанныеФормированияЗапроса);
		КонецЕсли;
			
	КонецЕсли;
	
	СоответствияРазделовДаннымФормированияЗапросов = ЗначениеВСтрокуВнутр(СоответствияРазделовДаннымФормированияЗапросов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФормированияЗапросаРаздела(Раздел, ИмяТаблицы, ТаблицаФормы, ПрофильНастройкиЭДО)
	
	Если ИмяТаблицы = "ДокументыКОтправке" Или ИмяТаблицы = "ВходящиеДокументы"
		Или ИмяТаблицы = "ИсходящиеДокументы" Или ИмяТаблицы = "ДокументыСКвитанциями" Тогда
		ДанныеФормированияЗапроса = ПолучитьДанныеКомпоновщикаДинамическогоСписка(Раздел, ИмяТаблицы, ТаблицаФормы);
	Иначе
		ДанныеФормированияЗапроса = Неопределено;
	КонецЕсли;
	
	Возврат ДанныеФормированияЗапроса;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыДанныхНастройкиКомпоновкиДанныхРаздела(НастройкиКомпоновкиДанных, Раздел)
	
	ПараметрыДанныхРаздела = НастройкиОтбораСписковРаздела(Раздел);
	ПараметрыДанныхРаздела.Вставить("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	
	ПараметрыДанныхНастройки = НастройкиКомпоновкиДанных.ПараметрыДанных;
	Для каждого ПараметрДанных Из ПараметрыДанныхРаздела Цикл
		ИдентификаторПараметраДанныхРаздела = ПараметрДанных.Ключ;
		НайденныйПараметрДанныхНастройки = ПараметрыДанныхНастройки.Элементы.Найти(ИдентификаторПараметраДанныхРаздела);
		Если Не НайденныйПараметрДанныхНастройки  = Неопределено И НайденныйПараметрДанныхНастройки.Использование Тогда
			ПараметрыДанныхНастройки.УстановитьЗначениеПараметра(ПараметрДанных.Ключ, ПараметрДанных.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗавершениеОбновленияСчетчиков()
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗаданияОбновленияСчетчиков) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ККСНГ_ОбщегоНазначенияВызовСервера.РезультатВыполненияФоновогоЗадания(ИдентификаторЗаданияОбновленияСчетчиков);
	
	Если Не РезультатВыполнения.Завершено Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеОбновленияСчетчиков", 5, Истина);
	Иначе
		
		Если РезультатВыполнения.ОписаниеОшибки = Неопределено Тогда
			ЗапросДанныхОбновленияСчетчиков = ПолучитьЗначенияСчетчиковРазделовИзФоновогоЗадания(ИдентификаторЗаданияОбновленияСчетчиков);
			
			Если ЗапросДанныхОбновленияСчетчиков.Успех Тогда
				ДанныеОбновленияСчетчиков = ЗапросДанныхОбновленияСчетчиков.Результат;
				ОбновитьЗначенияОписанийРазделов(ДанныеОбновленияСчетчиков);
			КонецЕсли;
								
		Иначе
					
			ОписаниеОшибки = "Обновление данных по разделам завершено с ошибками: " + РезультатВыполнения.ОписаниеОшибки;
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			
		КонецЕсли;
		
		ОбновитьДеревоНавигации(ДеревоДействийРазделов.ПолучитьЭлементы());
				
		ОбновитьСостояниеКнопкиОбновления(Ложь);

	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияСчетчиковРазделовИзФоновогоЗадания(ИдентификаторЗадания)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
    Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторЗадания));
	
	Если НЕ Задание = Неопределено Тогда
		
		СообщенияЗадания = Задание.ПолучитьСообщенияПользователю();
		
		Если СообщенияЗадания.Количество() = 1 Тогда
			АдресХранилища = СообщенияЗадания[0].Текст;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ АдресХранилища = Неопределено
		И ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		
		ЗначениеИзХранилища = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		Если ТипЗнч(ЗначениеИзХранилища) = Тип("Структура")
			И ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеИзХранилища, "Успех", Ложь) Тогда
			Ответ.Успех = Истина;
			Ответ.Результат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеИзХранилища, "Результат");
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЗначенияОписанийРазделов(ДанныеСчетчиковРазделов)
	
	Для каждого ДанныеСчетчикаРаздела Из ДанныеСчетчиковРазделов Цикл
		
		Раздел = ДанныеСчетчикаРаздела.Ключ;
		Количество = ДанныеСчетчикаРаздела.Значение;
		
		УстановитьЗначениеСчетчикаОписанияРаздела(Раздел, Количество);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьСчетчикиРазделовДокументов()
	
	Для каждого ОписаниеРаздела Из ОписаниеРазделов Цикл
		Если ОписаниеРаздела.ЭтоДокумент Тогда
			ОписаниеРаздела.Количество = 0;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьДеревоНавигации(ДеревоДействийРазделов.ПолучитьЭлементы(), Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьСчетчикиРазделовПриглашений()
	
	Для каждого ОписаниеРаздела Из ОписаниеРазделов Цикл
		Если ОписаниеРаздела.ЭтоПриглашение Тогда
			ОписаниеРаздела.Количество = 0;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьДеревоНавигации(ДеревоДействийРазделов.ПолучитьЭлементы(), Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяТаблицыРаздела(Знач Раздел)
	
	СоответствияРазделовТаблицам = СоответствияРазделовТаблицамДанных();
	Возврат СоответствияРазделовТаблицам.Получить(Раздел);
	
КонецФункции

&НаСервере
Функция СоответствияРазделовТаблицамДанных()
	
	СоответствияРазделовТаблицам = Новый Соответствие;
	СоответствияРазделовТаблицам.Вставить("ПодписатьИОтправить", "ДокументыКОтправке");
	СоответствияРазделовТаблицам.Вставить("ПодписатьКвитанции", "ДокументыСКвитанциями");
	СоответствияРазделовТаблицам.Вставить("ПринятьВх", "ВходящиеДокументы");
	СоответствияРазделовТаблицам.Вставить("ПодписатьВх", "ВходящиеДокументы");
	СоответствияРазделовТаблицам.Вставить("АннулироватьВх", "ВходящиеДокументы");
	СоответствияРазделовТаблицам.Вставить("ПринятьКУчетуВх", "ВходящиеДокументы");
	СоответствияРазделовТаблицам.Вставить("ОтозватьИсх", "ИсходящиеДокументы");
	СоответствияРазделовТаблицам.Вставить("АннулироватьИсх", "ИсходящиеДокументы");
	СоответствияРазделовТаблицам.Вставить("ОтклоненныеИсх", "ИсходящиеДокументы");
	
	Если ДоступнаРаботаСЧерновиками Тогда
		СоответствияРазделовТаблицам.Вставить("Черновики", "ИсходящиеДокументы");
		СоответствияРазделовТаблицам.Вставить("ПодписатьИсх", "ИсходящиеДокументы");
		СоответствияРазделовТаблицам.Вставить("ОтправитьИсх", "ИсходящиеДокументы");
	КонецЕсли;
	
	Если ДоступнаРаботаПоБизнесПроцессуУВХД Тогда
		СоответствияРазделовТаблицам.Вставить("ПодписатьИОтправитьУВХД", "ДокументыКОтправке");
	КонецЕсли;
	
	Возврат СоответствияРазделовТаблицам;
	
КонецФункции

&НаСервере
Функция СоответствияРазделовТаблицамФормы()
	
	СоответствияРазделовТаблицамФормы = Новый Соответствие;
	СоответствияРазделовТаблицамФормы.Вставить("ДокументыКОтправке", Элементы.ДокументыКОтправке);
	СоответствияРазделовТаблицамФормы.Вставить("ДокументыСКвитанциями", Элементы.ДокументыСКвитанциями);
	СоответствияРазделовТаблицамФормы.Вставить("ВходящиеДокументы", Элементы.ВходящиеДокументы);
	СоответствияРазделовТаблицамФормы.Вставить("ИсходящиеДокументы", Элементы.ИсходящиеДокументы);
	
	Если ДоступнаРаботаСПриглашениями Тогда
		СоответствияРазделовТаблицамФормы.Вставить("Приглашения", Элементы.Приглашения);
		СоответствияРазделовТаблицамФормы.Вставить("ТаблицаПриглашенийОтправленные", Элементы.ТаблицаПриглашенийОтправленные);
		СоответствияРазделовТаблицамФормы.Вставить("ТаблицаПриглашенийПринятые", Элементы.ТаблицаПриглашенийПринятые);
	КонецЕсли;
	
	Возврат СоответствияРазделовТаблицамФормы;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеСчетчикаОписанияРаздела(Имя, Количество)
	
	СтрокиОписанийРазделов = ОписаниеРазделов.НайтиСтроки(Новый Структура("Имя", Имя));
	Если СтрокиОписанийРазделов.Количество() Тогда
		СтрокаОписанияРазделов = СтрокиОписанийРазделов[0];
		СтрокаОписанияРазделов.Количество = Количество;
		СтрокаОписанияРазделов.КоличествоРассчитано = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКомпоновщикаДинамическогоСписка(Раздел, ИмяТаблицы, ТаблицаФормы)
	
	Схема = ТаблицаФормы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = ТаблицаФормы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	Настройки.Порядок.Элементы.Очистить();
	
	УстановитьДополнительныеНастройкиКомпоновкиДанныхРаздела(Настройки, Раздел, ИмяТаблицы);
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Схема.НаборыДанных[0].Запрос);
	ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов.Получить(СхемаЗапроса.ПакетЗапросов.Количество() - 1);
	Для каждого Оператор Из ПоследнийЗапрос.Операторы Цикл
		Оператор.КоличествоПолучаемыхЗаписей = 1000;
	КонецЦикла;
	
	Схема.НаборыДанных[0].Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	Настройки.Структура.Очистить();
	ДетальныеЗаписи = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ТекстЗапроса = МакетКомпоновки.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
		
	ПараметрыЗапроса = Новый Массив();
	Для каждого ЭлементПараметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		СтруктураПараметра = Новый Структура("Имя, Значение", ЭлементПараметр.Имя, ЭлементПараметр.Значение);
		ПараметрыЗапроса.Добавить(СтруктураПараметра);
	КонецЦикла;
		
	Возврат Новый Структура("ТекстЗапроса, ПараметрыЗапроса", ТекстЗапроса, ПараметрыЗапроса);
	
КонецФункции

&НаСервере
Процедура УстановитьДополнительныеНастройкиКомпоновкиДанныхРаздела(НастройкиКомпоновкиДанных, Раздел, ИмяТаблицы)
	
	Если Раздел = "ПодписатьИОтправить" Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(НастройкиКомпоновкиДанных.Отбор, "ЭтоКонтрагентСбер");
		ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(НастройкиКомпоновкиДанных.Отбор, "ДоступенПоУВХД");
	ИначеЕсли Раздел = "ПодписатьИОтправитьУВХД" Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиКомпоновкиДанных.Отбор, "ЭтоКонтрагентСбер", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиКомпоновкиДанных.Отбор, "ДоступенПоУВХД", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ИмяТаблицы = "ВходящиеДокументы" ИЛИ ИмяТаблицы = "ИсходящиеДокументы" Тогда
		УстановитьПараметрыДанныхНастройкиКомпоновкиДанныхРаздела(НастройкиКомпоновкиДанных, Раздел);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеПоПодпискеИПриглашений()

	ОчиститьСообщения();
	Если ККСНГ_ОбщегоНазначенияВызовСервера.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Установлена блокировка работы с внешними ресурсами");
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьОбновлениеПоПодпискеИПриглашений", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновлениеПоПодпискеИПриглашений(ЗапросПараметрыАвторизации, ДопПараметры = Неопределено) Экспорт

	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		
		ПродолжитьОбновлениеПодписки(ПараметрыАвторизации, ДопПараметры);
	
		Если ДоступнаРаботаСПриглашениями Тогда
			ПолучитьСпискиПолученныхОтправленныхЗавершение(ПараметрыАвторизации, ДопПараметры);
		КонецЕсли;
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДинамическиеСписки

&НаСервереБезКонтекста
Процедура ЭлектронныеДокументПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Перем СвязанныеДокументы;
	Перем СтрокаСписка, ДанныеСтроки, Документ1С;
	Перем ПричиныОтклоненияИлиОтзыва, Причина;
	
	Для каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		Если ДанныеСтроки.Свойство("Документ1С") И ТипЗнч(ДанныеСтроки.Документ1С) = Тип("Строка") Тогда
			Документ1С = ККСНГ_ОбъектыИБВызовСервера.СсылкаНаСвязанныйДокументПоИдентификатору(ДанныеСтроки.Ссылка, ДанныеСтроки.Документ1С);
			Если Документ1С <> Неопределено Тогда
				ОформлениеПоля = СтрокаСписка.Значение.Оформление["Документ1С"];
				ОформлениеПоля.УстановитьЗначениеПараметра("Текст", Документ1С);
				ОформлениеПоля.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ИмяЭлемента = "ИсходящиеДокументы" И ДанныеСтроки.Свойство("StatusName") Тогда
		ПричиныОтклоненияИлиОтзыва = ПолучитьПричиныОтклоненияИлиОтзыва(Строки.ПолучитьКлючи());
		Для каждого СтрокаСписка Из Строки Цикл
			Причина = ПричиныОтклоненияИлиОтзыва[СтрокаСписка.Ключ];
			Если Не ПустаяСтрока(Причина) Тогда
				ДанныеСтроки = СтрокаСписка.Значение.Данные;
				ДанныеСтроки.StatusName = СтрШаблон("%1, %2", ДанныеСтроки.StatusName, Причина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// TODO Пересмотреть получение значений
	Если ДанныеСтроки.Свойство("БизнесПроцесс") Тогда
		ВывестиЗначениеБизнесПроцесса(Строки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПричиныОтклоненияИлиОтзыва(Документы)
	
	Перем Результат;
	Перем ТекстЗапроса, Запрос, Выборка;
	
	Результат = Новый Соответствие;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка,
	|	ККСНГ_ЭлектронныеДокументы.Status КАК Status,
	|	ККСНГ_ЭлектронныеДокументы.RejectReason КАК RejectReason,
	|	ККСНГ_ЭлектронныеДокументы.RevokeReason КАК RevokeReason
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка В(&Документы)
	|	И (ККСНГ_ЭлектронныеДокументы.Status = ""Rejected""
	|			ИЛИ ККСНГ_ЭлектронныеДокументы.Status = ""Revoked"")";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документы", Документы);
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.Ссылка, Выборка.RejectReason + Выборка.RevokeReason);
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПериодСпискаДокументовКОтправке()

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыКОтправке,
									"НачалоПериода", ПериодКОтправке.ДатаНачала);
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыКОтправке,
									"КонецПериода", ПериодКОтправке.ДатаОкончания);
															
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокДокументовОтправке()
	
	ОбщийМодульДокументыКОтправке = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ДокументыКОтправке");
	ОтборВидыЭД = ОбщийМодульДокументыКОтправке.ПолучитьСписокВидовЭД();
	ТекстЗапросаКОтправке = ОбщийМодульДокументыКОтправке.ПолучитьТекстЗапросаДокументовКОтправке();
	ТекстЗапросаКОтправке = ПолучитьОбщийЗапросСДопРеквизитами(ТекстЗапросаКОтправке);
	ДокументыКОтправке.ТекстЗапроса = ТекстЗапросаКОтправке;
	
	ДокументыКОтправке.УстановитьОбязательноеИспользование("Ссылка", Истина);
	ДокументыКОтправке.УстановитьОбязательноеИспользование("ГотовКОтправке", Истина);
	
	ПериодКОтправке.Вариант = ВариантСтандартногоПериода.Вчера;
	ПериодКОтправке.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодКОтправке.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыКОтправке, "ВариантНастройкиОбменаОрганизации", ККСНГ_ОбщегоНазначенияКлиентСервер.ВариантНастройкиОбменаОрганизации());
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыКОтправке, "ВариантыНастройкиОбменаДОП", ККСНГ_ОбщегоНазначенияВызовСервера.ВариантыНастройкиОбменаДОП());
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "ВидЭД", ОтборВидыЭД.ВыгрузитьЗначения(), ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыКОтправке, "Новый", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбщийЗапросСДопРеквизитами(ТекстЗапроса)
	
	ОбщийМодульДокументыКОтправке = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ДокументыКОтправке");
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	ИндексПоследнейКолонки = ПакетЗапросов.Колонки.Количество()-1;
	Кол1 = ИндексПоследнейКолонки + 1;
	Кол2 = ИндексПоследнейКолонки + 2;
	Кол3 = ИндексПоследнейКолонки + 3;
	Кол4 = ИндексПоследнейКолонки + 4;
	// Доп. реквизиты УВХД
	Кол5 = ИндексПоследнейКолонки + 5;
	Кол6 = ИндексПоследнейКолонки + 6;
	
	Для Каждого Оператор Из ПакетЗапросов.Операторы Цикл
		
		//Первый запрос
		Если НЕ Оператор.Источники.Количество() Тогда
			Оператор.ВыбираемыеПоля.Добавить("NULL", Кол1);
			Оператор.ВыбираемыеПоля.Добавить("NULL", Кол2);
			Оператор.ВыбираемыеПоля.Добавить("NULL", Кол3);
			Оператор.ВыбираемыеПоля.Добавить("NULL", Кол4);
			// Доп. реквизиты УВХД
			Оператор.ВыбираемыеПоля.Добавить("ЛОЖЬ", Кол5);
			Оператор.ВыбираемыеПоля.Добавить("NULL", Кол6);
			Продолжить;
		КонецЕсли;
		
		// Запросы объединений
		Оператор.Источники.Добавить("РегистрСведений.ККСНГ_ПМ_ДопРеквизитыЭД", "ДопРеквизитыЭД");
		Оператор.Источники[Оператор.Источники.Количество()-1].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
		
		Оператор.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ДопРеквизитыЭД.УстановленыДопАтрибуты, ЛОЖЬ)", Кол1);
		Оператор.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ДопРеквизитыЭД.ЕстьВложения, ЛОЖЬ)", Кол2);
		Оператор.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ДопРеквизитыЭД.ЗаполненКомментарий, ЛОЖЬ)", Кол3);
		Оператор.ВыбираемыеПоля.Добавить("ВЫБОР
										|	КОГДА ДопРеквизитыЭД.СвязанныйДокумент ЕСТЬ NULL
										|	ТОГДА 0
										|ИНАЧЕ ВЫБОР
										|	КОГДА ДопРеквизитыЭД.ЕстьВложения
										|	ТОГДА 1
										|ИНАЧЕ 0
										|	КОНЕЦ + ВЫБОР
										|	КОГДА ДопРеквизитыЭД.УстановленыДопАтрибуты
										|	ТОГДА 2
										|ИНАЧЕ 0
										|	КОНЕЦ + ВЫБОР
										|	КОГДА ДопРеквизитыЭД.ЗаполненКомментарий
										|	ТОГДА 4
										|ИНАЧЕ 0
										|	КОНЕЦ
										|	КОНЕЦ", Кол4);
		// Доп. реквизиты УВХД
		Оператор.ВыбираемыеПоля.Добавить(ОбщийМодульДокументыКОтправке.ВыражениеЭтоКонтрагентСбер(), Кол5);
		Оператор.ВыбираемыеПоля.Добавить("NULL", Кол6);
	
	КонецЦикла;
	
	ПакетЗапросов.Колонки[Кол1].Псевдоним = "УстановленыДопАтрибуты";
	ПакетЗапросов.Колонки[Кол2].Псевдоним = "ЕстьВложения";
	ПакетЗапросов.Колонки[Кол3].Псевдоним = "ЗаполненКомментарий";
	ПакетЗапросов.Колонки[Кол4].Псевдоним = "УстановленыДопРеквизиты";
	// Доп. реквизиты УВХД
	ПакетЗапросов.Колонки[Кол5].Псевдоним = "ЭтоКонтрагентСбер";
	ПакетЗапросов.Колонки[Кол6].Псевдоним = "Примечание";
	
	НовыйТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат НовыйТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура НастроитьСписокДокументовСКвитанциями()
		
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДокументыСКвитанциями,
									"ДатаОтправкиПолучения", (ТекущаяДатаСеанса() - 86400*30*3), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ,
									Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокИсходящихДокументов()
	
	ИсходящиеДокументы.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка,
	|	ККСНГ_ЭлектронныеДокументы.Id КАК Id,
	|	ККСНГ_ЭлектронныеДокументы.TypeName КАК TypeName,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Description_ КАК СТРОКА(255)) КАК Description_,
	|	ККСНГ_ЭлектронныеДокументы.TotalSum КАК TotalSum,
	|	ККСНГ_ЭлектронныеДокументы.Status КАК Status,
	|	ККСНГ_ЭлектронныеДокументы.StatusName КАК StatusName,
	|	ККСНГ_ЭлектронныеДокументы.SenderName КАК SenderName,
	|	ККСНГ_ЭлектронныеДокументы.ReceiverName КАК ReceiverName,
	|	ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted КАК IsDocflowCompleted,
	|	ККСНГ_ЭлектронныеДокументы.SendDate КАК SendDate,
	|	ККСНГ_ЭлектронныеДокументы.DocumentTypeCode КАК DocumentTypeCode,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Number КАК СТРОКА(255)) КАК Number,
	|	ККСНГ_ЭлектронныеДокументы.Date КАК Date,
	|	ВЫБОР
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_DOP""
	|			ТОГДА ""УПД.ДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF""
	|			ТОГДА ""УПД.СЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF_DOP""
	|			ТОГДА ""УПД.СЧФДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF""
	|			ТОГДА ""УКД.КСЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_DIC""
	|			ТОГДА ""УКД.ДИС""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF_DIC""
	|			ТОГДА ""УКД.КСЧФДИС""
	|		ИНАЧЕ ККСНГ_ЭлектронныеДокументы.TypeName
	|	КОНЕЦ КАК ТипДокумента,
	|	ККСНГ_ЭлектронныеДокументы.ЕстьМаркировка КАК Маркированный,
	|	ККСНГ_ЭлектронныеДокументы.СтатусЦРПТ КАК СтатусЦРПТ,
	|	ККСНГ_СвязанныеДокументы.СвязанныйДокумент КАК Документ1С,
	|	NULL КАК БизнесПроцесс
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|	    	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ККСНГ_СвязанныеДокументы КАК ККСНГ_СвязанныеДокументы
	|			ПО ККСНГ_ЭлектронныеДокументы.ГУИД = ККСНГ_СвязанныеДокументы.ЭлектронныйДокумент
	|				И ККСНГ_СвязанныеДокументы.КлючСтроки = 1
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы.DocumentActions КАК ККСНГ_ЭлектронныеДокументыDocumentActions
	|			ПО ККСНГ_ЭлектронныеДокументы.Ссылка = ККСНГ_ЭлектронныеДокументыDocumentActions.Ссылка
	|		ПО ККСНГ_Организации.КодУчастникаЭДО = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|			И ККСНГ_Организации.ИдентификаторСК = ККСНГ_ЭлектронныеДокументы.SenderId
	|ГДЕ
	|	ККСНГ_Организации.Ссылка = &ПрофильНастройкиЭДО
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборДействий
	|			ТОГДА ККСНГ_ЭлектронныеДокументыDocumentActions.Action В (&Actions)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборСтатусов
	|			ТОГДА ККСНГ_ЭлектронныеДокументы.Status В (&Statuses)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	
	ИсходящиеДокументы.ДинамическоеСчитываниеДанных = Истина;
	ИсходящиеДокументы.ОсновнаяТаблица = "Справочник.ККСНГ_ЭлектронныеДокументы";
	ИсходящиеДокументы.УстановитьОбязательноеИспользование("Ссылка", Истина);
	//ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ИсходящиеДокументы, "SendDate", (ТекущаяДатаСеанса() - 86400*30*3), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокВходящихДокументов()
	
	ВходящиеДокументы.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка,
	|	ККСНГ_ЭлектронныеДокументы.Id КАК Id,
	|	ККСНГ_ЭлектронныеДокументы.TypeName КАК TypeName,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Description_ КАК СТРОКА(255)) КАК Description_,
	|	ККСНГ_ЭлектронныеДокументы.TotalSum КАК TotalSum,
	|	ККСНГ_ЭлектронныеДокументы.StatusName КАК StatusName,
	|	ККСНГ_ЭлектронныеДокументы.SenderName КАК SenderName,
	|	ККСНГ_ЭлектронныеДокументы.ReceiverName КАК ReceiverName,
	|	ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted КАК IsDocflowCompleted,
	|	ККСНГ_ЭлектронныеДокументы.ReceiveDate КАК ReceiveDate,
	|	ККСНГ_ЭлектронныеДокументы.DocumentTypeCode КАК DocumentTypeCode,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Number КАК СТРОКА(255)) КАК Number,
	|	ККСНГ_ЭлектронныеДокументы.Date КАК Date,
	|	ВЫБОР
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_DOP""
	|			ТОГДА ""УПД.ДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF""
	|			ТОГДА ""УПД.СЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF_DOP""
	|			ТОГДА ""УПД.СЧФДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF""
	|			ТОГДА ""УКД.КСЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_DIC""
	|			ТОГДА ""УКД.ДИС""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF_DIC""
	|			ТОГДА ""УКД.КСЧФДИС""
	|		ИНАЧЕ ККСНГ_ЭлектронныеДокументы.TypeName
	|	КОНЕЦ КАК ТипДокумента,
	|	ККСНГ_ЭлектронныеДокументы.ЕстьМаркировка КАК Маркированный,
	|	ККСНГ_ЭлектронныеДокументы.СтатусЦРПТ КАК СтатусЦРПТ,
	|	ККСНГ_СвязанныеДокументы.СвязанныйДокумент КАК Документ1С,
	|	НЕ ККСНГ_СвязанныеДокументы.СвязанныйДокумент ЕСТЬ NULL КАК Учет1С,
	|	NULL КАК БизнесПроцесс
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ККСНГ_СвязанныеДокументы КАК ККСНГ_СвязанныеДокументы
	|			ПО ККСНГ_ЭлектронныеДокументы.ГУИД = ККСНГ_СвязанныеДокументы.ЭлектронныйДокумент
	|				И ККСНГ_СвязанныеДокументы.КлючСтроки = 1
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы.DocumentActions КАК ККСНГ_ЭлектронныеДокументыDocumentActions
	|			ПО ККСНГ_ЭлектронныеДокументы.Ссылка = ККСНГ_ЭлектронныеДокументыDocumentActions.Ссылка
	|		ПО ККСНГ_Организации.КодУчастникаЭДО = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|			И ККСНГ_Организации.ИдентификаторСК = ККСНГ_ЭлектронныеДокументы.ReceiverId
	|ГДЕ
	|	ККСНГ_Организации.Ссылка = &ПрофильНастройкиЭДО
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборДействий
	|				ТОГДА ККСНГ_ЭлектронныеДокументыDocumentActions.Action В (&Actions)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтборСтатусов
	|				ТОГДА ККСНГ_ЭлектронныеДокументы.Status В (&Statuses)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоНеПринятымКУчету
	|				ТОГДА ККСНГ_СвязанныеДокументы.СвязанныйДокумент ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоЗавершенным
	|				ТОГДА ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	ВходящиеДокументы.ДинамическоеСчитываниеДанных = Истина;
	ВходящиеДокументы.ОсновнаяТаблица = "Справочник.ККСНГ_ЭлектронныеДокументы";
		
	ВходящиеДокументы.УстановитьОбязательноеИспользование("Ссылка", Истина);
	ВходящиеДокументы.УстановитьОбязательноеИспользование("Маркированный", Истина);
	ВходящиеДокументы.УстановитьОбязательноеИспользование("DocumentTypeCode", Истина);
		                                                                   
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВходящиеДокументы,
									"ReceiveDate", (ТекущаяДатаСеанса() - 86400*30*3), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ,
									Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокОбработанныхДокументов()
			
	ОбработанныеДокументы.ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка,
	|	ККСНГ_ЭлектронныеДокументы.Id КАК Id,
	|	ККСНГ_ЭлектронныеДокументы.TypeName КАК TypeName,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Description_ КАК СТРОКА(255)) КАК Description_,
	|	ККСНГ_ЭлектронныеДокументы.TotalSum КАК TotalSum,
	|	ККСНГ_ЭлектронныеДокументы.StatusName КАК StatusName,
	|	ККСНГ_ЭлектронныеДокументы.SenderName КАК SenderName,
	|	ККСНГ_ЭлектронныеДокументы.ReceiverName КАК ReceiverName,
	|	ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted КАК IsDocflowCompleted,
	|	ККСНГ_ЭлектронныеДокументы.ReceiveDate КАК ReceiveDate,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Number КАК СТРОКА(255)) КАК Number,
	|	ККСНГ_ЭлектронныеДокументы.Date КАК Date,
	|	ВЫБОР
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_DOP""
	|			ТОГДА ""УПД.ДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF""
	|			ТОГДА ""УПД.СЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF_DOP""
	|			ТОГДА ""УПД.СЧФДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF""
	|			ТОГДА ""УКД.КСЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_DIC""
	|			ТОГДА ""УКД.ДИС""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF_DIC""
	|			ТОГДА ""УКД.КСЧФДИС""
	|		ИНАЧЕ ККСНГ_ЭлектронныеДокументы.TypeName
	|	КОНЕЦ КАК ТипДокумента,
	|	ККСНГ_ЭлектронныеДокументы.ЕстьМаркировка КАК Маркированный,
	|	ККСНГ_ЭлектронныеДокументы.СтатусЦРПТ КАК СтатусЦРПТ,
	|	ККСНГ_СвязанныеДокументы.СвязанныйДокумент КАК Документ1С,
	|	НЕ ККСНГ_СвязанныеДокументы.СвязанныйДокумент ЕСТЬ NULL КАК Учет1С,
	|	NULL КАК БизнесПроцесс
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ККСНГ_СвязанныеДокументы КАК ККСНГ_СвязанныеДокументы
	|			ПО ККСНГ_ЭлектронныеДокументы.ГУИД = ККСНГ_СвязанныеДокументы.ЭлектронныйДокумент
	|				И ККСНГ_СвязанныеДокументы.КлючСтроки = 1
	|		ПО ККСНГ_Организации.КодУчастникаЭДО = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|			И ККСНГ_Организации.ИдентификаторСК = ККСНГ_ЭлектронныеДокументы.ReceiverId
	|ГДЕ
	|	ККСНГ_Организации.Ссылка = &ПрофильНастройкиЭДО
	|	И ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка,
	|	ККСНГ_ЭлектронныеДокументы.Id,
	|	ККСНГ_ЭлектронныеДокументы.TypeName,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Description_ КАК СТРОКА(255)),
	|	ККСНГ_ЭлектронныеДокументы.TotalSum,
	|	ККСНГ_ЭлектронныеДокументы.StatusName,
	|	ККСНГ_ЭлектронныеДокументы.SenderName,
	|	ККСНГ_ЭлектронныеДокументы.ReceiverName,
	|	ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted,
	|	ККСНГ_ЭлектронныеДокументы.ReceiveDate,
	|	ВЫРАЗИТЬ(ККСНГ_ЭлектронныеДокументы.Number КАК СТРОКА(255)),
	|	ККСНГ_ЭлектронныеДокументы.Date,
	|	ВЫБОР
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_DOP""
	|			ТОГДА ""УПД.ДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF""
	|			ТОГДА ""УПД.СЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UPD_SF_DOP""
	|			ТОГДА ""УПД.СЧФДОП""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF""
	|			ТОГДА ""УКД.КСЧФ""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_DIC""
	|			ТОГДА ""УКД.ДИС""
	|		КОГДА ККСНГ_ЭлектронныеДокументы.DocumentTypeCode = ""UCD_CSF_DIC""
	|			ТОГДА ""УКД.КСЧФДИС""
	|		ИНАЧЕ ККСНГ_ЭлектронныеДокументы.TypeName
	|	КОНЕЦ,
	|	ККСНГ_ЭлектронныеДокументы.ЕстьМаркировка,
	|	ККСНГ_ЭлектронныеДокументы.СтатусЦРПТ,
	|	ККСНГ_СвязанныеДокументы.СвязанныйДокумент КАК Документ1С,
	|	НЕ ККСНГ_СвязанныеДокументы.СвязанныйДокумент ЕСТЬ NULL КАК Учет1С,
	|	NULL КАК БизнесПроцесс
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ККСНГ_СвязанныеДокументы КАК ККСНГ_СвязанныеДокументы
	|			ПО ККСНГ_ЭлектронныеДокументы.ГУИД = ККСНГ_СвязанныеДокументы.ЭлектронныйДокумент
	|				И ККСНГ_СвязанныеДокументы.КлючСтроки = 1
	|		ПО ККСНГ_Организации.КодУчастникаЭДО = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|			И ККСНГ_Организации.ИдентификаторСК = ККСНГ_ЭлектронныеДокументы.SenderId
	|ГДЕ
	|	ККСНГ_Организации.Ссылка = &ПрофильНастройкиЭДО
	|	И ККСНГ_ЭлектронныеДокументы.IsDocflowCompleted";
	
	ОбработанныеДокументы.ДинамическоеСчитываниеДанных = Истина;
	ОбработанныеДокументы.ОсновнаяТаблица = "Справочник.ККСНГ_ЭлектронныеДокументы";
		
	ОбработанныеДокументы.УстановитьОбязательноеИспользование("Ссылка", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область УВХД

&НаСервере
Процедура ЗагрузитьСписокСопоставленийДоговоровУВХД(ПрофильКонтрагента = Неопределено)
	
	Если Не ПрофильКонтрагента = Неопределено Тогда
		НайденныеСтроки = СопоставленияДоговоров.НайтиСтроки(Новый Структура("Контрагент", ПрофильКонтрагента));
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СопоставленияДоговоров.Удалить(НайденнаяСтрока);
		КонецЦикла;
	Иначе
		СопоставленияДоговоров.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыУВХД.Договор1С КАК ДоговорЗначениеСвойства,
	|	ДоговорыУВХД.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты.ДоговорыУВХД КАК ДоговорыУВХД
	|ГДЕ
	|	НЕ ДоговорыУВХД.Договор1С = ЗНАЧЕНИЕ(Справочник.ККСНГ_ЗначенияСвойствОбъектов.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ПрофильКонтрагента = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ДоговорыУВХД.Ссылка = &ПрофильКонтрагента
	|		КОНЕЦ
	|ИТОГИ ПО
	|	Контрагент";
	Запрос.УстановитьПараметр("ПрофильКонтрагента", ПрофильКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонтрагент.Следующий() Цикл
		Выборка = ВыборкаКонтрагент.Выбрать();
		Пока Выборка.Следующий() Цикл
			Договор = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуОбъектаПоЗначениюСвойства(Выборка.ДоговорЗначениеСвойства);
			Если ЗначениеЗаполнено(Договор) Тогда
				СопоставленияНоваяСтрока = СопоставленияДоговоров.Добавить();
				СопоставленияНоваяСтрока.Контрагент = ВыборкаКонтрагент.Контрагент;
				СопоставленияНоваяСтрока.Договор = Договор;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСопоставленныхДоговоров()
	Возврат СопоставленияДоговоров.Выгрузить(, "Договор").ВыгрузитьКолонку("Договор");
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроверитьДокументыПоПроцессуУВХД(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыОтправки = Новый Структура();
		ПараметрыОтправки.Вставить("ПодписатьДанные", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ПодписатьДанные", Ложь));
		
		ДанныеКОтправке = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ДанныеКОтправке", Ложь);
		ПродолжитьОтправкуДокументов(ДанныеКОтправке, ПараметрыОтправки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// TODO Вынести в общий модуль
&НаКлиенте
Процедура НачатьВыборДокумента1С(ДанныеДокумента)
	
	ОбщийМодуль = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	ЗапросТиповДокументов1С = ОбщийМодуль.ТипыСвязанногоДокумента1С(ДанныеДокумента.ЭлектронныйДокумент, ДанныеДокумента.КодТипаДокумента, ДанныеДокумента.ЭтоВходящий);
	
	Если ЗапросТиповДокументов1С.Успех Тогда
		
		ОписаниеДоступныхТипов = ЗапросТиповДокументов1С.Результат;
		ОбработкаОповещения = Новый ОписаниеОповещения("ОбработчикЗавершенияВыбораПринятогоКУчетуДокумента", ЭтотОбъект, ДанныеДокумента);
		
		Документ1С = ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьСвязанныйДокумент1С(ДанныеДокумента.ЭлектронныйДокумент);
		
		ПоказатьВводЗначения(ОбработкаОповещения, Документ1С, "Выбор документа принятого к учёту", ОписаниеДоступныхТипов);
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросТиповДокументов1С.Журнал, "-1");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияВыбораПринятогоКУчетуДокумента(ВыбЗначение, ДопПараметры) Экспорт

	Если ВыбЗначение <> Неопределено Тогда
		ККСНГ_ОбъектыИБВызовСервера.ЗаписатьСвязьЭлектронногоДокумента(ДопПараметры.ЭлектронныйДокумент, ВыбЗначение);
		Элементы.ВходящиеДокументы.Обновить();
		ОбновитьСчетчикиРазделовДокументов();
		
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

&НаКлиентеНаСервереБезКонтекста
Функция МассивОтозватьИсх()
	Массив = Новый Массив;
	Массив.Добавить("Revoke");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивЗапроситьАннулирование()
	Массив = Новый Массив;
	Массив.Добавить("AvoidanceRequest");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивПринятьВх()
	Массив = Новый Массив;
	Массив.Добавить("Accept");
	//Массив.Добавить("Reject");
	//Массив.Добавить("Sign");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивПодписатьВх()
	Массив = Новый Массив;
	Массив.Добавить("AcceptWithTicket");
	Массив.Добавить("Sign");
	//Массив.Добавить("RejectWithTicket");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивПодписатьИсх()
	Массив = Новый Массив;
	Массив.Добавить("Sign");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивОтправитьИсх()
	Массив = Новый Массив;
	Массив.Добавить("Send");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивАннулировать()
	Массив = Новый Массив;
	Массив.Добавить("AcceptAvoidance");
	Массив.Добавить("RejectAvoidance");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивЧерновики()
	Массив = Новый Массив;
	Массив.Добавить("Draft");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивОтклоненные()
	Массив = Новый Массив;
	Массив.Добавить("Rejected");
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствияРазделовШаблон(Знач ЗначениеПоУмолчанию = Неопределено)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("КОтправке", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПодписатьИОтправить", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПодписатьИОтправитьУВХД", ЗначениеПоУмолчанию);
	Соответствие.Вставить("Черновики", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПодписатьКвитанции", ЗначениеПоУмолчанию);
	Соответствие.Вставить("Входящие", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПринятьВх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПодписатьВх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("АннулироватьВх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ЗапроситьАннулированиеВх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПринятьКУчетуВх",  ЗначениеПоУмолчанию);
	Соответствие.Вставить("Исходящие", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ПодписатьИсх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ОтправитьИсх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ОтозватьИсх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ЗапроситьАннулированиеИсх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("АннулироватьИсх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ОтклоненныеИсх", ЗначениеПоУмолчанию);
	Соответствие.Вставить("Обработанные", ЗначениеПоУмолчанию);
	Соответствие.Вставить("Приглашения", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ИсходящиеПригл", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ВходящиеПригл", ЗначениеПоУмолчанию);
	Соответствие.Вставить("ОбработанныеПригл", ЗначениеПоУмолчанию);
	
	Возврат Соответствие;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеДействияРаздела(Раздел = Неопределено)
	
	Соответствие = СоответствияРазделовШаблон(Новый Массив);
	Соответствие.Вставить("ПринятьВх", МассивПринятьВх());
	Соответствие.Вставить("ПодписатьВх", МассивПодписатьВх());
	Соответствие.Вставить("АннулироватьВх", МассивАннулировать());
	Соответствие.Вставить("ЗапроситьАннулированиеВх", МассивЗапроситьАннулирование());
	Соответствие.Вставить("ОтозватьИсх", МассивОтозватьИсх());
	Соответствие.Вставить("ЗапроситьАннулированиеИсх", МассивЗапроситьАннулирование());
	Соответствие.Вставить("АннулироватьИсх", МассивАннулировать());
	Соответствие.Вставить("ПодписатьИсх", МассивПодписатьИсх());
	Соответствие.Вставить("ОтправитьИсх", МассивОтправитьИсх());
	
	Возврат ?(Раздел = Неопределено, Соответствие, Соответствие.Получить(Раздел));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеСтатусыРаздела(Раздел = Неопределено)
	
	Соответствие = СоответствияРазделовШаблон(Новый Массив);
	Соответствие.Вставить("Черновики", МассивЧерновики());
	Соответствие.Вставить("ОтклоненныеИсх", МассивОтклоненные());
	
	Возврат ?(Раздел = Неопределено, Соответствие, Соответствие.Получить(Раздел));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеЕстьОтборПоНеПринятымКУчету(Раздел = Неопределено)
	
	Соответствие = СоответствияРазделовШаблон(Ложь);
	Соответствие.Вставить("ПринятьКУчетуВх",  Истина);
	
	Возврат ?(Раздел = Неопределено, Соответствие, Соответствие.Получить(Раздел));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеЕстьОтборПоЗавершенным(Раздел = Неопределено)
	
	Соответствие = СоответствияРазделовШаблон(Ложь);
	Соответствие.Вставить("Обработанные", Истина);
	
	Возврат ?(Раздел = Неопределено, Соответствие, Соответствие.Получить(Раздел));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазделыЗапрещеноМножественноеВыделение()
	Массив = Новый Массив;
	Массив.Добавить("ПринятьКУчетуВх");
	Массив.Добавить("Черновики");
	Возврат Массив;
КонецФункции

#КонецОбласти
