
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем МодульККСНГ_ПМ_РаботаСМетаданными, ОбщийМодульПринятиеКУчету;
	Перем МассивСвязиПараметровВыбора, НоваяСвязьПараметраВыбора, СвязиПараметровВыбора;
	Перем ТаблицыТоваров;
	Перем ЗапросДанных;
	
	ДокументСсылка = Параметры.Объект;
	
	// Устанавливаем ограничение типов для реквизитов
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	
	Если МодульККСНГ_ПМ_РаботаСМетаданными <> Неопределено Тогда
		
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.ТаблицаХарактеристикаНоменклатуры, "ХарактеристикиНоменклатуры");
		
		Если Элементы.ТаблицаХарактеристикаНоменклатуры.ОграничениеТипа.Типы().Количество() Тогда
			
			Элементы.ТаблицаХарактеристикаНоменклатуры.Видимость = Истина;
			
			МассивСвязиПараметровВыбора = Новый Массив();
			НоваяСвязьПараметраВыбора = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Таблица.ТекущиеДанные.Номенклатура");
			МассивСвязиПараметровВыбора.Добавить(НоваяСвязьПараметраВыбора);
			СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязиПараметровВыбора);
			Элементы.ТаблицаХарактеристикаНоменклатуры.СвязиПараметровВыбора = СвязиПараметровВыбора;
			
			МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.ТаблицаКорХарактеристикаНоменклатуры, "ХарактеристикиНоменклатуры");
			
			Элементы.ТаблицаКорХарактеристикаНоменклатуры.Видимость = Истина;
			
			МассивСвязиПараметровВыбора = Новый Массив();
			НоваяСвязьПараметраВыбора = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.ТаблицаКор.ТекущиеДанные.Номенклатура");
			МассивСвязиПараметровВыбора.Добавить(НоваяСвязьПараметраВыбора);
			СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязиПараметровВыбора);
			Элементы.ТаблицаКорХарактеристикаНоменклатуры.СвязиПараметровВыбора = СвязиПараметровВыбора;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		// Получение данных документа 
		ЗапросДанных = ККСНГ_ПринятиеКУчетуВызовСервера.ДанныеДокумента(ДокументСсылка);
				
		Если ЗапросДанных.Успех Тогда
			ЗаполнитьПоДаннымСтруктурированногоДокумента(ЗапросДанных.Результат);
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросДанных.Журнал, "-1");
			Отказ = Истина;
		КонецЕсли;
		
		ЕстьКорректировкаПоступления = Истина;
		ЕстьМаркировка = Параметры.ЕстьМаркировка;
		
		ТаблицыТоваров = Новый Структура;
		ЗаполнитьДанныеТабличныхЧастей(ТаблицыТоваров);
		ЕстьПрослеживаемость = ККСНГ_ОбщегоНазначенияКлиентСервер.ЕстьПрослеживаемость(ИдентификаторФайла, ТаблицыТоваров);
		
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		
		// Настройка формы, установка ограничений типов
		ОбщийМодульПринятиеКУчету.НастроитьФормуПринятияКУчету(ЭтотОбъект);
					
	Иначе
		Отказ = Истина;                         
	КонецЕсли;
	
	Если НЕ Отказ 
		И ЗначениеЗаполнено(Организация)
		И НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ОрганизацияДоступнаПользователю(Организация) Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	КонецЕсли;
	
	НастроитьУсловноеОформление();
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьВидимостьПоТипуДокумента();
	ОбновитьДоступностьЭлементов();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И Не ЗакрытьБезСохраненияСвязей И ЕстьНезаписанныеСвязиДокумента() Тогда
		Отказ = Истина;
		
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросПередЗакрытием", ЭтотОбъект, Параметры);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ЗаголовокОкна = "Завершение принятия к учету";
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0, КодВозвратаДиалога.Да, ЗаголовокОкна);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если СозданыУчетныеДокументы() Тогда
		ОбщийМодульПринятиеКУчетуКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");	
		ОбщийМодульПринятиеКУчетуКлиент.ПриЗавершенииПринятияКУчету(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СопоставитьНоменклатуруКонтрагентаНаСервере();
	
КонецПроцедуры

#Область ШапкаУПД

&НаКлиенте
Процедура ВидСчетаФактурыПолученногоПриИзменении(Элемент)
	
	СчетФактураСсылка = Неопределено;
	СчетФактураСсылкаАванс = Неопределено;
	ПоступлениеТоваровУслугСсылка = Неопределено;
	ДокументОснование = Неопределено;
	
	Если ВидСчетаФактурыПолученного = "НаАванс" И ДанныеПРД.Количество() > 0 Тогда
		ЗаполнитьДокументОснованиеСЧФАванса();
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ДокументОснование, СчетФактураСсылкаАванс, Истина);
	Иначе 
		ЗаполнитьДокументОснованиеСЧФ();
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ПоступлениеТоваровУслугСсылка, СчетФактураСсылка, Ложь);
	КонецЕсли;
	
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваровУслугСсылкаПриИзменении(Элемент)
	
	СчетФактураСсылка = Неопределено;
	
 	Если ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка) Тогда
		
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ПоступлениеТоваровУслугСсылка, СчетФактураСсылка);
		ОбновитьДанныеИзСвязанногоДокумента();
		
	КонецЕсли;
	
	ПриИзмененииДокументаПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураСсылкаПриИзменении(Элемент)
	
	ПриИзмененииСчетФактуры();
		
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураСсылкаАвансПриИзменении(Элемент)
	
	ПриИзмененииСчетФактуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеАвансПриИзменении(Элемент)
	
	СчетФактураСсылкаАванс = Неопределено;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ДокументОснование, СчетФактураСсылкаАванс, Истина);
		ОбновитьДанныеИзСвязанногоДокумента();
	КонецЕсли;
	
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ШапкаУКД

&НаКлиенте
Процедура КорректируемыйДокументПриИзменении(Элемент)
	
	КорПоступленияТоваровУслугСсылка = Неопределено;
	КорСчетфактураСсылка = Неопределено;
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(ЭтотОбъект.НомерИсправления) Тогда
		ОбновитьДанныеИспрПоДокументуОснования(КорректируемыйДокумент);
	Иначе
	    ОбновитьДанныеКорПоДокументуОснования(КорректируемыйДокумент);
	КонецЕсли;
	
	ПриИзмененииДокументаПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура КорПоступленияТоваровУслугСсылкаПриИзменении(Элемент)
	
	КорСчетфактураСсылка = Неопределено;
	
 	Если ЗначениеЗаполнено(КорПоступленияТоваровУслугСсылка) Тогда
		
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(КорПоступленияТоваровУслугСсылка, КорСчетфактураСсылка);
			
	КонецЕсли;
	
	ПриИзмененииДокументаПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетфактураСсылкаПриИзменении(Элемент)
			
	ПриИзмененииСчетФактуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСчетаФактурыИсправляемогоПриИзменении(Элемент)
	
	СчетФактураСсылкаИсправляемый = Неопределено;
	СчетФактураИсправлениеАванса = Неопределено;
	КорректируемыйДокумент = Неопределено;
	КорПоступленияТоваровУслугСсылка = Неопределено;
	КорСчетфактураСсылка = Неопределено;
	
	Если ВидСчетаФактурыИсправляемого = "НаАванс" Тогда
		ЗаполнитьСЧФИсправляемыйАванса();
	Иначе // НаПоступление	
		ЗаполнитьКорректируемыйДокумент();
	КонецЕсли;
	
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураСсылкаИсправляемыйПриИзменении(Элемент)
	
	СчетФактураИсправлениеАванса = Неопределено;
	
	Если ВидСчетаФактурыИсправляемого = "НаАванс" Тогда
		ОбновитьДанныеИспрАвансаПоСЧФИсправляемому(СчетФактураСсылкаИсправляемый);
	Иначе // НаПоступление	
		ОбновитьДанныеИспрПоДокументуОснования(КорректируемыйДокумент);
	КонецЕсли;
	
	ПриИзмененииСчетФактуры();

КонецПроцедуры

&НаКлиенте
Процедура СчетФактураИсправлениеАвансаПриИзменении(Элемент)
			
	ПриИзмененииСчетФактуры();

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблица

&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Таблица.ТекущаяСтрока;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьСтрокуСоответствияНоменклатурыНаСервере("Таблица", ТекСтрока);
	ОбновитьНомерСтрокиДокОснованияИспрДляТекущей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Таблица.ТекущиеДанные;
	
	Если Не ПустаяСтрока(ТекДанные.Наименование + ТекДанные.Код + ТекДанные.Артикул) Тогда
		
		ОбщийМодуль = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		ДанныеВыбора = ОбщийМодуль.НайтиНоменклатуру(ТекДанные.Наименование, ТекДанные.Артикул);
							
		Если ДанныеВыбора.Количество() Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаЕдИзмСсылкаПриИзменении(Элемент)
	
	ОбновитьНомерСтрокиДокОснованияИспрДляТекущей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьСопоставлениеРНПТ(Элемент, СтандартнаяОбработка, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКор

&НаКлиенте
Процедура ТаблицаНоменклатураАвтоПодборКор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаКор.ТекущиеДанные;
	
	Если Не ПустаяСтрока(ТекДанные.Наименование + ТекДанные.Код + ТекДанные.Артикул) Тогда
		ДанныеВыбора = ККСНГ_ПринятиеКУчетуВызовСервера.НайтиНоменклатуру(ТекДанные.Наименование, ТекДанные.Артикул);
							
		Если ДанныеВыбора.Количество() Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ТаблицаКор.ТекущаяСтрока;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьСтрокуСоответствияНоменклатурыНаСервере("ТаблицаКор", ТекСтрока);
	ОбновитьНомерСтрокиДокОснованияКорДляТекущей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорЕдИзмСсылкаПриИзменении(Элемент)
	
	ОбновитьНомерСтрокиДокОснованияКорДляТекущей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьСопоставлениеРНПТ(Элемент, СтандартнаяОбработка, Истина);

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоступление(Команда)
	
	ОбработатьКомандуПринятияКУчету(Команда.Имя);
				
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуру(Команда)
	
	Если ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка) Тогда
		
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ПоступлениеТоваровУслугСсылка, СчетФактураСсылка);
						
		Если НЕ ЗначениеЗаполнено(СчетфактураСсылка) Тогда
			ОбработатьКомандуПринятияКУчету(Команда.Имя);	
		Иначе
			ОбновитьДоступностьЭлементов();
		КонецЕсли;	
		
	КонецЕсли;	
	 	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуруАванс(Команда)
	
	ОбработатьКомандуПринятияКУчету(Команда.Имя);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировкуПоступления(Команда)
	
	ОчиститьСообщения();
	Если ПроверитьЗаполненностьНоменклатуры() Тогда 
		ОбработатьКомандуПринятияКУчету(Команда.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуруКорректировочный(Команда)
	
	ОбработатьКомандуПринятияКУчету(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетФактуруИсправлениеАванса(Команда)
	
	ОбработатьКомандуПринятияКУчету(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПринятиеКУчетуКоманда(Команда)
	
	ЗавершитьПринятиеКУчетуССохранением();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СопоставлениеРНПТ

&НаКлиенте
Процедура ОткрытьСопоставлениеРНПТ(Элемент, СтандартнаяОбработка, ЭтоУКД = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяТаблица = ?(ЭтоУКД, Элементы.ТаблицаКор, Элементы.Таблица);
	ТекДанные = ТекущаяТаблица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСведенияОПрослеживаемости = ТекДанные.СведенияОПрослеживаемости.ВыгрузитьЗначения();
	Если ТекСведенияОПрослеживаемости.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТекСведенияОПрослеживаемости", ТекСведенияОПрослеживаемости);
	ПараметрыОткрытия.Вставить("СтранаПроисхождения", ТекДанные.СтранаПроисхожденияСсылка);
	ПараметрыОткрытия.Вставить("ЭтоУКД", ЭтоУКД);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("СтрокаСведений", ТекущаяТаблица.ТекущаяСтрока);
	ДопПараметры.Вставить("ЭтоУКД", ЭтоУКД);
	ПослеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияСопоставленияРНПТ", ЭтотОбъект, ДопПараметры);
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("ОбщаяФорма.ККСНГ_СопоставлениеРНПТ", 
		ПараметрыОткрытия, Элемент, ,,, ПослеЗакрытия, РежимОткрытия);

КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗакрытияСопоставленияРНПТ(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоУКД = ДопПараметры.ЭтоУКД;
	ТекущаяТаблица = ?(ЭтоУКД, ТаблицаКор, Таблица);
	СтрокаСведений = ДопПараметры.СтрокаСведений;
	РедактируемаяСтрока = ТекущаяТаблица.НайтиПоИдентификатору(СтрокаСведений);
	Если РедактируемаяСтрока <> Неопределено Тогда
		РедактируемаяСтрока.СведенияОПрослеживаемости.ЗагрузитьЗначения(РезультатЗакрытия);
		ЗаполнитьСопоставленыРНПТ(РедактируемаяСтрока);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура НастроитьУсловноеОформление()
	
	// Исправление
	ЭтоИсправление = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(ЭтотОбъект.НомерИсправления);
	// Корректировка
	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла);

	Если ЭтоИсправление Или ЭтоКорректировка Тогда
		
		ИмяТаблицыКорИспр = ?(ЭтоКорректировка, "ТаблицаКор", "Таблица");
		
		УОТаблицыКорИспр = УсловноеОформление.Элементы.Добавить();	
		УОТаблицыКорИспр.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
		
		УсловияОформления = УОТаблицыКорИспр.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		
		НетНомераСтрокиОснования = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НетНомераСтрокиОснования.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицыКорИспр + ".НомерСтрокиОснования");
		НетНомераСтрокиОснования.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НетНомераСтрокиОснования.ПравоеЗначение = 0;
		
		ЗаполненКорректируемыйДокумент = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполненКорректируемыйДокумент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КорректируемыйДокумент");
		ЗаполненКорректируемыйДокумент.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
		ОформляемоеПоле = УОТаблицыКорИспр.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицыКорИспр);
		
	КонецЕсли;
	
	Если ЕстьПрослеживаемость Тогда
		
		ИмяПоляРНПТ = ?(ЭтоКорректировка, "ТаблицаКорРНПТ", "ТаблицаРНПТ");
		ИмяТаблицы = ?(ЭтоКорректировка, "ТаблицаКор", "Таблица");
		
		УОПодсветкаРНПТ = УсловноеОформление.Элементы.Добавить();	
		УОПодсветкаРНПТ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		
		УсловияОформления = УОПодсветкаРНПТ.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		
		НеСопоставленыРНПТ = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НеСопоставленыРНПТ.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".СопоставленыРНПТ");
		НеСопоставленыРНПТ.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НеСопоставленыРНПТ.ПравоеЗначение = Ложь;
		
		ОформляемоеПоле = УОПодсветкаРНПТ.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляРНПТ);
		
		
		УОРедактированиеРНПТ = УсловноеОформление.Элементы.Добавить();	
		УОРедактированиеРНПТ.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
		УсловияОформления = УОРедактированиеРНПТ.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		
		ЭтоПрослеживаемыйТовар = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭтоПрослеживаемыйТовар.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".ЭтоПрослеживаемыйТовар");
		ЭтоПрослеживаемыйТовар.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭтоПрослеживаемыйТовар.ПравоеЗначение = Ложь;
		
		ОформляемоеПоле = УОРедактированиеРНПТ.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляРНПТ);	
		
		Если Не ЭтоКорректировка Тогда
			
			УОТолькоПросмотрСтранаПроисхождения = УсловноеОформление.Элементы.Добавить();	
			УОТолькоПросмотрСтранаПроисхождения.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
			
			УсловияОформления = УОТолькоПросмотрСтранаПроисхождения.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			
			ЕстьКодСтраныПроисх = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЕстьКодСтраныПроисх.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Таблица.КодСтраныПроисх");
			ЕстьКодСтраныПроисх.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			ОформляемоеПоле = УОТолькоПросмотрСтранаПроисхождения.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСтранаПроисхожденияСсылка");
			
			
			УООтметкаНезаполненногоСтранаПроисхождения = УсловноеОформление.Элементы.Добавить();	
			УООтметкаНезаполненногоСтранаПроисхождения.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
			
			УсловияОформления = УООтметкаНезаполненногоСтранаПроисхождения.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			
			ЕстьКодСтраныПроисх = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЕстьКодСтраныПроисх.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Таблица.КодСтраныПроисх");
			ЕстьКодСтраныПроисх.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			
			НеПодобранаСтрана = УсловияОформления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НеПодобранаСтрана.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Таблица.СтранаПроисхожденияСсылка");
			НеПодобранаСтрана.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			ОформляемоеПоле = УООтметкаНезаполненногоСтранаПроисхождения.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаСтранаПроисхожденияСсылка");
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросПередЗакрытием(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗавершитьПринятиеКУчетуССохранением();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЗакрытьБезСохраненияСвязей = Истина;
		Закрыть();
	Иначе	// Отмена 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПринятиеКУчетуССохранением()
	
	ЗаписатьСвязиДокумента();
	ОповеститьОбИзменении(ЭтотОбъект.ДокументСсылка);
	Оповестить("ПослеКомандыСФЕРАКурьер");	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполненностьНоменклатуры()

	Успех = Истина;	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла)
		И Элементы.ТаблицаКорНоменклатура.Видимость 
		И Элементы.ТаблицаКорНоменклатура.АвтоОтметкаНезаполненного = Истина Тогда
		ИмяТаблицыТоваров = "ТаблицаКор";
	ИначеЕсли Элементы.ТаблицаНоменклатура.Видимость 
		И Элементы.ТаблицаНоменклатура.АвтоОтметкаНезаполненного = Истина Тогда
		ИмяТаблицыТоваров = "Таблица";
	Иначе 
		ИмяТаблицыТоваров = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяТаблицыТоваров) Тогда
		Возврат Успех;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	НекорректныеСтроки = ЭтотОбъект[ИмяТаблицыТоваров].НайтиСтроки(ПараметрыОтбора);
	Если НекорректныеСтроки.Количество() > 0 Тогда
		Успех = Ложь;
		ДопустимоеКоличествоСообщений = 2;
		Если НекорректныеСтроки.Количество() <= ДопустимоеКоличествоСообщений Тогда
			Для каждого ТекСтрока Из НекорректныеСтроки Цикл
				ТекстСообщения = "Заполните, пожалуйста, номенклатуру в строке таблицы товаров.";
				ИндексСтроки = ТекСтрока.ПолучитьИдентификатор();
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяТаблицыТоваров + "[" + ИндексСтроки + "].Номенклатура");
			КонецЦикла;
		Иначе 
			ТекстСообщения = "Заполните, пожалуйста, номенклатуру в таблице товаров.";
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции

&НаКлиенте
Функция ФункцияСодержитСЧФ()
	
	Возврат ЭтотОбъект.Функция <> "ДИС" И ЭтотОбъект.Функция <> "ДОП";
	
КонецФункции

#Область НастройкаВидимостиПоТипуДокумента

&НаКлиенте
Процедура ПоказатьДанныеКорректируемыхДокументов()
	
	МалоеКоличество = 2;
	КоличествоКорректируемыхДокументов = ДанныеКорректируемыхДокументов.Количество();
	КоррДокМало = КоличествоКорректируемыхДокументов <= МалоеКоличество;
	ШаблонКорДок = ?(КоррДокМало, "Корректируемый документ №%Номер% от %Дата%", "№%Номер% от %Дата%");
	СведенияКорДок = "";
	Для каждого ТекКорДок Из ДанныеКорректируемыхДокументов Цикл
		ТекСведенияКорДок = СтрЗаменить(ШаблонКорДок, "%Номер%", ТекКорДок.Номер);
		ТекСведенияКорДок = СтрЗаменить(ТекСведенияКорДок, "%Дата%", Формат(ТекКорДок.Дата, "ДФ=dd.MM.yyyy"));
		СведенияКорДок = СведенияКорДок + ?(ПустаяСтрока(СведенияКорДок), "", Символы.ПС) + ТекСведенияКорДок;
	КонецЦикла;
	Элементы.ДекорацияКоррДок.Заголовок = СведенияКорДок;
	Если КоррДокМало Тогда	
		Элементы.ГруппаКоррДокГиперссылка.Поведение = ПоведениеОбычнойГруппы.Обычное;
		Элементы.ГруппаКоррДокГиперссылка.ОтображатьЗаголовок = Ложь;
	Иначе 
		Элементы.ГруппаКоррДокГиперссылка.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		Элементы.ГруппаКоррДокГиперссылка.ОтображатьЗаголовок = Истина;
		ШаблонЗаголовка = Элементы.ГруппаКоррДокГиперссылка.Заголовок;
		Элементы.ГруппаКоррДокГиперссылка.Заголовок = СтрЗаменить(ШаблонЗаголовка, "%Колво%", 
													КоличествоКорректируемыхДокументов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьШапкуУКД()
	
	Элементы.ВидСчетаФактурыИсправляемого.Видимость = ФункцияСодержитСЧФ() И ВидСчетаФактурыИсправляемого <> "НаПоступление";
	Если ФункцияСодержитСЧФ() И НЕ ЗначениеЗаполнено(ВидСчетаФактурыИсправляемого) Тогда
		ВидСчетаФактурыИсправляемого = "НаПоступление";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьШапкуУПД()
		
	Элементы.ВидСчетаФактурыПолученного.Видимость = ФункцияСодержитСЧФ() И ВидСчетаФактурыПолученного <> "НаПоступление";
	Если ФункцияСодержитСЧФ() И НЕ ЗначениеЗаполнено(ВидСчетаФактурыПолученного) Тогда
		ВидСчетаФактурыПолученного = "НаПоступление";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка)
		И НЕ ЗначениеЗаполнено(СчетФактураСсылка) Тогда
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ПоступлениеТоваровУслугСсылка, СчетФактураСсылка);	
	КонецЕсли;
	
	Если ВидСчетаФактурыПолученного = "НаАванс"
		И ЗначениеЗаполнено(ДокументОснование) 
		И НЕ ЗначениеЗаполнено(СчетФактураСсылкаАванс) Тогда
		ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ДокументОснование, СчетФактураСсылкаАванс, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоТипуДокумента()
	
	// Исправление
	ЭтоИсправление = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(ЭтотОбъект.НомерИсправления);

	// Корректировка
	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла);
	
	Элементы.УКД.Видимость = ЭтоКорректировка Или ЭтоИсправление;
	Элементы.УПД.Видимость = Не Элементы.УКД.Видимость;
	Элементы.Шапка.ТекущаяСтраница = ?(Элементы.УКД.Видимость, Элементы.УКД, Элементы.УПД);
	
	Элементы.ТоварыУКД.Видимость = ЭтоКорректировка;
	Элементы.ТоварыУПД.Видимость = Не Элементы.ТоварыУКД.Видимость;
	Элементы.Товары.ТекущаяСтраница = ?(Элементы.ТоварыУКД.Видимость, Элементы.ТоварыУКД, Элементы.ТоварыУПД);
	Если Элементы.ТоварыУПД.Видимость Тогда 
		Элементы.ТаблицаКодыМаркировки.Видимость = ЕстьМаркировка И Не ЭтоИсправление;
		Элементы.ТаблицаРНПТ.Видимость = ЕстьПрослеживаемость;
		Элементы.ТаблицаДанныеСтраныПроисхождения.Видимость = ЕстьПрослеживаемость;
	КонецЕсли;
	Если Элементы.ТоварыУКД.Видимость Тогда 
		Элементы.ТаблицаКорРНПТ.Видимость = ЕстьПрослеживаемость;
	КонецЕсли;
	// Для ДИС решили счет-фактуру не создавать и не показывать.
	Элементы.ГруппаСчетФактураКорректировочный.Видимость = ФункцияСодержитСЧФ();	
	Элементы.КорПоступленияТоваровУслугСсылка.Заголовок = ?(ЭтоКорректировка, 
								"Документ корректировки поступления", "Документ исправления поступления");
	Элементы.КорСчетфактураСсылка.Заголовок = ?(ЭтоКорректировка, 
								"Счет-фактура корректировочный", "Счет-фактура исправление");
	
	Элементы.ГруппаКоррДокГиперссылка.Видимость = ЭтоКорректировка;
	Если Элементы.ГруппаКоррДокГиперссылка.Видимость Тогда
		ПоказатьДанныеКорректируемыхДокументов();
	КонецЕсли;
	
	// Настройка интерфейса УКД и УПД исправления.
	Если Элементы.УКД.Видимость Тогда
		
		НастроитьШапкуУКД();
		
	КонецЕсли;
	
	// Настройка интерфейса обычного УПД.
	Если Элементы.УПД.Видимость Тогда
		
		НастроитьШапкуУПД();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоказатьДанныеТранНакл()
	
	МалоеКоличество = 2;
	КоличествоТранспортныхНакладных = ДанныеТранспортныхНакладных.Количество();
	ТранНаклМало = КоличествоТранспортныхНакладных <= МалоеКоличество;
	ШаблонТранНакл = ?(ТранНаклМало, "Транспортная накладная №%Номер% от %Дата%", "№%Номер% от %Дата%");
	СведенияТранНакл = "";
	Для каждого ТекТранНакл Из ДанныеТранспортныхНакладных Цикл
		ТекСведенияТранНакл = СтрЗаменить(ШаблонТранНакл, "%Номер%", ТекТранНакл.Номер);
		ТекСведенияТранНакл = СтрЗаменить(ТекСведенияТранНакл, "%Дата%", Формат(ТекТранНакл.Дата, "ДФ=dd.MM.yyyy"));
		СведенияТранНакл = СведенияТранНакл + ?(ПустаяСтрока(СведенияТранНакл), "", Символы.ПС) + ТекСведенияТранНакл;
	КонецЦикла;
	Элементы.ДекорацияТранНакл.Заголовок = СведенияТранНакл;
	Если ТранНаклМало Тогда	
		Элементы.ГруппаТранНаклГиперссылка.Поведение = ПоведениеОбычнойГруппы.Обычное;
		Элементы.ГруппаТранНаклГиперссылка.ОтображатьЗаголовок = Ложь;
	Иначе 
		Элементы.ГруппаТранНаклГиперссылка.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		Элементы.ГруппаТранНаклГиперссылка.ОтображатьЗаголовок = Истина;
		ШаблонЗаголовка = Элементы.ГруппаТранНаклГиперссылка.Заголовок;
		Элементы.ГруппаТранНаклГиперссылка.Заголовок = СтрЗаменить(ШаблонЗаголовка, "%Колво%", 
						КоличествоТранспортныхНакладных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеПРД()
	
	МалоеКоличество = 2;
	КоличествоПРД = ДанныеПРД.Количество();
	ПРДМало = КоличествоПРД <= МалоеКоличество;
	ШаблонПРД = ?(ПРДМало, "Платёжно-расчётный документ №%Номер% от %Дата%", "№%Номер% от %Дата%");
	СведенияПРД = "";
	Для каждого ТекПРД Из ДанныеПРД Цикл
		ТекСведенияПРД = СтрЗаменить(ШаблонПРД, "%Номер%", ТекПРД.Номер);
		ТекСведенияПРД = СтрЗаменить(ТекСведенияПРД, "%Дата%", Формат(ТекПРД.Дата, "ДФ=dd.MM.yyyy"));
		СведенияПРД = СведенияПРД + ?(ПустаяСтрока(СведенияПРД), "", Символы.ПС) + ТекСведенияПРД;
	КонецЦикла;
	Элементы.ДекорацияПРД.Заголовок = СведенияПРД;
	Если ПРДМало Тогда	
		Элементы.ГруппаПРДГиперссылка.Поведение = ПоведениеОбычнойГруппы.Обычное;
		Элементы.ГруппаПРДГиперссылка.ОтображатьЗаголовок = Ложь;
	Иначе 
		Элементы.ГруппаПРДГиперссылка.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		Элементы.ГруппаПРДГиперссылка.ОтображатьЗаголовок = Истина;
		ШаблонЗаголовка = Элементы.ГруппаПРДГиперссылка.Заголовок;
		Элементы.ГруппаПРДГиперссылка.Заголовок = СтрЗаменить(ШаблонЗаголовка, "%Колво%", 
													КоличествоПРД);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбновлениеДоступностиЭлементов

&НаКлиенте
Процедура ОбновитьЭлементыДляКорректировкиИсправления(ЭтоАванс)
	
	Элементы.СчетФактураСсылкаИсправляемый.Видимость = ФункцияСодержитСЧФ() И ЭтоАванс;
	Элементы.ГруппаСчетФактураИсправлениеАванса.Видимость = ФункцияСодержитСЧФ() И ЭтоАванс;
	Элементы.КорректируемыйДокумент.Видимость = Не ЭтоАванс;
	Элементы.ГруппаКорректировкаПоступления.Видимость = ЕстьКорректировкаПоступления И Не ЭтоАванс;
	Элементы.ГруппаСчетФактураКорректировочный.Видимость = ФункцияСодержитСЧФ() И Не ЭтоАванс;
	
	Если ЭтоАванс Тогда
		
		Элементы.ВидСчетаФактурыИсправляемого.ТолькоПросмотр = ЗначениеЗаполнено(СчетФактураИсправлениеАванса);
		
		// Счета-фактуры исправления аванса.	
		ДоступноДобавлениеИспрАванса = НЕ ЗначениеЗаполнено(СчетФактураИсправлениеАванса)
			И ЗначениеЗаполнено(СчетФактураСсылкаИсправляемый);
		
		Элементы.СчетФактураИсправлениеАванса.ТолькоПросмотр = Не ДоступноДобавлениеИспрАванса;
		Элементы.СчетФактураИсправлениеАванса.КнопкаСоздания = ДоступноДобавлениеИспрАванса;
		Элементы.СоздатьСчетФактуруИсправлениеАванса.Видимость = ДоступноДобавлениеИспрАванса;
		
	Иначе 
		
		Элементы.ВидСчетаФактурыИсправляемого.ТолькоПросмотр = ЗначениеЗаполнено(КорСчетфактураСсылка) Или ЗначениеЗаполнено(КорПоступленияТоваровУслугСсылка);
		
		// Корректировка поступления
		КорректируемыйДокументЗаполнен = ЗначениеЗаполнено(КорректируемыйДокумент);
		
		// Эти реквизиты заполняем только из документа-основания.
		Элементы.ДоговорКонтрагента.ТолькоПросмотр = КорректируемыйДокументЗаполнен;
		Элементы.Склад.ТолькоПросмотр = КорректируемыйДокументЗаполнен;
		
		ДоступноДобавлениеКорПоступления = НЕ ЗначениеЗаполнено(КорПоступленияТоваровУслугСсылка) И КорректируемыйДокументЗаполнен;
		
		// TODO Проверить способы редактирования значения поля "КорПоступленияТоваровУслугСсылка" 
		Элементы.КорПоступленияТоваровУслугСсылка.ТолькоПросмотр = Не ДоступноДобавлениеКорПоступления;
		Элементы.КорПоступленияТоваровУслугСсылка.КнопкаСоздания = ДоступноДобавлениеКорПоступления;
		Элементы.СоздатьКорректировкуПоступления.Видимость = ДоступноДобавлениеКорПоступления;
		
		// Счета-фактуры	
		ДоступноДобавлениеКорСФ = НЕ ЗначениеЗаполнено(КорСчетфактураСсылка)
			И (Не ЕстьКорректировкаПоступления
			Или ЗначениеЗаполнено(КорПоступленияТоваровУслугСсылка))
			// TODO Проверить необходимость
			И КорректируемыйДокументЗаполнен;
		
		// СЧФ Корректировочный либо тянем из кор. поступления, либо создаем по кнопке, не выбираем.
		Элементы.КорСчетфактураСсылка.КнопкаСоздания = ДоступноДобавлениеКорСФ;
		Элементы.СоздатьСчетФактуруКорректировочный.Видимость = ДоступноДобавлениеКорСФ;
		
	КонецЕсли;
	
	ОбщийМодульПринятиеКУчетуКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	ОбщийМодульПринятиеКУчетуКлиент.ОбновитьДоступностьЭлементовФормыПринятияКУчету(ЭтотОбъект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыДляУПДБезИсправления(ЭтоАванс)
	
	Элементы.ДокументОснованиеАванс.Видимость = ФункцияСодержитСЧФ() И ЭтоАванс;
	Элементы.ГруппаСчетФактураАванс.Видимость = ФункцияСодержитСЧФ() И ЭтоАванс;
	Элементы.ГруппаПоступление.Видимость = Не ЭтоАванс;
	Элементы.ГруппаСчетФактура.Видимость = ФункцияСодержитСЧФ() И Не ЭтоАванс;
	
	Элементы.ГруппаТранНаклГиперссылка.Видимость = Не ЭтоАванс И (ДанныеТранспортныхНакладных.Количество() > 0);
	Если Элементы.ГруппаТранНаклГиперссылка.Видимость Тогда
		ПоказатьДанныеТранНакл();
	КонецЕсли;
	
	Элементы.ГруппаПРДГиперссылка.Видимость = ЭтоАванс И (ДанныеПРД.Количество() > 0);
	Если Элементы.ГруппаПРДГиперссылка.Видимость Тогда
		ПоказатьДанныеПРД();
	КонецЕсли;
	
	Если ЭтоАванс Тогда
		
		Элементы.ВидСчетаФактурыПолученного.ТолькоПросмотр = ЗначениеЗаполнено(СчетФактураСсылкаАванс);
		Элементы.ДокументОснованиеАванс.ТолькоПросмотр = ЗначениеЗаполнено(СчетФактураСсылкаАванс);
		
		ДоступноДобавлениеСЧФАванса = НЕ ЗначениеЗаполнено(СчетФактураСсылкаАванс)
		И ЗначениеЗаполнено(ДокументОснование);
		
		Элементы.СчетФактураСсылкаАванс.ТолькоПросмотр = Не ДоступноДобавлениеСЧФАванса;
		Элементы.СчетФактураСсылкаАванс.КнопкаСоздания = ДоступноДобавлениеСЧФАванса;
		Элементы.СоздатьСчетФактуруАванс.Видимость = ДоступноДобавлениеСЧФАванса;
		
	Иначе 
		
		Элементы.ВидСчетаФактурыПолученного.ТолькоПросмотр = ЗначениеЗаполнено(СчетфактураСсылка) Или ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка);
		
		// Поступление
		ДокументПоступленияЗаполнен = ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка);
		
		// Эти реквизиты заполняем только из поступления.
		Элементы.ДоговорКонтрагента.ТолькоПросмотр = ДокументПоступленияЗаполнен;
		Элементы.Склад.ТолькоПросмотр = ДокументПоступленияЗаполнен;
		
		// TODO Проверить способы редактирования значения поля "ПоступлениеТоваровУслугСсылка" 
		Элементы.ПоступлениеТоваровУслугСсылка.ТолькоПросмотр = ДокументПоступленияЗаполнен;
		Элементы.ПоступлениеТоваровУслугСсылка.КнопкаСоздания = Не ДокументПоступленияЗаполнен;
		Элементы.СоздатьПоступление.Видимость = Не ДокументПоступленияЗаполнен;
		
		// Счета-фактуры	
		ДоступноДобавлениеСЧФ = НЕ ЗначениеЗаполнено(СчетФактураСсылка)
		И ДокументПоступленияЗаполнен;
		
		// СЧФ либо тянем из поступления, либо создаем по кнопке, не выбираем.
		Элементы.СчетФактураСсылка.КнопкаСоздания = ДоступноДобавлениеСЧФ;
		Элементы.СоздатьСчетФактуру.Видимость = ДоступноДобавлениеСЧФ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВидимостьКнопкиЗавершения()
		
	Если ФункцияСодержитСЧФ() Тогда
		Возврат ЗначениеЗаполнено(СчетфактураСсылка) Или ЗначениеЗаполнено(СчетФактураСсылкаАванс) 
				Или ЗначениеЗаполнено(КорСчетфактураСсылка) Или ЗначениеЗаполнено(СчетФактураИсправлениеАванса);
	Иначе
		Возврат ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка) Или ЗначениеЗаполнено(КорПоступленияТоваровУслугСсылка);
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
		
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла)
		Или ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(ЭтотОбъект.НомерИсправления) Тогда
		
		ЭтоАванс = ВидСчетаФактурыИсправляемого = "НаАванс";
		ОбновитьЭлементыДляКорректировкиИсправления(ЭтоАванс);
		Элементы.Склад.Видимость = ЕстьКорректировкаПоступления И Не ЭтоАванс;
		
	Иначе // Это обычный УПД.
		
		ЭтоАванс = ВидСчетаФактурыПолученного = "НаАванс";
		ОбновитьЭлементыДляУПДБезИсправления(ЭтоАванс);
		Элементы.Склад.Видимость = Не ЭтоАванс;
							
	КонецЕсли;
	
	Элементы.ДоговорКонтрагента.Видимость = Не ЭтоАванс;
			
	Элементы.ЗавершитьПринятиеКУчету.Видимость = ВидимостьКнопкиЗавершения();
		
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументовУчета

&НаКлиенте
Процедура ОбработатьКомандуПринятияКУчету(ИмяКоманды)
	
	ОчиститьСообщения();
	
	СтруктураДанных = ПолучитьСтруктуруДанныхФормы();
	СтруктураДанных.Вставить("ИмяКоманды", ИмяКоманды);
	
	ПроверяемыеПриПрослеживаемости = Новый Массив;
	ПроверяемыеПриПрослеживаемости.Добавить("СоздатьПоступление");
	ПроверяемыеПриПрослеживаемости.Добавить("СоздатьКорректировкуПоступления");
	ПроверяемыеПриПрослеживаемости.Добавить("СоздатьСчетФактуруАванс");
	ПроверяемыеПриПрослеживаемости.Добавить("СоздатьСчетФактуруИсправлениеАванса");
	Если ЕстьПрослеживаемость
		И ПроверяемыеПриПрослеживаемости.Найти(ИмяКоманды) <> Неопределено Тогда
		
		ЗапросПроверки = ПроверитьДанныеДляПрослеживаемости(СтруктураДанных);
		Если Не ЗапросПроверки.Успех Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ДанныеЗаполнения", СтруктураДанных);
			ДопПараметры.Вставить("СообщенияОбОшибках", ЗапросПроверки.Результат);
			ПослеОтвета = Новый ОписаниеОповещения("ПослеОтветаНаПредупреждениеОПрослеживаемости", ЭтотОбъект, ДопПараметры);
			
			ТекстВопроса = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросПроверки.Журнал)
				+ Символы.ПС + "Продолжить создание документа?";
			ТекстЗаголовка = "Предупреждение о прослеживаемости";
			ПоказатьВопрос(ПослеОтвета, ТекстВопроса, Режим, 0, , ТекстЗаголовка);
			Возврат;
			
		КонецЕсли;	
			
	КонецЕсли;
	
	ПродолжитьПринятиеКУчету(СтруктураДанных);
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументПоДаннымЭДО(ДанныеЗаполнения, ДопПараметры) Экспорт
		
	Если ДанныеЗаполнения.РедактированиеВФорме 
		 И ЗначениеЗаполнено(ДанныеЗаполнения.ПолныйПутьКФорме) Тогда
			
		ПараметрыОткрытияФормы = Неопределено;
		ДанныеЗаполнения.Свойство("ПараметрыОткрытияФормы", ПараметрыОткрытияФормы);
		
		Если НЕ ТипЗнч(ПараметрыОткрытияФормы) = Тип("Структура") Тогда
			ПараметрыОткрытияФормы = Новый Структура;	
		КонецЕсли;
		
		ПараметрыОткрытияФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
		
		ФормаДокумента = ОткрытьФорму(ДанныеЗаполнения.ПолныйПутьКФорме, ПараметрыОткрытияФормы, ЭтотОбъект, 
			Новый УникальныйИдентификатор(), ,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		ДанныеЗаполнения.Вставить("ФормаДокумента", ФормаДокумента);
		ОписаниеОповещенияЗакрытия = Новый ОписаниеОповещения("ЗавершитьПринятиеКУчету", ЭтотОбъект, ДанныеЗаполнения);
		ФормаДокумента.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияЗакрытия;
			
	ИначеЕсли НЕ ДанныеЗаполнения.РедактированиеВФорме Тогда	
		
		ЗавершитьПринятиеКУчету(Неопределено, ДанныеЗаполнения);
	
	Иначе
		// Ошибка?
		Возврат;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПринятиеКУчету(РезультатЗакрытия, ДопПараметры) Экспорт
			
	Если ДопПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДопПараметры.РедактированиеВФорме Тогда
		СсылкаНаДокумент = ДопПараметры.ФормаДокумента.Объект.Ссылка;
		ДопПараметры.ФормаДокумента = Неопределено;
	Иначе // Если документ формируется не через форму, то в структуре должен быть готовая ссылка на него в "СсылкаНаДокумент" 
		СсылкаНаДокумент = ДопПараметры.СсылкаСозданныйДокумент;
	КонецЕсли;	
		
	Если НЕ СсылкаНаДокумент.Пустая() Тогда
			
		Если ДопПараметры.ИмяКоманды = "СоздатьПоступление" Тогда
			
			ПоступлениеТоваровУслугСсылка = СсылкаНаДокумент;
			
			ОбновитьДанныеИзСвязанногоДокумента();
			ПроверитьОбновитьДанныеСчетФактурыПоОснованию(ПоступлениеТоваровУслугСсылка, СчетФактураСсылка);
			ПриИзмененииДокументаПоступления();
						
		ИначеЕсли ДопПараметры.ИмяКоманды = "СоздатьСчетФактуру" Тогда
			
			СчетфактураСсылка = СсылкаНаДокумент;
			ПриИзмененииСчетФактуры();
			
		ИначеЕсли ДопПараметры.ИмяКоманды = "СоздатьСчетФактуруАванс" Тогда
				
			СчетФактураСсылкаАванс = СсылкаНаДокумент;
			ПриИзмененииСчетФактуры();
			
		ИначеЕсли ДопПараметры.ИмяКоманды = "СоздатьСчетФактуруКорректировочный" Тогда
				
			КорСчетфактураСсылка = СсылкаНаДокумент;
			ПриИзмененииСчетФактуры();
				
		ИначеЕсли ДопПараметры.ИмяКоманды = "СоздатьКорректировкуПоступления" Тогда
			
			КорПоступленияТоваровУслугСсылка = СсылкаНаДокумент;
			ПроверитьОбновитьДанныеСчетФактурыПоОснованию(КорПоступленияТоваровУслугСсылка, КорСчетфактураСсылка);
			ПриИзмененииДокументаПоступления();
			
		ИначеЕсли ДопПараметры.ИмяКоманды = "СоздатьСчетФактуруИсправлениеАванса" Тогда
			
			СчетФактураИсправлениеАванса = СсылкаНаДокумент;
			ПриИзмененииСчетФактуры();
			
		Иначе 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруДанныхФормы() 
	
	СтруктураДанных = Новый Структура;
	
	// Данные ревизитов формы
	СтруктураДанных.Вставить("Организация", Организация);
	СтруктураДанных.Вставить("Контрагент", Контрагент);
	СтруктураДанных.Вставить("ДоговорКонтрагента", ДоговорКонтрагента);
	СтруктураДанных.Вставить("Склад", Склад);
	СтруктураДанных.Вставить("ВалютаДокумента", ВалютаДокумента);
	СтруктураДанных.Вставить("ВидСчетаФактуры", ВидСчетаФактурыПолученного);
	СтруктураДанных.Вставить("НомерВходящегоДокумента", Номер);
	СтруктураДанных.Вставить("ДатаВходящегоДокумента", Дата);
	СтруктураДанных.Вставить("ИдентификаторФайла", ИдентификаторФайла);
	СтруктураДанных.Вставить("ДокументОснование", ДокументОснование);
	СтруктураДанных.Вставить("КорректируемыйДокумент", КорректируемыйДокумент);
	СтруктураДанных.Вставить("СчетФактураСсылкаИсправляемый", СчетФактураСсылкаИсправляемый);	
	
	СтруктураДанных.Вставить("СуммаБезНДС", СуммаБезНДС);	
	СтруктураДанных.Вставить("СуммаНДС", СуммаНДС);	
	СтруктураДанных.Вставить("СуммаСНДС", СуммаСНДС);	
		
	СтруктураДанных.Вставить("СуммаБезНДСУвеличение", СуммаБезНДСУвеличение);	
	СтруктураДанных.Вставить("СуммаНДСУвеличение", СуммаНДСУвеличение);	
	СтруктураДанных.Вставить("СуммаСНДСУвеличение", СуммаСНДСУвеличение);	
	СтруктураДанных.Вставить("СуммаБезНДСУменьшение", СуммаБезНДСУменьшение);	
	СтруктураДанных.Вставить("СуммаНДСУменьшение", СуммаНДСУменьшение);	
	СтруктураДанных.Вставить("СуммаСНДСУменьшение", СуммаСНДСУменьшение);
	
	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла);
	СтруктураДанных.Вставить("ЭтоКорректировка", ЭтоКорректировка);
	ЭтоИсправление = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(НомерИсправления);
	СтруктураДанных.Вставить("ЭтоИсправление", ЭтоИсправление);		
	Если ЭтоИсправление Тогда
		СтруктураДанных.Вставить("НомерИсправления", НомерИсправления);
		СтруктураДанных.Вставить("ДатаИсправления", ДатаИсправления);
	КонецЕсли;	
	СтруктураДанных.Вставить("КорПоступленияТоваровУслугСсылка", КорПоступленияТоваровУслугСсылка);
	СтруктураДанных.Вставить("КорСчетфактураСсылка", КорСчетфактураСсылка);
	СтруктураДанных.Вставить("ПоступлениеТоваровУслугСсылка", ПоступлениеТоваровУслугСсылка);
	СтруктураДанных.Вставить("ЕстьМаркировка", ЕстьМаркировка);
	СтруктураДанных.Вставить("ЕстьПрослеживаемость", ЕстьПрослеживаемость);
	
	// Данные таблиц формы
	СтруктураДанных.Вставить("ККСНГ_ТабличныеЧасти", Новый Структура);
	ЗаполнитьДанныеТабличныхЧастей(СтруктураДанных.ККСНГ_ТабличныеЧасти);
	
	ДобавитьДанныеКорректируемыхДокументов(СтруктураДанных);
		
	// Доп. реквизиты не выводимые непосредственно на форму
	Если ТипЗнч(ДопРеквизиты) = Тип("Структура") Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураДанных, ДопРеквизиты);
	КонецЕсли;	
		
	// доп. поля 
	СтруктураДанных.Вставить("ЦенаВключаетНДС", Ложь);
	
	// Указывает, что для формируемого документа 1С будет открыта форма объекта с возможностью редактирования.
	СтруктураДанных.Вставить("РедактированиеВФорме", Истина);
	
	СтруктураДанных.Вставить("СсылкаСозданныйДокумент"); 
	СтруктураДанных.Вставить("ТипДокумента");
	СтруктураДанных.Вставить("ПолныйПутьКФорме");
	
	Возврат СтруктураДанных;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеТабличныхЧастей(ТабличныеЧасти)
		
	СписокТоваров = Новый Массив;
	
	ТаблицаТЗ = Таблица.Выгрузить();
	Для каждого СтрокаТаблицы Из ТаблицаТЗ Цикл
		ТекСтрока = ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
		ТекСтрока.Вставить("ИндексСтроки", ТаблицаТЗ.Индекс(СтрокаТаблицы));
		СписокТоваров.Добавить(ТекСтрока);
	КонецЦикла;
	
	ТабличныеЧасти.Вставить("Товары", СписокТоваров);
	
	СписокТоваровКор = Новый Массив;
	
	ТаблицаКорТЗ = ТаблицаКор.Выгрузить();
	Для каждого СтрокаТаблицы Из ТаблицаКорТЗ Цикл
		ТекСтрока = ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы);
		ТекСтрока.Вставить("ИндексСтроки", ТаблицаКорТЗ.Индекс(СтрокаТаблицы));
		СписокТоваровКор.Добавить(ТекСтрока);
	КонецЦикла;
	
	ТабличныеЧасти.Вставить("ТоварыКор", СписокТоваровКор);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеКорректируемыхДокументов(СтруктураДанных)
	
	СписокКорректируемыхДокументов = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ДанныеКорректируемыхДокументов.Выгрузить() Цикл
		СписокКорректируемыхДокументов.Добавить(ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы));
	КонецЦикла;
	
	СтруктураДанных.Вставить("ДанныеКорректируемыхДокументов", СписокКорректируемыхДокументов);

КонецПроцедуры

&НаКлиенте
Функция ПроверитьДанныеДляПрослеживаемости(ДанныеЗаполнения)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ОбщийМодульПринятиеКУчетуВызовСервера = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");

	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла);
	Если Не ОбщийМодульПринятиеКУчетуВызовСервера.ПрослеживаемостьПоддерживается(ЭтоКорректировка) Тогда
		ТекстСообщения = "Текущая версия конфигурации не поддерживает прослеживаемость.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "PRS-00005");
		Возврат Ответ;
	КонецЕсли;
	
	ПроверкаКоманды = ОбщийМодульПринятиеКУчетуВызовСервера.ДокументПоддерживаетПрослеживаемость(ДанныеЗаполнения.ИмяКоманды);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПроверкаКоманды.Журнал, Ложь);	
	Если Не ПроверкаКоманды.Успех Тогда
		ТекстСообщения = "В создаваемом документе нельзя заполнить информацию о прослеживаемых товарах.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "PRS-00009");
		Ответ.Результат = ПроверкаКоманды.Результат;
		Возврат Ответ;
	КонецЕсли;
	
	СписокТоваров = ?(ЭтоКорректировка, ДанныеЗаполнения.ККСНГ_ТабличныеЧасти.ТоварыКор, ДанныеЗаполнения.ККСНГ_ТабличныеЧасти.Товары);
	ПроверкаТоваров = ОбщийМодульПринятиеКУчетуВызовСервера.ТоварыСоответствуютПрослеживаемости(СписокТоваров);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПроверкаТоваров.Журнал, Ложь);	
	Если Не ПроверкаТоваров.Успех Тогда
		ТекстСообщения = "Таблицу товаров нужно дозаполнить, чтобы в создаваемом документе сведения о прослеживаемости отразились полностью.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "PRS-00007");
		Ответ.Результат = ПроверкаТоваров.Результат;
		Возврат Ответ;
	КонецЕсли;
	
	Ответ.Успех = Истина;
	Возврат Ответ;

КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаПредупреждениеОПрослеживаемости(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПродолжитьПринятиеКУчету(ДопПараметры.ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДопПараметры.СообщенияОбОшибках) = Тип("Массив") Тогда
		ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла);
		Для каждого ТекДанныеОшибки Из ДопПараметры.СообщенияОбОшибках Цикл
			Поле = ?(ЭтоКорректировка, "ТаблицаКор[%1].%2", "Таблица[%1].%2");
			Поле = СтрШаблон(Поле, ТекДанныеОшибки.ИндексСтроки, ТекДанныеОшибки.ПолеОшибки);
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекДанныеОшибки.ТекстОшибки, , Поле);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДопПараметры.СообщенияОбОшибках) = Тип("Структура") Тогда
		ТекстОшибки = ДопПараметры.СообщенияОбОшибках.ТекстОшибки;
		ПолеОшибки = ДопПараметры.СообщенияОбОшибках.ПолеОшибки;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , ПолеОшибки);
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПринятиеКУчету(ДанныеЗаполнения)
	
	ОбщийМодульПринятиеКУчетуКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");
	
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("СформироватьДокументПоДаннымЭДО", ЭтотОбъект);
	ОбщийМодульПринятиеКУчетуКлиент.ДополнитьДаннымиДокументов(ДанныеЗаполнения, ОписаниеОповещенияЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеФормыПринятияКУчету

#Область ЗаполнениеФормыПриСоздании

&НаСервере
Процедура ЗаполнитьПоДаннымСтруктурированногоДокумента(ДанныеДокумента)
		
	ДанныеСтруктурированногоДокумента = ДанныеДокумента.СтруктурированныйДокумент;
	
	// Реквизиты заголовка 
	ЗаполнитьЗначенияРеквизитовФормыПоДаннымДокумента(ДанныеДокумента);
	
	// Реквизиты заголовка структурированного документа
	ЗаполнитьЗначенияРеквизитовФормыПоДаннымДокумента(ДанныеСтруктурированногоДокумента);
		
	ЭтотОбъект.Заголовок = ЭтотОбъект.Заголовок + " " + ДанныеСтруктурированногоДокумента.Функция + " " + ДанныеСтруктурированногоДокумента.Номер 
	                                             + " от " + ДанныеСтруктурированногоДокумента.ДатаСтрокой
												 + ?(ЗначениеЗаполнено(ДанныеСтруктурированногоДокумента.НомерИсправления), 
												 " (испр. " + ДанныеСтруктурированногоДокумента.НомерИсправления + " от " + ДанныеСтруктурированногоДокумента.ДатаИсправленияСтрокой + ")", "");
							
	Элементы.НаименованиеПродавца.Заголовок = "Продавец: " + ДанныеСтруктурированногоДокумента.ПродавецНаименование;							
	Элементы.ИННКПППродавца.Заголовок = "ИНН/КПП: " + ДанныеСтруктурированногоДокумента.ПродавецИНН 
											+ ?(ЗначениеЗаполнено(ДанныеСтруктурированногоДокумента.ПродавецКПП), " / " 
												+ ДанныеСтруктурированногоДокумента.ПродавецКПП, "");
		
	Элементы.НаименованиеПокупателя.Заголовок = "Покупатель: " + ДанныеСтруктурированногоДокумента.ПокупательНаименование;
	Элементы.ИННКПППокупателя.Заголовок =  "ИНН/КПП: " + ДанныеСтруктурированногоДокумента.ПокупательИНН 
											+ ?(ЗначениеЗаполнено(ДанныеСтруктурированногоДокумента.ПокупательКПП), " / " 
												+ ДанныеСтруктурированногоДокумента.ПокупательКПП, "");
												
	// Данные исправленя
	ЭтоИсправление = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(ДанныеСтруктурированногоДокумента.НомерИсправления);
	Если ЭтоИсправление Тогда
		
		ОбновитьДанныеИспрПоДокументуОснования(ДанныеДокумента.КорректируемыйДокумент, ДанныеСтруктурированногоДокумента.Номенклатура);
		ОбновитьДанныеИспрАвансаПоСЧФИсправляемому(ДанныеДокумента.СчетФактураСсылкаИсправляемый);
		
	КонецЕсли;
	
	// Данные ПРД
	ЗаполнитьДанныеПРД(ДанныеСтруктурированногоДокумента);
	
	// Транспортные накладные
	ЗаполнитьДанныеТранспортныхНакладных(ДанныеСтруктурированногоДокумента);
	
	// Данные корректировки
	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ДанныеДокумента.ИдентификаторФайла);
	Если ЭтоКорректировка Тогда
		
		ЗаполнитьДанныеКорректируемыхДокументов(ДанныеСтруктурированногоДокумента);
		
		ОбновитьДанныеКорПоДокументуОснования(ДанныеДокумента.КорректируемыйДокумент, ДанныеСтруктурированногоДокумента.НоменклатураКор);
		// Таблица номенклатуры корректировки
		ЗаполнитьТаблицуНоменклатурыПоДаннымДокумента(ТаблицаКор, ДанныеСтруктурированногоДокумента.НоменклатураКор);	
		
	Иначе 
		
		// Таблица номенклатуры
		ЗаполнитьТаблицуНоменклатурыПоДаннымДокумента(Таблица, ДанныеСтруктурированногоДокумента.Номенклатура);
		
	КонецЕсли;
	
	Если Не ЭтоИсправление И Не ЭтоКорректировка Тогда
		ОбновитьДанныеИзСвязанногоДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияРеквизитовФормыПоДаннымДокумента(ДанныеЗаполнения)
	
	РеквизитыФормы = ЭтотОбъект.ПолучитьРеквизиты();
	
	Для каждого РеквизитФормы Из РеквизитыФормы Цикл
		
		ТекРеквизитФормы = ЭтотОбъект[РеквизитФормы.Имя];
			
		Если ТипЗнч(ТекРеквизитФормы) = Тип("ДанныеФормыКоллекция") Тогда
			Продолжить;
		КонецЕсли;
			
		ЭтотОбъект[РеквизитФормы.Имя] = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, РеквизитФормы.Имя, ТекРеквизитФормы);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыПоДаннымДокумента(ТаблицаНоменклатуры, ТаблицаДанных)
	
	Для каждого СтрокаНоменклатуры Из ТаблицаДанных Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ИсключаемыеКолонки = "СведенияОМаркировке, СведенияОПрослеживаемости";
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатуры, , ИсключаемыеКолонки);
		ЗаполнитьСведенияОМаркировке(НоваяСтрока, СтрокаНоменклатуры);
		ЗаполнитьСведенияОПрослеживаемости(НоваяСтрока, СтрокаНоменклатуры);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОМаркировке(ЗаполняемаяСтрока, СтрокаДанных)
	
	Если ТипЗнч(СтрокаДанных.СведенияОМаркировке) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемаяСтрока.СведенияОМаркировке.ЗагрузитьЗначения(СтрокаДанных.СведенияОМаркировке);
	
	Для каждого ТекСведения Из СтрокаДанных.СведенияОМаркировке Цикл
		
		Для Каждого ТекИндивидуальнаяУпаковка Из ТекСведения.НомУпак Цикл
			Если ЗначениеЗаполнено(ТекИндивидуальнаяУпаковка) Тогда
				ЗаполняемаяСтрока.КодыМаркировки.Добавить(ТекИндивидуальнаяУпаковка, ТекИндивидуальнаяУпаковка);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекКИЗ Из ТекСведения.КИЗ Цикл
			Если ЗначениеЗаполнено(ТекКИЗ) Тогда
				ЗаполняемаяСтрока.КодыМаркировки.Добавить(ТекКИЗ, ТекКИЗ);
			КонецЕсли;	
		КонецЦикла;
		
		ТранспортнаяУпаковка = ТекСведения.ИдентТрансУпак;
		Если ЗначениеЗаполнено(ТранспортнаяУпаковка) Тогда 
			ЗаполняемаяСтрока.КодыМаркировки.Добавить(ТранспортнаяУпаковка, ТранспортнаяУпаковка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаполняемаяСтрока.ГТИН) Тогда
			ЗаполняемаяСтрока.КодыМаркировки.Добавить(ККСНГ_ФормированиеXML.СобратьШтрикодОбъемноСортовогоУчета(ЗаполняемаяСтрока.ГТИН, ТекСведения.КолВедМарк));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПрослеживаемости(ЗаполняемаяСтрока, СтрокаДанных)
	
	Если ТипЗнч(СтрокаДанных.СведенияОПрослеживаемости) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДанных.СведенияОПрослеживаемости.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");	
	
	Для каждого ТекСведения Из СтрокаДанных.СведенияОПрослеживаемости Цикл
				
		ТекНомТовПрослеж = СокрЛП(ТекСведения.НомТовПрослеж);
		Если ЗначениеЗаполнено(ТекНомТовПрослеж) Тогда 
			ЗаполняемаяСтрока.РНПТ.Добавить(ТекНомТовПрослеж, ТекНомТовПрослеж);
		КонецЕсли;
		
		СсылкаРНПТ = ОбщийМодульПринятиеКУчету.НайтиНомерГТД(ТекНомТовПрослеж, 
						ЗаполняемаяСтрока.КодСтраныПроисх, ЗаполняемаяСтрока.СтранаПроисхожденияСсылка);
		ТекСведения.Вставить("СсылкаРНПТ", СсылкаРНПТ);
		
	КонецЦикла;
	ЗаполняемаяСтрока.СведенияОПрослеживаемости.ЗагрузитьЗначения(СтрокаДанных.СведенияОПрослеживаемости);
	ЗаполняемаяСтрока.ЭтоПрослеживаемыйТовар = Истина;
	ЗаполнитьСопоставленыРНПТ(ЗаполняемаяСтрока);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСопоставленыРНПТ(ЗаполняемаяСтрока)
	
	СопоставленыРНПТ = Истина;
	Для каждого ТекЭлемент Из ЗаполняемаяСтрока.СведенияОПрослеживаемости Цикл
		
		ТекСведения = ТекЭлемент.Значение;
		СопоставленыРНПТ = СопоставленыРНПТ И ЗначениеЗаполнено(ТекСведения.СсылкаРНПТ);
		
	КонецЦикла;
	ЗаполняемаяСтрока.СопоставленыРНПТ = СопоставленыРНПТ;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПРД(ДанныеСтруктурированногоДокумента)
	
	СвПРД = Неопределено;
	ДанныеСтруктурированногоДокумента.Свойство("СвПРД", СвПРД);
	Если СвПРД <> Неопределено И СвПРД.Количество() > 0 Тогда
		Для каждого ТекСвПРД Из СвПРД Цикл
			НовПРД = ДанныеПРД.Добавить();
			НовПРД.Номер = ТекСвПРД.НомерПРД;
			НовПРД.Дата = ТекСвПРД.ДатаПРД;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТранспортныхНакладных(ДанныеСтруктурированногоДокумента)
	
	ТранНакл = Неопределено;
	ДанныеСтруктурированногоДокумента.Свойство("ТранНакл", ТранНакл);
	Если ТранНакл <> Неопределено И ТранНакл.Количество() > 0 Тогда
		Для каждого ТекТранНакл Из ТранНакл Цикл
			НовТранНакл = ДанныеТранспортныхНакладных.Добавить();
			НовТранНакл.Номер = ТекТранНакл.НомТранНакл;
			НовТранНакл.Дата = ТекТранНакл.ДатаТранНакл;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКорректируемыхДокументов(ДанныеСтруктурированногоДокумента)
	
	ОснСЧФ = Неопределено;
	ДанныеСтруктурированногоДокумента.Свойство("ОснСЧФ", ОснСЧФ);
	Если ОснСЧФ <> Неопределено И ОснСЧФ.Количество() > 0 Тогда
		Для каждого ТекОснСЧФ Из ОснСЧФ Цикл
			НовКорДок = ДанныеКорректируемыхДокументов.Добавить();
			НовКорДок.Номер = ТекОснСЧФ.НомерОснСЧФ;
			НовКорДок.Дата = ТекОснСЧФ.ДатаОснСЧФ;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьДанныеИзСвязанногоДокумента()
	
	Если ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка) Тогда
		
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		ОбщийМодульПринятиеКУчету.ЗаполнитьДанныеФормыПоДокументу(ЭтотОбъект, ПоступлениеТоваровУслугСсылка);
		
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		ОбщийМодульПринятиеКУчету.ЗаполнитьДанныеФормыПоДокументу(ЭтотОбъект, ДокументОснование);
		
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновитьДанныеСчетФактурыПоОснованию(Основание, ПолеСчетФактуры, ЭтоАванс = Ложь)

	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
	ПолеСчетФактуры = ОбщийМодульПринятиеКУчету.СчетаФактурыПоОснованию(Основание, ЭтоАванс);
	// TO DO: Проверить для УПД исправленного.

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументОснованиеСЧФАванса()
	
	ДанныеОснованийСФ = ККСНГ_ПринятиеКУчетуВызовСервера.ТаблицаОснСЧФ();
	Для каждого ТекСвПРД Из ДанныеПРД Цикл
		СтрокаТекПРД = ДанныеОснованийСФ.Добавить();
		СтрокаТекПРД.НомерОснСЧФ = ТекСвПРД.Номер;
		СтрокаТекПРД.ДатаОснСЧФ = ТекСвПРД.Дата;
	КонецЦикла;
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
	ДокументОснование = ОбщийМодульПринятиеКУчету.НайтиОснованиеСФ(Организация, Контрагент, 
							ДанныеОснованийСФ, ВидСчетаФактурыПолученного);
	ОбновитьДанныеИзСвязанногоДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументОснованиеСЧФ()
	
	ДанныеОснованийСФ = ККСНГ_ПринятиеКУчетуВызовСервера.ТаблицаОснСЧФ();	
	СтрокаТекДокумента = ДанныеОснованийСФ.Добавить();
	СтрокаТекДокумента.НомерОснСЧФ = Номер;
	СтрокаТекДокумента.ДатаОснСЧФ = Дата;
	
	Если ДанныеТранспортныхНакладных.Количество() Тогда
		Для каждого ТекТранНакл Из ДанныеТранспортныхНакладных Цикл
			СтрокаТекТранНакл = ДанныеОснованийСФ.Добавить();
			СтрокаТекТранНакл.НомерОснСЧФ = ТекТранНакл.Номер;
			СтрокаТекТранНакл.ДатаОснСЧФ = ТекТранНакл.Дата;
		КонецЦикла;
	КонецЕсли;
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
	ДокументОснование = ОбщийМодульПринятиеКУчету.НайтиОснованиеСФ(Организация, Контрагент, 
							ДанныеОснованийСФ, ВидСчетаФактурыПолученного);
	ОбновитьДанныеИзСвязанногоДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКорПоДокументуОснования(ДокументОснованиеКор, НоменклатураКор = Неопределено)
	
	Если ЗначениеЗаполнено(ДокументОснованиеКор) Тогда
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		ОбщийМодульПринятиеКУчету.ЗаполнитьДанныеФормыПоДокументу(ЭтотОбъект, ДокументОснованиеКор);
		Если НоменклатураКор = Неопределено Тогда
			ТаблицаКорНоменклатуры = ТаблицаКор.Выгрузить();	
			ОбщийМодульПринятиеКУчету.ЗаполнитьНомераСтрокОснованияКорректировки(ТаблицаКорНоменклатуры, ДокументОснованиеКор);
			ТаблицаКор.Загрузить(ТаблицаКорНоменклатуры);
		Иначе
			ОбщийМодульПринятиеКУчету.ЗаполнитьНомераСтрокОснованияКорректировки(НоменклатураКор, ДокументОснованиеКор);
		КонецЕсли;
		КорПоступленияТоваровУслугСсылка = ОбщийМодульПринятиеКУчету.НайтиКорректировочныйДокумент(Номер, Дата, ДокументОснованиеКор);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКорректируемыйДокумент()
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
	ДанныеИсправляемыхДокументов = ККСНГ_ПринятиеКУчетуВызовСервера.ТаблицаОснСЧФ();
	ЭтоКорректировка = ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла);
	Если ЭтоКорректировка Тогда
		Для Каждого ТекСтрока Из ДанныеКорректируемыхДокументов Цикл
			СтрокаТекДокумента = ДанныеИсправляемыхДокументов.Добавить();
			СтрокаТекДокумента.НомерОснСЧФ = ТекСтрока.Номер;
			СтрокаТекДокумента.ДатаОснСЧФ = ТекСтрока.Дата;
		КонецЦикла;
	Иначе 
		СтрокаТекДокумента = ДанныеИсправляемыхДокументов.Добавить();
		СтрокаТекДокумента.НомерОснСЧФ = Номер;
		СтрокаТекДокумента.ДатаОснСЧФ = Дата;
	КонецЕсли;
	КорректируемыйДокумент = ОбщийМодульПринятиеКУчету.НайтиКорректируемыйДокумент(Организация, Контрагент, 
															ДанныеИсправляемыхДокументов, ЭтоКорректировка);
	ОбновитьДанныеИспрПоДокументуОснования(КорректируемыйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеИспрПоДокументуОснования(ДокументОснованиеИспр, НоменклатураИспр = Неопределено)
	
	Если ЗначениеЗаполнено(ДокументОснованиеИспр) Тогда
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		ОбщийМодульПринятиеКУчету.ЗаполнитьДанныеФормыПоДокументу(ЭтотОбъект, ДокументОснованиеИспр);
		Если НоменклатураИспр = Неопределено Тогда
			ТаблицаИспрНоменклатуры = Таблица.Выгрузить();	
			ОбщийМодульПринятиеКУчету.ЗаполнитьНомераСтрокОснованияИсправления(ТаблицаИспрНоменклатуры, ДокументОснованиеИспр);
			Таблица.Загрузить(ТаблицаИспрНоменклатуры);
		Иначе
			ОбщийМодульПринятиеКУчету.ЗаполнитьНомераСтрокОснованияИсправления(НоменклатураИспр, ДокументОснованиеИспр);
		КонецЕсли;
		КорПоступленияТоваровУслугСсылка = ОбщийМодульПринятиеКУчету.НайтиКорректировочныйДокумент(Номер, Дата, ДокументОснованиеИспр);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСЧФИсправляемыйАванса()
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
	СчетФактураСсылкаИсправляемый = ОбщийМодульПринятиеКУчету.НайтиИсправляемыйАвансСФ(Организация, Контрагент, Дата, Номер);			
	ОбновитьДанныеИспрАвансаПоСЧФИсправляемому(СчетФактураСсылкаИсправляемый);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеИспрАвансаПоСЧФИсправляемому(СЧФИсправляемый)
	
	Если ЗначениеЗаполнено(СЧФИсправляемый) Тогда
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		ОбщийМодульПринятиеКУчету.ЗаполнитьДанныеФормыПоДокументу(ЭтотОбъект, СЧФИсправляемый);
		СчетФактураИсправлениеАванса = ОбщийМодульПринятиеКУчету.НайтиИсправленныйАвансСФ(НомерИсправления, ДатаИсправления, СЧФИсправляемый);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьНомерСтрокиДокументаОснованияКор(ДокументОснованиеКор, ИДОбновляемойСтроки)
	
	ОбновляемаяСтрока = ТаблицаКор.НайтиПоИдентификатору(ИДОбновляемойСтроки);
	Если ЗначениеЗаполнено(ДокументОснованиеКор) И ОбновляемаяСтрока <> Неопределено Тогда
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		НоменклатураКор = Новый Массив;
		НоменклатураКор.Добавить(ОбновляемаяСтрока);
		ОбщийМодульПринятиеКУчету.ЗаполнитьНомераСтрокОснованияКорректировки(НоменклатураКор, ДокументОснованиеКор);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьНомерСтрокиДокументаОснованияИспр(ДокументОснованиеИспр, ИДОбновляемойСтроки)
	
	ОбновляемаяСтрока = Таблица.НайтиПоИдентификатору(ИДОбновляемойСтроки);
	Если ЗначениеЗаполнено(ДокументОснованиеИспр) И ОбновляемаяСтрока <> Неопределено Тогда
		ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
		НоменклатураИспр = Новый Массив;
		НоменклатураИспр.Добавить(ОбновляемаяСтрока);
		ОбщийМодульПринятиеКУчету.ЗаполнитьНомераСтрокОснованияИсправления(НоменклатураИспр, ДокументОснованиеИспр);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СохранитьСтрокуСоответствияНоменклатурыНаСервере(ИмяТекущейТаблицы, ИдентификаторСтроки)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		СтрокаНомеклатуры = ЭтотОбъект[ИмяТекущейТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если СтрокаНомеклатуры <> Неопределено 
			И ЗначениеЗаполнено(СтрокаНомеклатуры.Номенклатура) Тогда
			
			СписокВидовНоменклатуры = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьСписокПризнаковТоварРабота();
			
			ВидНоменклатуры = СписокВидовНоменклатуры.НайтиПоЗначению(СтрокаНомеклатуры.Вид); 
			
			Справочники.ККСНГ_НоменклатураКонтрагентов.Записать(Контрагент,
																	СтрокаНомеклатуры.Номенклатура,
																	СтрокаНомеклатуры.ХарактеристикаНоменклатуры,
																	СтрокаНомеклатуры.Код,
																	СтрокаНомеклатуры.Наименование,
																	?(ВидНоменклатуры <> Неопределено, ВидНоменклатуры.Представление, ""),
																	СтрокаНомеклатуры.ЕдИзм,
																	СтрокаНомеклатуры.Артикул,
																	СтрокаНомеклатуры.Характеристика);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьНоменклатуруКонтрагентаНаСервере()
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоКорректировка(ЭтотОбъект.ИдентификаторФайла) Тогда
	
		ТаблицаКорНоменклатуры = ТаблицаКор.Выгрузить();	
		ККСНГ_ПринятиеКУчетуВызовСервера.НайтиСопоставленияНоменклатурыКонтрагентаДляКорректировки(ТаблицаКорНоменклатуры, Контрагент);
		ТаблицаКор.Загрузить(ТаблицаКорНоменклатуры);
	
	Иначе
		
		ТаблицаНоменклатуры = Таблица.Выгрузить();	
		ККСНГ_ПринятиеКУчетуВызовСервера.НайтиСопоставленияНоменклатурыКонтрагента(ТаблицаНоменклатуры, Контрагент);
		Таблица.Загрузить(ТаблицаНоменклатуры);
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСвязиДокумента()
	
	ККСНГ_ОбъектыИБВызовСервера.УдалитьСвязиЭлектронногоДокумента(ДокументСсылка);
	
	СвязанныеДокументы = Новый Массив;
	
	Если ЗначениеЗаполнено(ПоступлениеТоваровУслугСсылка) Тогда
		СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка", ПоступлениеТоваровУслугСсылка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетфактураСсылка) Тогда
		СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка", СчетфактураСсылка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетФактураСсылкаАванс) Тогда
		СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка", СчетФактураСсылкаАванс));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КорПоступленияТоваровУслугСсылка) Тогда
		СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка", КорПоступленияТоваровУслугСсылка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КорСчетфактураСсылка) Тогда
		СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка", КорСчетфактураСсылка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетФактураИсправлениеАванса) Тогда
		СвязанныеДокументы.Добавить(Новый Структура("ДокументСсылка", СчетФактураИсправлениеАванса));
	КонецЕсли;
	
	Если СвязанныеДокументы.Количество() Тогда
		ККСНГ_ОбъектыИБВызовСервера.ЗаписатьСвязиЭлектронногоДокумента(ДокументСсылка, СвязанныеДокументы);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СозданыУчетныеДокументы()
	
	КоличествоЗаполненныхДокументов = КоличествоСвязейДокумента(Истина);
	Возврат КоличествоЗаполненныхДокументов > 0;
	
КонецФункции
	
&НаКлиенте
Функция ЕстьНезаписанныеСвязиДокумента()
	
	ЗапросЗаписанныхСвязей = КоличествоЗаписанныхСвязейДокумента(ДокументСсылка);
	Если ЗапросЗаписанныхСвязей.Успех Тогда
		КоличествоЗаписанныхСвязей = ЗапросЗаписанныхСвязей.Результат;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
	ТребуемоеКоличествоСвязей = КоличествоСвязейДокумента(Истина);	
	ЕстьНезаписанныеСвязи = КоличествоЗаписанныхСвязей <> ТребуемоеКоличествоСвязей;

	Возврат ЕстьНезаписанныеСвязи;
	
КонецФункции

&НаКлиенте
Функция КоличествоСвязейДокумента(ТолькоЗаполненные = Ложь)
	
	КоличествоСвязей = 0;
	ПоляСвязи = Новый Соответствие;
	ПоляСвязи.Вставить(ПоступлениеТоваровУслугСсылка, Элементы.ПоступлениеТоваровУслугСсылка.Видимость); 
	ПоляСвязи.Вставить(СчетфактураСсылка, Элементы.СчетФактураСсылка.Видимость);
	ПоляСвязи.Вставить(СчетФактураСсылкаАванс, Элементы.СчетФактураСсылкаАванс.Видимость);
	ПоляСвязи.Вставить(КорПоступленияТоваровУслугСсылка, ЕстьКорректировкаПоступления И Элементы.КорПоступленияТоваровУслугСсылка.Видимость); 
	ПоляСвязи.Вставить(КорСчетфактураСсылка, Элементы.КорСчетфактураСсылка.Видимость); 
	ПоляСвязи.Вставить(СчетФактураИсправлениеАванса, Элементы.СчетФактураИсправлениеАванса.Видимость); 	
	Для каждого ТекПоле Из ПоляСвязи Цикл
		Если ТекПоле.Значение = Истина И (ЗначениеЗаполнено(ТекПоле.Ключ) Или Не ТолькоЗаполненные) Тогда
			КоличествоСвязей = КоличествоСвязей + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоСвязей;

КонецФункции

&НаСервереБезКонтекста
Функция КоличествоЗаписанныхСвязейДокумента(ДокументСсылка)
	
	РезультатПоиска = РегистрыСведений.ККСНГ_СвязанныеДокументы.НайтиЗаписи(ДокументСсылка);	
	Ответ = РезультатПоиска;
	Если РезультатПоиска.Успех Тогда
		Ответ.Результат = РезультатПоиска.Результат.Количество();
	Иначе 
		Ответ.Результат = Неопределено;
	КонецЕсли;
	
	Возврат Ответ;            
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииСчетФактуры()
	
	ЗаписатьСвязиДокумента();
	ОповеститьОбИзменении(ЭтотОбъект.ДокументСсылка);
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДокументаПоступления()
	
	ЗаписатьСвязиДокумента();
	Если Не ФункцияСодержитСЧФ() Тогда
		ОповеститьОбИзменении(ЭтотОбъект.ДокументСсылка);
	КонецЕсли;
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНомерСтрокиДокОснованияИспрДляТекущей()
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИсправление(ЭтотОбъект.НомерИсправления) Тогда
		ИДТекСтроки = Элементы.Таблица.ТекущиеДанные.ПолучитьИдентификатор();
		ОбновитьНомерСтрокиДокументаОснованияИспр(КорректируемыйДокумент, ИДТекСтроки);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНомерСтрокиДокОснованияКорДляТекущей()
	
	ИДТекСтроки = Элементы.ТаблицаКор.ТекущиеДанные.ПолучитьИдентификатор();
	ОбновитьНомерСтрокиДокументаОснованияКор(КорректируемыйДокумент, ИДТекСтроки);
		
КонецПроцедуры

#КонецОбласти