#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтпечатокИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Перем Результат;
	
	Если ПроверитьЗаполнение() Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Наименование", СокрЛП(ЭтотОбъект.Наименование));
		Результат.Вставить("Отпечаток", СокрЛП(ЭтотОбъект.Отпечаток));
		
		Закрыть(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы()
	
	ЭтотОбъект.Элементы.ОК.Доступность = Не ПустаяСтрока(Элементы.Отпечаток.ТекстРедактирования);
	
КонецПроцедуры

#КонецОбласти
