
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьНаличиеОбновления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТестПриИзменении(Элемент)
	
	Элементы.ЗагрузитьТестовоеОбновление.Видимость = Тест;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	ДопПараметры = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОбновление", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = НСтр("ru = 'Перед началом обновления рекомендуется сделать резервные копии расширений.
								|Продолжить обновление?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0, , "Обновление");		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьОбновление(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановкаОбновления = ККСНГ_ОбновлениеВызовСервера.УстановитьОбновление(СтруктураОбновления);
		Если УстановкаОбновления.Успех Тогда
			Перезапуск();
		Иначе
			Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;
			Элементы.ДекорацияИНФО.Заголовок = "Установка обновления завершилась с ошибками.";
			Элементы.ДекорацияОжидание.Видимость = Ложь;
			ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(УстановкаОбновления.Журнал, "-1");	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиОшибки(МассивСообщений)
	
	Элементы.Обновить.Видимость = Ложь;
	
	ИнформацияОбОшибках = "";
	Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаТекст;
	
	Для Каждого СтрокаСообщения Из МассивСообщений Цикл
		ИнформацияОбОшибках = ИнформацияОбОшибках + ?(ИнформацияОбОшибках = "", СтрокаСообщения, Символы.ПС + СтрокаСообщения);
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИнформациюОбОбновлении()
	
	БылиОшибки = Ложь;
	
	Если ТипЗнч(СтруктураОбновления) = Тип("Структура") Тогда
		
		Если ТипЗнч(СтруктураОбновления.Ошибки) = Тип("Массив") Тогда
			МассивОшибок = СтруктураОбновления.Ошибки;
			Если МассивОшибок.Количество() > 0 Тогда
				ВывестиОшибки(МассивОшибок);
				БылиОшибки = Истина;
			КонецЕсли;
		КонецЕсли;	
		
		Если СтруктураОбновления.ЕстьОбновление Тогда
	        Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаХТМЛ;
			ОтобразитьХТМЛ();
			ДоступноОбновление = ККСНГ_РасширенияВызовСервера.ДоступноПравоАдминистрированияРасширений();
			Элементы.Обновить.Видимость = ДоступноОбновление;
			Элементы.ОбновитьБезПолномочий.Видимость = Не ДоступноОбновление;
		Иначе
			Если Не БылиОшибки Тогда
				Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;
				Элементы.ДекорацияИНФО.Заголовок = "Вы используете актуальную версию продукта. Обновление не требуется.";
				Элементы.ДекорацияОжидание.Видимость = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		Элементы.Тест.Доступность = ?(Не Тест, Истина, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтобразитьХТМЛ()
	
	АдресХранилищаХТМЛ = СтруктураОбновления.ИнформацияОбОбновленииАдресХранилища;	
	ДДИнфо = ПолучитьИзВременногоХранилища(АдресХранилищаХТМЛ);
	ФайлХТМЛ = ПолучитьИмяВременногоФайла("html");
	ДДИнфо.Записать(ФайлХТМЛ);
	ИнформацияОбОбновлении = ФайлХТМЛ;
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьВременныеФайлы(ФайлХТМЛ);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапуск()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерезапускОК", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Для применения изменений требуется перезапуск сеанса 1С. Перезапустить сейчас?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПерезапускОК(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПрекратитьРаботуСистемы(Истина);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры	

#Область ПроверкаНаличияОбновления

&НаКлиенте
Процедура ПроверитьНаличиеОбновления(Тестовое = Ложь)
	
	Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;
	
	Элементы.ДекорацияИНФО.Заголовок = "Проверка наличия обновления займёт некоторое время...";
	Элементы.ДекорацияОжидание.Видимость = Истина;
	
	Если Тестовое Тогда
		Элементы.Тест.Доступность = Ложь;
		Элементы.ЗагрузитьТестовоеОбновление.Доступность = Ложь;
	КонецЕсли;	
	
	ФоновоеЗадание = ПроверитьНаличиеОбновленияНаСервере();
	
	Если ФоновоеЗадание <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеПроверкиНаличияОбновления", 2, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеОбновленияНаСервере()
		
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(АдресХранилища);
	ПараметрыВызова.Добавить(Тест);
	
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ККСНГ_ОбновлениеВызовСервера.ПроверитьНаличиеОбновленияВФоновомЗадании", 
														ПараметрыВызова, , "Проверка наличия обновления");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	Возврат ИдентификаторЗадания;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗавершениеПроверкиНаличияОбновления() Экспорт
	
	РезультатВыполнения = ККСНГ_ОбщегоНазначенияВызовСервера.РезультатВыполненияФоновогоЗадания(ИдентификаторЗадания);
	Если РезультатВыполнения.Завершено Тогда
		
		ИдентификаторЗадания = "";
		Если РезультатВыполнения.ОписаниеОшибки = Неопределено Тогда
			РезультатПроверки = ПолучитьИзВременногоХранилища(АдресХранилища);
		Иначе 
			РезультатПроверки = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
			ОписаниеОшибки = "Проверка наличия обновления завершилась с ошибками: " + РезультатВыполнения.ОписаниеОшибки;
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(РезультатПроверки.Журнал, ОписаниеОшибки, "BJ-00002");
		КонецЕсли;
		Если РезультатПроверки.Успех Тогда
		    Если РезультатПроверки.Результат = Истина Тогда
			    ЗапроситьДанныеОбновления(Ложь);
			Иначе 
				Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;
				Элементы.ДекорацияИНФО.Заголовок = "Вы используете актуальную версию продукта. Обновление не требуется.";
				Элементы.ДекорацияОжидание.Видимость = Ложь;
			КонецЕсли;
		Иначе 
			Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;
			Элементы.ДекорацияИНФО.Заголовок = "Проверка наличия обновления завершилась с ошибками.";
			Элементы.ДекорацияОжидание.Видимость = Ложь;
			ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатПроверки.Журнал, "-1");
		КонецЕсли;
		
	Иначе
		
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеПроверкиНаличияОбновления", 2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросДанныхОбновления

&НаКлиенте
Процедура ЗапроситьДанныеОбновления(Тестовое = Ложь)
	
	Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;	
	Элементы.ДекорацияИНФО.Заголовок = "Загрузка обновления займёт некоторое время...";
	Элементы.ДекорацияОжидание.Видимость = Истина;
	
	Если Тестовое Тогда
		Элементы.Тест.Доступность = Ложь;
		Элементы.ЗагрузитьТестовоеОбновление.Доступность = Ложь;
	КонецЕсли;	
	
	ФоновоеЗадание = ЗапроситьДанныеОбновленияНаСервере();
	
	Если ФоновоеЗадание <> Неопределено Тогда		
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеЗапросаДанныхОбновления", 2, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗапроситьДанныеОбновленияНаСервере()
		
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
	ПараметрыВызова = Новый Массив;
	ПараметрыВызова.Добавить(АдресХранилища);
	ПараметрыВызова.Добавить(Тест);
	
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ККСНГ_ОбновлениеВызовСервера.ЗагрузитьОбновлениеВФоновомЗадании", 
														ПараметрыВызова, , "Проверка наличия обновления");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	Возврат ИдентификаторЗадания;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗавершениеЗапросаДанныхОбновления() Экспорт
	
	ЗаданиеВыполнено = ККСНГ_ОбщегоНазначенияВызовСервера.ЗаданиеВыполнено(ИдентификаторЗадания);
	
	Если ЗаданиеВыполнено Тогда
		
		ИдентификаторЗадания = "";
		ЗапросПакетаОбновления = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		Если ЗапросПакетаОбновления.Успех Тогда
			
			СтруктураОбновления = ЗапросПакетаОбновления.Результат;
			Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаХТМЛ;
			ИнформацияОбОбновлении = СтруктураОбновления.ИсторияВерсий;
			ДоступноОбновление = ККСНГ_РасширенияВызовСервера.ДоступноПравоАдминистрированияРасширений();
			Элементы.Обновить.Видимость = ДоступноОбновление;
			Элементы.ОбновитьБезПолномочий.Видимость = Не ДоступноОбновление;
			
		Иначе 
			Элементы.ГруппаСтраницыИнформации.ТекущаяСтраница = Элементы.СтраницаДекорация;
			Элементы.ДекорацияИНФО.Заголовок = "Проверка наличия обновления завершилась с ошибками.";
			Элементы.ДекорацияОжидание.Видимость = Ложь;
			ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗапросПакетаОбновления.Журнал, "-1");
		КонецЕсли;
		
	Иначе
		
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеЗапросаДанныхОбновления", 2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
