#Область СлужебныйПрограммныйИнтерфейс

// Получает новый авторизационный токен по предоставленному ключу
// См. ККСНГ_APIКурьерСервер.LogonByApiKey
//
// Параметры:
//  Key - строка, ключ доступа к API
//
// Возвращаемое значение: 
//  Токен - строка, авторизационный токен
//
Функция ПолучитьАвторизационныйТокенПоКлючу(Знач Key) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение auth-токена сервиса ЭДО");
	
	Если (ПустаяСтрока(Key)) Тогда
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не указан ключ доступа к API", "AU-00001");
		
	Иначе
		
		Запрос = ККСНГ_APIКурьер.v1_LogonByApiKey(Key);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, Запрос.Журнал, Ложь);
		Если Запрос.Успех Тогда
			Ответ.Результат = Запрос.Результат.token;
			Ответ.Успех = Истина;
		Иначе
			Ответ.Результат = Запрос.Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает код ЭДО для получателя по указанному коду типа документа
//
// Параметры:
//  Контрагент - СправочникСсылка.ККСНГ_Контрагенты, получатель
//  КодТипаДокумента - Строка, код типа документа
//  ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации, организация-отправитель
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//  КодЭДО - строка, код ЭДО получателя
//
Функция ПолучитьКодЭДОПолучателя(Знач Контрагент, КодТипаДокумента, ПрофильЭДООрганизации, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Определение кода ЭДО для получателя");
	
	// Получим значение по умолчанию из профиля ЭДО контрагента
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПрофильКонтрагента = Справочники.ККСНГ_Контрагенты.НайтиПоРеквизиту("Контрагент", Контрагент, , ПрофильЭДООрганизации);
		
		Если Не ПрофильКонтрагента.Пустая() Тогда
			Ответ.Результат = ПрофильКонтрагента.КодУчастникаЭДО;
			Ответ.Успех = Истина;
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не найдена настройка ЭДО по контрагенту");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Контрагент) = Тип("СправочникСсылка.ККСНГ_Контрагенты") Тогда
		
		ПрофильКонтрагента = Контрагент;
		Ответ.Результат = ПрофильКонтрагента.КодУчастникаЭДО;
		Ответ.Успех = Истина;
		
	Иначе
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Некорректные данные контрагента.");
		
	КонецЕсли;
	
	// Получим актуальный код ЭДО через API Курьер
	Если Ответ.Успех И Не ПустаяСтрока(КодТипаДокумента) Тогда
		
		ЗапросАктуальныйКодЭДО = АктуальныйКодЭДОПолучателяИзСервиса(ПараметрыАвторизации, Ответ.Результат, КодТипаДокумента);
			
		Если ЗапросАктуальныйКодЭДО.Успех Тогда
			Ответ.Результат = ЗапросАктуальныйКодЭДО.Результат;
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросАктуальныйКодЭДО.Журнал, Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает значение ставки НДС по переданному представлению в терминах метаданных конфигурации. 
//
// Параметры:
//	СтавкаНДС - Строка
//
// Возвращаемое значение:
//	ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС
//
Функция ПолучитьСтавкуНДСДляПринятияКУчету(ПредставлениеСтавкиНДС) Экспорт
	
	Перем СтавкиНДС, СтавкаНДС;
	
	СтавкиНДС = СоответствиеСтавокНДССтроковымЗначениям();
	СтавкаНДС = СтавкиНДС.Получить(ПредставлениеСтавкиНДС);
	
	Если СтавкаНДС = Неопределено Тогда
		СтавкаНДС = СтавкиНДС.Получить("без НДС");
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции

// Возвращает строковое представление НДС
//
// Параметры:
//	СтавкаНДС - ПеречислениеСсылка.СтавкиНДС, СправочникСсылка.СтавкиНДС
//
// Возвращаемое значение:
//	Строка
//
Функция ОпределитьСтавкуНДС(Знач СтавкаНДС) Экспорт
	
	Перем СтавкиНДС, СтавкаНДССтрокой;
	
	СтавкиНДС = СоответствиеСтавокНДССтроковымЗначениям();
	СтавкаНДССтрокой = СтавкиНДС.Получить(СтавкаНДС);
	
	Если СтавкаНДССтрокой = Неопределено Тогда
		СтавкаНДССтрокой = "без НДС";
	КонецЕсли;
	
	Возврат СтавкаНДССтрокой;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеСтавокНДССтроковымЗначениям()
	
	Перем Соответствие, ТекстЗапроса, Запрос, Выборка;
	Перем КонфигурацияERP, КлючСоответствия;
	
	Соответствие = Новый Соответствие;
	
	Если Метаданные.Справочники.Найти("СтавкиНДС") <> Неопределено Тогда // ERP
		
		КонфигурацияERP = Истина;
		Соответствие.Вставить("без НДС", Справочники.СтавкиНДС.БезНДС);
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтавкиНДС.Ставка КАК Ставка,
		|	СтавкиНДС.Ссылка КАК Ссылка,
		|	СтавкиНДС.РасчетнаяСтавка КАК РасчетнаяСтавка
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	НЕ СтавкиНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)";
		
	Иначе // БП
		
		КонфигурацияERP = Ложь;
		Соответствие.Вставить("без НДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтавкиНДС.Ссылка) КАК Ставка,
		|	СтавкиНДС.Ссылка КАК Ссылка,
		|	ЛОЖЬ КАК РасчетнаяСтавка
		|ИЗ
		|	Перечисление.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	НЕ СтавкиНДС.Ссылка = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)";
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.РасчетнаяСтавка Тогда
			КлючСоответствия = Строка(Выборка.Ставка) + "/" + Строка(Выборка.Ставка + 100);
		Иначе
			КлючСоответствия = Строка(Выборка.Ставка);
			Если КонфигурацияERP И СтрНайти(КлючСоответствия, "%") = 0 Тогда
				КлючСоответствия = КлючСоответствия + "%";
			КонецЕсли;
		КонецЕсли;
		
		// Добавляем возможность получать как строковое значение, так и ссылочное по ключу
		Соответствие.Вставить(КлючСоответствия , Выборка.Ссылка);
		Соответствие.Вставить(Выборка.Ссылка, КлючСоответствия);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция АктуальныйКодЭДОПолучателяИзСервиса(ПараметрыАвторизации, КодУчастникаЭДО, КодТипаДокумента) 
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение актуального кода ЭДО клиента.");
	
	ЗапросСlientCode       = ККСНГ_APIКурьер.v2_СlientCode(ПараметрыАвторизации, КодУчастникаЭДО);
	ЗапросTypeDocumentCode = ККСНГ_APIКурьер.v2_TypeDocumentCode(ПараметрыАвторизации, КодТипаДокумента);
		
	Если ЗапросСlientCode.Успех И ЗапросTypeDocumentCode.Успех Тогда
			
		receiverId = ЗапросСlientCode.Результат.Id;
		documentTypeId = ЗапросTypeDocumentCode.Результат.Id;
			
		ЗапросClientEdiCode = ККСНГ_APIКурьер.v2_СlientEdiCodeByID(ПараметрыАвторизации, receiverId, documentTypeId);		
		
		Если ЗапросClientEdiCode.Успех Тогда
			
			Ответ.Результат = ЗапросClientEdiCode.Результат.Code;
			Ответ.Успех = Истина;
				
		Иначе
				
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросClientEdiCode.Журнал, Ложь);
				
		КонецЕсли;
				
	Иначе
			
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСlientCode.Журнал, Ложь);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросTypeDocumentCode.Журнал, Ложь);
			
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
