#Область ПрограммныйИнтерфейс

#Область ПроверкаБезопасногоРежима

// Проверяет необходимость донастройки расширения
//
// Возвращаемое значение:
//   Булево - Результат проверки
//
Функция НужноДонастроитьРасширения() Экспорт
	
	//Возврат НужноСнятьБезопасныйРежим() Или (глНужнаПерезагрузка = Истина);
	
	Возврат Ложь;
	
КонецФункции

// Проверяет необходимостить отключения безопасного режима при работе расширений
//
// Возвращаемое значение:
//   Булево - Результат проверки
//   
Функция НужноСнятьБезопасныйРежим() Экспорт
	
	//глНужнаПерезагрузка = (глНужнаПерезагрузка = Истина) Или (глРасширенияБезопасныйРежим.Количество() > 0);
	//ОбновитьРасширенияБезопасныйРежим();	
	//Возврат глРасширенияБезопасныйРежим.Количество() > 0;
	
	Возврат Ложь;
	
КонецФункции

// Обновляет расширения для работы в безопасном режиме
//
Процедура ОбновитьБезопасныйРежимРасширения(ДанныеОбновляемогоРасширения) Экспорт
	
	//ИнициализироватьРасширенияБезопасныйРежим();
	//ИмяРасширения = ДанныеОбновляемогоРасширения.Имя;
	//СинонимРасширения = глРасширенияБезопасныйРежим.Получить(ИмяРасширения);
	//ТекущийБезопасныйРежим = ККСНГ_РасширенияВызовСервера.БезопасныйРежимВключен(ИмяРасширения);
	//Если ТекущийБезопасныйРежим Тогда
	//	Если СинонимРасширения = Неопределено Тогда
	//		глРасширенияБезопасныйРежим.Вставить(ИмяРасширения, ДанныеОбновляемогоРасширения.Синоним);
	//	КонецЕсли;
	//Иначе 
	//	Если СинонимРасширения <> Неопределено Тогда
	//		глРасширенияБезопасныйРежим.Удалить(ИмяРасширения);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти