#Область ПрограммныйИнтерфейс

// Возвращает список расширений конфигурации
//
// Параметры:
//   Отбор - Неопределено - Вернет все установленные расширения конфигурации 
//		   - Структура - содержит:
//				* УникальныйИдентификатор - Строка - Идентификатор расширения
//				* Имя - Строка - Имя расширения
//
// Возвращаемое значение:
//   Массив из РасширениеКонфигурации
//
Функция ПолучитьСписокРасширенийКонфигурации(Отбор = Неопределено) Экспорт
	
	МассивРасширенийКонфигурации = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить(Отбор);
	ПодключенныеРасширения = ИдентификаторыРасширений(ИсточникРасширенийКонфигурации.СеансАктивные);
	ОтключенныеРасширения  = ИдентификаторыРасширений(ИсточникРасширенийКонфигурации.СеансОтключенные);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Расширение Из Расширения Цикл
		
		НовыйЭлемент = ПолучитьСтруктуруРасширения();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Расширение,, "Назначение");
		
		НовыйЭлемент.Статус =
			?(ПодключенныеРасширения[Расширение.Имя + Расширение.ХешСумма + Расширение.ОбластьДействия] <> Неопределено, 0,
			?(ОтключенныеРасширения[Расширение.Имя + Расширение.ХешСумма + Расширение.ОбластьДействия] <> Неопределено, 2 , 1));
		
		НовыйЭлемент.ПодключеноРаботает = (Расширение.Активно И НЕ НовыйЭлемент.Статус);
		НовыйЭлемент.ПредупреждатьОбОпасныхДействиях = Расширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях;
		НовыйЭлемент.Назначение = Строка(Расширение.Назначение);
		
		МассивРасширенийКонфигурации.Добавить(НовыйЭлемент);
		
	КонецЦикла;
	
	Возврат МассивРасширенийКонфигурации;
	
КонецФункции

// Возвращает коллекцию подключаемых модулей
//
// Параметры:
//   МакетНастройкиПодключаемыхМодулей - Строка - Имя макета настройки подключаемых модулей
//
// Возвращаемое значение:
//   Соответствие - содержит:
//		* Ключ - Строка - Полный путь к подключаемому модулю (конфигурация + расширение)
//		* Значение - Структура - содержит:
//			** ИмяКонфигурации - Строка
//			** МинимальнаяВерсияКонфигурации - Строка
//			** ИмяМакета - Строка
//			** Имя - Строка
//			** Версия - Строка
//
Функция ПолучитьСписокПодключаемыхМодулей(МакетНастройкиПодключаемыхМодулей) Экспорт

	Результат = Новый Соответствие;
	
	ТекущаяКонфигурация         = СведенияОКонфигурации();
	ИмяКонфигурации             = ТекущаяКонфигурация.Имя;
	ВерсияКонфигурацииСлужебная = ККСНГ_ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииСтрокой(ТекущаяКонфигурация.Версия);
	
	НастройкиПодключаемыхМодулей      = ПолучитьТаблицуЗначенийИзМакета(МакетНастройкиПодключаемыхМодулей);
	
	Для Каждого НастройкаПодключаемогоМодуля Из НастройкиПодключаемыхМодулей Цикл
		
		МинимальнаяВерсияКонфигурацииСлужебная = ККСНГ_ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииСтрокой(НастройкаПодключаемогоМодуля.МинимальнаяВерсияКонфигурации);
		Если МинимальнаяВерсияКонфигурацииСлужебная <= ВерсияКонфигурацииСлужебная
			И ИмяКонфигурации = НастройкаПодключаемогоМодуля.ИмяКонфигурации Тогда
			
			ПодключаемыйМодуль = ПолучитьСтруктуруПодключаемогоМодуля();
			ЗаполнитьЗначенияСвойств(ПодключаемыйМодуль, НастройкаПодключаемогоМодуля);
			
			Результат.Вставить(ПодключаемыйМодуль.ИмяКонфигурации + ПодключаемыйМодуль.Имя, ПодключаемыйМодуль);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выполняет установку/обновление подключаемого модуля
//
// Параметры:
//   ИмяРасширения - Строка - Имя расширения
//   ДвоичныеДанные - ДвоичныеДанные - Двоичные данные расширения
//   Активно - Булево - Признак активности расширения
//   ПредупреждатьОбОпасныхДействиях - Булево - Признак предупрждения об опасных действиях
//   БезопасныйРежим - Булево - Признак включения безопасного режима
//
// Возвращаемое значение:
//   Структура - содержит:
//		* Успех - Булево
//		* ОписаниеОшибки - Строка
//
Функция УстановитьОбновитьПодключаемыйМодуль(ИмяРасширения, ДвоичныеДанные, Активно = Истина, ПредупреждатьОбОпасныхДействиях = Ложь, БезопасныйРежим = Ложь) Экспорт
		
	Результат = Новый Структура("Успех, ОписаниеОшибки");
	Результат.Успех = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
			
	Отбор = Новый Структура("Имя", ИмяРасширения);
	Расширения = РасширенияКонфигурации.Получить(Отбор);
	Если Расширения.Количество() Тогда 
		НовоеРасширение = Расширения[0];
	Иначе
		НовоеРасширение = РасширенияКонфигурации.Создать();
	КонецЕсли;
	
	НовоеРасширение.Активно = Активно;
	НовоеРасширение.БезопасныйРежим = БезопасныйРежим;
	
	//ОписаниеЗащитыОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
	//ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = ПредупреждатьОбОпасныхДействиях;
	//
	//НовоеРасширение.ЗащитаОтОпасныхДействий = ОписаниеЗащитыОтОпасныхДействий;	
	
	Попытка
		НовоеРасширение.Записать(ДвоичныеДанные);
		Результат.Успех = Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстОшибки = "Не удалось установить расширение %1. " + ОписаниеОшибки;
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяРасширения);
		Результат.ОписаниеОшибки = ТекстОшибки;
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруРасширения()
	
	СтруктураРасширения = Новый Структура();
	
	СтруктураРасширения.Вставить("Имя");
	СтруктураРасширения.Вставить("Синоним");
	СтруктураРасширения.Вставить("Статус");
	СтруктураРасширения.Вставить("Активно");
	СтруктураРасширения.Вставить("ПодключеноРаботает");
	СтруктураРасширения.Вставить("Версия");
	СтруктураРасширения.Вставить("ПредупреждатьОбОпасныхДействиях");
	СтруктураРасширения.Вставить("БезопасныйРежим");
	СтруктураРасширения.Вставить("УникальныйИдентификатор");
	СтруктураРасширения.Вставить("ХешСумма");
	СтруктураРасширения.Вставить("Назначение");
		
	Возврат СтруктураРасширения;
	
КонецФункции

Функция ПолучитьСтруктуруПодключаемогоМодуля()
	
	СтруктураПодключаемогоМодуля = Новый Структура();
	СтруктураПодключаемогоМодуля.Вставить("ИмяКонфигурации");
	СтруктураПодключаемогоМодуля.Вставить("МинимальнаяВерсияКонфигурации");
	СтруктураПодключаемогоМодуля.Вставить("ИмяМакета");
	СтруктураПодключаемогоМодуля.Вставить("Имя");
	СтруктураПодключаемогоМодуля.Вставить("Версия");
	
	Возврат СтруктураПодключаемогоМодуля;

КонецФункции

Функция ИдентификаторыРасширений(ИсточникРасширений)
	
	Расширения = РасширенияКонфигурации.Получить(, ИсточникРасширений);
	Идентификаторы = Новый Соответствие;
	
	Для Каждого Расширение Из Расширения Цикл
		Идентификаторы.Вставить(Расширение.Имя + Расширение.ХешСумма + Расширение.ОбластьДействия, Истина);
	КонецЦикла;
	
	Возврат Идентификаторы;
	
КонецФункции

Функция СведенияОКонфигурации()
	
	Результат = Новый Структура("Имя,Синоним,Версия");
	ЗаполнитьЗначенияСвойств(Результат, Метаданные);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуЗначенийИзМакета(Макет)

	ОбрабатываемыеСсылочныеТипы = Новый Массив;
	//ОбрабатываемыеСсылочныеТипы.Добавить("Перечисления");
	//ОбрабатываемыеСсылочныеТипы.Добавить("ПланыВидовХарактеристик");
	//ОбрабатываемыеСсылочныеТипы.Добавить("Справочники");
	
	// Получим колонки таблицы форматов
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ТаблицаЗначений = ДобавитьКолонкиВТаблцуЗначенийИзТабличногоДокумента(ОбластьШапки);
	
	// Заполним строки
	ОбластьСтрок = Макет.ПолучитьОбласть("Строки");
	ЗагрузитьТабличныйДокументВТаблицуЗначений(ТаблицаЗначений, ОбластьСтрок, ОбрабатываемыеСсылочныеТипы);
		
	Возврат ТаблицаЗначений;

КонецФункции

Функция ДобавитьКолонкиВТаблцуЗначенийИзТабличногоДокумента(ТабличныйДокумента, ТаблицаЗначений = Неопределено)
	
	Если ТаблицаЗначений = Неопределено Тогда
		ТаблицаЗначений = Новый ТаблицаЗначений;		
	КонецЕсли;
	
	Для Сч = 1 По ТабличныйДокумента.ШиринаТаблицы Цикл
		
		ИмяКолонки = ТабличныйДокумента.Область(1, Сч).Текст;
		Если ЗначениеЗаполнено(ИмяКолонки) Тогда
			
			ПредставлениеТипаКолонки = ТабличныйДокумента.Область(2, Сч).Текст;
			ТипКолонки = Новый ОписаниеТипов(ПредставлениеТипаКолонки);
			
			ТаблицаЗначений.Колонки.Добавить(ИмяКолонки, ТипКолонки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ЗагрузитьТабличныйДокументВТаблицуЗначений(ТаблицаЗначений, ТабличныйДокумент, ОбрабатываемыеСсылочныеТипы)
	
	Для НомерСтроки = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Если ЗначениеЗаполнено(ТабличныйДокумент.Область(НомерСтроки, 1).Текст) Тогда
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			Для НомерКолонки = 1 По ТаблицаЗначений.Колонки.Количество() Цикл
				Колонка = ТаблицаЗначений.Колонки[НомерКолонки - 1];
				
				ТекстЯчейки = СокрЛП(ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст);
				ТипЗначения = Колонка.ТипЗначения.Типы()[0];
				
				ПолноеИмяОбъекта = "";
				ЗначениеЯчейкиОтвет = ЗначениеЯчейки(ТипЗначения, ТекстЯчейки, ОбрабатываемыеСсылочныеТипы, Колонка, ПолноеИмяОбъекта);
				Если НЕ ЗначениеЯчейкиОтвет.Успех Тогда
					ШаблонОшибки = НСтр("ru='В макете %1 использован неподдерживаемый ссылочный тип (%2)'");
					СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, 
					Метаданные.ОбщиеМакеты.ККСНГ_ФорматыЭлектронныхДокументов.Синоним, ПолноеИмяОбъекта);
					ВызватьИсключение СтрокаОшибки;					
				КонецЕсли;
				
				НоваяСтрока[Колонка.Имя] = ЗначениеЯчейкиОтвет.Результат;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;       
	
КонецПроцедуры

Функция ЗначениеЯчейки(ТипЗначения, ТекстЯчейки, ОбрабатываемыеСсылочныеТипы, Колонка, ПолноеИмяОбъекта)

	Ответ = Новый Структура;
	Ответ.Вставить("Успех",     Истина);
	Ответ.Вставить("Результат", Неопределено);
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗначения);
		ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ИмяБазовогоТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(МетаданныеОбъекта);
		Если ОбрабатываемыеСсылочныеТипы.Найти(ИмяБазовогоТипа) <> Неопределено Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
			Ответ.Результат = МенеджерОбъекта[ТекстЯчейки];
		Иначе
			Ответ.Успех = Ложь;
		КонецЕсли;
	Иначе
		Если ТипЗначения = Тип("Дата") И ЗначениеЗаполнено(ТекстЯчейки) Тогда
			Ответ.Результат = ККСНГ_ОбщегоНазначенияКлиентСервер.ДатаИзСтроки(ТекстЯчейки);
		ИначеЕсли ТипЗначения = Тип("Массив") И ЗначениеЗаполнено(ТекстЯчейки) Тогда
			Ответ.Результат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстЯчейки, ",", Истина, Истина);
		Иначе
			Ответ.Результат = Колонка.ТипЗначения.ПривестиЗначение(ТекстЯчейки);
		КонецЕсли;
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

#КонецОбласти
