
#Область ПрограммныйИнтерфейс

// Добавляет связанные документы к отправляемым и вызывает формирование и подписание документов
//
// Параметры:
//	МассивДокументов                - Массив документов, ссылки на документы ИБ
//	ПрофильЭДООрганизации           - СправочникСсылка.ККСНГ_Организации
//	ПараметрыАвторизации            - Структура:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	ОписаниеОповещенияОЗавершении   - Оповещение
//
Процедура ПодписатьИОтправитьЭлектронныеДокументы(МассивДокументов, ПрофильЭДООрганизации, ПараметрыАвторизации, ПодписатьДанные, ОписаниеОповещенияОЗавершении = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Попытка
		
		МассивСсылок = Новый Массив();
		Для каждого ЭлементДокумент Из МассивДокументов Цикл
			МассивСсылок.Добавить(ЭлементДокумент.Ссылка);	
		КонецЦикла;
		
		ОбщийМодульПолучениеДанныхВызовСервера = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПолучениеДанныхВызовСервера");
		
		ЗапросСвязанныхДокументов = ОбщийМодульПолучениеДанныхВызовСервера.ПолучитьДанныеСвязанныхДокументов(МассивСсылок);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСвязанныхДокументов.Журнал, Ложь);
		
		Если ЗапросСвязанныхДокументов.Успех Тогда
			ДанныеСвязанныхДокументов = ЗапросСвязанныхДокументов.Результат;
			ОбработатьДанныеСвязанныхДокументов(ДанныеСвязанныхДокументов, МассивДокументов, ПрофильЭДООрганизации, ПараметрыАвторизации, ОписаниеОповещенияОЗавершении, ПодписатьДанные);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Ответ); 
		КонецЕсли;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		
		Если ТипЗнч(МассивДокументов) = Тип("Массив") И МассивДокументов.Количество() > 0 Тогда
			Для каждого ТекущийДокумент Из МассивДокументов Цикл
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка подписания документа.", "SB-000015", ОписаниеОшибки, ТекущийДокумент.Ссылка);	
			КонецЦикла;
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка подписания документа.", "SB-000015", ОписаниеОшибки);
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Ответ); 
	КонецПопытки;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Перед подписанием печатных форм
//
// Параметры:
//  Параметры	 - 			 - Структура:
//  			* ОписаниеДанных - Структура:
//  			** ВыбранныйСертификат
//  			** НаборДанных           - Массив - данные для подписи
//  ДопПараметры - структура - дополнительные данные
//
Процедура ПередПодписаниемПечатныхФорм(Параметры, ДопПараметры) Экспорт
	
	Перем ПереданныйСертификат;
	Перем ТекДанные, ЗапросДанныхПодписанта;
	Перем ПоследняяОшибка, ТекстСообщения;
	
	ПереданныйСертификат = Параметры.ОписаниеДанных.ВыбранныйСертификат;
	Если ПереданныйСертификат.Свойство("Ссылка") Тогда
		ВыбранныйСертификат = ПереданныйСертификат.Ссылка;
	Иначе
		ВыбранныйСертификат = ПереданныйСертификат;
	КонецЕсли;
	
	Для каждого ТекДанные Из Параметры.ОписаниеДанных.НаборДанных Цикл
		
		ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ДопПараметры.ОрганизацияЭДО, ТекДанные.Получатель, ВыбранныйСертификат);
		Если Не ЗапросДанныхПодписанта.Успех Тогда
			
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
			Если ПоследняяОшибка <> Неопределено Тогда
				ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
			Иначе
				ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
			КонецЕсли;
			Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
			
			Прервать;
			
		КонецЕсли;
		
		ТекДанные.Вставить("ДанныеПодписанта", ЗапросДанныхПодписанта.Результат);
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, Параметры);
	
КонецПроцедуры

// Перед подписанием неструктурированного электронного документа
//
// Параметры:
//  Параметры	 - 			 - Структура:
//  			* ОписаниеДанных - Структура:
//  			** ВыбранныйСертификат
//  			** НаборДанных           - Массив - данные для подписи
//  ДопПараметры - структура - дополнительные данные
//
Процедура ПередПодписаниемНеструктурированногоЭлектронногоДокумента(Параметры, ДопПараметры) Экспорт
	
	Перем ПереданныйСертификат, ВыбранныйСертификат;
	Перем Получатели, Получатель, КонтрагентЭДО;
	Перем ЗапросДанныхПодписанта, ПоследняяОшибка, ТекстСообщения;
	
	// Для сертификата получаем ссылку, для токена Сбербанк структуру
	ПереданныйСертификат = Параметры.ОписаниеДанных.ВыбранныйСертификат;
	Если ПереданныйСертификат.Свойство("Ссылка") Тогда
		ВыбранныйСертификат = ПереданныйСертификат.Ссылка;
	Иначе
		ВыбранныйСертификат = ПереданныйСертификат;
	КонецЕсли;
	
	Получатели = Новый Массив;
	
	Для каждого КонтрагентЭДО Из ДопПараметры.КонтрагентыЭДО Цикл
		
		ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ДопПараметры.ОрганизацияЭДО, КонтрагентЭДО, ВыбранныйСертификат);
		Если ЗапросДанныхПодписанта.Успех Тогда
			
			Получатель = Новый Структура;
			Получатель.Вставить("КонтрагентЭДО", КонтрагентЭДО);
			Получатель.Вставить("ДанныеПодписанта", ЗапросДанныхПодписанта.Результат);
			
			Получатели.Добавить(Получатель);
			
		Иначе
			
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
			Если ПоследняяОшибка <> Неопределено Тогда
				ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
			Иначе
				ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
			КонецЕсли;
			Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Параметры.ОписаниеДанных.Вставить("Получатели", Получатели);
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, Параметры);
	
КонецПроцедуры

// Заполняет подписанта ЭД
//
// Параметры:
//	Параметры                - Структура:
// 								* ОписаниеДанных - Структура:
//                                  ** ВыбранныйСертификат
//                                  ** НаборДанных           - Массив - данные для подписи
//	ДопПараметры             - Произвольный, не используется
//
// Заполняет подписанта ЭД
//
// Параметры:
//	Параметры                - Структура:
// 								* ОписаниеДанных - Структура:
//                                  ** ВыбранныйСертификат
//                                  ** НаборДанных           - Массив - данные для подписи
//	ДопПараметры             - Произвольный, не используется
//
Процедура ПередПодписаниемЭлектронногоДокумента(Параметры, ДопПараметры) Экспорт
	
	Перем ПереданныйСертификат, ДанныеПодписанта;
	Перем ПараметрыЭД, ТекДанные, ЗапросДанныхПодписанта, ЗапросЗаполнения;
	Перем ПоследняяОшибка, ТекстСообщения, ДвоичныеДанные, АдресВХранилище;
	
	ПереданныйСертификат = Параметры.ОписаниеДанных.ВыбранныйСертификат;
	Если ПереданныйСертификат.Свойство("Ссылка") Тогда
		ВыбранныйСертификат = ПереданныйСертификат.Ссылка;
	Иначе
		ВыбранныйСертификат = ПереданныйСертификат;
	КонецЕсли;
	
	ПараметрыЭД = Новый Структура("ДанныеФормата, ДокументСсылка");
	Для каждого ТекДанные Из Параметры.ОписаниеДанных.НаборДанных Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыЭД, ТекДанные);
		
		ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ТекДанные.ПрофильОрганизации, ТекДанные.ПрофильКонтрагента, ВыбранныйСертификат);
		Если Не ЗапросДанныхПодписанта.Успех Тогда
			
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
			Если ПоследняяОшибка <> Неопределено Тогда
				ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
			Иначе
				ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
			КонецЕсли;
			Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
			
			Прервать;
			
		КонецЕсли;
		
		ТекДанные.ДанныеПодписанта = ЗапросДанныхПодписанта.Результат;
		
		Если ККСНГ_ЭлектронныеДокументыВызовСервера.ЭтоСтруктурированныйЭД(ПараметрыЭД.ДанныеФормата.КодТипаДокумента) Тогда
			
			ДвоичныеДанные = ТекДанные[ТекДанные.ИмяПоляДД];
			АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			
			Если ТекДанные.ДанныеФормата.КодТипаДокумента = "UVHD_BILL" Тогда
				ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ДвоичныеДанные, "windows-1251");
				ТекДанные[ТекДанные.ИмяПоляДД] = ДвоичныеДанные;
			Иначе
				ЗапросЗаполнения = ККСНГ_ОтправкаЭДВызовСервера.ЗаполнитьПодписантаНаСервере(АдресВХранилище, ТекДанные.ДанныеПодписанта, ПараметрыЭД);
				Если ЗапросЗаполнения.Успех Тогда
					ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЗапросЗаполнения.Результат);
					ТекДанные[ТекДанные.ИмяПоляДД] = ДвоичныеДанные;
				Иначе
					// TODO вести список ошибок
					ТекстСообщения = СтрШаблон("Ошибка при заполнении подписанта в файле электронного документа (%1): %2", ПараметрыЭД.ДанныеФормата.КодТипаДокумента, ПараметрыЭД.ДокументСсылка);
					ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросЗаполнения.Журнал);
					
					Если ПоследняяОшибка <> Неопределено Тогда
						ТекстСообщения = ТекстСообщения + Символы.ПС + ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
					КонецЕсли;
					
					Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, Параметры);
	
КонецПроцедуры

// Вызывает отправку ЭД в Курьер
//
// Параметры:
//	Параметры                - Структура:
//	 * БезПодтверждения	    Булево
//	 * ЗаголовокДанных	    Строка
//	 * КонтекстОперации	    Неопределено
//	 * НаборДанных	        Массив
//	 * Операция	            Строка
//	 * ОтборСертификатов	Массив
//	 * ПередВыполнением	    ОписаниеОповещения
//	 * ПоказатьКомментарий	Булево
//	 * ПредставлениеНабора	Строка
//	 * СообщитьОЗавершении	Булево
//	 * СписокПредставлений	СписокЗначений
//	 * Успех	            Булево
//	ДополнительныеПараметры             - Структура:
//	 * ОписаниеОповещенияОЗавершении	ОписаниеОповещения
//	 * Ответ	                        Структура
//	 * ПараметрыАвторизации	            Структура
//	 * ПрофильЭДООрганизации	        СправочникСсылка.ККСНГ_Организации
//
Процедура ПослеПодписанияДанныхЭлектронныхДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Перем Ответ;
	Перем МассивУспешноОтправленных, РезультатОбработки;
	Перем ОписаниеОповещенияОЗавершенииНовое, ОписаниеОповещенияОЗавершении;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Истина;
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ДополнительныеПараметры.Ответ.Журнал, Ложь);
	
	МассивУспешноОтправленных = Новый Массив;
	
	Если Результат.Успех Тогда
		
		РезультатОбработки = ОбработатьРезультатПодписанияЭлектронныхДокументов(Результат.НаборДанных, ДополнительныеПараметры);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, РезультатОбработки.Журнал, Ложь);
		
		Если РезультатОбработки.Успех Тогда
			МассивУспешноОтправленных = РезультатОбработки.Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеОповещенияОЗавершении = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОписаниеОповещенияОЗавершении", Неопределено);
	
	Если ОписаниеОповещенияОЗавершении <> Неопределено Тогда
		ОписаниеОповещенияОЗавершенииНовое = Новый ОписаниеОповещения(ОписаниеОповещенияОЗавершении.ИмяПроцедуры, ОписаниеОповещенияОЗавершении.Модуль, МассивУспешноОтправленных);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершенииНовое, Ответ);
	КонецЕсли;
	
КонецПроцедуры

// Удаляет связанные документы из массива отправки в зависимости от ответа
//
// Параметры:
//	РезультатВопроса                - Результат
//	ДопПараметры                    - Структура:
// 										* ДокументСсылка
// 										* ДанныеСвязанныхДокументов
// 										* МассивДокументовОтправить
// 										* ПрофильЭДООрганизации
// 										* ОписаниеОповещенияОЗавершении
// 										* ПараметрыАвторизации
//
Процедура ВопросОтправитьЗавершение(РезультатВопроса, ДопПараметры) Экспорт
		
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		МассивДокументовОтправить = ДопПараметры.МассивДокументовОтправить;
		ТекущийИндекс = МассивДокументовОтправить.ВГраница();
		Пока ТекущийИндекс >= 0 Цикл
		    ЭлементМассива = МассивДокументовОтправить[ТекущийИндекс];
			Если ДопПараметры.ДокументСсылка = ЭлементМассива.Ссылка Тогда
				МассивДокументовОтправить.Удалить(ТекущийИндекс);	
			КонецЕсли;	
		    ТекущийИндекс = (ТекущийИндекс - 1);
		КонецЦикла;	
	КонецЕсли;
	
	ОбработатьДанныеСвязанныхДокументов(ДопПараметры.ДанныеСвязанныхДокументов, ДопПараметры.МассивДокументовОтправить, 
											ДопПараметры.ПрофильЭДООрганизации, ДопПараметры.ПараметрыАвторизации, 
											ДопПараметры.ОписаниеОповещенияОЗавершении, ДопПараметры.ПодписатьДанные);
		
КонецПроцедуры

#Область РаботаСДопРеквизитами

// Получает дополнительные реквизиты из РС ККСНГ_ПМ_ДопРеквизитыЭД
//
// Параметры:
//	НаборДанных - Структура:
//					* ДокументСсылка
//
// Возвращаемое значение:
//	Соответствие
//
Функция ПолучитьДопРеквизитыДокументовДляОтправки(НаборДанных) Экспорт
	
	УникальныйИдентфикатор = Новый УникальныйИдентификатор;
	СоответствиеДопРеквизитов = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДопРеквизитыДокументовДляОтправки(НаборДанных, УникальныйИдентфикатор);
	
	Для каждого ДопРеквизиты из СоответствиеДопРеквизитов Цикл
		ЗаполнитьДвоичныеДанныеДопВложенийФайловНаДиске(ДопРеквизиты.Значение.Вложения, УникальныйИдентфикатор);	
	КонецЦикла;
	
	Возврат СоответствиеДопРеквизитов;
	
КонецФункции

// Проверка наличия файлов вложений
//
// Параметры:
//	МассивДокументов - Структура:
//					* ДокументСсылка
//
// Возвращаемое значение:
//  Структура. см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПроверкаЗаполненияДопРеквизитовДокументов(МассивДокументов) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	СоответствиеДопРеквизитов = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДопРеквизитыДокументов(МассивДокументов);
	
	ОшибкиПоДокументам = Новый Соответствие;	
	
	Для каждого ДопРеквизиты из СоответствиеДопРеквизитов Цикл
		
		// 1. Проверка доп. вложений
		
		Вложения = ДопРеквизиты.Значение.Вложения;
		
		Если ТипЗнч(Вложения) = Тип("Массив") Тогда 
			ЗапросПроверкиДвоичныхДанных = ПроверитьДвоичныеДанныеДопВложений(ДопРеквизиты.Ключ, Вложения);	
			
			Если НЕ ЗапросПроверкиДвоичныхДанных.Успех Тогда
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПроверкиДвоичныхДанных.Журнал, Ложь);
				
				ОшибкиПоДокументам.Вставить(ДопРеквизиты.Ключ, ЗапросПроверкиДвоичныхДанных);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Успех = ОшибкиПоДокументам.Количество() = 0;
	Ответ.Результат = ОшибкиПоДокументам;
	
	Возврат Ответ;
	
КонецФункции

// МАКС размер вложений
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	Структура
//
Функция МаксимальныйРазмерФайлаВложения() Экспорт
	
	МаксимальныйРазмерФайла = Новый Структура();
	МаксимальныйРазмерФайла.Вставить("Размер", 100*1024*1024); // в кб
	МаксимальныйРазмерФайла.Вставить("Представление", "100 мб."); 
		
	Возврат МаксимальныйРазмерФайла;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДвоичныеДанныеДопВложенийФайловНаДиске(Вложения, УникальныйИдентфикатор)

	Если НЕ ТипЗнч(Вложения) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтруктураВложения Из Вложения Цикл 
		
		Если ЗначениеЗаполнено(СтруктураВложения.ПолноеИмя) Тогда
			ДвоичныеДанные = Неопределено;
						
			Попытка
				ДвоичныеДанные = Новый ДвоичныеДанные(СтруктураВложения.ПолноеИмя);
				АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентфикатор);
							
				СтруктураВложения.АдресВХранилище = АдресВХранилище;
			Исключение
				ДвоичныеДанные = Неопределено;
							
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;	
			
КонецПроцедуры

Процедура ПодписатьИОтправитьЭлектронныеДокументыПродолжение(МассивДокументов, ПрофильЭДООрганизации, ПараметрыАвторизации, ПодписатьДанные, ОписаниеОповещенияОЗавершении = Неопределено)
		
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	ДополнительныеПараметры = Новый Структура();
	
	Если Не ОписаниеОповещенияОЗавершении = Неопределено Тогда
		ДополнительныеПараметры.Вставить("БизнесПроцесс", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеОповещенияОЗавершении.ДополнительныеПараметры, "БизнесПроцесс"));
	КонецЕсли;
	
	ЗапросДанных = ККСНГ_ОтправкаЭДВызовСервера.ПодготовитьДанныеЭлектронныхДокументов(МассивДокументов, ПрофильЭДООрганизации, ПараметрыАвторизации, ДополнительныеПараметры);
			
	Если ЗапросДанных.Успех Тогда
		
		МассивНаПодпись = Новый Массив;
		Для каждого ДанныеЭлектронногоДокумента Из ЗапросДанных.Результат Цикл
			Если ДанныеЭлектронногоДокумента.Успех Тогда
				ТекДокумент = ДанныеЭлектронногоДокумента.Результат;
				МассивНаПодпись.Добавить(ТекДокумент);		
			Иначе  //обработать ошибки
				
				ПредставлениеДокумента = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
											ДанныеЭлектронногоДокумента,
											"Результат.Данные.ДокументСсылка",
											"");
				ТекстСообщения = СтрШаблон("Ошибки при формировании документа %1.", ПредставлениеДокумента);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал,ТекстСообщения, "", "");
				ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ДанныеЭлектронногоДокумента.Журнал);
				Если ПоследняяОшибка <> Неопределено Тогда
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал,
													ПоследняяОшибка.Событие,
													ПоследняяОшибка.КодОшибки,
													ПоследняяОшибка.Комментарий,
													ПоследняяОшибка.Данные);
				Иначе
					Продолжить;									
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла;
		
		Если МассивНаПодпись.Количество() > 0 Тогда		
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
			ДопПараметры.Вставить("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
			ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			ДопПараметры.Вставить("Ответ", Ответ);
			ДопПараметры.Вставить("ПодписатьДанные", ПодписатьДанные);
			
			Если ПодписатьДанные Тогда
				
				ОповещениеПослеПодписания = Новый ОписаниеОповещения("ПослеПодписанияДанныхЭлектронныхДокументов", ЭтотОбъект, ДопПараметры);
				ДанныеНаПодпись = Новый Структура("МассивДанных,Представление", МассивНаПодпись, "Подписываемые документы");
				ПередВыполнением = Новый ОписаниеОповещения("ПередПодписаниемЭлектронногоДокумента", ЭтотОбъект);
				
				ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильЭДООрганизации, 
																			"Подписание электронного документа", ОповещениеПослеПодписания, ПередВыполнением);
				
			Иначе
				
				ДанныеДляОтправкиБезПодписи = ДанныеДляОтправкиБезПодписи(МассивНаПодпись);
				ПослеПодписанияДанныхЭлектронныхДокументов(ДанныеДляОтправкиБезПодписи, ДопПараметры);
				
			КонецЕсли;
			
		ИначеЕсли ОписаниеОповещенияОЗавершении <> Неопределено Тогда 
			
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Ответ);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьДанныеСвязанныхДокументов(ДанныеСвязанныхДокументов, МассивДокументовОтправить, ПрофильЭДООрганизации, ПараметрыАвторизации, ОписаниеОповещенияОЗавершении, ПодписатьДанные)
	
	Если ДанныеСвязанныхДокументов.Количество()>0 Тогда		
		
		ДанныеСвязи = ДанныеСвязанныхДокументов[0];
		ДанныеСвязанныхДокументов.Удалить(0);
		
		ТекстВопроса = "";
		
		Если ДанныеСвязи.ЕстьСвязь Тогда
			
			Если Не ДанныеСвязи.ДокументСвязиСоздан Тогда
				
				ТекстВопроса = "Для документа %1 есть связанный документ, который не был отправлен. Подтвердить отправку?";				
				
				//  INTPRO-405, версия 431 Попов Д.В., смотри последний комментарий
				//ИначеЕсли Не ДанныеСвязи.ДокументооборотЗавершен Тогда 				
				//	ТекстВопроса = "Для документа %1 есть связанный документ, по которому не завершен документооборот. Подтвердить отправку?";
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если Не ПустаяСтрока(ТекстВопроса) Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ДокументСсылка", ДанныеСвязи.Ссылка);
			ДопПараметры.Вставить("ДанныеСвязанныхДокументов", ДанныеСвязанныхДокументов);
			ДопПараметры.Вставить("МассивДокументовОтправить", МассивДокументовОтправить);
			ДопПараметры.Вставить("ПрофильЭДООрганизации", ПрофильЭДООрганизации);
			ДопПараметры.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
			ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			ДопПараметры.Вставить("ПодписатьДанные", ПодписатьДанные);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОтправитьЗавершение", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(ОписаниеОповещения, СтрШаблон(ТекстВопроса, ДанныеСвязи.Ссылка), РежимДиалогаВопрос.ДаНет, 60);				
		Иначе			
			ОбработатьДанныеСвязанныхДокументов(ДанныеСвязанныхДокументов, МассивДокументовОтправить, 
									ПрофильЭДООрганизации, ПараметрыАвторизации, ОписаниеОповещенияОЗавершении, ПодписатьДанные);			
		КонецЕсли;
		
	Иначе
		
		ПодписатьИОтправитьЭлектронныеДокументыПродолжение(МассивДокументовОтправить, ПрофильЭДООрганизации, ПараметрыАвторизации, ПодписатьДанные, ОписаниеОповещенияОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ПроверитьДвоичныеДанныеДопВложений(ДокументСсылка, Вложения)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	МассивПроблемных = Новый Массив;
	МаксимальныйРазмерФайла = МаксимальныйРазмерФайлаВложения();
	
	Для каждого СтруктураВложения Из Вложения Цикл 
		
		ОписаниеОшибки = "";
		РазмерФайла = Неопределено;
		
		Если ЗначениеЗаполнено(СтруктураВложения.ПолноеИмя) Тогда // Это файл из каталога
			
			Файл = Новый Файл(СтруктураВложения.ПолноеИмя);				
					
			Если НЕ Файл.Существует() Тогда
				ОписаниеОшибки = "Не удалось найти файл по указанному пути: " + СтруктураВложения.ПолноеИмя;
			Иначе
				//РазмерФайла = Окр(Файл.Размер()/1024); // в кб
				РазмерФайла = Файл.Размер()
			КонецЕсли;
				
		ИначеЕсли ЗначениеЗаполнено(СтруктураВложения.Ссылка) Тогда // Это присоединенный файл документа
			
			Если НЕ ЭтоАдресВременногоХранилища(СтруктураВложения.АдресВХранилище) Тогда
			    ОписаниеОшибки = "Ошибка получения данных присоединенного файла """ + СтруктураВложения.ИмяФайла + """ документа.";
			Иначе
				РазмерФайла = СтруктураВложения.Размер;	
			КонецЕсли;
						
		Иначе
			ОписаниеОшибки = "Ошибка формата вложения """ + СтруктураВложения.ИмяФайла + """";
			
		КонецЕсли;
		
		Если РазмерФайла <> Неопределено Тогда
			Если РазмерФайла > МаксимальныйРазмерФайла.Размер Тогда
	        	ОписаниеОшибки = "Размер файла вложения """ + СтруктураВложения.ИмяФайла 
									+ """ превышает максимальный допустимый размер - " + МаксимальныйРазмерФайла.Представление;
			ИначеЕсли РазмерФайла = 0 Тогда
				ОписаниеОшибки = "Файл вложения """ + СтруктураВложения.ИмяФайла + """ пустой, укажите другой файл, либо удалите его.";	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда           
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка проверки доп. вложения документа " + ДокументСсылка + ".", "CH-000001", ОписаниеОшибки);
			
			СтруктураВложения.ОписаниеОшибки = ОписаниеОшибки;
			МассивПроблемных.Добавить(СтруктураВложения);	
		КонецЕсли;
		
	КонецЦикла;	
		
	Ответ.Успех = МассивПроблемных.Количество() = 0;
	Ответ.Результат = МассивПроблемных;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбработатьРезультатПодписанияЭлектронныхДокументов(РезультатыПодписания, ДополнительныеПараметры)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Истина;
	
	МассивУспешноОтправленных = Новый Массив;
	
	ДопРеквизиты = ПолучитьДопРеквизитыДокументовДляОтправки(РезультатыПодписания);
	
	Для Каждого РезультатПодписания Из РезультатыПодписания Цикл
		
		ОтправкаДокумента = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьДокументВКурьер(РезультатПодписания,
																				ДополнительныеПараметры.ПрофильЭДООрганизации, 
																				ДополнительныеПараметры.ПараметрыАвторизации, 
																				ДополнительныеПараметры.ПодписатьДанные,
																				ДопРеквизиты.Получить(РезультатПодписания.ДокументСсылка));
		
		Если ОтправкаДокумента.Успех Тогда
			
			Если ОтправкаДокумента.Результат <> Неопределено Тогда
				НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ОтправкаДокумента.Результат);
				ПоказатьОповещениеПользователя("Создание:", НавигационнаяСсылка, ОтправкаДокумента.Результат);
				ОповеститьОбИзменении(ОтправкаДокумента.Результат);
				ОповеститьОбИзменении(РезультатПодписания.ДокументСсылка);	
				
				МассивУспешноОтправленных.Добавить(РезультатПодписания.ДокументСсылка);
				
			КонецЕсли;
			
		Иначе
			
			ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ДополнительныеПараметры.ПрофильЭДООрганизации, ДополнительныеПараметры.ПараметрыАвторизации);
			ТекстСообщения = СтрШаблон("Документ не отправлен %1.", РезультатПодписания.ДокументСсылка);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "", "");
			
			ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ОтправкаДокумента.Журнал);
			Если ПоследняяОшибка <> Неопределено Тогда
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ПоследняяОшибка.Событие, ПоследняяОшибка.КодОшибки, ПоследняяОшибка.Комментарий, РезультатПодписания.ДокументСсылка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Результат = МассивУспешноОтправленных;
	
	Возврат Ответ;
	
КонецФункции

Функция ДанныеДляОтправкиБезПодписи(МассивНаПодпись)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Вставить("НаборДанных");
	
	Результат = Новый Массив;
	
	Для каждого ДанныеДокумента Из МассивНаПодпись Цикл
		
		ДанныеДокумента.Данные.Вставить("ИмяПоляДД", ДанныеДокумента.ИмяПоляДД);
		ДанныеДокумента.Данные.Вставить("Представление", ДанныеДокумента.Представление);
		
		ДанныеXML = ДанныеДокумента.Данные.Данные;
		
		Если ТипЗнч(ДанныеXML) = Тип("ДвоичныеДанные") Тогда
			Результат.Добавить(ДанныеДокумента.Данные);	
		ИначеЕсли ТипЗнч(ДанныеXML) = Тип("Строка") Тогда
			ДанныеДокумента.Данные.Данные = ПолучитьДвоичныеДанныеИзСтроки(ДанныеXML, "windows-1251");
			Результат.Добавить(ДанныеДокумента.Данные);
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось определить, как обработать входные данные XML.", "XM-00002");
			Возврат Ответ;
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Успех = Истина;
	Ответ.НаборДанных = Результат;
	
	Возврат Ответ;

КонецФункции

#КонецОбласти
