
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	
	ЭтотОбъект.ТекстЗапросаПоУмолчанию = Список.ТекстЗапроса;

	ДоступнаРаботаСЧерновиками = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяОтправкаЧерновиков();
	Элементы.СписокДобавитьВЧерновики.Видимость = ДоступнаРаботаСЧерновиками;
	
	ПарамСписокНеструктурированныхТипов = Неопределено;
	Параметры.Свойство("СписокНеструктурированныхТипов", ПарамСписокНеструктурированныхТипов);
	
	Если ПарамСписокНеструктурированныхТипов <> Неопределено Тогда
		Для каждого ТекТип Из ПарамСписокНеструктурированныхТипов Цикл
			СписокНеструктурированныхТипов.Добавить(ТекТип.Значение, ТекТип.Представление);
		КонецЦикла;
	КонецЕсли;
	
	ОбщийМодульНеструктурированныеДокументы = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_НеструктурированныеДокументы");
	ОбщийМодульНеструктурированныеДокументы.НастроитьДоступныеТипыОбъектовДляОтправки(ЭтаФорма);
	
	ЭтаФорма.Заголовок = СтрШаблон("Отправка печатных форм документов (%1)", ПрофильНастройкиЭДО);
	ПериодДокументов.Вариант = ВариантСтандартногоПериода.Месяц;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ККСНГ_ДокументооборотКлиент.ПроверитьНаличиеКонтрагентовЭДО(ПрофильНастройкиЭДО, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ККСНГ_НастройкиОтправкиПечатнойФормы" Тогда
		
		НастройкиСохранения = НастройкиСохранения();
		ЗаполнитьЗначенияСвойств(НастройкиСохранения, ВыбранноеЗначение);
		НастройкиСохранения.ФорматыСохранения = ВыбранноеЗначение.ФорматыОтправки;
			
		СформироватьПечатныеФормы();
	
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, МассивДанныхКОтправке, Источник)
	
	Если ИмяСобытия = "ЗавершеноФормированиеНеструктурированного" Тогда
		
		Если ТипЗнч(Источник) = Тип("УправляемаяФорма") Тогда
			Источник.Закрыть();
		КонецЕсли;
		
		Если МассивДанныхКОтправке.Количество() > 0 Тогда
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("МассивДанныхКОтправке", МассивДанныхКОтправке);
					
			НачатьПодписание = Новый ОписаниеОповещения("НачатьПодписание", ЭтотОбъект, ДопПараметры);
			ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, НачатьПодписание);
			
		Иначе 
			СообщитьОНедоступностиПечатнойФормыДляДокументов();
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	ПечатнаяФорма = Неопределено;
	Элементы.ПечатнаяФорма.СписокВыбора.Очистить();
	
	// Получаем структуру данных по выбранному типу
	ТекСтруктураДанныхОбъекта = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОбъектов, ТипДокумента);
		
	Если ТекСтруктураДанныхОбъекта <> Неопределено Тогда
		
		Попытка
			ФормаСписка = ПолучитьФорму(ТекСтруктураДанныхОбъекта.ИмяФормы);
			АдресТаблицыКоманд = ФормаСписка.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;
		Исключение
			АдресТаблицыКоманд = Неопределено;
		КонецПопытки;
		
		Если НЕ ЭтоАдресВременногоХранилища(АдресТаблицыКоманд) Тогда
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка определения печатных форм объекта, обратитесь к администратору.");
			Возврат;
		КонецЕсли;
		
		НастроитьФормуОтправкиПоТипуОбъекта(АдресТаблицыКоманд);
		
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"ЭтоНовый", Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
		УстановитьПометкуДействующегоФильтраПоДокументам(Элементы.СписокКомандаПоказатьНовые);
		
		ФормаСписка = Неопределено;
		
	Иначе
		ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ЭтоНовый");
		УстановитьТекстЗапросаСпискаНаСервере();
	КонецЕсли;
		
	УстановитьПериодСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДокументовПриИзменении(Элемент)
	
	УстановитьПериодСпискаДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьИОтправить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПечатнаяФорма) Тогда
		Возврат;
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	СписокОбъектов.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
	
	ИмяКоманды = "СформироватьИОтправить";
	
	Если СписокОбъектов.Количество() Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СписокНеструктурированныхТипов", СписокНеструктурированныхТипов);
		ПараметрыФормы.Вставить("ИмяОбъектаМетаданных", ТекСтруктураДанныхОбъекта.ПолноеИмя);
		
		ОткрытьФорму("ОбщаяФорма.ККСНГ_НастройкиОтправкиПечатнойФормы", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПечатнаяФорма) Тогда
		Возврат;
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	СписокОбъектов.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
	
	ИмяКоманды = "Отправить";
	
	Если СписокОбъектов.Количество() Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СписокНеструктурированныхТипов", СписокНеструктурированныхТипов);
		ПараметрыФормы.Вставить("ИмяОбъектаМетаданных", ТекСтруктураДанныхОбъекта.ПолноеИмя);
		
		ОткрытьФорму("ОбщаяФорма.ККСНГ_НастройкиОтправкиПечатнойФормы", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВЧерновики(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПечатнаяФорма) Тогда
		Возврат;
	КонецЕсли;
	
	СписокОбъектов.Очистить();
	СписокОбъектов.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
	
	ИмяКоманды = "ОтправитьВЧерновики";
	
	Если СписокОбъектов.Количество() Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СписокНеструктурированныхТипов", СписокНеструктурированныхТипов);
		ПараметрыФормы.Вставить("ИмяОбъектаМетаданных", ТекСтруктураДанныхОбъекта.ПолноеИмя);
		
		ОткрытьФорму("ОбщаяФорма.ККСНГ_НастройкиОтправкиПечатнойФормы", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтрПоДокументам(Команда)
	
	Перем ЭтоНовый; 
	
	ЭтоНовый = "ЭтоНовый";
	
	Если Список.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы.Количество() > 0 Тогда
		
		Если Команда.Имя = "ФильтрВсеДокументы" Тогда
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ЭтоНовый, Истина, ВидСравненияКомпоновкиДанных.Равно, , Ложь);
			УстановитьПометкуДействующегоФильтраПоДокументам(Элементы.СписокПоказатьВсеДокументы);
			
		ИначеЕсли Команда.Имя = "ФильтрРанееОтправленные" Тогда 
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ЭтоНовый, Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
			УстановитьПометкуДействующегоФильтраПоДокументам(Элементы.СписокКомандаПоказатьРанееОтправленные);
			
		Иначе
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ЭтоНовый, Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
			УстановитьПометкуДействующегоФильтраПоДокументам(Элементы.СписокКомандаПоказатьНовые);
			
		КонецЕсли;
		
	Иначе
		УстановитьПометкуДействующегоФильтраПоДокументам(Элементы.СписокКомандаПоказатьНовые);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометкуДействующегоФильтраПоДокументам(АктивныйЭлемент)
	
	Для каждого ТекЭлемент Из Элементы.СписокГруппаФильтрДокументов.ПодчиненныеЭлементы Цикл
		Если АктивныйЭлемент = ТекЭлемент Тогда
			ТекЭлемент.Пометка = Истина;
		Иначе
			ТекЭлемент.Пометка = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗапросаСпискаНаСервере()
	
	Список.ОсновнаяТаблица = "";
	Список.ТекстЗапроса = ЭтотОбъект.ТекстЗапросаПоУмолчанию;
	
КонецПроцедуры

&НаСервере 
Процедура НастроитьФормуОтправкиПоТипуОбъекта(АдресТаблицыКоманд)
	
	ОбщийМодульНеструктурированныеДокументы = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_НеструктурированныеДокументы");
	ОбщийМодульНеструктурированныеДокументы.НастроитьФормуОтправкиПоТипуОбъекта(ЭтаФорма, ТекСтруктураДанныхОбъекта, АдресТаблицыКоманд);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьОписаниеКоманды()
		
	СписокКомандыПечати = ПолучитьИзВременногоХранилища(ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд);
	
	КомандаПечати = СписокКомандыПечати.Найти(ПечатнаяФорма, "ИмяВФорме");	
	
	Если КомандаПечати = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеКоманды = ККСНГ_ОбщегоНазначенияВызовСервера.СтрокаТаблицыЗначенийВСтруктуру(КомандаПечати);
	
	ОписаниеКоманды.Вставить("Имя", ОписаниеКоманды.ИмяВФорме);
	
	Возврат ОписаниеКоманды;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиСохранения()
	
	НастройкиСохранения = Новый Структура;
	НастройкиСохранения.Вставить("ФорматыСохранения", Новый Массив);
	НастройкиСохранения.Вставить("УпаковатьВАрхив", Ложь);
	НастройкиСохранения.Вставить("ПереводитьИменаФайловВТранслит", Ложь);
	НастройкиСохранения.Вставить("ПодписьИПечать", Ложь);
	НастройкиСохранения.Вставить("ТипДокумента");
		
	Возврат НастройкиСохранения;
	
КонецФункции

&НаКлиенте
Процедура СформироватьПечатныеФормы()
	
	//ОписаниеКоманды = ПолучитьОписаниеКоманды();
	ОписаниеКоманды = Новый Структура("Имя", ПечатнаяФорма);
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, ОписаниеКоманды, Элементы.Список);
	
КонецПроцедуры

#Область ОтправкаИПодпись

&НаКлиенте
Процедура НачатьПодписание(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
		
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		
		МассивДанныхКОтправке = ДопПараметры.МассивДанныхКОтправке;
		
		ДополнитьДаннымиДинамическогоСписка(МассивДанныхКОтправке);
		
		Если МассивДанныхКОтправке.Количество() = 1 Тогда
			ПодтвердитьОтправкуДокументовЗавершение(Истина, ДопПараметры);
		Иначе
					
			НовыйОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодтвердитьОтправкуДокументовЗавершение", ЭтотОбъект, ДопПараметры);
			
			ОткрытьФорму("Обработка.ККСНГ_СфераКурьер.Форма.ФормаПодтвержденияОтправки",

							Новый Структура("МассивДокументов", МассивДанныхКОтправке), ЭтотОбъект,,,,

								НовыйОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		КонецЕсли;
		
				
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);	
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
Процедура ПодтвердитьОтправкуДокументовЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		МассивДанныхКОтправке = ДопПараметры.МассивДанныхКОтправке;
		ПараметрыАвторизации = ДопПараметры.ПараметрыАвторизации;
		
		МассивДанныеНаПодпись = Новый Массив;
		
		Для каждого СтруктураДокумента Из МассивДанныхКОтправке Цикл
			
			Если Не ЗначениеЗаполнено(СтруктураДокумента.Ссылка) Или ТипЗнч(СтруктураДокумента.Ссылка) = Тип("Строка") Тогда
				Продолжить;
			КонецЕсли;
			
			ОтветДанныеОтправки = ДанныеДляОтправки(СтруктураДокумента, ИмяКоманды);
			
			Если НЕ ОтветДанныеОтправки.Успех Тогда
				ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтветДанныеОтправки.Журнал);
				Продолжить;
			КонецЕсли;
			
			ДанныеКарточки = ОтветДанныеОтправки.Результат;
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
			ДопПараметры.Вставить("ОрганизацияЭДО", ПрофильНастройкиЭДО);
			
			ДанныеНаПодпись = Новый Структура("Данные,ИмяПоляДД,Представление", ДанныеКарточки, "Content", ДанныеКарточки.Filename);
			МассивДанныеНаПодпись.Добавить(ДанныеНаПодпись);
			СписокОбъектов.Удалить(СписокОбъектов.НайтиПоЗначению(СтруктураДокумента.ИсходныйДокумент));
			
		КонецЦикла;
		
		СообщитьОНедоступностиПечатнойФормыДляДокументов();
		
		Если СтрСравнить(ИмяКоманды, "СформироватьИОтправить") = 0 Тогда
			
			Если МассивДанныеНаПодпись.Количество() Тогда
				
				СтруктураНаПодпись = Новый Структура;
				СтруктураНаПодпись.Вставить("МассивДанных", МассивДанныеНаПодпись);
				СтруктураНаПодпись.Вставить("Представление", "Подписываемые документы");
				
				ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемПечатныхФорм", ККСНГ_ОтправкаЭДКлиент, ДопПараметры);
				ПослеПодписания = Новый ОписаниеОповещения("ПодписатьДвоичныеДанныеЗавершение", ЭтотОбъект, ДопПараметры);
				
				ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(СтруктураНаПодпись, ПараметрыАвторизации, ПрофильНастройкиЭДО, "Подписание электронного документа", ПослеПодписания, ПередПодписанием);
				
			КонецЕсли;
			
		Иначе
			
			СтруктураДанных = Новый Структура;
			НаборДанных = Новый Массив;
			
			Для Каждого ТекЭлемент Из МассивДанныеНаПодпись Цикл
				
				ТекДанные = ТекЭлемент.Данные;
				ТекПредставление = ТекЭлемент.Представление;
				ЭлементНабора = Новый Структура("Данные, Представление", ТекЭлемент.Данные.Content, ТекПредставление);
				
				Для Каждого ТекПоле Из ТекДанные Цикл
					ЭлементНабора.Вставить(ТекПоле.Ключ, ТекПоле.Значение);
				КонецЦикла;
				
				ЭлементНабора.Вставить("ИмяПоляДД", ТекЭлемент.ИмяПоляДД);
				НаборДанных.Добавить(ЭлементНабора);
				
			КонецЦикла;
			
			СтруктураДанных.Вставить("НаборДанных", НаборДанных);
			СтруктураДанных.Вставить("Успех", Истина);
			
			ПодписатьДвоичныеДанныеЗавершение(СтруктураДанных, ДопПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОНедоступностиПечатнойФормыДляДокументов()
	
	Для каждого ВыбранныйОбъект Из СписокОбъектов Цикл
		ПечатнаяФормаПредставление = Элементы.ПечатнаяФорма.СписокВыбора.НайтиПоЗначению(ПечатнаяФорма).Представление;
		ТекстСообщения = СтрШаблон("Печатная форма ""%1"" недоступна для документа ""%2""", ПечатнаяФормаПредставление, ВыбранныйОбъект.Значение);
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеДляОтправки(СтруктураДокумента, ИмяКоманды)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Сформировать данные карточки произвольного документа");
			
	ДанныеДляОтправки = Новый Структура;
	ДанныеДляОтправки.Вставить("Дата", СтруктураДокумента.Дата);
	ДанныеДляОтправки.Вставить("Номер", СтруктураДокумента.Номер);
	ДанныеДляОтправки.Вставить("Получатель", СтруктураДокумента.Получатель);
	ДанныеДляОтправки.Вставить("КодТипаДокумента", НастройкиСохранения.ТипДокумента);
	ДанныеДляОтправки.Вставить("Filename", СтруктураДокумента.Представление);
	
	// TODO 
	//Если ЗначениеЗаполнено(ДатаДоговора) Тогда
	//	ДанныеКарточки.Вставить("ДоговорДата", ДатаДоговора);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(НомерДоговора) Тогда
	//	ДанныеКарточки.Вставить("ДоговорНомер", НомерДоговора);
	//КонецЕсли;	
	
	ДанныеДляОтправки.Вставить("MimeType", "application/xml");
		
	//Если ДанныеДокумента.ДвоичныеДанные.Размер() = 0 Тогда
	//	ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, 
	//						"Документ пуст. Ошибка формирования печатной формы документа.", "DT-00021");
	//    Возврат Ответ;
	//КонецЕсли;
	
	ДанныеДляОтправки.Вставить("Content", СтруктураДокумента.ДвоичныеДанные);
	ДанныеДляОтправки.Вставить("ЗапроситьПодписание", ЗапроситьПодписание);
	ДанныеДляОтправки.Вставить("Комментарий", Комментарий);
	ДанныеДляОтправки.Вставить("ВариантОтправки", ИмяКоманды);
	
	ДобавитьВЧерновики = СтрСравнить(ИмяКоманды, "ОтправитьВЧерновики") = 0;
	
	ДанныеДляОтправки.Вставить("Черновик", ДобавитьВЧерновики);
	ДанныеДляОтправки.Вставить("Ссылка", СтруктураДокумента.Ссылка);
	
	ИсходныйОбъект = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДокумента, "ИсходныйОбъект");
	Если ИсходныйОбъект <> Неопределено Тогда
		ДанныеДляОтправки.Вставить("Ссылка", ИсходныйОбъект);
	КонецЕсли;
		
	Ответ.Успех = Истина;
	Ответ.Результат = ДанныеДляОтправки;
		
	Возврат Ответ;
	
КонецФункции	

&НаСервере
Функция ПолучитьНомерНаПечать(НомерДокумента)

	Возврат ККСНГ_ЭлектронныеДокументы.ПолучитьНомерНаПечать(НомерДокумента);
	
КонецФункции

&НаСервере
Функция ПолучитьНомерНаПечатьПоСсылке(ДокументСсылка)

	Возврат ККСНГ_ЭлектронныеДокументы.ПолучитьНомерНаПечатьПоСсылке(ДокументСсылка);
	
КонецФункции

&НаКлиенте
Процедура ПодписатьДвоичныеДанныеЗавершение(Результат, ДопПараметры) Экспорт
			
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Результат.Успех;
	ПараметрыАвторизации = ДопПараметры.ПараметрыАвторизации;
			
	МассивРезультатов = Результат.НаборДанных;
	
	Для Каждого ДанныеРезультата Из МассивРезультатов Цикл
		
		СпособОтправки = СпособОтправки("ПечатнаяФорма");
		Если ДанныеРезультата.Черновик Тогда
			
			ТекстПредупреждения = "Документ " + ДанныеРезультата.Filename + " сохранен в черновики.";
			ОтветОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьНеструктурированныйДокументВКурьер(ДанныеРезультата, ПрофильНастройкиЭДО, ПараметрыАвторизации, , Ложь, СпособОтправки);
			
		Иначе
			
			Если ДанныеРезультата.Свойство("СвойстваПодписи") Тогда
				СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(ДанныеРезультата);
				Подпись = СвойстваПодписи.Подпись;
			КонецЕсли;
			
			ТекстПредупреждения = "Документ " + ДанныеРезультата.Filename + " отправлен.";
			
			Если СтрСравнить(ДанныеРезультата.ВариантОтправки, "Отправить") = 0 Тогда
				ОтветОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьДокументНаКурьерСОбработкойЧерновика(ДанныеРезультата, ПрофильНастройкиЭДО, ПараметрыАвторизации, СпособОтправки);
			Иначе
				ОтветОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьНеструктурированныйДокументВКурьер(ДанныеРезультата, ПрофильНастройкиЭДО, ПараметрыАвторизации, Подпись, Истина, СпособОтправки);
			КонецЕсли;
			
		КонецЕсли;
		
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветОтправки.Журнал);
		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ОтветОтправки.Журнал);
		
		Если ОтветОтправки.Успех Тогда
			
			ОшибкаПодписания = ТипЗнч(ПоследняяОшибка) = Тип("Структура") И ПоследняяОшибка.КодОшибки = "ER-12001";
			Если ОшибкаПодписания Тогда
				ТекстПредупреждения = ТекстПредупреждения + " Подписание не требуется.";
			КонецЕсли;
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
			
		Иначе
			
			Если ТипЗнч(ПоследняяОшибка) = Тип("Структура") И СтрСравнить(ПоследняяОшибка.КодОшибки, "ER-12107") <> 0 Тогда
				Если СтрСравнить(ДанныеРезультата.ВариантОтправки, "Отправить") = 0 Тогда
					ПоследняяОшибка.Комментарий = "Документ " + ДанныеРезультата.Filename + " сохранен в черновики.";
				Иначе
					ПоследняяОшибка.Комментарий = "Документ " + ДанныеРезультата.Filename + " не удалось подписать.";
				КонецЕсли;
			КонецЕсли;
			
			ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации); 
			
		КонецЕсли;
		
		Ответ.Успех = Ответ.Успех И ОтветОтправки.Успех;
		
	КонецЦикла;
	
	Элементы.Список.ВыделенныеСтроки.Очистить();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДаннымиДинамическогоСписка(МассивДанныхКОтправке)

	СтруктураДополнения = Новый Структура("Дата, Номер, Получатель, Ссылка, Контрагент, ИсходныйДокумент");
	
	Для каждого ДанныеКОтправке Из МассивДанныхКОтправке Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
		Если Не ДанныеСтроки = Неопределено Тогда
			СтруктураДополнения.Дата = ДанныеСтроки.Дата;
			
			Если ЗначениеЗаполнено(ДанныеКОтправке.ОбъектПечати) И ТипЗнч(ДанныеКОтправке.ОбъектПечати) <> Тип("Строка") Тогда
				СтруктураДополнения.Номер = ПолучитьНомерНаПечатьПоСсылке(ДанныеКОтправке.ОбъектПечати);
			Иначе
				СтруктураДополнения.Номер = ДанныеСтроки.Номер;
			КонецЕсли;
			
			СтруктураДополнения.Получатель = ДанныеСтроки.ПрофильКонтрагента;
			СтруктураДополнения.Контрагент = ДанныеСтроки.Контрагент;
			СтруктураДополнения.Ссылка = ДанныеКОтправке.ОбъектПечати;
			СтруктураДополнения.ИсходныйДокумент = ДанныеСтроки.Ссылка;
			
		КонецЕсли;
		
		ККСНГ_ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеКОтправке, СтруктураДополнения); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодСпискаДокументов()

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, 
									"НачалоПериода", ПериодДокументов.ДатаНачала);
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, 
									"КонецПериода", ПериодДокументов.ДатаОкончания);
															
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемыПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	//ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция СпособОтправки(Имя)
	МодульМенедежераСпособыОтправки = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("Перечисления.ККСНГ_ПМ_СпособыОтправки");
	Возврат МодульМенедежераСпособыОтправки[Имя];
КонецФункции

#КонецОбласти 