
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекСведенияОПрослеживаемости = Неопределено;
	Параметры.Свойство("ТекСведенияОПрослеживаемости", ТекСведенияОПрослеживаемости);
	Параметры.Свойство("СтранаПроисхождения", СтранаПроисхождения);
	Параметры.Свойство("ЭтоУКД", ЭтоУКД);
	
	Если ТипЗнч(ТекСведенияОПрослеживаемости) <> Тип("Массив") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСведение Из ТекСведенияОПрослеживаемости Цикл
		НовСтрока = СведенияОПрослеживаемости.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСведение);
		Если ЭтоУКД И ТипЗнч(ТекСведение.ИзмКолЕдПТ) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСведение.ИзмКолЕдПТ);
		КонецЕсли;
	КонецЦикла;
	
	ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");	
	ОбщийМодульПринятиеКУчету.НастроитьФормуСопоставленияРНПТ(ЭтотОбъект);
	
	Для Каждого ТекСтрока Из СведенияОПрослеживаемости Цикл
		Если ПустаяСтрока(ТекСтрока.НаимЕдИзмПрослеж) И Не ПустаяСтрока(ТекСтрока.ЕдИзмПрослеж) Тогда
			КодПоОКЕИ = СокрЛП(ТекСтрока.ЕдИзмПрослеж);
			ТекСтрока.НаимЕдИзмПрослеж = Строка(ОбщийМодульПринятиеКУчету.НайтиЕдиницуИзмерения(Неопределено, КодПоОКЕИ));
		КонецЕсли;
	КонецЦикла;
	
	НастроитьВидимость();
		
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияОПрослеживаемости

&НаКлиенте
Процедура СведенияОПрослеживаемостиСсылкаРНПТПриИзменении(Элемент)
	
	ОбщийМодульПринятиеКУчетуКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуКлиент");	
	ОбщийМодульПринятиеКУчетуКлиент.СведенияОПрослеживаемостиСсылкаРНПТПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

// ОбработчикиСобытийЭлементовТаблицыФормыСведенияОПрослеживаемости
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ЭтоУКД Тогда
		ВыгружаемыеПоляСтрокой = "НомТовПрослеж, ЕдИзмПрослеж, НаимЕдИзмПрослеж, СсылкаРНПТ, ИзмКолЕдПТ";
	Иначе
		ВыгружаемыеПоляСтрокой = "НомТовПрослеж, ЕдИзмПрослеж, НаимЕдИзмПрослеж, СсылкаРНПТ, КолВЕдПрослеж";
	КонецЕсли;
	ВыгружаемыеПоля = СтрРазделить(ВыгружаемыеПоляСтрокой, ",", Ложь);
	ТекСведенияОПрослеживаемости = Новый Массив;
	Для Каждого ТекСтрока Из СведенияОПрослеживаемости Цикл
		ТекСведение = Новый Структура;
		Для Каждого ТекПоле Из ВыгружаемыеПоля Цикл
			ТекПоле = СокрЛП(ТекПоле);
			Если ТекПоле = "ИзмКолЕдПТ" Тогда
				ТекЗначение = Новый Структура("КолТовЕдПТДо, КолТовЕдПТПосле, КолТовЕдПТУвел, КолТовЕдПТУм");
				ЗаполнитьЗначенияСвойств(ТекЗначение, ТекСтрока);
			Иначе
				ТекЗначение = ТекСтрока[ТекПоле];
			КонецЕсли;
			ТекСведение.Вставить(ТекПоле, ТекЗначение);
		КонецЦикла;
		ТекСведенияОПрослеживаемости.Добавить(ТекСведение);
	КонецЦикла;
	
	Закрыть(ТекСведенияОПрослеживаемости);

КонецПроцедуры

// ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимость()
	
	Элементы.СведенияОПрослеживаемостиКолВЕдПрослеж.Видимость = Не ЭтоУКД;
	Элементы.СведенияОПрослеживаемостиГруппаКоличествоУКД.Видимость = ЭтоУКД;
	Элементы.СведенияОПрослеживаемостиГруппаИзменениеУКД.Видимость = ЭтоУКД;
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции
#КонецОбласти