
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодОшибки = Неопределено;
	Параметры.Свойство("КодОшибки", КодОшибки);
	
	ОбрабатываемыеОшибки = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ОшибкиСертификатаКлючаЭП();
			
	Элементы.ДекорацияНетАктивногоСертификата.Видимость = КодОшибки = ОбрабатываемыеОшибки["НетАктивногоСертификата"];
	Элементы.ДекорацияСертификатПросрочен.Видимость = КодОшибки = ОбрабатываемыеОшибки["АктивныйСертификатПросрочен"];
	Элементы.ДекорацияСертификатПокаНеДействует.Видимость = КодОшибки = ОбрабатываемыеОшибки["АктивныйСертификатПокаНеДействует"];

	Элементы.ГруппаОшибкиАктивногоСертификата.Видимость = Элементы.ДекорацияНетАктивногоСертификата.Видимость
															ИЛИ Элементы.ДекорацияСертификатПросрочен.Видимость
															ИЛИ Элементы.ДекорацияСертификатПокаНеДействует.Видимость;
	
	Элементы.ГруппаНеНайденСертификатЭП.Видимость = КодОшибки = ОбрабатываемыеОшибки["НеНайденСертификатЭП"];
	
	Если Элементы.ГруппаНеНайденСертификатЭП.Видимость Тогда
		
		ДанныеАктивногоСертификата = Параметры.ДанныеАктивногоСертификата;
		ОбразСертификата = ДанныеАктивногоСертификата.Image;
		ЗаполнитьОписаниеДанныхСертификата();
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияПереходКЗагрузкеСертификатаЭП(Элемент)
	
	Если Элементы.ГруппаОшибкиАктивногоСертификата.Видимость Тогда
		
		Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим() Тогда
			ВнешняяСсылка = "https://lkk-preprod.esphere.ru/#/req";
		Иначе
			ВнешняяСсылка = "https://lkk.esphere.ru/#/req";
		КонецЕсли;
		ЗапуститьПриложение(ВнешняяСсылка);
		
	Иначе 
		ОткрытьФорму("ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьДанныеСертификатаВФайл(Команда)
		
	ДДСертификата = ПолучитьДвоичныеДанныеИзBase64Строки(ОбразСертификата);
	СертификатКриптографии = Новый СертификатКриптографии(ДДСертификата);
	
	ПредставлениеСубъекта = СокрЛП(ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеСубъекта(СертификатКриптографии));
	ИмяФайла = ККСНГ_ОбщегоНазначенияКлиентСервер.ПодготовитьСтрокуДляИмениФайла(ПредставлениеСубъекта) + ".cer";
		
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДДСертификата);
	ДанныеФайла = Новый ОписаниеПередаваемогоФайла(ИмяФайла, АдресВоВременномХранилище);
	
	СохраняемыеФайлы = Новый Массив;
	СохраняемыеФайлы.Добавить(ДанныеФайла);
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru = 'Выберите файл для сохранения сертификата'");
	Диалог.Фильтр    = НСтр("ru = 'Файлы сертификатов (*.cer)|*.cer|Все файлы (*.*)|*.*'");
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СохранитьСертификатПослеПолученияФайлов", ЭтотОбъект);
	НачатьПолучениеФайлов(ОповещениеОЗавершении, СохраняемыеФайлы, Диалог, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПопытку(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОписаниеДанныхСертификата()
	
	ДДСертификата = ПолучитьДвоичныеДанныеИзBase64Строки(ОбразСертификата);
	СертификатКриптографии = Новый СертификатКриптографии(ДДСертификата);
		
	ОписаниеДанныхСертификата.Очистить();
	Строка = ОписаниеДанныхСертификата.Добавить();
	Строка.Свойство = НСтр("ru = 'Кому выдан:'");
	Строка.Значение = СокрЛП(ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеСубъекта(СертификатКриптографии));
	
	Строка = ОписаниеДанныхСертификата.Добавить();
	Строка.Свойство = НСтр("ru = 'Кем выдан:'");
	Строка.Значение = СокрЛП(ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеИздателя(СертификатКриптографии));
	
	Строка = ОписаниеДанныхСертификата.Добавить();
	Строка.Свойство = НСтр("ru = 'Действителен с:'");
	Строка.Значение = Формат(СертификатКриптографии.ДатаНачала, "ДЛФ=D");

	Строка = ОписаниеДанныхСертификата.Добавить();
	Строка.Свойство = НСтр("ru = 'Действителен по:'");
	Строка.Значение = Формат(СертификатКриптографии.ДатаОкончания, "ДЛФ=D");
	
	Строка = ОписаниеДанныхСертификата.Добавить();
	Строка.Свойство = НСтр("ru = 'Серийный номер:'");
	Строка.Значение = СокрЛП(СертификатКриптографии.СерийныйНомер);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСертификатПослеПолученияФайлов(ПолученныеФайлы, ДопПараметры) Экспорт
	
	Если ПолученныеФайлы <> Неопределено
	 И ПолученныеФайлы.Количество() > 0 Тогда
	 
	 	ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииНаСсылкуФайла", ЭтотОбъект, ПолученныеФайлы[0].ПолноеИмя);
		
		ТекстОповещения = НСтр("ru = 'Сертификат сохранен в файл:'");
		ПоказатьОповещениеПользователя(ТекстОповещения, ОписаниеОповещения, ПолученныеФайлы[0].Имя, БиблиотекаКартинок.СохранитьФайл);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаСсылкуФайла(ДополнительныеПараметры) Экспорт
	
	#Если ВебКлиент Тогда
		Если Не РаботаСФайламиСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда
			РаботаСФайламиСлужебныйКлиент.ПоказатьПредупреждениеОНеобходимостиРасширенияРаботыСФайлами(Неопределено);
			Возврат;
		КонецЕсли;
	#КонецЕсли

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Строка") И Не ПустаяСтрока(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиент.ОткрытьПроводник(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти