
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеПрофилиЭДО = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДоступныеПрофилиЭДОПользователя();
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", 
				ДоступныеПрофилиЭДО, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СинхронизацияКонтрагентов(Команда)
	
	ОткрытьФорму("Обработка.ККСНГ_СинхронизацияКонтрагентов.Форма.Синхронизация");
	
КонецПроцедуры

#КонецОбласти