
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрофильОрганизации = Параметры.ПрофильНастройкиЭДО;
	ПараметрыАвторизации = Параметры.ПараметрыАвторизации;	
	Отправитель = ПрофильОрганизации.Организация;
	Элементы.Отправитель.Подсказка = "(" + ПрофильОрганизации.КодУчастникаЭДО + ")";
	Параметры.Свойство("БизнесПроцесс", БизнесПроцесс);
	
	ДокументСтруктурированный = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСтруктурированный", Истина);
	
	Если НЕ ДокументСтруктурированный Тогда
		
		Элементы.ДокументСсылка.Видимость = Ложь;
		Элементы.ФормаСохранить.Видимость = Ложь;
		Элементы.ГруппаВложенияВсплывающая.Видимость = Ложь;
		
		ПолучательЭДО = Параметры.Получатель;
		Получатель = Параметры.Получатель.Контрагент;
		Элементы.Получатель.Подсказка = "(" + Параметры.Получатель.КодУчастникаЭДО + ")";
		
		ЗапросДопАтрибуты = ПолучитьДопАтрибутыКурьер(Параметры.ВидЭД, Параметры.Получатель.КодУчастникаЭДО);
		
		ПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;
		
	Иначе	
		// Параметры
		ДокументСсылка = Параметры.ДокументСсылка;
		
		// Данные по документу, участники, роуминг, коды эдо
		ЗапросДанныхДокумента = ПолучитьДанныеФорматаДокумента();
		
		Если НЕ ЗапросДанныхДокумента.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросДанныхДокумента.Журнал);
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		ДанныеДокумента = ЗапросДанныхДокумента.Результат; 
		
		// Значения реквизитов из полученных данных по документу
		
		Получатель = ДанныеДокумента.ПрофильКонтрагента.Контрагент;
		
		Элементы.Получатель.Подсказка = "(" + ДанныеДокумента.КодЭДОПолучателя + ")";
		
		ЗапросДопАтрибуты = ПолучитьДопАтрибутыКурьер(ДанныеДокумента.ДанныеФормата.КодТипаДокумента, ДанныеДокумента.КодЭДОПолучателя);
		
		ПараметрыЗаполнения = Неопределено;
		
	КонецЕсли;
	
	Если НЕ ЗапросДопАтрибуты.Успех Тогда
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросДопАтрибуты.Журнал);                                             
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ДопАтрибуты = ЗапросДопАтрибуты.Результат;
	
	// Элементы доп атрибутов
	СоздатьРеквизитыИЭлементы(ДопАтрибуты);
	
 	Если НЕ ДокументСтруктурированный Тогда
		
		ДанныеНеструктурированногоДокумента = Новый Структура;
		ДанныеНеструктурированногоДокумента.Вставить("ПрофильКонтрагента", Параметры.Получатель);
		ДанныеНеструктурированногоДокумента.Вставить("КодТипаДокумента", Параметры.ВидЭД);
		ДанныеНеструктурированногоДокумента.Вставить("Договор", Параметры.Договор);
		
		ПараметрыЗапроса = Новый Структура("БизнесПроцесс", БизнесПроцесс);
		ДопПараметры = ККСНГ_ЭлектронныеДокументы.ДополнительныеПараметрыДокумента(ДанныеНеструктурированногоДокумента, ПараметрыЗапроса);
		
	Иначе	
		ДокументНастройки = ПолучитьДокументНастройки(ДокументСсылка);
		
		Если ДокументНастройки <> Неопределено Тогда
			
			ИмяМетаданных = ДокументНастройки.Метаданные().ПолноеИмя();
			НастройкиИнфоПолейДокумента = ККСНГ_ЭлектронныеДокументы.ПолучитьНастройкиФормированияИнфополей(ИмяМетаданных, 
			ДанныеДокумента.ПрофильКонтрагента, "ИнфоФХЖ1,ИнфоФХЖ3");
			
			СоздатьРеквизитыИЭлементыИнфоПолей(НастройкиИнфоПолейДокумента);
		КонецЕсли;			
		
		ПараметрыЗапроса = Новый Структура("БизнесПроцесс", БизнесПроцесс);
		ДопПараметры = ККСНГ_ЭлектронныеДокументы.ДополнительныеПараметрыДокумента(ДанныеДокумента, ПараметрыЗапроса);
		
	КонецЕсли;
	
	Если Не ДопПараметры = Неопределено Тогда
		СоздатьРеквизитыИЭлементыДопПараметры(ДопПараметры);
		ЗаполнитьЗначенияДопПараметровИзСтруктуры(ДопПараметры);      
	КонецЕсли;
	
	ОбновитьДополнительныеРеквизитыДокументаИзРегистра(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьЗаполнениеДопРеквизитовДокумента();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизитыДопАтрибутов Цикл
		ПроверяемыеРеквизиты.Добавить(ПроверяемыйРеквизит.Значение);
	КонецЦикла;
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизитыДопПараметров Цикл
		ПроверяемыеРеквизиты.Добавить(ПроверяемыйРеквизит.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ДобавитьСтрокуПрисоединенныеФайлы(ВыбранноеЗначение);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		Если ЗавершениеРаботы Тогда
			Возврат;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаСсылкаНажатие(Элемент, СтандартнаяОбработка)
	
	ПоказатьЗначение( , ЭтотОбъект[Элемент.Имя]);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФайлов

&НаКлиенте
Процедура ТаблицаФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	МассивФайлов = Новый Массив();
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
		МассивФайлов.Добавить(ПараметрыПеретаскивания.Значение);	
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		МассивФайлов = ПараметрыПеретаскивания.Значение;
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого Файл Из МассивФайлов Цикл
		ДобавитьСтрокуПрисоединенныеФайлы(Файл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = ТаблицаФайлов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.Ссылка) Тогда
		ПоказатьЗначение( , ВыбраннаяСтрока.Ссылка);
	ИначеЕсли ЗначениеЗаполнено(ВыбраннаяСтрока.ПолноеИмя) Тогда
		ОбщегоНазначенияКлиент.ОткрытьПроводник(ВыбраннаяСтрока.ПолноеИмя);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПослеУдаления(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФайлСДиска(Команда)

	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл(ы)'");
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;

	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОповещениеЗавершения);
		
КонецПроцедуры

&НаКлиенте
Процедура ФайлДокумента(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", ДокументСсылка);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
	             ПараметрыФормы,
	             ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВложения(Команда)
	
	ТекущийЭлемент = Элементы.ГруппаШапка;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
		
	ЗаписатьДополнительныеРеквизитыДокументаВРегистр();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если НЕ ДокументСтруктурированный Тогда
		
		Модифицированность = Ложь;
		
		ОтветПриЗакрытии = Новый Структура;
		ОтветПриЗакрытии.Вставить("КонтрагентЭДО", ПолучательЭДО);
		ОтветПриЗакрытии.Вставить("ЗапросПодписи", ЗапроситьПодпись);
		ОтветПриЗакрытии.Вставить("Комментарий", Комментарий);
		ОтветПриЗакрытии.Вставить("ДопАтрибуты", ПолучитьСистемноеПредставлениеДопАтрибутов());
		ОтветПриЗакрытии.Вставить("ДопПараметры", ПолучитьСистемноеПредставлениеДопПараметров());
		ОтветПриЗакрытии.Вставить("Вложения", ПолучитьСистемноеПредставлениеТаблицыФайлов());
		
		Закрыть(ОтветПриЗакрытии);
		Возврат;
		
	КонецЕсли;	
	
	Если ЗаписатьДополнительныеРеквизитыДокументаВРегистр() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеСтрокиВложения(ОписаниеВложения)

	НайденныеСтроки = НайтиСтрокуПоОписаниюФайла(ОписаниеВложения);
	
	Если НайденныеСтроки.Количество() Тогда
		
		НайденнаяСтрока = НайденныеСтроки[0];
		ЗаполнитьЗначенияСвойств(НайденнаяСтрока, ОписаниеВложения);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да 
		И НЕ ЗаписатьДополнительныеРеквизитыДокументаВРегистр() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат = КодВозвратаДиалога.Отмена Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
			Файл = Новый Файл(ВыбранныйФайл);
			ДобавитьСтрокуПрисоединенныеФайлы(Файл);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФорматаДокумента()
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();	
	
	// Получение данных документа
	ОбщийМодульПолучениеДанных = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПолучениеДанных");
	ЗапросПредставленияЭД = ОбщийМодульПолучениеДанных.ПолучитьПредставлениеЭД(ДокументСсылка);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПредставленияЭД.Журнал);
	
	Если ЗапросПредставленияЭД.Успех Тогда
		
		ДанныеДокумента = ЗапросПредставленияЭД.Результат;
		ДанныеДокумента.БизнесПроцесс = БизнесПроцесс;
		
		ЗапросНаДополнение = ККСНГ_ОтправкаЭДВызовСервера.ДополнитьДанныеДокументаДаннымиЭДО(ДанныеДокумента, ПрофильОрганизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросНаДополнение.Журнал);
		
		Если ЗапросНаДополнение.Успех Тогда
			
			// Получение данных о формате отправляемого документа
			ЗапросДанныхФормата = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеФорматаДокументаЭД(ДанныеДокумента);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныхФормата.Журнал);
			
			Если ЗапросДанныхФормата.Успех Тогда
				
				ДанныеФормата = ЗапросДанныхФормата.Результат;
				
				// Обновление кода ЭДО получателя на случай роуминга
				ДанныеДокумента.Вставить("ЭтоРоуминг", Ложь);
				ЗапросКодаЭДО = ККСНГ_ДокументооборотВызовСервера.ПолучитьКодЭДОПолучателя(ДанныеДокумента.ПрофильКонтрагента, 
				ДанныеФормата.КодТипаДокумента, ПрофильОрганизации, ПараметрыАвторизации);
				Если ЗапросКодаЭДО.Успех Тогда
					ДанныеДокумента.Вставить("ЭтоРоуминг", ?(ДанныеДокумента.КодЭДОПолучателя = ЗапросКодаЭДО.Результат, Ложь, Истина));
					ДанныеДокумента.КодЭДОПолучателя = ЗапросКодаЭДО.Результат;
				КонецЕсли;
				
				ДанныеДокумента.Вставить("ДанныеФормата", ДанныеФормата);
				Ответ.Результат = ДанныеДокумента;
				Ответ.Успех = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьДопАтрибутыКурьер(TypeCode, КодПолучателя)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	ЗапросШаблонов = ККСНГ_APIКурьер.v1_ClassifierTemplate(ПараметрыАвторизации, TypeCode, КодПолучателя);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросШаблонов.Журнал);
	
	Если ЗапросШаблонов.Успех Тогда

		ДопАтрибуты = ЗапросШаблонов.Результат.ClassifierTemplate;
		
		Для Каждого ДопАтрибут Из ДопАтрибуты Цикл
			
			// 2. Получение значений
			ЗапросЗначенийАтрибута = ККСНГ_APIКурьер.v1_ClassifierClassifierValues(ПараметрыАвторизации, ДопАтрибут.ID, Истина);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросЗначенийАтрибута.Журнал);

			Если НЕ ЗапросЗначенийАтрибута.Успех Тогда
				Возврат Ответ;	
			КонецЕсли;
		
			МассивЗначенийАтрибута = ЗапросЗначенийАтрибута.Результат.ClassifierValue;
			
			ДопАтрибут.Вставить("МассивЗначений", МассивЗначенийАтрибута);
			ДопАтрибут.Вставить("ДоступенСписокЗначений", ?(МассивЗначенийАтрибута.Количество(), Истина, Ложь));
			
		КонецЦикла;
		
	Иначе
		
		Возврат Ответ;	
		
	КонецЕсли;

	Ответ.Результат = ДопАтрибуты;
	Ответ.Успех = Истина;

	Возврат Ответ;
	
КонецФункции	

&НаСервере
Функция СоздатьРеквизитыИЭлементы(ДопАтрибуты)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	// Подготовка реквизитов
	НовыеРеквизиты = Новый Массив;
	
	Для Каждого ДопАтрибут Из ДопАтрибуты Цикл
		
		Имя = "ClassifierID_" + Формат(ДопАтрибут.Id, "ЧДЦ=0; ЧН=0; ЧГ=");
		КС = Новый КвалификаторыСтроки(256);
		Тип = Новый ОписаниеТипов("Строка", , , , КС);	
		ЗаголовокРеквизита = ДопАтрибут.Name;
		
		НовыйРеквизит = Новый РеквизитФормы(Имя, Тип, , ЗаголовокРеквизита, Истина);
		
		Если ДопАтрибут.IsRequired Тогда
			ПроверяемыеРеквизитыДопАтрибутов.Добавить(Имя);
		КонецЕсли;
		           
		НовыеРеквизиты.Добавить(НовыйРеквизит);
		РеквизитыДопАтрибутов.Добавить(ДопАтрибут.Id, Имя);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	// Сохдание элементов формы
	Для Каждого ДопАтрибут Из ДопАтрибуты Цикл
		
		Имя = "ClassifierID_" + Формат(ДопАтрибут.Id, "ЧДЦ=0; ЧН=0; ЧГ=");
		
		ЭлементГруппаАтрибутов = Элементы.Найти(ДопАтрибут.Participant);
		Если ЭлементГруппаАтрибутов = Неопределено Тогда
			ЭлементГруппаАтрибутов = Элементы.ГруппаДопАтрибуты;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Вставить(Имя, Тип("ПолеФормы"), ЭлементГруппаАтрибутов);
		НовыйЭлемент.ПутьКДанным = Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Если ЗначениеЗаполнено(ДопАтрибут.Comment) Тогда
			НовыйЭлемент.Подсказка = ДопАтрибут.Comment;
			НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		КонецЕсли;
		
		НовыйЭлемент.АвтоОтметкаНезаполненного = ДопАтрибут.IsRequired;
		
		Если ДопАтрибут.ДоступенСписокЗначений Тогда
			
			НовыйЭлемент.РежимВыбораИзСписка = ДопАтрибут.IsSelectOnly;
			НовыйЭлемент.РедактированиеТекста = НЕ ДопАтрибут.IsSelectOnly;
			
			НовыйЭлемент.КнопкаВыпадающегоСписка = Истина; 
			
			Для Каждого Элемент Из ДопАтрибут.МассивЗначений Цикл
				
				Если Элемент.IsActive Тогда
					НовыйЭлемент.СписокВыбора.Добавить(Элемент.Value);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		НовыйЭлемент.КнопкаОчистки = Истина;
			
	КонецЦикла;	
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	КоличествоВложений = ТаблицаФайлов.Количество();
	Элементы.ГруппаВложенияВсплывающая.Заголовок = "Прикрепить доп. вложения" + ?(КоличествоВложений, " (" + XMLСтрока(КоличествоВложений) + ")", "");	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеФайлаПоСсылке(СсылкаНаПрисоединеныйФайл)
	
	ФайлОписание = Новый Структура();
	ФайлОписание.Вставить("ИндексКартинки", СсылкаНаПрисоединеныйФайл.ИндексКартинки);
	ФайлОписание.Вставить("Наименование"  , СсылкаНаПрисоединеныйФайл.Наименование);
	ФайлОписание.Вставить("ПолноеИмя"     , "");	
	ФайлОписание.Вставить("Ссылка"        , СсылкаНаПрисоединеныйФайл.Ссылка);
	ФайлОписание.Вставить("Расширение"    , СсылкаНаПрисоединеныйФайл.Расширение);
		
	Размер = ?(СсылкаНаПрисоединеныйФайл.Размер = 0, 0, Окр(СсылкаНаПрисоединеныйФайл.Размер / 1024));
	
	Если СсылкаНаПрисоединеныйФайл.Размер > 0 И Размер < 1 Тогда
		Размер = 1;	
	КонецЕсли;
	
	ФайлОписание.Вставить("Размер", Размер);
	
	Возврат ФайлОписание;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеФайла(ФайлНаДиске)
	
	Перем ФайлОписание, Размер;
	
	ФайлОписание = Новый Структура();
	ФайлОписание.Вставить("ИндексКартинки", ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьИндексПиктограммыФайла(ФайлНаДиске.Расширение));
	ФайлОписание.Вставить("Наименование" , ФайлНаДиске.ИмяБезРасширения);
	ФайлОписание.Вставить("ПолноеИмя" , ФайлНаДиске.ПолноеИмя);
	ФайлОписание.Вставить("Ссылка" , "");
	ФайлОписание.Вставить("Расширение" , Прав(ФайлНаДиске.Расширение, СтрДлина(ФайлНаДиске.Расширение) - 1));
	
	Размер = ?(ФайлНаДиске.Размер() = 0, 0, Окр(ФайлНаДиске.Размер() / 1024));
	
	Если ФайлНаДиске.Размер() > 0 И Размер < 1 Тогда
		Размер = 1;
	КонецЕсли;
	
	ФайлОписание.Вставить("Размер", Размер);
	
	Возврат ФайлОписание;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтрокуПрисоединенныеФайлы(Данные)
	
	Если ТипЗнч(Данные) = Тип("Файл") Тогда
		Если Данные.Существует() И Данные.ЭтоФайл() Тогда
			ФайлОписание = ПолучитьОписаниеФайла(Данные);
		КонецЕсли;
	Иначе
		ФайлОписание = ПолучитьОписаниеФайлаПоСсылке(Данные);	
	КонецЕсли;

	Если ПроверитьФайл(ФайлОписание) Тогда
	
		НоваяСтрока = ТаблицаФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ФайлОписание); 
		
		Модифицированность = Истина;
	
		ОбновитьЭлементыФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьФайл(ФайлОписание)
	
	Если НЕ ПроверитьФайлНаСервере(ФайлОписание) Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	ИмяКолонкиПоиска = "Ссылка";
	
	Если ЗначениеЗаполнено(ФайлОписание.ПолноеИмя) Тогда
		ИмяКолонкиПоиска = "ПолноеИмя";
	КонецЕсли;
	
	Если ФайлОписание.Размер > 100 * 1024 Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Размер файла вложения '" + ФайлОписание[ИмяКолонкиПоиска]
																		+ "' превышает максимальный допустимый размер 100 МБ.");
		Возврат Ложь;
		
	КонецЕсли;	
	
	Если ФайлОписание.Размер = 0 Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл вложения '" + ФайлОписание[ИмяКолонкиПоиска] 
																		+ "' пустой, укажите другой файл, либо удалите его.");	
		Возврат Ложь;
			
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьФайлНаСервере(ФайлОписание)
	
	НайденныеСтроки = НайтиСтрокуПоОписаниюФайла(ФайлОписание);
			
	Возврат НЕ НайденныеСтроки.Количество();
	
КонецФункции

&НаСервере
Функция НайтиСтрокуПоОписаниюФайла(ФайлОписание)
	
	ИмяКолонкиПоиска = "Ссылка";
	
	Если ЗначениеЗаполнено(ФайлОписание.ПолноеИмя) Тогда
		ИмяКолонкиПоиска = "ПолноеИмя";
	КонецЕсли;

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить(ИмяКолонкиПоиска, ФайлОписание[ИмяКолонкиПоиска]);
	НайденныеСтроки = ТаблицаФайлов.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеСтроки;
	
КонецФункции
		
&НаСервере
Функция ПолучитьСистемноеПредставлениеТаблицыФайлов()
	
	Если ТаблицаФайлов.Количество() Тогда
		Возврат ЗначениеВСтрокуВнутр(ТаблицаФайлов.Выгрузить());
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСистемноеПредставлениеДопАтрибутов()
	
	Если РеквизитыДопАтрибутов.Количество() Тогда
		
		МассивДопАтрибутов = Новый Массив();
		
		Для Каждого РеквизитДопАтрибутов Из РеквизитыДопАтрибутов Цикл
			
			ЗначениеKey = РеквизитДопАтрибутов.Значение;
			ЗначениеValue = ЭтотОбъект[РеквизитДопАтрибутов.Представление];
			
			Если ЗначениеЗаполнено(ЗначениеValue) Тогда
				
				СтруктураKeyValueObject = Новый Структура();
				СтруктураKeyValueObject.Вставить("Key", ЗначениеKey);
				СтруктураKeyValueObject.Вставить("Value", ЗначениеValue);
				
				МассивДопАтрибутов.Добавить(СтруктураKeyValueObject);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивДопАтрибутов.Количество() Тогда
			Возврат ЗначениеВСтрокуВнутр(МассивДопАтрибутов);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСистемноеПредставлениеИнфоПолей()
	
	Если РеквизитыИнфоПолей.Количество() Тогда
		
		МассивИнфоПолей = Новый Массив();
		
		Для Каждого РеквизитИнфоПоля Из РеквизитыИнфоПолей Цикл
			
			ИдентификаторИнфоПоля = РеквизитИнфоПоля.Идентификатор;
			ТипИнфоПоля = РеквизитИнфоПоля.Тип;
			ЗначениеИнфоПоля = ЭтотОбъект[РеквизитИнфоПоля.ИмяЭлементаФормы];
			
			Если ЗначениеЗаполнено(ЗначениеИнфоПоля) Тогда
				
				СтруктураСохранения = Новый Структура();
				СтруктураСохранения.Вставить("Key", СтрЗаменить(ИдентификаторИнфоПоля, "InfoFieldID_", ""));
				СтруктураСохранения.Вставить("Type", ТипИнфоПоля);
				СтруктураСохранения.Вставить("Value", ЗначениеИнфоПоля);
				
				МассивИнфоПолей.Добавить(СтруктураСохранения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивИнфоПолей.Количество() Тогда
			Возврат ЗначениеВСтрокуВнутр(МассивИнфоПолей);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьДополнительныеРеквизитыДокументаИзРегистра(ПараметрыЗаполнения = Неопределено)
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДопРеквизитыДокумента = ККСНГ_ЭлектронныеДокументы.ПрочитатьДополнительныеРеквизитыДокумента(ДокументСсылка);
		ВерсияЗаписиРегистра = ?(ДопРеквизитыДокумента = Неопределено, "", ДопРеквизитыДокумента.ВерсияЗаписи);
		ЗаполнитьДополнительныеРеквизитыДокумента(ДопРеквизитыДокумента);
	ИначеЕсли НЕ ПараметрыЗаполнения = Неопределено Тогда
		ЗаполнитьДополнительныеРеквизитыДокумента(ПараметрыЗаполнения);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыДокумента(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ТаблицаФайлов.Очистить();	
		Возврат;		
	КонецЕсли;
	
	ЗапроситьПодпись = ДанныеЗаполнения.ЗапросПодписи;
	Комментарий = ДанныеЗаполнения.Комментарий;
	
	ЗаполнитьДопАтрибутыДокумента(ДанныеЗаполнения);	
	ЗаполнитьВложенияДокумента(ДанныеЗаполнения);
	ЗаполнитьДопПараметрыДокумента(ДанныеЗаполнения);
	
	Если ДокументСтруктурированный Тогда
		ЗаполнитьИнфоПоляДокумента(ДанныеЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопАтрибутыДокумента(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.УстановленыДопАтрибуты Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДопАтрибуты) = Тип("ХранилищеЗначения") Тогда
			МассивKeyValueObject = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.ДопАтрибуты.Получить());
		Иначе	
			МассивKeyValueObject = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.ДопАтрибуты);
		КонецЕсли;
		
		Для Каждого KeyValueObject Из МассивKeyValueObject Цикл
			
			НайденныйРеквизит = РеквизитыДопАтрибутов.НайтиПоЗначению(KeyValueObject.Key);					
			Если НайденныйРеквизит <> Неопределено Тогда
				ЭтотОбъект[НайденныйРеквизит.Представление] = KeyValueObject.Value;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнфоПоляДокумента(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.УстановленыИнфоПоля Тогда
		
		КоллекцияИнфоПолей = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.ИнфоПоля.Получить());
		Для Каждого ЭлементИнфоПоля Из КоллекцияИнфоПолей Цикл
			
			ИдентификаторИнфоПоля = ЭлементИнфоПоля.Key;
			ТипИнфоПоля = ?(ЭлементИнфоПоля.Свойство("Type"), ЭлементИнфоПоля.Type, "");
			
			НайденныеРеквизиты = РеквизитыИнфоПолей.НайтиСтроки(Новый Структура("Идентификатор, Тип", ИдентификаторИнфоПоля, ТипИнфоПоля));					
			Для каждого НайденныйРеквизит Из НайденныеРеквизиты Цикл
				ЭтотОбъект[НайденныйРеквизит.ИмяЭлементаФормы] = ЭлементИнфоПоля.Value;
				НайденныйРеквизит.Значение = ЭлементИнфоПоля.Value;						
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;			
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенияДокумента(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.ЕстьВложения Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.Вложения) = Тип("ХранилищеЗначения") Тогда
			ТаблицаРегистра = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.Вложения.Получить());
		Иначе	
			ТаблицаРегистра = ЗначениеИзСтрокиВнутр(ДанныеЗаполнения.Вложения);
		КонецЕсли;		
		
		ТаблицаФайлов.Загрузить(ТаблицаРегистра);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьДополнительныеРеквизитыДокументаВРегистр()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеЗаписаны = ЗаписатьДополнительныеРеквизитыДокумента(ДокументСсылка, ЗапроситьПодпись, 
							ПолучитьСистемноеПредставлениеДопАтрибутов(), ПолучитьСистемноеПредставлениеИнфоПолей(), 
							ПолучитьСистемноеПредставлениеТаблицыФайлов(), ПолучитьСистемноеПредставлениеДопПараметров(), Комментарий);
							
	Модифицированность = НЕ ДанныеЗаписаны;
	
	Если ДанныеЗаписаны Тогда
		ИмяСобытия = "ОбновитьКОтправке";
		Параметр = Новый Структура("ПрофильЭДООрганизации", ПрофильОрганизации);
		Оповестить(ИмяСобытия, Параметр, ЭтотОбъект);
	КонецЕсли;
	
	Возврат ДанныеЗаписаны;
		
КонецФункции

&НаСервере
Функция ПолучитьДокументНастройки(ТекущийДокумент)
	
	ОбщийМодульРаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	СписокДокументовНастроек = ОбщийМодульРаботаСМетаданными.ПолучитьДокументыВыбора();
	НайденнаяНастройка = СписокДокументовНастроек.НайтиПоЗначению(ТекущийДокумент.Метаданные().ПолноеИмя());
	
	Если НайденнаяНастройка = Неопределено Тогда
		Если НЕ ТекущийДокумент.Метаданные().Реквизиты.Найти("ДокументОснование") = Неопределено Тогда
			ДокументНастройки = ТекущийДокумент.ДокументОснование;
		КонецЕсли;
	Иначе
		ДокументНастройки = ТекущийДокумент;
	КонецЕсли;	
	
	Возврат ДокументНастройки;
	
КонецФункции

&НаСервере
Процедура СоздатьРеквизитыИЭлементыИнфоПолей(КоллекцияНастроекИнфоПолей)
	
	Если ЗначениеЗаполнено(КоллекцияНастроекИнфоПолей) Тогда
		
		// Создаем главные группы формы для размещения групп и элементов инфо.полей ФХЖ
		ГруппаАтрибутов = Элементы.ГруппаИнфоПолей;
		
		ГруппыФХЖ = Новый Соответствие;
		ГруппыФХЖ.Вставить("ИнфоФХЖ1", ГруппаФХЖ(Элементы, "ГруппаФХЖ1", "Сведения о документе (ФХЖ1)", ГруппаАтрибутов));
		ГруппыФХЖ.Вставить("ИнфоФХЖ3", ГруппаФХЖ(Элементы, "ГруппаФХЖ3", "Сведения об отгрузке (ФХЖ3)", ГруппаАтрибутов));
		
		ШаблонИмениИнфоПоля = "InfoFieldID_%1";
		ШаблонИмениГруппыИнфоПоля = "InfoFieldGroupID_%1";
		
		ДокументНастройки = ПолучитьДокументНастройки(ДокументСсылка);
		
		СчетчикРеквизитов = 1;
		
		Для каждого НастройкиИнфоПоляСтруктура Из КоллекцияНастроекИнфоПолей Цикл
			
			СчетчикЭлементовФормы = СчетчикРеквизитов;
			
			// Добавляем реквизиты формы
			НовыеРеквизиты = Новый Массив;
			Для Каждого НастройкаИнфоПоля Из НастройкиИнфоПоляСтруктура.Значение Цикл
				ИмяРеквизита = СтрШаблон(ШаблонИмениИнфоПоля, СокрЛП(СчетчикРеквизитов));
				ДобавитьРеквизитФормыНастройкиИнфоПолей(НовыеРеквизиты, ИмяРеквизита, НастройкаИнфоПоля.Подсказка);
				СохранитьРеквизитФормыНастройкиИнфоПолей(РеквизитыИнфоПолей, НастройкаИнфоПоля, ИмяРеквизита);
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СчетчикРеквизитов);
			КонецЦикла;
			
			ИзменитьРеквизиты(НовыеРеквизиты);
			
			// Добавляем элементов формы
			Для Каждого НастройкаИнфоПоля Из НастройкиИнфоПоляСтруктура.Значение Цикл
				
				РодительГруппаФХЖ = ПолучитьГруппуФХЖПоТипу(НастройкаИнфоПоля.ТипИнфополя, ГруппыФХЖ, ГруппаАтрибутов);
				ИмяЭлемента = СтрШаблон(ШаблонИмениИнфоПоля, СокрЛП(СчетчикЭлементовФормы));
				ИмяГруппы = СтрШаблон(ШаблонИмениГруппыИнфоПоля, СокрЛП(СчетчикЭлементовФормы));
				
				ГруппаИнфоПоля = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительГруппаФХЖ);
				ГруппаИнфоПоля.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаИнфоПоля.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
				ГруппаИнфоПоля.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ГруппаИнфоПоля.ОтображатьЗаголовок = Ложь;
				
				ЭлементИнфоПоля = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаИнфоПоля);
				ЭлементИнфоПоля.ПутьКДанным = ИмяЭлемента;
				ЭлементИнфоПоля.Заголовок = СокрЛП(НастройкаИнфоПоля.Идентификатор);
				ЭлементИнфоПоля.Вид = ВидПоляФормы.ПолеВвода;
				ЭлементИнфоПоля.Подсказка = НастройкаИнфоПоля.Подсказка;
				ЭлементИнфоПоля.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
				ЭлементИнфоПоля.КнопкаОчистки = Истина;
				ЭлементИнфоПоля.УстановитьДействие("ИзменениеТекстаРедактирования", "ОбработкаИзмененияТекстаИнфоПолей");
				ЗаполнитьПодсказкуИнфоПоля(ЭлементИнфоПоля, НастройкаИнфоПоля, ДокументНастройки);
				
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СчетчикЭлементовФормы);
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ГруппаФХЖ(Элементы, Имя, Заголовок, Родитель)
	
	ГруппаФХЖ = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель);
	ГруппаФХЖ.Заголовок = Заголовок;
	ГруппаФХЖ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФХЖ.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ГруппаФХЖ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаФХЖ.ОтображатьЗаголовок = Истина;
	
	Возврат ГруппаФХЖ;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьРеквизитФормыНастройкиИнфоПолей(КоллекцияНовыхРеквизитов, ИмяРеквизита, ЗаголовокРеквизита)
	
	Тип = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(2000));	
	НовыйРеквизитИнфоПоля = Новый РеквизитФормы(ИмяРеквизита, Тип, , ЗаголовокРеквизита, Истина);
	КоллекцияНовыхРеквизитов.Добавить(НовыйРеквизитИнфоПоля);
	
	Возврат НовыйРеквизитИнфоПоля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьРеквизитФормыНастройкиИнфоПолей(ТаблицаХранения, НастройкаИнфоПоля, ИмяРеквизита)
	
	ПараметрыХраненияРеквизитовФормы = Новый Структура();
	ПараметрыХраненияРеквизитовФормы.Вставить("Тип", НастройкаИнфоПоля.ТипИнфополя);
	ПараметрыХраненияРеквизитовФормы.Вставить("Идентификатор", НастройкаИнфоПоля.Идентификатор);
	ПараметрыХраненияРеквизитовФормы.Вставить("ИмяЭлементаФормы", ИмяРеквизита);
	ПараметрыХраненияРеквизитовФормы.Вставить("Формула", НастройкаИнфоПоля.Формула);
	ПараметрыХраненияРеквизитовФормы.Вставить("ЗначениеПоФормуле", "");
	
	ДобавитьРеквизитФормыВТаблицуХранения(ТаблицаХранения, ПараметрыХраненияРеквизитовФормы);		
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьРеквизитФормыВТаблицуХранения(ТаблицаХранения, СтруктураХранения)
	
	ЗаполнитьЗначенияСвойств(ТаблицаХранения.Добавить(), СтруктураХранения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьГруппуФХЖПоТипу(ТипИнфополя, СписокПоискаГрупп, ГруппаПоУмолчанию = Неопределено)
	
	ГруппаФХЖ = СписокПоискаГрупп.Получить(ТипИнфополя);	
	Если ГруппаФХЖ = Неопределено Тогда
		ГруппаФХЖ = ГруппаПоУмолчанию;		
	КонецЕсли;
	
	Возврат ГруппаФХЖ;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПодсказкуИнфоПоля(ЭлементИнфоПоля, НастройкаИнфоПоля, ДокументНастройки)
	
	Формула = НастройкаИнфоПоля.Формула;
	Если Не ЗначениеЗаполнено(Формула) Или Не ЗначениеЗаполнено(ДокументНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементИнфоПоля.Подсказка = СокрЛП(СтрШаблон(ЭлементИнфоПоля.Подсказка + " (расчет по формуле %1)", Формула));
		
	ИмяПоля = "Инфополе_1";
	МассивОшибокЗаполнения = Новый Массив;
	ТаблицаРезультат = ККСНГ_ЭлектронныеДокументы.ВычислитьЗначениеИнфополя(НастройкаИнфоПоля, ДокументНастройки, ИмяПоля, МассивОшибокЗаполнения);
	Если ТаблицаРезультат.Количество() Тогда	
		РассчитанноеЗначениеПоФормуле = Строка(ТаблицаРезультат[0][ИмяПоля]);
	Иначе 
		РассчитанноеЗначениеПоФормуле = "";
	КонецЕсли;
	
	ЭлементИнфоПоля.ПодсказкаВвода = РассчитанноеЗначениеПоФормуле;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияТекстаИнфоПолей(Элемент)
	
	НайденныеРеквизиты = РеквизитыИнфоПолей.НайтиСтроки(Новый Структура("ИмяЭлементаФормы", Элемент.Имя));
	Если НайденныеРеквизиты.Количество() = 1 Тогда
		
		ТекстРедактирования = Элемент.ТекстРедактирования;
		НайденныйРеквизит = НайденныеРеквизиты[0];
		Если ЗначениеЗаполнено(НайденныйРеквизит.Формула) 
			И Не ЗначениеЗаполнено(НайденныйРеквизит.Значение)
			И Не НайденныйРеквизит.Значение = ТекстРедактирования
			И Не НайденныйРеквизит.ПредупреждениеПросмотрено Тогда
			
			ПараметрыПредупреждения = Новый Структура("РеквизитИнфоПолей, Элемент", НайденныйРеквизит, Элемент);
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект, ПараметрыПредупреждения);
			ТекстПредупреждения = СтрШаблон("Значение инфо.поля рассчитывается по формуле ""%1""", НайденныйРеквизит.Формула);
			
			ПоказатьПредупреждение(Оповещение, ТекстПредупреждения, , "Внимание!");		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("РеквизитИнфоПолей") Тогда
		РеквизитИнфоПолей = ДополнительныеПараметры.РеквизитИнфоПолей;
		РеквизитИнфоПолей.ПредупреждениеПросмотрено = Истина;
		ЭтотОбъект[РеквизитИнфоПолей.ИмяЭлементаФормы] = ДополнительныеПараметры.Элемент.ТекстРедактирования;
	КонецЕсли;	
	
КонецПроцедуры

#Область РаботаСРегистром

&НаСервере
Функция ЗаписатьДополнительныеРеквизитыДокумента(СвязанныйДокумент, ЗапросПодписи = Ложь, ДопАтрибуты = Неопределено, 
												ИнфоПоля = Неопределено, Вложения = Неопределено, ДопПараметры = Неопределено, Комментарий = Неопределено) 

	Результат = Ложь;
		
	Попытка
		
		МодульМенеджераДопРеквизитыЭД = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("РегистрыСведений.ККСНГ_ПМ_ДопРеквизитыЭД");
		
		НаборЗаписей = МодульМенеджераДопРеквизитыЭД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СвязанныйДокумент.Установить(СвязанныйДокумент);
		
		Если ЗначениеЗаполнено(ДопАтрибуты)
			ИЛИ ЗначениеЗаполнено(ИнфоПоля)
			ИЛИ ЗначениеЗаполнено(Вложения)
			ИЛИ ЗначениеЗаполнено(ДопПараметры)
			ИЛИ ЗначениеЗаполнено(Комментарий)
			ИЛИ ЗапросПодписи Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.СвязанныйДокумент = СвязанныйДокумент;
			НоваяЗапись.ВерсияЗаписи      = Новый УникальныйИдентификатор();
			
			НоваяЗапись.ЗапросПодписи = ЗапросПодписи;
			
			Если ЗначениеЗаполнено(ДопАтрибуты) Тогда
				НоваяЗапись.ДопАтрибуты = Новый ХранилищеЗначения(ДопАтрибуты, Новый СжатиеДанных(9)); 	
				НоваяЗапись.УстановленыДопАтрибуты = Истина;
			Иначе
				НоваяЗапись.УстановленыДопАтрибуты = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИнфоПоля) Тогда
				НоваяЗапись.ИнфоПоля = Новый ХранилищеЗначения(ИнфоПоля, Новый СжатиеДанных(9)); 	
				НоваяЗапись.УстановленыИнфоПоля = Истина;
			Иначе
				НоваяЗапись.УстановленыИнфоПоля = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Вложения) Тогда
				НоваяЗапись.Вложения = Новый ХранилищеЗначения(Вложения, Новый СжатиеДанных(9)); 	
				НоваяЗапись.ЕстьВложения = Истина;
			Иначе
				НоваяЗапись.ЕстьВложения = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДопПараметры) Тогда
				НоваяЗапись.ДопПараметры = Новый ХранилищеЗначения(ДопПараметры, Новый СжатиеДанных(9)); 	
				НоваяЗапись.УстановленыДопПараметры = Истина;
			Иначе
				НоваяЗапись.УстановленыДопПараметры = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Комментарий) Тогда
				НоваяЗапись.Комментарий = Комментарий; 	
				НоваяЗапись.ЗаполненКомментарий = Истина;
			Иначе
				НоваяЗапись.ЗаполненКомментарий = Ложь;
			КонецЕсли;
			
		КонецЕсли;
			
		НаборЗаписей.Записать();
		
		Результат = Истина;
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПроверитьЗаполнениеДопРеквизитовДокумента()
	
	РезультатПроверки = ККСНГ_ОтправкаЭДКлиент.ПроверкаЗаполненияДопРеквизитовДокументов(ДокументСсылка);
	Если НЕ РезультатПроверки.Успех Тогда
		ОбработатьДанныеПроверкиЗаполненияДопРеквизитовДокумента(РезультатПроверки.Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПроверкиЗаполненияДопРеквизитовДокумента(ДанныеПроверкиЗаполнения)
	
	Для Каждого ОтветПоДокументу Из ДанныеПроверкиЗаполнения Цикл
		
		Если НЕ ОтветПоДокументу.Значение.Успех Тогда
			МассивВложений = ОтветПоДокументу.Значение.Результат;
			Для Каждого Вложение Из МассивВложений Цикл
				Если ЗначениеЗаполнено(Вложение.ОписаниеОшибки) Тогда
					ОбновитьДанныеСтрокиВложения(Вложение);
					ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Вложение.ОписаниеОшибки);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#Область РаботаСДопПараметрамиДокумента

&НаСервере
Процедура СоздатьРеквизитыИЭлементыДопПараметры(ДопПараметры)
	
	УдаляемыеРеквизиты = Новый Массив();
	Для каждого ДопПараметрРеквизит Из РеквизитыДопПараметров Цикл
		ИмяРеквизита = ДопПараметрРеквизит.Представление;
		НайденныйЭлемент = Элементы.Найти(ИмяРеквизита);
		Если Не НайденныйЭлемент = Неопределено Тогда
			Элементы.Удалить(НайденныйЭлемент);		
		КонецЕсли;		
		УдаляемыеРеквизиты.Добавить(ИмяРеквизита);	
	КонецЦикла;
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	РеквизитыДопПараметров.Очистить();
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		
		ШаблонИмени = "ExtraOptionID_%1";
			
		// Добавляем реквизиты формы
		СчетчикРеквизитов = 1;
		НовыеРеквизиты = Новый Массив;
		Для каждого ДопПараметр Из ДопПараметры Цикл
			
			ИмяРеквизита = СтрШаблон(ШаблонИмени, СокрЛП(СчетчикРеквизитов));
			ЗаголовокРеквизита = ДопПараметр.Представление;
			
			Тип = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(2000));	
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Тип, , ЗаголовокРеквизита, Истина);
			НовыеРеквизиты.Добавить(НовыйРеквизит);
			
			РеквизитыДопПараметров.Добавить(ДопПараметр.Ключ, ИмяРеквизита); 
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СчетчикРеквизитов);
			
			Если ДопПараметр.ОбязательноЗаполнение И ДопПараметр.ВозможноИзменение Тогда
				ПроверяемыеРеквизитыДопПараметров.Добавить(ИмяРеквизита);	
			КонецЕсли;
			
		КонецЦикла;
		ИзменитьРеквизиты(НовыеРеквизиты);
		
		// Добавляем элементов формы
		СчетчикЭлементов = 1;
		Для каждого ДопПараметр Из ДопПараметры Цикл
			
			ИмяЭлемента = СтрШаблон(ШаблонИмени, СокрЛП(СчетчикЭлементов));
			
			НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаДопПараметры);
			НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
			НовыйЭлемент.Заголовок = ДопПараметр.Представление;
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.КнопкаОчистки = ДопПараметр.ВозможноИзменение;
			НовыйЭлемент.Видимость = ДопПараметр.ВозможноИзменение;
			
			Если ЗначениеЗаполнено(ДопПараметр.Комментарий) Тогда
				НовыйЭлемент.Подсказка = ДопПараметр.Комментарий;
				НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
			КонецЕсли;
		
			Если ДопПараметр.ДоступенСписокЗначений Тогда
				// TODO При необходимости добавить параметры для регулирования возможности редактирования
				// НовыйЭлемент.РежимВыбораИзСписка = ДопАтрибут.IsSelectOnly;
				НовыйЭлемент.РедактированиеТекста = Истина;
	            НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;
				
				Для Каждого Элемент Из ДопПараметр.СписокДопустимыхЗначений Цикл
				
					НовыйЭлемент.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СчетчикЭлементов);
					
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияДопПараметровИзСтруктуры(ДопПараметры)
		
	Для Каждого ДопПараметрДокумента Из ДопПараметры Цикл
		НайденныйРеквизит = РеквизитыДопПараметров.НайтиПоЗначению(ДопПараметрДокумента.Ключ);					
		Если Не НайденныйРеквизит = Неопределено Тогда
			ЭтотОбъект[НайденныйРеквизит.Представление] = ДопПараметрДокумента.Значение;
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопПараметрыДокумента(ДанныеЗаполнения)
	
	Если БизнесПроцесс = "УВХД" И ДанныеЗаполнения.УстановленыДопПараметры Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДопПараметры) = Тип("ХранилищеЗначения") Тогда
			ДопПараметрыДокументаСтрока = ДанныеЗаполнения.ДопПараметры.Получить();
		Иначе	
			ДопПараметрыДокументаСтрока = ДанныеЗаполнения.ДопПараметры;
		КонецЕсли;
		
		Если Не ДопПараметрыДокументаСтрока = Неопределено Тогда
			ДопПараметрыДокумента = ЗначениеИзСтрокиВнутр(ДопПараметрыДокументаСтрока);
			ЗаполнитьЗначенияДопПараметровИзСтруктуры(ДопПараметрыДокумента)
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСистемноеПредставлениеДопПараметров()
	
	Если РеквизитыДопПараметров.Количество() Тогда
		
		МассивДопПараметров = Новый Массив();
		Для Каждого РеквизитДопПараметров Из РеквизитыДопПараметров Цикл
			
			ПараметрСохраненияКлюч = РеквизитДопПараметров.Значение;
			ПараметрСохраненияЗначение = ЭтотОбъект[РеквизитДопПараметров.Представление];
			
			ИмяРеквизита = РеквизитДопПараметров.Представление;
			ЭтоПроверяемыйРеквизит = Не ПроверяемыеРеквизитыДопПараметров.НайтиПоЗначению(ИмяРеквизита) = Неопределено;
			Если ЭтоПроверяемыйРеквизит И Не ЗначениеЗаполнено(ПараметрСохраненияЗначение) Тогда
				Продолжить;	
			КонецЕсли;
			
			СтруктураСохраненияПараметров = Новый Структура();
			СтруктураСохраненияПараметров.Вставить("Ключ", ПараметрСохраненияКлюч);
			СтруктураСохраненияПараметров.Вставить("Значение", ПараметрСохраненияЗначение);
			
			МассивДопПараметров.Добавить(СтруктураСохраненияПараметров);
			
		КонецЦикла;
		
		Если МассивДопПараметров.Количество() Тогда
			Возврат ЗначениеВСтрокуВнутр(МассивДопПараметров);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти
