
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ККСНГ_ПодключаемыеМодулиКлиент.РаботаСПодключаемымиМодулямиДоступна() Тогда 
		
		ОткрытьФорму("Обработка.ККСНГ_ЗагрузкаДокументов.Форма.Форма", 
							, 
							ПараметрыВыполненияКоманды.Источник, 
							ПараметрыВыполненияКоманды.Уникальность, 
							ПараметрыВыполненияКоманды.Окно, 
							ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
