
#Область ПрограммныйИнтерфейс

// Проверяет доступность работы с подключаемыми модулями
//
// Возвращаемое значение:
//   Булево - Результат проверки
//
Функция РаботаСПодключаемымиМодулямиДоступна() Экспорт
	
	Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбновлятьПодключаемыеМодули() Тогда
		
		РезультатПроверки = ККСНГ_ПодключаемыеМодулиВызовСервера.ПроверитьНеобходимостьОбновленияПодключаемыхМодулей();
		
		Если Не РезультатПроверки.Успех Тогда
			ОткрытьФорму("ОбщаяФорма.ККСНГ_ОбновлениеПодключаемыхМодулей", , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли
		
	Иначе
		РезультатПроверки = Новый Структура("Успех", Истина);
	КонецЕсли;
	
	Попытка
		ККСНГ_МашиночитаемыеДоверенностиВызовСервера.ПеренестиМашиночитаемыеДоверенностиИзНастроекВСправочник();
	Исключение
	КонецПопытки;
	
	Возврат РезультатПроверки.Успех;
	
КонецФункции

#КонецОбласти