#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция УстановитьЗначенияСвойств(Объект, ОрганизацияЭДО, ЗначенияСвойств, Дополнять = Истина) Экспорт
	
	Перем Ответ;
	Перем МенеджерЗаписи, ОписаниеОшибки;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Объект;
		МенеджерЗаписи.ПрофильЭДООрганизации = ОрганизацияЭДО;
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.Объект) Тогда
			ОписаниеОшибки = СтрШаблон("Несовместимый тип объекта: %1", ТипЗнч(Объект));
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось записать значения свойств объекта", "PR-0012", ОписаниеОшибки);
		КонецЕсли;
		
		Если Дополнять Тогда
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Объект = Объект;
			МенеджерЗаписи.ПрофильЭДООрганизации = ОрганизацияЭДО;
		КонецЕсли;
		
		Если ЗначенияСвойств <> Неопределено Тогда
			
			Если ТипЗнч(ЗначенияСвойств) = Тип("Структура") Или ТипЗнч(ЗначенияСвойств) = Тип("ФиксированнаяСтруктура") Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначенияСвойств);
			КонецЕсли;
			
			МенеджерЗаписи.Объект = Объект;
			МенеджерЗаписи.ПрофильЭДООрганизации = ОрганизацияЭДО;
			МенеджерЗаписи.Записать(Истина);
			
		Иначе
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
		Ответ.Успех = Истина;
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось записать значения свойств объекта", "PR-0013", ОписаниеОшибки, Объект);
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецЕсли