#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем СпособАвторизацииОрганизации;
	
	СпособАвторизацииОрганизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СпособАвторизацииОрганизации");
	Если СтрСравнить(СпособАвторизацииОрганизации, "Токен Cбербанка") = 0 Тогда
		ЭтотОбъект.СпособВыбораСертификата = "Токен";
	Иначе
		ЭтотОбъект.СпособВыбораСертификата = "Сертификат";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Перем ПослеВыбораСертификата, Параметры;
	
	ПослеВыбораСертификата = Новый ОписаниеОповещения("ПослеВыбораСертификата", ЭтотОбъект);
	
	Если СтрСравнить(ЭтотОбъект.СпособВыбораСертификата, "Сертификат") = 0 Тогда
		
		Параметры = Новый Структура("РежимВыбора", Истина);
		ОткрытьФорму("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.ФормаВыбора", Параметры, ЭтотОбъект, , , , ПослеВыбораСертификата, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли СтрСравнить(ЭтотОбъект.СпособВыбораСертификата, "Токен") = 0 Тогда
		
		Параметры = Новый Структура();
		Параметры.Вставить("ПослеВыбораСертификата", ПослеВыбораСертификата);
		Параметры.Вставить("ОписаниеОповещенияЗавершения", Неопределено);
		Параметры.Вставить("ОтборСертификатов", Неопределено);
		
		ККСНГ_VPNKeyTLSКлиент.НачатьИнициализациюУстройства(Неопределено, Параметры);
		
	Иначе
		
		ОткрытьФорму("Справочник.ККСНГ_МашиночитаемыеДоверенности.Форма.ФормаВводаСертификата", , ЭтотОбъект, , , , ПослеВыбораСертификата, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораСертификата(ВыбранныйСертификат, ДополнительныеПараметры) Экспорт
	
	Перем Сертификат, СертификатЭП;
	
	Если ТипЗнч(ВыбранныйСертификат) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") И Не ВыбранныйСертификат.Пустая() Тогда
		
		Сертификат = ВыбранныйСертификат;
		
	ИначеЕсли ТипЗнч(ВыбранныйСертификат) = Тип("Структура") И ВыбранныйСертификат.Свойство("Контекст") Тогда // Данные сертификата если это токен Сбербанка
		
		Сертификат = Новый Структура("Наименование, Отпечаток, СертификатСсылка");
		
		СертификатЭП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранныйСертификат.Контекст, "СертификатЭП");
		
		Сертификат.Наименование = СертификатЭП.ОбщееИмя;
		Сертификат.Отпечаток = СертификатЭП.Отпечаток;
		
	ИначеЕсли ТипЗнч(ВыбранныйСертификат) = Тип("Структура") Тогда // Данные сертификата если это ручной ввод
		
		Сертификат = Новый Структура("Наименование, Отпечаток, СертификатСсылка");
		
		Сертификат.Наименование = ВыбранныйСертификат.Наименование;
		Сертификат.Отпечаток = ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьСимволыИзСтроки(ВРег(ВыбранныйСертификат.Отпечаток), " ");
		
	Иначе
		
		Сертификат = Неопределено;
		
	КонецЕсли;
	
	ЭтотОбъект.Закрыть(Сертификат);
	
КонецПроцедуры

#КонецОбласти