
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Строка(Организация);
		
	Если НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ОрганизацияДоступнаПользователю(Организация) Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		СкладСсылка = Неопределено;
		Если ДополнительныеСвойства.Свойство("Склад", СкладСсылка) Тогда
			Склад = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойства(СкладСсылка);
		КонецЕсли;	
	КонецЕсли;	
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли