#Область ПрограммныйИнтерфейс

// Запуск процесса авторизации в ЛКК
//
// Параметры:
// 	Контекст - Структура, Неопределено 		  
// 	ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения после завершения процесса авторизации ЛКК 		  
// 	ОтборСертификатов - Структура - Описание см. ККСНГ_ДокументооборотКлиент.ПолучитьОтборСертификатовКорус 		  
//
Процедура НачатьАвторизациюЛКК(Контекст, ОписаниеОповещенияЗавершения, ОтборСертификатов = Неопределено) Экспорт 
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершения", ОписаниеОповещенияЗавершения);
	ДополнительныеПараметры.Вставить("ОтборСертификатов", ОтборСертификатов);
	
	ПослеВыбораСертификата = Новый ОписаниеОповещения("ПродолжитьАвторизациюЛКК", ЭтотОбъект, ДополнительныеПараметры);
	
	ДополнительныеПараметры.Вставить("ПослеВыбораСертификата", ПослеВыбораСертификата);
	
	ККСНГ_VPNKeyTLSКлиент.НачатьИнициализациюУстройства(Контекст, ДополнительныеПараметры);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик описания оповещения начачала авторизации в ЛКК
//
// Параметры:
// 	ПараметрыСессии - Структура - содержит:
//		* Контекст - Структура - Контекст авторизации
// 		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//										 после завершения процесса авторизации ЛКК 		  
//	ДопПараметры - Структура - содержит:
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Обработчик выполнения, в случае не успеха
// 		* ОтборСертификатов - Структура - Описание см. ККСНГ_ДокументооборотКлиент.ПолучитьОтборСертификатовКорус 		  
//
Процедура ПродолжитьАвторизациюЛКК(ПараметрыСессии, ДопПараметры = Неопределено) Экспорт
	
	Ответ = ККСНГ_VPNKeyTLSКлиент.ПолучитьСтруктуруОтвета();
	
	ОписаниеОповещенияЗавершения	= ДопПараметры.ОписаниеОповещенияЗавершения;
	Контекст  						= ПараметрыСессии.Контекст;
	ОтборСертификатов 				= ДопПараметры.ОтборСертификатов; 
	
	// auth/session - Создание первичной сессии авторизации
	ЗапросHTTP = AUTH_SESSION("lkk_sbbol1_token");
		
	Если НЕ ЗапросHTTP.Успех Тогда
		Ответ.ОписаниеОшибки = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросHTTP.Журнал);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат; 
	КонецЕсли;
	
	ПараметрыСессии.Вставить("Cookie", ЗапросHTTP.Результат.Заголовки["Set-Cookie"]);
		                                                              
	ТелоОтвета = ЗапросHTTP.Результат.ПолучитьТелоКакСтроку();
	РезультатЗапроса = ДанныеИзJSON(ТелоОтвета);
	
	Если НЕ РезультатЗапроса.Успех Тогда
		Ответ.ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;
	
	// Формирование требуемых данных для авторизационного подписания 
	ДанныеДляПодписи = СформироватьДвоичныеДанныеДляАвторизационнойПодписи(РезультатЗапроса.Результат);
			
	ЗавершитьАвторизациюЛКК = Новый ОписаниеОповещения("ЗавершитьАвторизациюЛКК", ЭтотОбъект, ПараметрыСессии);
	
	ЗаголовокОперации = "Авторизация в сервисе электронный документооборот";
	ККСНГ_VPNKeyTLSКлиент.НачатьПодписание(Контекст, ДанныеДляПодписи, ЗавершитьАвторизациюЛКК, 
												Истина, ЗаголовокОперации, ОтборСертификатов);

КонецПроцедуры

// Обработчик описания оповещения после авторизации в ЛКК
//
// Параметры:
//  РезультатПодписания - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//	ДопПараметры - Структура - содержит:
// 		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика после завершения процесса авторизации ЛКК 		  
//		* Cookie - Строка - Значение куки из заголовка Set-Cookie
//		* Контекст - Структура - Контекст авторизации
//
Процедура ЗавершитьАвторизациюЛКК(РезультатПодписания, ДопПараметры) Экспорт
	
	ОписаниеОповещенияЗавершения	= ДопПараметры.ОписаниеОповещенияЗавершения;
	Cookie 							= ДопПараметры.Cookie;
	Контекст 						= ДопПараметры.Контекст;
	
	Если НЕ РезультатПодписания.Успех Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, РезультатПодписания);
		Возврат;                                                        
	КонецЕсли;
	
	Ответ = ККСНГ_VPNKeyTLSКлиент.ПолучитьСтруктуруОтвета();
	
	// POST auth/authPac - Получает на вход пакет авторизации и возвращает список пользователей
	ЗапросHTTP = AUTH_AUTHPAC(Cookie, РезультатПодписания.Результат);
		
	Если НЕ ЗапросHTTP.Успех Тогда
		Ответ.ОписаниеОшибки = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросHTTP.Журнал);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат; 
	КонецЕсли;
		
	ТелоОтвета = ЗапросHTTP.Результат.ПолучитьТелоКакСтроку();
	РезультатЗапроса = ДанныеИзJSON(ТелоОтвета);	
	
	Если РезультатЗапроса.Успех Тогда
		СписокПользователей = РезультатЗапроса.Результат;
		
		Если СписокПользователей.Количество() > 0 Тогда 
			ИДПользователяЛКК = СписокПользователей[0].uid;		
		Иначе
			Ответ.ОписаниеОшибки = "Ошибка авторизации в сервисе электронный документооборот: попробуйте выбрать другой сертификат ЭП.";
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
			Возврат;
		КонецЕсли;	
	Иначе
		Ответ.ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;
	
	// POST auth/login - Получает на вход пакет авторизации и возвращает список пользователей	
	ЗапросHTTP = AUTH_LOGIN(Cookie, ИДПользователяЛКК);
		
	Если НЕ ЗапросHTTP.Успех Тогда
		Ответ.ОписаниеОшибки = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(ЗапросHTTP.Журнал);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;
	
	ТелоОтвета = ЗапросHTTP.Результат.ПолучитьТелоКакСтроку();
	РезультатЗапроса = ДанныеИзJSON(ТелоОтвета);
	 
	Если РезультатЗапроса.Успех Тогда	
		
		AuthCookie = ЗапросHTTP.Результат.Заголовки["Set-Cookie"];
					
		Если ЗначениеЗаполнено(AuthCookie) Тогда
						
			Контекст.AuthCookie = AuthCookie; 
			Ответ.Результат = Новый Структура("КонтекстТокена", Контекст);
			Ответ.Успех = Истина;
		Иначе
			Ответ.ОписаниеОшибки = "Ошибка авторизации.";	
		КонецЕсли;	
		
	Иначе
		Ответ.ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	КонецЕсли;	
			
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		         
КонецПроцедуры

#Область APIЛКК

// Создание первичной сессии авторизации (auth/session)
//
// Параметры:
//   realm - Строка - Ключ сессии
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//   
Функция AUTH_SESSION(realm) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапросаЛКК("GET", "/auth/session");								                            	
	СтруктураЗапроса.Параметры.Вставить("realm", realm);	
		
	Возврат ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
	
КонецФункции

// Получает на вход пакет авторизации и возвращает список пользователей (auth/authPac)
//
// Параметры:
//   Cookie - Строка - Куки сессии
//   РезультатПодписания - ДвоичныеДанные - Данные подписания
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//   
Функция AUTH_AUTHPAC(Cookie, РезультатПодписания) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапросаЛКК("POST", "/auth/authPac");		
		
	СтруктураЗапроса.Заголовки.Вставить("Cookie", Cookie);
	
	СтруктураЗапроса.Тело = Base64Строка(РезультатПодписания);
	СтруктураЗапроса.Тело = СтрЗаменить(СтруктураЗапроса.Тело, Символы.ВК, "");
	СтруктураЗапроса.Тело = СтрЗаменить(СтруктураЗапроса.Тело, Символы.ПС, "");	
			
	Возврат ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
	
КонецФункции

// Получает на вход пакет авторизации и возвращает список пользователей (auth/login)
//
// Параметры:
//   Cookie - Строка - Куки сессии
//   ИДПользователяЛКК - Строка - Идентификатор пользователя ЛКК
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//   
Функция AUTH_LOGIN(Cookie, ИДПользователяЛКК) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапросаЛКК("POST", "/auth/login");		
	
	СтруктураЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	СтруктураЗапроса.Заголовки.Вставить("Cookie", Cookie);
	
	ДанныеЗапроса = Новый Структура("uid", ИДПользователяЛКК);
	СтруктураЗапроса.Тело = СтрокаJSON(ДанныеЗапроса);
			
	Возврат ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьДвоичныеДанныеДляАвторизационнойПодписи(Знач ДанныеДляПодписи)

	ТекМомент = (УниверсальноеВремя(ТекущаяДата()) - '19700101') * 1000;
	ДанныеДляПодписи = ДанныеДляПодписи + ":" + XMLСтрока(ТекМомент);
	Base64СтрокаАдреса = ПолучитьBase64СтрокуИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзСтроки("https://courier-api.esphere.ru"));
	ДанныеДляПодписи = ДанныеДляПодписи + ":" + Base64СтрокаАдреса;  
	
	Возврат ПолучитьДвоичныеДанныеИзСтроки(ДанныеДляПодписи);
	
КонецФункции

#Область ПарсингJSON

Функция СтрокаJSON(ЗаписываемыеДанные)
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, ЗаписываемыеДанные);
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ДанныеИзJSON(СтрокаJSON)
	
	Ответ = ККСНГ_VPNKeyTLSКлиент.ПолучитьСтруктуруОтвета();
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ПолученныеДанные = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	ПрефиксОписанияОшибки = "Авторизация в сервисе электронный документооборот: ";
	
	Если ТипЗнч(ПолученныеДанные) = Тип("Структура") Тогда
		Успех = Неопределено;
		ПолученныеДанные.Свойство("ok", Успех);
		
		ОписаниеОшибки = Неопределено;
		ПолученныеДанные.Свойство("error", ОписаниеОшибки);
				
		Если Успех = Неопределено Тогда
			Ответ.ОписаниеОшибки = ПрефиксОписанияОшибки + "В ответе запроса отсутствует обязательное поле ""ok""";
		ИначеЕсли НЕ Успех Тогда
			Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ОписаниеОшибки = "Ошибка выполнения запроса";
			КонецЕсли;	
			
			Ответ.ОписаниеОшибки = ПрефиксОписанияОшибки + ОписаниеОшибки;
		Иначе  
			
			Результат = Неопределено;			
			Если ПолученныеДанные.Свойство("data", Результат) Тогда
				Ответ.Успех = Истина;
				Ответ.Результат = Результат;
			Иначе 
				Ответ.ОписаниеОшибки = ПрефиксОписанияОшибки + "В ответе запроса отсутствует обязательное поле ""data""";	
			КонецЕсли;				
		КонецЕсли;		
	Иначе	
		Ответ.ОписаниеОшибки = ПрефиксОписанияОшибки + "Ошибка десериализации ответа на запрос";
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
	
#КонецОбласти

#Область APIЛКК

Функция ПолучитьАдресЛКК()
	
	Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим() Тогда
		АдресРесурса = "https://sso-pp.esphere.ru/cas";
	Иначе // Адрес продуктива
		АдресРесурса = "https://sso.esphere.ru/cas";
	КонецЕсли;
	
	Возврат АдресРесурса;
	
КонецФункции

Функция ПолучитьСтруктуруЗапросаЛКК(Метод, АдресМетода = "")
	                                                                          
	СтруктураЗапроса = ККСНГ_ТранспортHTTPКлиентСервер.ПолучитьСтруктуруЗапроса();
	
	СтруктураЗапроса.Метод = Метод;
	СтруктураЗапроса.Адрес = ПолучитьАдресЛКК() + АдресМетода;
	
	ККСНГ_ТранспортHTTPКлиентСервер.ЗаполнитьПараметрыПрокси(СтруктураЗапроса);
	
	Возврат СтруктураЗапроса;        
	                                                                             
КонецФункции

#КонецОбласти

#КонецОбласти