
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПроверитьБезопасныйРежим(Отказ);
	ЭтаФорма.ПодключитьОбработчикОжидания("ОбработчикОжидания", 2, Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если Элемент = ЭтаФорма.Элементы.НадоПерезагрузитьДействие Тогда
		СтандартнаяОбработка = Ложь;
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОжидания() Экспорт

	ПроверитьБезопасныйРежим(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьБезопасныйРежим(Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
