#Область ПрограммныйИнтерфейс

// Формирует печатную форму счета на основании данных электронного документа
// и возвращает заполненную печатную форму счета
//
// Параметры:
//   ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Описание параметра
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - ТабличныйДокумент - Сформированная и заполненная печатная форма
//      	
//
Функция ПолучитьТабличныйДокументСчета(ЭлектронныйДокумент) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Печать счета ЭД " + Строка(ЭлектронныйДокумент.id));
	
	// Сбор данных
	Попытка 
		ПрисоединенныйФайлДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьОбъектПрисоединенныйФайл(0, ЭлектронныйДокумент);	
		XMLДокумента = ПолучитьСтрокуИзДвоичныхДанных(ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ПрисоединенныйФайлДокумента), "windows-1251");	
		ОбXDTO = ККСНГ_APIКурьер.ПолучитьОбъектXDTO(XMLДокумента, "KKSNG_BILL", "Файл");	
		СтруктураСчета = ККСНГ_APIКурьер.ПолучитьСтруктуруПоОбъектуXDTO(ОбXDTO);
	Исключение
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки(), "PR-00001");
		Ответ.Результат = Новый ТабличныйДокумент();
		Возврат Ответ;
	КонецПопытки;
		
	// Подготовка данных
	СписокРеквизитов = ПолучитьСписокРеквизитовСчета();
	
	// Реквизиты шапки
	ОбработатьРеквизитыШапкиСчета(СписокРеквизитов, СтруктураСчета);
	
	// Строки товаров
	СтрокиСведТов = ОбработатьИПолучитьСведенияОТоварахСчета(СтруктураСчета);
	
	// Дополнительные реквизиты
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("СтрокиСведТов", СтрокиСведТов);
	ПараметрыОбработки.Вставить("ИдентификаторЭД", ЭлектронныйДокумент.id);
	
	ОбработатьДополнительныеРеквизитыСчета(СписокРеквизитов, ПараметрыОбработки);
	
	// Печать		
	ТабДокумент = Новый ТабличныйДокумент;	
	МакетСчета =  ПолучитьОбщийМакет("ККСНГ_ПФ_Счет");
		
	// Заголовок
	ОбластьЗаголовок = МакетСчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заполнить(СписокРеквизитов);
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	// Строки
	Для Каждого Элем из СтрокиСведТов Цикл
		
		ОбластьСтрока = МакетСчета.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(Элем);
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	// Подвал
	ОбластьПодвал = МакетСчета.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(СписокРеквизитов);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.РазмерСтраницы = "A4";  
    ТабДокумент.АвтоМасштаб  = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Ответ.Результат = ТабДокумент;
	Ответ.Успех = Истина;
		
	Возврат Ответ;
	
КонецФункции

// Формирует печатную форму счета по бизнес-процессу ЭДО с поставщиками (УВХД) на основании данных электронного документа
// и возвращает заполненную печатную форму счета
//
// Параметры:
//   ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныеДокументы - Описание параметра
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - ТабличныйДокумент - Сформированная и заполненная печатная форма
//      	
//
Функция ПолучитьТабличныйДокументСчетаУВХД(ЭлектронныйДокумент) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Печать счета ЭД " + Строка(ЭлектронныйДокумент.id));
	
	// Сбор данных
	Попытка 
		ПрисоединенныйФайлДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьОбъектПрисоединенныйФайл(0, ЭлектронныйДокумент);	
		XMLДокумента = ПолучитьСтрокуИзДвоичныхДанных(ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ПрисоединенныйФайлДокумента), "windows-1251");	
		XMLДокумента = СтрЗаменить(XMLДокумента, "xml:lang=", "lang=");
		ОбXDTO = ККСНГ_APIКурьер.ПолучитьОбъектXDTO(XMLДокумента, "KKSNG_BILL_UVHD", "Request");	
		СтруктураСчета = ККСНГ_APIКурьер.ПолучитьСтруктуруПоОбъектуXDTO(ОбXDTO);
	Исключение
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки(), "PR-00001");
		Ответ.Результат = Новый ТабличныйДокумент();
		Возврат Ответ;
	КонецПопытки;
		
	// Подготовка данных
	СписокРеквизитов = ПолучитьСписокРеквизитовСчетаУВХД();
	
	// Реквизиты шапки
	ОбработатьРеквизитыШапкиСчетаУВХД(СписокРеквизитов, СтруктураСчета);
	
	// Строки товаров
	СтрокиСведТов = ОбработатьИПолучитьСведенияОТоварахСчетаУВХД(СтруктураСчета);
	
	// Итоги
	ОбработатьРеквизитыИтоговСчетаУВХД(СписокРеквизитов, СтруктураСчета);
	
	// Дополнительные реквизиты
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("СтрокиСведТов", СтрокиСведТов);
	ПараметрыОбработки.Вставить("ИдентификаторЭД", ЭлектронныйДокумент.id);
	
	ОбработатьДополнительныеРеквизитыСчетаУВХД(СписокРеквизитов, ПараметрыОбработки);
	
	// Печать		
	ТабДокумент = Новый ТабличныйДокумент;	
	МакетСчета =  ПолучитьОбщийМакет("ККСНГ_ПФ_Счет");
		
	// Заголовок
	ОбластьЗаголовок = МакетСчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заполнить(СписокРеквизитов);
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	// Строки
	Для Каждого Элем из СтрокиСведТов Цикл
		
		ОбластьСтрока = МакетСчета.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(Элем);
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	// Подвал
	ОбластьПодвал = МакетСчета.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(СписокРеквизитов);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.РазмерСтраницы = "A4";  
    ТабДокумент.АвтоМасштаб  = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Ответ.Результат = ТабДокумент;
	Ответ.Успех = Истина;
		
	Возврат Ответ;
	
КонецФункции

Функция КопируемыеСвойстваТабличногоДокумента() Экспорт
	
	Возврат "АвтоМасштаб,Вывод,ВысотаСтраницы,ДвусторонняяПечать,Защита,ИмяПринтера,КодЯзыка,
	|КоличествоЭкземпляров,МасштабПечати,НомерПервойСтраницы,ОриентацияСтраницы,ПолеСверху,ПолеСлева,
	|ПолеСнизу,ПолеСправа,РазборПоКопиям,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,РазмерСтраницы,
	|ТочностьПечати,ФоноваяКартинка,ЧерноБелаяПечать,ШиринаСтраницы,ЭкземпляровНаСтранице";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоставнойАдрес(СтруктураПараметров)
	
	СтрРез = "";
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
	
		Для Каждого Свойство ИЗ СтруктураПараметров Цикл
			
			Если НЕ ЗначениеЗаполнено(Свойство.Значение) Тогда
				Продолжить;
			Иначе
				ЗначениеСвойства = "";
			КонецЕсли;

			ЗначениеСвойства = ЗначениеСвойства(Свойство);
			
			Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
				СтрРез = ?(ЗначениеЗаполнено(СтрРез), СтрРез + ", ", "") + ЗначениеСвойства;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрРез;
	
КонецФункции

Функция ЗначениеСвойства(Свойство)

	ЗначениеСвойства = "";
	
	Если Свойство.Ключ = "Индекс" Тогда
		ЗначениеСвойства = Свойство.Значение;
	ИначеЕсли Свойство.Ключ = "КодРегион" Тогда
		ЗначениеСвойства = НазваниеРегиона(Свойство.Значение);
	ИначеЕсли Свойство.Ключ = "КодСтр" Тогда
		ЗначениеСвойства = ПредставлениеСтраны(Свойство.Значение);
	Иначе
		ЗначениеСвойства = "";
		Если Свойство.Ключ = "Дом" Тогда
			ЗначениеСвойства = "дом № ";
		ИначеЕсли Свойство.Ключ = "Корпус" Тогда
			ЗначениеСвойства = "корпус ";
		ИначеЕсли Свойство.Ключ = "Кварт" Тогда
			ЗначениеСвойства = "кв. ";
		КонецЕсли;
		ЗначениеСвойства = ЗначениеСвойства + Свойство.Значение;
	КонецЕсли;	
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Функция НазваниеРегиона(КодРегиона) 
	
	СокращениеАдреса = "";
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	КодРегионаКакЧисло = ОписаниеТипаЧисло.ПривестиЗначение(КодРегиона);
	
	Если КодРегионаКакЧисло = 0 Тогда
		Возврат Неопределено;
	Иначе	
		КодРегионаЧисло = КодРегионаКакЧисло;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.АдресныеОбъекты;
	
	Если ОбъектМетаданных.Реквизиты.Найти("Сокращение") <> Неопределено Тогда
		СокращениеАдреса = "АдресныеОбъекты.Сокращение";
	ИначеЕсли ОбъектМетаданных.Реквизиты.Найти("ТипОбъекта") <> Неопределено Тогда
		СокращениеАдреса = "АдресныеОбъекты.ТипОбъекта";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АдресныеОбъекты.Наименование КАК ПолноеНаименование
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|ГДЕ
	|	АдресныеОбъекты.КодСубъектаРФ = &КодРегиона
	| И АдресныеОбъекты.Уровень = 1";
	
	Запрос.Параметры.Вставить("КодРегиона", КодРегионаЧисло);
	Запрос.Текст = ТекстЗапроса;

	Если ЗначениеЗаполнено(СокращениеАдреса) Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "АдресныеОбъекты.Наименование", СокращениеАдреса + "+ "" "" + " + "АдресныеОбъекты.Наименование");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.ПолноеНаименование);
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ПредставлениеСтраны(КодСтраны)
	
	ДанныеСтраны = УправлениеКонтактнойИнформацией.ДанныеСтраныМира(КодСтраны);
	
	Представление = Неопределено;
	Если ТипЗнч(ДанныеСтраны) = Тип("Структура") Тогда 
		ДанныеСтраны.Свойство("Наименование", Представление);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = КодСтраны;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПолучитьСписокРеквизитовСчета()
	
	// Реквизиты
	СписокРеквизитов = Новый Структура();
	
	// Заголовок
	СписокРеквизитов.Вставить("Номер",	"Документ.СвСч.НомерСч");
	СписокРеквизитов.Вставить("Дата",	"Документ.СвСч.ДатаСч");
	СписокРеквизитов.Вставить("Валюта",	"Документ.СвСч.КодОКВ");

	СписокРеквизитов.Вставить("Продавец",			"Документ.СвСч.СвПрод.ИдСв.СвЮЛ.НаимОрг");
	СписокРеквизитов.Вставить("ПродавецФамилия",	"Документ.СвСч.СвПрод.ИдСв.СвФЛ.ФИОИП.Фамилия");
	СписокРеквизитов.Вставить("ПродавецИмя",		"Документ.СвСч.СвПрод.ИдСв.СвФЛ.ФИОИП.Имя");
	СписокРеквизитов.Вставить("ПродавецОтчество", 	"Документ.СвСч.СвПрод.ИдСв.СвФЛ.ФИОИП.Отчество");
	СписокРеквизитов.Вставить("АдресПродавца",		"");
	СписокРеквизитов.Вставить("АдресПродавцаРФ",	"Документ.СвСч.СвПрод.Адрес.АдрРФ");
	СписокРеквизитов.Вставить("АдресПродавцаИно",	"Документ.СвСч.СвПрод.Адрес.АдрИно");
	
	СписокРеквизитов.Вставить("Плательщик",			"Документ.СвСч.СвПокуп.ИдСв.СвЮЛ.НаимОрг");
	СписокРеквизитов.Вставить("ПлательщикФамилия",	"Документ.СвСч.СвПокуп.ИдСв.СвФЛ.ФИОИП.Фамилия");
	СписокРеквизитов.Вставить("ПлательщикИмя",		"Документ.СвСч.СвПокуп.ИдСв.СвФЛ.ФИОИП.Имя");
	СписокРеквизитов.Вставить("ПлательщикОтчество",	"Документ.СвСч.СвПокуп.ИдСв.СвФЛ.ФИОИП.Отчество");
	СписокРеквизитов.Вставить("АдресПлательщика",	"");
	СписокРеквизитов.Вставить("АдресПлательщикаРФ",	"Документ.СвСч.СвПокуп.Адрес.АдрРФ");
	СписокРеквизитов.Вставить("АдресПлательщикаИно", "Документ.СвСч.СвПокуп.Адрес.АдрИно");
			
	СписокРеквизитов.Вставить("ИННПолучателя",		"Документ.СвСч.СвПрод.ИдСв.СвЮЛ.ИННЮЛ");
	СписокРеквизитов.Вставить("ИННПолучателяФЛ",	"Документ.СвСч.СвПрод.ИдСв.СвФЛ.ИННФЛ");
	СписокРеквизитов.Вставить("КПППолучателя",		"Документ.СвСч.СвПрод.ИдСв.СвЮЛ.КПП");
	//СписокРеквизитов.Вставить("Получатель",			"Документ.СвСч.СвПрод.ИдСв.СвЮЛ.НаимОрг");
	
	СписокРеквизитов.Вставить("БанкПолучателя",		"Документ.СвСч.РеквПрод.Банк.НаимБанк");
	СписокРеквизитов.Вставить("РСПолучателя",		"Документ.СвСч.РеквПрод.Счет");
	СписокРеквизитов.Вставить("БИК",				"Документ.СвСч.РеквПрод.Банк.БИК");
	СписокРеквизитов.Вставить("КСБанкаПолучателя",	"Документ.СвСч.РеквПрод.Банк.Счет");	
	
	// Подвал	
	СписокРеквизитов.Вставить("ИтогоБезНДС",	"Документ.ТаблСч.ВсегоОпл.СтТовБезНДСВсего");
	СписокРеквизитов.Вставить("ИтогоНДС",		"Документ.ТаблСч.ВсегоОпл.СумНалВсего.СумНДС");
	СписокРеквизитов.Вставить("ИтогоСНДС",		"Документ.ТаблСч.ВсегоОпл.СтТовУчНалВсего");
	
	Возврат СписокРеквизитов;
	
КонецФункции

Процедура ОбработатьРеквизитыШапкиСчета(СписокРеквизитов, СтруктураСчета)
	
	Для Каждого Реквизит Из СписокРеквизитов Цикл	
		
		Если МожноЗаполнитьРеквизит(СписокРеквизитов, "АдресПродавца", Реквизит.Ключ) Тогда 
			ПоляАдреса = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСчета, Реквизит.Значение);
			СписокРеквизитов["АдресПродавца"] = СоставнойАдрес(ПоляАдреса);
		ИначеЕсли МожноЗаполнитьРеквизит(СписокРеквизитов, "АдресПлательщика", Реквизит.Ключ) Тогда 
			ПоляАдреса = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСчета, Реквизит.Значение);
			СписокРеквизитов["АдресПлательщика"] = СоставнойАдрес(ПоляАдреса);
		ИначеЕсли Реквизит.Ключ = "Валюта" Тогда
			КодОКВ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСчета, Реквизит.Значение, "643");			
			СписокРеквизитов[Реквизит.Ключ] = Справочники.Валюты.НайтиПоКоду(КодОКВ);						
		Иначе
			СписокРеквизитов[Реквизит.Ключ] = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСчета, Реквизит.Значение);
		КонецЕсли;
		
	КонецЦикла;	

	Если НЕ ЗначениеЗаполнено(СписокРеквизитов["Продавец"]) Тогда
		СписокРеквизитов["Продавец"] = "Индивидуальный предприниматель "
					+ СписокРеквизитов["ПродавецФамилия"] + " " + СписокРеквизитов["ПродавецИмя"] + " " + СписокРеквизитов["ПродавецОтчество"];		
	КонецЕсли;
	СписокРеквизитов.Вставить("Получатель", СписокРеквизитов["Продавец"]);
	
	Если НЕ ЗначениеЗаполнено(СписокРеквизитов["Плательщик"]) Тогда
		СписокРеквизитов["Плательщик"] = "ИП " + СписокРеквизитов["ПлательщикФамилия"]
					+ " " + СписокРеквизитов["ПлательщикИмя"] + " " + СписокРеквизитов["ПлательщикОтчество"];		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СписокРеквизитов["ИННПолучателя"]) Тогда
		СписокРеквизитов["ИННПолучателя"] = СписокРеквизитов["ИННПолучателяФЛ"];		
	КонецЕсли;
	
КонецПроцедуры

Функция МожноЗаполнитьРеквизит(СписокРеквизитов, ИмяРеквизита, ПроверяемоеИмя)
	
	ЭтоЗначениеРеквизита = СтрНайти(ПроверяемоеИмя, ИмяРеквизита) > 0;
	РеквизитПустой = НЕ ЗначениеЗаполнено(СписокРеквизитов[ИмяРеквизита]);
	Возврат ЭтоЗначениеРеквизита И РеквизитПустой;
	
КонецФункции

Функция ОбработатьИПолучитьСведенияОТоварахСчета(СтруктураСчета)
	
	СтрокиСведТов = Новый Массив;
	МассивСтрокСведТов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСчета, "Документ.ТаблСч.СведТов", Новый Массив);
	Для Каждого Элем Из МассивСтрокСведТов Цикл
		
		СведТов = Новый Структура;
		
		СведТов.Вставить("НПП",			"НомСтр");
		СведТов.Вставить("ТоварУслуга",	"НаимТов");
		СведТов.Вставить("Единица",     "ОКЕИ_Тов");
		СведТов.Вставить("Количество",	"КолТов");
		СведТов.Вставить("Цена",		"ЦенаТов");
		СведТов.Вставить("СтавкаНДС",	"НалСт");
		СведТов.Вставить("СуммаБезНДС",	"СтТовБезНДС");
		СведТов.Вставить("Сумма",		"СтТовУчНал");
		СведТов.Вставить("СуммаНДС",    "СумНал.СумНДС");
				
		Для Каждого Тов Из СведТов Цикл	
			СведТов[Тов.Ключ] = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Элем, Тов.Значение);
		КонецЦикла;
		
		Если СведТов.Единица <> Неопределено Тогда
			Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбъектМетаданныхЕстьВКонфигурации("Справочник", "КлассификаторЕдиницИзмерения") Тогда
				СведТов.Единица = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СведТов.Единица);
			ИначеЕсли ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбъектМетаданныхЕстьВКонфигурации("Справочник", "УпаковкиЕдиницыИзмерения") Тогда
				СведТов.Единица = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(СведТов.Единица);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокиСведТов.Добавить(СведТов);
		
	КонецЦикла;
	
	Возврат СтрокиСведТов;
	
КонецФункции

Процедура ОбработатьДополнительныеРеквизитыСчета(СписокРеквизитов, ДополнительныеПараметры = Неопределено)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;			
	КонецЕсли;
	
	СтрокиСведТов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СтрокиСведТов", Новый Массив);	
	ИдентификаторЭД = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИдентификаторЭД", 0);	
	
	СуммаПоДокументу = СписокРеквизитов["ИтогоСНДС"];
	СуммаПоДокументу = ?(ЗначениеЗаполнено(СуммаПоДокументу), СуммаПоДокументу, 0);
	ПараметрыПредметаИсчисления = СписокРеквизитов["Валюта"].ПараметрыПрописи;
	СуммаПрописью = ЧислоПрописью(СуммаПоДокументу,, ПараметрыПредметаИсчисления);
	СписокРеквизитов.Вставить("СуммаПрописью", СуммаПрописью);	
	
	СписокРеквизитов.Вставить("ВсегоПозиций", СтрокиСведТов.Количество());
	СписокРеквизитов.Вставить("ИтогоСНДСФормат",Формат(СуммаПоДокументу, "ЧДЦ=2"));
	СписокРеквизитов.Вставить("ИДДок", Формат(ИдентификаторЭД, "ЧГ="));
	
КонецПроцедуры

#Область СчетУВХД

Функция ПолучитьСписокРеквизитовСчетаУВХД()
	
	// Реквизиты
	СписокРеквизитов = Новый Структура();
	
	// Заголовок
	СписокРеквизитов.Вставить("Номер");
	СписокРеквизитов.Вставить("Дата");
	СписокРеквизитов.Вставить("Валюта");

	СписокРеквизитов.Вставить("Продавец");
	СписокРеквизитов.Вставить("АдресПродавца");
	
	СписокРеквизитов.Вставить("Плательщик");
	СписокРеквизитов.Вставить("АдресПлательщика");
			
	СписокРеквизитов.Вставить("ИННПолучателя");
	СписокРеквизитов.Вставить("КПППолучателя");
	СписокРеквизитов.Вставить("Получатель");
	
	СписокРеквизитов.Вставить("БанкПолучателя");
	СписокРеквизитов.Вставить("РСПолучателя");
	СписокРеквизитов.Вставить("БИК");
	СписокРеквизитов.Вставить("КСБанкаПолучателя");	
	
	// Подвал	
	СписокРеквизитов.Вставить("ИтогоБезНДС");
	СписокРеквизитов.Вставить("ИтогоНДС");
	СписокРеквизитов.Вставить("ИтогоСНДС");
	
	Возврат СписокРеквизитов;
	
КонецФункции

Процедура ОбработатьРеквизитыШапкиСчетаУВХД(СписокРеквизитов, СтруктураСчета)
	
	ДанныеШапки = СтруктураСчета.InvoiceDetailRequest.InvoiceDetailRequestHeader;
	СчетРеквизиты = ДанныеШапки.Extrinsic;
	
	СписокРеквизитов.Номер = ПолучитьЗначениеРеквизитаУВХД(СчетРеквизиты, "Num_invoice");
	СписокРеквизитов.Дата = ПолучитьЗначениеРеквизитаУВХД(СчетРеквизиты, "Date_invoice");
	
	НаименованиеВалютыОКВ = СтруктураСчета.InvoiceDetailRequest.InvoiceDetailSummary.SubtotalAmount.Money.currency;
	СписокРеквизитов.Валюта = Справочники.Валюты.НайтиПоНаименованию(НаименованиеВалютыОКВ);
	
	// Продавец
	ПродавецДанные = ДанныеШапки.InvoicePartner[1].Contact;
	ПродавецРеквизиты = ПродавецДанные.Extrinsic;
	ПродавецНаименование = ПродавецДанные.Name.__content;
	ПродавецИНН = ПолучитьЗначениеРеквизитаУВХД(ПродавецРеквизиты, "INN");
	ПродавецКПП = ПолучитьЗначениеРеквизитаУВХД(ПродавецРеквизиты, "KPP");
	ПродавецБанк = ПолучитьЗначениеРеквизитаУВХД(ПродавецРеквизиты, "NameBank");
	ПродавецБик = ПолучитьЗначениеРеквизитаУВХД(ПродавецРеквизиты, "BIK");
	ПродавецРСчет = ПолучитьЗначениеРеквизитаУВХД(ПродавецРеквизиты, "IBAN");
	
	СписокРеквизитов.ИННПолучателя = ПродавецИНН;
	СписокРеквизитов.КПППолучателя = ПродавецКПП;
	СписокРеквизитов.БанкПолучателя = ПродавецБанк;
	СписокРеквизитов.РСПолучателя = ПродавецРСчет;
	СписокРеквизитов.БИК = ПродавецБик;
	СписокРеквизитов.КСБанкаПолучателя = "";
	СписокРеквизитов.Получатель = ПродавецНаименование;
	Если ЗначениеЗаполнено(ПродавецКПП) Тогда
		СписокРеквизитов.Продавец = СтрШаблон("%1, ИНН %2, КПП %3", ПродавецНаименование, ПродавецИНН, ПродавецКПП);
	Иначе
		СписокРеквизитов.Продавец = СтрШаблон("%1, ИНН %2", ПродавецНаименование, ПродавецИНН);
	КонецЕсли;
	СписокРеквизитов.АдресПродавца = АдресУВХДСтрокой(ПродавецДанные.PostalAddress);
	
	// Покупатель
	ПокупательДанные = ДанныеШапки.InvoicePartner[0].Contact;
	ПокупательРеквизиты = ПокупательДанные.Extrinsic;
	ПокупательНаименование = ПокупательДанные.Name.__content;
	ПокупательИНН = ПолучитьЗначениеРеквизитаУВХД(ПокупательРеквизиты, "INN");
	ПокупательКПП = ПолучитьЗначениеРеквизитаУВХД(ПокупательРеквизиты, "KPP");
	Если ЗначениеЗаполнено(ПокупательКПП) Тогда
		СписокРеквизитов.Плательщик = СтрШаблон("%1, ИНН %2, КПП %3", ПокупательНаименование, ПокупательИНН, ПокупательКПП);
	Иначе
		СписокРеквизитов.Плательщик = СтрШаблон("%1, ИНН %2", ПокупательНаименование, ПокупательИНН);
	КонецЕсли;
	СписокРеквизитов.АдресПлательщика = АдресУВХДСтрокой(ПокупательДанные.PostalAddress);
	
КонецПроцедуры

Функция АдресУВХДСтрокой(СтруктураАдреса)
	
	Индекс = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураАдреса, "PostalCode", "");
	Город = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураАдреса, "City", "");
	Улица = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураАдреса, "Street", "");
	
	Возврат СтрШаблон("%1, %2, %3", Индекс, Город, Улица);	
	
КонецФункции

Функция ПолучитьЗначениеРеквизитаУВХД(МассивДанных, КлючПоиска)
	
	Если Не ТипЗнч(МассивДанных) = Тип("Массив") Тогда
		Возврат Неопределено;		
	КонецЕсли;		
	
	НайденноеЗначение = Неопределено;
	
	Для каждого ДанныеРеквизита Из МассивДанных Цикл
		Если ДанныеРеквизита.name = КлючПоиска Тогда
			НайденноеЗначение = ДанныеРеквизита.__content;	
		КонецЕсли;		
	КонецЦикла;
	
	Возврат НайденноеЗначение;
		
КонецФункции

Функция ОбработатьИПолучитьСведенияОТоварахСчетаУВХД(СтруктураСчета)
	
	СтрокиСведТов = Новый Массив;
	МассивСтрокСведТов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСчета, "InvoiceDetailRequest.InvoiceDetailOrder.InvoiceDetailItem", Новый Массив);
	Для Каждого Элем Из МассивСтрокСведТов Цикл
		
		СведТов = Новый Структура;
		
		СведТов.Вставить("НПП", "invoiceLineNumber");
		СведТов.Вставить("ТоварУслуга", "Distribution.__content");
		СведТов.Вставить("Единица", "UnitOfMeasure");
		СведТов.Вставить("Количество", "quantity");
		СведТов.Вставить("Цена", "UnitPrice.Money.__content");
		СведТов.Вставить("СтавкаНДС", "Tax.Description.__content");
		СведТов.Вставить("СуммаБезНДС", "");
		СведТов.Вставить("Сумма", "SubtotalAmount.Money.__content");
		СведТов.Вставить("СуммаНДС", "Tax.Money.__content");
				
		Для Каждого Тов Из СведТов Цикл	
			СведТов[Тов.Ключ] = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Элем, Тов.Значение);
		КонецЦикла;
		
		СтрокиСведТов.Добавить(СведТов);
		
	КонецЦикла;
	
	Возврат СтрокиСведТов;
	
КонецФункции

Процедура ОбработатьРеквизитыИтоговСчетаУВХД(СписокРеквизитов, СтруктураСчета)
	
	СписокРеквизитов.ИтогоСНДС = СтруктураСчета.InvoiceDetailRequest.InvoiceDetailSummary.SubtotalAmount.Money.__content;
	СписокРеквизитов.ИтогоБезНДС = СтруктураСчета.InvoiceDetailRequest.InvoiceDetailSummary.TotalAmountWithoutTax.Money.__content;
	СписокРеквизитов.ИтогоНДС = СтруктураСчета.InvoiceDetailRequest.InvoiceDetailSummary.Tax.Money.__content;
	
КонецПроцедуры

Процедура ОбработатьДополнительныеРеквизитыСчетаУВХД(СписокРеквизитов, ДополнительныеПараметры = Неопределено)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;			
	КонецЕсли;
	
	СтрокиСведТов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СтрокиСведТов", Новый Массив);	
	ИдентификаторЭД = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИдентификаторЭД", 0);	
	
	СуммаПоДокументу = СписокРеквизитов["ИтогоСНДС"];
	СуммаПоДокументу = ?(ЗначениеЗаполнено(СуммаПоДокументу), СуммаПоДокументу, 0);
	ПараметрыПредметаИсчисления = СписокРеквизитов["Валюта"].ПараметрыПрописи;
	СуммаПрописью = ЧислоПрописью(СуммаПоДокументу,, ПараметрыПредметаИсчисления);
	СписокРеквизитов.Вставить("СуммаПрописью", СуммаПрописью);	
	
	СписокРеквизитов.Вставить("ВсегоПозиций", СтрокиСведТов.Количество());
	СписокРеквизитов.Вставить("ИтогоСНДСФормат",Формат(СуммаПоДокументу, "ЧДЦ=2"));
	СписокРеквизитов.Вставить("ИДДок", Формат(ИдентификаторЭД, "ЧГ="));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти