
#Область ПрограммныйИнтерфейс

#Область Инициализация

// Инициализация контекста авторизазации
//
// Параметры:
// 	Контекст - Произвольный - Переменная контекста после инициализации содержит:
//		* ПрограммаЗапуска - Строка
//		* ФайлURL - Строка
//		* URL - Строка
//		* SID0 - Строка
//		* SID2 - Строка
//		* AuthCookie - Строка
//		* Пользователь - Строка
//		* Пароль - Строка
//		* СертификатЭП - Неопределено
//		* СерийныйНомер - Строка
//		* ВерсияПрошивки - Строка
//		* Кнопка - Булево
//		* Экран - Булево
//		* ПредAuthCookie - Строка
//		* ПредСертификатЭП - Неопределено
//
Процедура ИнициализироватьКонтекст(Контекст) Экспорт
	
	Контекст = Новый Структура;
	
	Контекст.Вставить("ПрограммаЗапуска", "");
	Контекст.Вставить("ФайлURL", "");
	Контекст.Вставить("URL", "");
	Контекст.Вставить("SID0", "");
	Контекст.Вставить("SID2", "");
	Контекст.Вставить("AuthCookie", "");
		
	Контекст.Вставить("Пользователь", "");
	Контекст.Вставить("Пароль", "");
	
	Контекст.Вставить("СертификатЭП");
	
	Контекст.Вставить("СерийныйНомер", "");
	Контекст.Вставить("ВерсияПрошивки", "");
	Контекст.Вставить("Кнопка", Ложь);
	Контекст.Вставить("Экран", Ложь);
	
	Контекст.Вставить("ПредAuthCookie", "");
	Контекст.Вставить("ПредСертификатЭП");
	
КонецПроцедуры

// Инициализация устройства для работы с токеном
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//	ОбработкаПослеИнициализации - ОписаниеОповещения - Описание обработчика оповещения
//			который необходимо выполнить после успешного выполнения инициализации токена
//
Процедура ИнициализироватьУстройство(Контекст, ОбработкаПослеИнициализации) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	// Проверка на клиента
	#Если Не (ТонкийКлиент Или ТолстыйКлиентУправляемоеПриложение) Тогда
		Ответ.ОписаниеОшибки = "Работа с токеном поддерживается только в тонком или толстом клиенте.";
		ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
		Возврат;
	#КонецЕсли
	
	// Проверка на платформу Windows
	ПоддерживаемыеТипыПлатформ = Новый Соответствие;
	ПоддерживаемыеТипыПлатформ.Вставить(ТипПлатформы.Windows_x86,	 Истина);
	ПоддерживаемыеТипыПлатформ.Вставить(ТипПлатформы.Windows_x86_64, Истина);
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Не ПоддерживаемыеТипыПлатформ[СистемнаяИнформация.ТипПлатформы] Тогда
		Ответ.ОписаниеОшибки = "Работа с токеном поддерживается только на платформе Windows.";
		ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
		Возврат;
	КонецЕсли;
	
	Если Контекст = Неопределено Тогда
		ИнициализироватьКонтекст(Контекст);
	КонецЕсли;
		
	ФайлыНайдены = Ложь;
	Если Не ПустаяСтрока(Контекст.ПрограммаЗапуска) И Не ПустаяСтрока(Контекст.ФайлURL) Тогда
		ФайлПрограммаЗапуска = Новый Файл(Контекст.ПрограммаЗапуска);
		ФайлURL = Новый Файл(Контекст.ФайлURL);
		Если ФайлПрограммаЗапуска.Существует() И ФайлURL.Существует() Тогда
			ФайлыНайдены = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Если Не ФайлыНайдены Тогда
		ФайлыНайдены = НайтиКлючевыеФайлыНаУстройстве(Контекст); // Поиск устройства
	КонецЕсли;	
	
	Если Не ФайлыНайдены Тогда
		// Начинаем ожидание токена.
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Контекст", Контекст);
		ДополнительныеПараметры.Вставить("ОбработкаПослеИнициализации", ОбработкаПослеИнициализации);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершениеОжиданияПодключенияТокена",
														ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_ОжиданиеКлюча", , ЭтотОбъект, , , ,
			ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПродолжитьИнициализациюУстройства(Контекст, ОбработкаПослеИнициализации);	
	КонецЕсли;		
		
КонецПроцедуры

// Обработчик оповещения ожидания подключения устройства для работы с токеном
//
// Параметры:
// 	Результат - Неопределено
//			  - УправляемаяФорма - Форма подписания токеном
//	ДополнительныеПараметры - Структура - содержит:
// 		* Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//		* ОбработкаПослеИнициализации - ОписаниеОповещения - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьУстройство
//
Процедура ЗавершениеОжиданияПодключенияТокена(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		// Стандартное оповещени при закрытии окна ожидания, нам оно не интересно
		Возврат;
	КонецЕсли;
	
	Ответ = ПолучитьСтруктуруОтвета();
	ДействиеОтменено = Результат.ДействиеОтменено;
	Контекст = ДополнительныеПараметры.Контекст;
	ОбработкаПослеИнициализации = ДополнительныеПараметры.ОбработкаПослеИнициализации;	
	Если ДействиеОтменено Тогда
		ЗакрытьФормуОжидания(Результат);
		Возврат;
	ИначеЕсли НайтиКлючевыеФайлыНаУстройстве(Контекст) Тогда // Поиск устройства
		ЗакрытьФормуОжидания(Результат);
		ПродолжитьИнициализациюУстройства(Контекст, ОбработкаПослеИнициализации);
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения продолжения инициализации устройства для работы с токеном, если действие не отменено
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//	ОбработкаПослеИнициализации - ОписаниеОповещения - Описание обработчика оповещения
//			который необходимо выполнить после успешного выполнения инициализации токена
//
Процедура ПродолжитьИнициализациюУстройства(Контекст, ОбработкаПослеИнициализации) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	ТекSID0 = Контекст.SID0;
	
	// Получение URL и SID0
	Если Не ПолучитьДанныеSslgate(Контекст) Тогда
		Ответ.ОписаниеОшибки = "Не удалось определить SID0.";
		ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
		Возврат;
	КонецЕсли;
			
	Если Не ПустаяСтрока(ТекSID0) 
		И ТекSID0 <> Контекст.SID0 Тогда // Токен переподключен или вставлен другой токен
		ОчиститьАвторизационныеДанныеТокена(Контекст);
	КонецЕсли;
		
	// GET_SYS_INFO_ID
	Запрос_GET_SYS_INFO_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_SYS_INFO_ID(Контекст.URL, Контекст.SID0);
	
	Если Не Запрос_GET_SYS_INFO_ID.Успех Тогда
		
		Если Запрос_GET_SYS_INFO_ID.Результат.retcode = "0" Тогда
			Попытка
				Shell = Новый COMObject("wScript.Shell");
				Shell.Run("taskkill /f /im start.exe /fi ""username eq %username%""", 0, Истина);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ЗапуститьПриложение(Контекст.ПрограммаЗапуска + " /silent");
			// TODO: реализовать паузу			
		Исключение
			Ответ.ОписаниеОшибки = "Не удалось запустить программу-сервер.";
			ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
			Возврат;
		КонецПопытки;
		
		Запрос_GET_SYS_INFO_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_SYS_INFO_ID(Контекст.URL, Контекст.SID0);
		
	КонецЕсли;
	
	Если Не Запрос_GET_SYS_INFO_ID.Успех Тогда
		Ответ.ОписаниеОшибки = "Не удалось инициализировать устройство VPNKey-TLS. Попробуйте еще раз.";
		ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
		Возврат;
	КонецЕсли;
	
	ТекСерийныйНомер = Запрос_GET_SYS_INFO_ID.Результат.serial;
	Если ПустаяСтрока(ТекСерийныйНомер) Тогда
		Ответ.ОписаниеОшибки = "Не удалось получить информацию об устройстве VPNKey-TLS.";
		ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
		Возврат;	
	КонецЕсли;
	
	Контекст.СерийныйНомер = ТекСерийныйНомер;
		
	// Чтение информации об устройстве		
	ИнформацияКонфигурации = ОбработатьСтрокуDevCfg(Запрос_GET_SYS_INFO_ID.Результат.devcfg);
	
	Контекст.ВерсияПрошивки = ИнформацияКонфигурации["VT"];
	Контекст.Кнопка = (ИнформацияКонфигурации["BU"] <> Неопределено);
	Контекст.Экран = (ИнформацияКонфигурации["SC"] <> Неопределено);
	
	Ответ.Успех = Истина;	
	Ответ.Вставить("Контекст", Контекст);
	ВыполнитьОбработкуОповещения(ОбработкаПослеИнициализации, Ответ);
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область Авторизация

// Обработчик оповещения начала авторизации токеном
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//	ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения
//									который необходимо выполнить после начала авторизации
//
Процедура НачатьАвторизацию(Контекст, ОписаниеОповещенияЗавершения) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	Если Не ПустаяСтрока(Контекст.SID2) Тогда
		// Получение списка сертификатов пользователя
		Запрос_GET_OBJ_LIST_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_OBJ_LIST_ID(Контекст.URL, Контекст.SID2);
		Если Запрос_GET_OBJ_LIST_ID.Успех Тогда
			Ответ.Успех = Истина;
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
			Возврат;
		Иначе
			Контекст.SID2 = "";
		КонецЕсли;
	КонецЕсли;
	
	// Получение списка пользователей на устройстве
	Запрос_GET_PIN_LIST = ККСНГ_APIVPNKeyTLSКлиент.GET_PIN_LIST(Контекст.URL, Контекст.SID0);
	Если Не Запрос_GET_PIN_LIST.Успех Тогда
		Ответ.ОписаниеОшибки = "Не удалось получить список пользователей.";
		Если НЕ ПустаяСтрока(Запрос_GET_PIN_LIST.ОписаниеОшибки) Тогда
			Ответ.ОписаниеОшибки = Ответ.ОписаниеОшибки + " " + Запрос_GET_PIN_LIST.ОписаниеОшибки;
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;
	
	// Проверка, что список пользователей пустой
	Если Не Запрос_GET_PIN_LIST.Результат.user.Количество() Тогда
		Ответ.ОписаниеОшибки = "Нет доступных пользователей.";
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;
	
	СписокПользователей = Новый СписокЗначений;
	Для Инд = 0 По Запрос_GET_PIN_LIST.Результат.user.ВГраница() Цикл
		СписокПользователей.Добавить(Запрос_GET_PIN_LIST.Результат.user[Инд], Запрос_GET_PIN_LIST.Результат.pin[Инд]);
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Контекст", Контекст);
	ДополнительныеПараметры.Вставить("СписокПользователей", СписокПользователей);
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершения", ОписаниеОповещенияЗавершения);
	Если Не ПустаяСтрока(Контекст.Пользователь) И Не ПустаяСтрока(Контекст.Пароль) Тогда
		ПараметрыАвторизации = Новый Структура("Пользователь,Пароль");
		ЗаполнитьЗначенияСвойств(ПараметрыАвторизации, Контекст);
		
		АвторизоватьсяПродолжение(ПараметрыАвторизации, ДополнительныеПараметры);
	Иначе 
		Параметры = Новый Структура;
		Параметры.Вставить("СписокПользователей", СписокПользователей);
		Параметры.Вставить("Экран", Контекст.Экран);
		Параметры.Вставить("СсылкаДляПерехода", Контекст.URL + Контекст.SID0 + "/auth.shtml"); 
		ОписаниеОповещения = Новый ОписаниеОповещения("АвторизоватьсяПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_Авторизация", Параметры, , , , , ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения начала авторизации токеном
//
// Параметры:
// 	Результат - Неопределено
//			  - Структура - содержит:
//				* Пользователь - Строка
//				* Пароль - Строка
//	ДополнительныеПараметры - Структура - содержит:
// 		* Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения
//										 который необходимо выполнить после авторизации
//		* СписокПользователей - СписокЗначений - Список пользователей устройства
//
Процедура АвторизоватьсяПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
	Контекст = ДополнительныеПараметры.Контекст;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		// Авторизация на устройстве
		Запрос_LOGIN = ККСНГ_APIVPNKeyTLSКлиент.LOGIN(Контекст.URL, Контекст.SID0, Результат.Пользователь, Результат.Пароль);
		Если Запрос_LOGIN.Успех Тогда
			
			Ответ.Успех = Запрос_LOGIN.Успех;
			Ответ.Результат = Запрос_LOGIN.Результат;
			Контекст.SID2 = Ответ.Результат.SID2;
			Контекст.Пользователь = Результат.Пользователь;
			Контекст.Пароль = Результат.Пароль;
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
			
			Возврат;
			
		Иначе
			
			Если Запрос_LOGIN.Результат.retcode <> "-0" Тогда
				
				Параметры = Новый Структура;
				Параметры.Вставить("СписокПользователей", ДополнительныеПараметры.СписокПользователей);
				Параметры.Вставить("ОписаниеОшибки", Запрос_LOGIN.ОписаниеОшибки);
				Параметры.Вставить("Экран", Контекст.Экран);
				Параметры.Вставить("СсылкаДляПерехода", Контекст.URL + Контекст.SID0 + "/auth.shtml"); 
				
				ОписаниеОповещения = Новый ОписаниеОповещения("АвторизоватьсяПродолжение", ЭтотОбъект, ДополнительныеПараметры);
				
				ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_Авторизация", Параметры, , , , , ОписаниеОповещения);
				
				Возврат;
				
			КонецЕсли;
			
			Ответ.ОписаниеОшибки = Запрос_LOGIN.ОписаниеОшибки;
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
			Возврат;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Ответ.ОписаниеОшибки = "Отменено пользователем.";
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
	
КонецПроцедуры

#КонецОбласти

#Область Сертификаты

// Обработчик оповещения начала выбора сертификата
//
// Параметры:
// 	Результат - Структура - содержит:
//		* Успех - Булево
//	ДополнительныеПараметры - Структура - содержит:
// 		* Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
//		* ОтборСертификатов - Массив, Неопределено - Данные для отбора списка сертификатов 
//
Процедура НачатьВыборСертификата(Результат, ДополнительныеПараметры) Экспорт

	Ответ = ПолучитьСтруктуруОтвета();
	ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
	
	Если Результат.Успех Тогда
		
		Контекст = ДополнительныеПараметры.Контекст;
		ОтборСертификатов = Неопределено;
		ДополнительныеПараметры.Свойство("ОтборСертификатов", ОтборСертификатов);
		ОтветСпискаСертификатов = ПолучитьСписокСертификатовНаУстройстве(Контекст);
		
		Если ОтветСпискаСертификатов.Успех Тогда
			
			СписокСертификатов = ОтветСпискаСертификатов.Результат;
			
			Если СписокСертификатов.Количество() Тогда
				
				ВыбранныйСертификат = НайтиСертификатУстройстваПоОтпечатку(Контекст.СертификатЭП, СписокСертификатов);
											
				Если ТипЗнч(ВыбранныйСертификат) = Тип("Структура") Тогда
					ЗавершитьВыборСертификата(ВыбранныйСертификат, ДополнительныеПараметры);
				Иначе	// Требуется выбрать сертификат.
					Контекст.AuthCookie = "";
					Параметры = Новый Структура;
					Параметры.Вставить("СписокСертификатов", СписокСертификатов);
					Параметры.Вставить("СписокИздателейСертификатов", СписокИздателейСертификатовЭПТокенаСбербанка());
					Параметры.Вставить("ОтборПоАктивностиСертификатов", Истина);
					Параметры.Вставить("ДополнительныеОтборы", ОтборСертификатов);
										
					ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборСертификата", ЭтотОбъект, ДополнительныеПараметры);	
					
					ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_ВыборСертификата", Параметры, ЭтотОбъект, , , , 
										ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЕсли;
				
			Иначе // Нет сертификатов
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ОписаниеСсылки", "Для выпуска сертификата перейдите, пожалуйста, по");
				ПараметрыФормы.Вставить("ОсновнойТекст", "Не найдены сертификаты поддерживаемых удостверяющих центров.");
				ПараметрыФормы.Вставить("СсылкаДляПерехода", "https://doc.esphere.ru/lkk-token3/67.html");

				Ответ.ОписаниеОшибки = "Не найдены сертификаты на устройстве.";
				ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
				ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_Информация", ПараметрыФормы);
				
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, ОтветСпискаСертификатов);
					
		КонецЕсли;
		
	Иначе 
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Результат);
				
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

// Обработчик оповещения завершения выбора сертификата
//
// Параметры:
// 	ВыбранныйСертификат - Неопределено - Не выбран сертификат
//						- Структура - содержит:
//							* Отпечаток - Строка - Отпечаток сертификата 
//							* ПослеВыбораСертификата - ОписаниеОповещения - Описание обработчика оповещения 
//																	завершения успешного выбора сертификата
//	ДополнительныеПараметры - Структура - содержит:
// 		* Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
//
Процедура ЗавершитьВыборСертификата(ВыбранныйСертификат, ДополнительныеПараметры) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	Если ТипЗнч(ВыбранныйСертификат) = Тип("Структура") Тогда
	
		Контекст = ДополнительныеПараметры.Контекст;
		
		Если НЕ ЗначениеЗаполнено(Контекст.AuthCookie)
			И ЗначениеЗаполнено(Контекст.ПредAuthCookie)
			И ЗначениеЗаполнено(Контекст.ПредСертификатЭП)
			И Контекст.ПредСертификатЭП.Отпечаток = ВыбранныйСертификат.Отпечаток Тогда 
			// Токен переподключен, но выбран тот же сертификат, AuthCookie действительна
			Контекст.AuthCookie = Контекст.ПредAuthCookie;
		КонецЕсли;
		
		Контекст.СертификатЭП = ВыбранныйСертификат;
		
		ПослеВыбораСертификата = ДополнительныеПараметры.ПослеВыбораСертификата;
		ВыполнитьОбработкуОповещения(ПослеВыбораСертификата, ДополнительныеПараметры);
				
	Иначе 
				
		// Не выбрали сертификат.
		Ответ.ОписаниеОшибки = "Не выбран сертификат для подписания.";
		ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

// Прочитать данные сертификата по идентификатору
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст
//	ИдентификаторСертификата - Строка - Идентификатор сертификата
//
// Возвращаемое значение:
//   Структура - содержит:
//		* Результат - Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСвойстваСертификата
//			** ИдентификаторСертификата - Строка - Идентификатор сертификата
//		* ОписаниеОшибки - Строка
//		* Успех - Булево
//
Функция ПрочитатьСертификат(Контекст, ИдентификаторСертификата) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();

	// GET_OBJ_CERT_D_ID		
	Запрос_GET_OBJ_CERT_D_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_OBJ_CERT_D_ID(Контекст.URL, Контекст.SID2, ИдентификаторСертификата);
	
	Если Не Запрос_GET_OBJ_CERT_D_ID.Успех Тогда
		Ответ.ОписаниеОшибки = "Не удалось получить данные сертификата." + " " + Запрос_GET_OBJ_CERT_D_ID.ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли;
		
	CertDataBase64 = Запрос_GET_OBJ_CERT_D_ID.Результат.data;
	CertDataBase64 = СтрЗаменить(CertDataBase64, "-----BEGIN CERTIFICATE-----" + Символы.ПС, "");
	CertDataBase64 = СтрЗаменить(CertDataBase64, Символы.ПС + "-----END CERTIFICATE-----", "");
	
	CertDataДвоичныеДанные = ПолучитьДвоичныеДанныеИзBase64Строки(CertDataBase64);
	
	СертификатКриптографии = Новый СертификатКриптографии(CertDataДвоичныеДанные);
	
	СтруктураСертификата = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПолучитьСвойстваСертификата(СертификатКриптографии);
	СтруктураСертификата.Вставить("ИдентификаторСертификата", ИдентификаторСертификата);
		
	Ответ.Результат = СтруктураСертификата;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает список серфтификатов на устройстве
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст
//	ОтборСертификатов - Неопределено - Получить все доступные сертификаты
//					  - Массив из Отбор 
//
// Возвращаемое значение:
//   Структура - содержит:
//		* Результат - Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСвойстваСертификата
//			** ИдентификаторСертификата - Строка - Идентификатор сертификата
//		* ОписаниеОшибки - Строка
//		* Успех - Булево
//
Функция ПолучитьСписокСертификатовНаУстройстве(Контекст) Экспорт
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	Запрос_GET_OBJ_LIST_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_OBJ_LIST_ID(Контекст.URL, Контекст.SID2);
	
	Если НЕ Запрос_GET_OBJ_LIST_ID.Успех Тогда
		Ответ.ОписаниеОшибки = "Не удалось получить список сертификатов." + " " + Запрос_GET_OBJ_LIST_ID.ОписаниеОшибки;
		Возврат Ответ;
	КонецЕсли;
		
	СписокСертификатов = Новый СписокЗначений;
	
	Для каждого ИдентификаторСертификата Из Запрос_GET_OBJ_LIST_ID.Результат.data Цикл
		
		ЗапросДанныхСертификата = ПрочитатьСертификат(Контекст, ИдентификаторСертификата);
		
		Если ЗапросДанныхСертификата.Успех Тогда
			
			ТекСертификат = ЗапросДанныхСертификата.Результат;
						
			СписокСертификатов.Добавить(ТекСертификат, ТекСертификат.Представление);
						
		Иначе 
			// Здесь может возникать критическая ошибка чтения сертификата по идентификатору
			// скорее всего связанная с битыми сертификатами, поэтому пока просто пропускаем
			// Возврат ЗапросДанныхСертификата;
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Ответ.Результат = СписокСертификатов;
	Ответ.Успех = Истина;
			
	Возврат Ответ;
	
КонецФункции
	
#КонецОбласти

#Область ЭП

#Область ПодписаниеФайла

// Обработчик подписания файлов токеном
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст
// 	Данные  - ДвоичныеДанные - Двоичные данные для подписи
//			- Структура - Данные для подписи. Содержит:
//				* ДвоичныеДанные - ДвоичныеДанные - Двоичные данные для подписи
//				* ИмяФайлаДляПодписи - Строка - Имя файла сохрания данных подписи
//	ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//														завершения выбора сертификата
// 	ВключатьДанныеВПодпись - Булево
// 	ЗаголовокОперации - Строка - Заголовок операции
//	ОтборСертификатов - Неопределено - Получить все доступные сертификаты
//					  - Массив из Отбор 
//
Процедура НачатьПодписание(Контекст, Данные, ОписаниеОповещенияЗавершения, ВключатьДанныеВПодпись = Ложь, 
								ЗаголовокОперации = "", ОтборСертификатов = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Данные", Данные); 
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершения", ОписаниеОповещенияЗавершения); 
	ДополнительныеПараметры.Вставить("ВключатьДанныеВПодпись", ВключатьДанныеВПодпись); 
	ДополнительныеПараметры.Вставить("ЗаголовокОперации", ЗаголовокОперации); 
	ДополнительныеПараметры.Вставить("ОтборСертификатов", ОтборСертификатов); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИнициализацииУстройстваПодписание", ЭтотОбъект, ДополнительныеПараметры);
	ИнициализироватьУстройство(Контекст, ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик оповещения после инициализации устройства подписания токеном
//
// Параметры:
// 	Результат - Структура - содержит:
//		* Успех - Булево - Признак успеха инициализации устройства подписания токеном
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//	ДополнительныеПараметры - Структура - содержит:
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
//
Процедура ПослеИнициализацииУстройстваПодписание(Результат, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
	Если НЕ Результат.Успех Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Результат);
		Возврат;                                                        
	КонецЕсли;	
	
	Контекст = Результат.Контекст;
	ДополнительныеПараметры.Вставить("Контекст", Контекст);
		
	ПослеВыбораСертификата = Новый ОписаниеОповещения("ПродолжитьПодписание", ЭтотОбъект, ДополнительныеПараметры);
	
	ДополнительныеПараметры.Вставить("ПослеВыбораСертификата", ПослеВыбораСертификата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыборСертификата", ЭтотОбъект, ДополнительныеПараметры);
	
	ККСНГ_VPNKeyTLSКлиент.НачатьАвторизацию(Контекст, ОписаниеОповещения);

КонецПроцедуры

// Обработчик оповещения после выбора сертификата токена для подписи
//
// Параметры:
// 	Результат - Неопределено		  
//	ДопПараметры - Структура - содержит:
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
// 		* ВключатьДанныеВПодпись - Булево - Признак влючения данных в подпись		  
// 		* ЗаголовокОперации - Строка - Заголовок операции
// 		* Данные - ДвоичныеДанные - Двоичные данные для подписи
//				 - Структура - Данные для подписи. Содержит:
//					* ДвоичныеДанные - ДвоичныеДанные - Двоичные данные для подписи
//					* ИмяФайлаДляПодписи - Строка - Имя файла сохрания данных подписи
//
Процедура ПродолжитьПодписание(Результат, ДопПараметры) Экспорт

	Ответ = ПолучитьСтруктуруОтвета();
	
	Контекст = ДопПараметры.Контекст;
	ВключатьДанныеВПодпись = ДопПараметры.ВключатьДанныеВПодпись; 
	ОписаниеОповещенияЗавершения = ДопПараметры.ОписаниеОповещенияЗавершения;
	ЗаголовокОперации = ДопПараметры.ЗаголовокОперации;
	
	Если ТипЗнч(ДопПараметры.Данные) = Тип("Структура") Тогда
		Данные = ДопПараметры.Данные.ДвоичныеДанные; 
		FileName = ДопПараметры.Данные.ИмяФайлаДляПодписи;
	Иначе
		FileName = "";
		Данные = ДопПараметры.Данные;
	КонецЕсли;	
	
	// INIT_SIGN_H_ID - Инициализация подписания
	datasize = XMLСтрока(Данные.Размер());
	obj_id = Контекст.СертификатЭП.ИдентификаторСертификата;
	
	Запрос_INIT_SIGN_H_ID = ККСНГ_APIVPNKeyTLSКлиент.INIT_SIGN_H_ID(Контекст.URL, Контекст.SID2,
																	obj_id, datasize, , ВключатьДанныеВПодпись, , FileName);
																	
	Если Не Запрос_INIT_SIGN_H_ID.Успех Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Запрос_INIT_SIGN_H_ID);
		Возврат;
	КонецЕсли;

	ctx_handle = Запрос_INIT_SIGN_H_ID.Результат.ctx_handle;
	
	ПотокДД = Данные.ОткрытьПотокДляЧтения();
	
	// Размер блока зависит от прошивки
	Если Контекст.ВерсияПрошивки = "531" Тогда
		БуферДД = Новый БуферДвоичныхДанных(16 * 1024 * 1024);	
	Иначе
		
		БуферДД = Новый БуферДвоичныхДанных(15 * 1024);
	КонецЕсли;
	
	ПрочитаноБайт = ПотокДД.Прочитать(БуферДД, 0, БуферДД.Размер);
	blocknum = 0;
	
	Пока ПрочитаноБайт Цикл
		
		// SET_SIGN_DATA_H_ID - Добавление порции данных
		blocknum = blocknum + 1;
		data = ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(БуферДД.Прочитать(0, ПрочитаноБайт));
		
		data = СтрЗаменить(data, Символы.ВК, "");
		data = СтрЗаменить(data, Символы.ПС, "");
		
		Запрос_SET_SIGN_DATA_H_ID = ККСНГ_APIVPNKeyTLSКлиент.SET_SIGN_DATA_H_ID(Контекст.URL, Контекст.SID2, 
																					data, blocknum, ctx_handle);
		Если Не Запрос_SET_SIGN_DATA_H_ID.Успех Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Запрос_SET_SIGN_DATA_H_ID);
			Возврат;
		КонецЕсли;
		
		ПрочитаноБайт = ПотокДД.Прочитать(БуферДД, 0, БуферДД.Размер);
		
	КонецЦикла;
		
	// CALC_SIGN_H_ID - Вычисление подписи
	Запрос_CALC_SIGN_H_ID = ККСНГ_APIVPNKeyTLSКлиент.CALC_SIGN_H_ID(Контекст.URL, Контекст.SID2, ctx_handle);
	Если Не Запрос_CALC_SIGN_H_ID.Успех Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Запрос_CALC_SIGN_H_ID);
		Возврат;
	КонецЕсли;
	
	// Открытие окна ожидания результата подписания
 	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Контекст", Контекст);
	ДополнительныеПараметры.Вставить("ИдентификаторЭП", ctx_handle);
	ДополнительныеПараметры.Вставить("Данные", Данные); 
	ДополнительныеПараметры.Вставить("ВключатьДанныеВПодпись", ВключатьДанныеВПодпись); 
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершения", ОписаниеОповещенияЗавершения);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПодписание", ЭтотОбъект, ДополнительныеПараметры);
	
	Параметры = Новый Структура;
	Параметры.Вставить("Кнопка", Контекст.Кнопка);
	Параметры.Вставить("Экран", Контекст.Экран);
	Параметры.Вставить("ИмяФайла", FileName);
	Параметры.Вставить("ЗаголовокОперации", ЗаголовокОперации);
	Параметры.Вставить("Таймаут", 300);
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_Подписание", Параметры, , , , , ОписаниеОповещения);
	
	Возврат;
	
КонецПроцедуры

// Обработчик оповещения после подписания данных токеном
//
// Параметры:
// 	Результат - Неопределено
//			  - УправляемаяФорма - Форма подписания токеном
//	ДопПараметры - Структура - содержит:
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
// 		* ВключатьДанныеВПодпись - Булево - Признак влючения данных в подпись		  
// 		* ЗаголовокОперации - Строка - Заголовок операции
//		* ИдентификаторЭП - Строка - Идентификатор контекста токена
// 		* Данные - ДвоичныеДанные - Двоичные данные для подписи
//
Процедура ЗавершитьПодписание(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		// Стандартное оповещение при закрытии окна ожидания, нам оно не интересно
		Возврат;
	КонецЕсли;
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	Контекст = ДополнительныеПараметры.Контекст;
	ВключатьДанныеВПодпись = ДополнительныеПараметры.ВключатьДанныеВПодпись; 
	ctx_handle = ДополнительныеПараметры.ИдентификаторЭП;
	ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
		
	// GET_CTX_INFO_H_ID - Информация о контексте		
	Запрос_GET_CTX_INFO_H_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_CTX_INFO_H_ID(Контекст.URL, Контекст.SID2, ctx_handle);
	
	Если Результат.ЗавершеноПоТаймауту Тогда
		Запрос_GET_CTX_INFO_H_ID.ОписаниеОшибки = "Операция отменена пользователем.";
		Запрос_GET_CTX_INFO_H_ID.Успех = Ложь;
		
		// Пробуем выполнить запрос для сброса состояния устройства
		Запрос_GET_SIGN_CMS_H_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_SIGN_CMS_H_ID(Контекст.URL, Контекст.SID2, ctx_handle);
	КонецЕсли;	
		
	Если НЕ Запрос_GET_CTX_INFO_H_ID.Успех Тогда
		ЗакрытьФормуОжидания(Результат);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Запрос_GET_CTX_INFO_H_ID);
		Возврат;
	КонецЕсли;
		
	status = Запрос_GET_CTX_INFO_H_ID.Результат.status;
				
	Если status = "1" Или status = "3" Тогда
		Возврат; // Ожидание результата
	КонецЕсли;
		
	ЗакрытьФормуОжидания(Результат);
	
	Если НЕ status = "2" Тогда
		Ответ.ОписаниеОшибки = ?(status = "5", "Операция отменена пользователем.", "Не удалось рассчитать электронную подпись.");
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;	
	
	// GET_SIGN_CMS_H_ID		
	Запрос_GET_SIGN_CMS_H_ID = ККСНГ_APIVPNKeyTLSКлиент.GET_SIGN_CMS_H_ID(Контекст.URL, Контекст.SID2, ctx_handle);
	Если Не Запрос_GET_SIGN_CMS_H_ID.Успех Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Запрос_GET_SIGN_CMS_H_ID);
		Возврат;
	КонецЕсли;
	
	ПотокВПамяти = Новый ПотокВПамяти();
	
	headДД = ПолучитьДвоичныеДанныеИзBase64Строки(Запрос_GET_SIGN_CMS_H_ID.Результат.head);
	headДД.Записать(ПотокВПамяти);
	
	Если ВключатьДанныеВПодпись Тогда
		Данные = ДополнительныеПараметры.Данные;
		Данные.Записать(ПотокВПамяти);
	КонецЕсли;

	suffixДД = ПолучитьДвоичныеДанныеИзBase64Строки(Запрос_GET_SIGN_CMS_H_ID.Результат.suffix);
	suffixДД.Записать(ПотокВПамяти);	
	
	Ответ.Результат = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
	Ответ.Успех = Истина;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ);

КонецПроцедуры

#КонецОбласти 

#Область ПодписаниеПакета

// Обработчик подписания пакета файлов токеном
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст
// 	ОписаниеДанных - Структура - содержит:
//		* ОтборСертификатов - Неопределено, Массив - Данные для отбора сертификатов
//		* ПередВыполнением - ОписаниеОповещения - Описание оповещения обработчика 
//												  перед подписанием пакета файлов
//		* Данные - Произвольный - Данные подписания
//		* Представление - Структура - содержит:
//			** Значение - ОбработчикОповещения - Обработчик оповещения обработки данныха
//			** Представление - Строка - Представление данных
//		* ИмяПоляДД - Строка - Имя поля данных на подпись, содержащее двоичные данные
//		* ПредставлениеНабора - Строка - Представление набора данных на подпись
//		* НаборДанных - Массив из Структура - содержит:
//			** Данные - Произвольный - Данные подписания
//			** Представление - Структура - содержит:
//				*** Значение - Структура - содержит:
//					**** Данные - ДвоичныеДанные
//					**** ИмяФайла - Строка
//				*** Представление - Строка - Представление данных
//			** ИмяПоляДД - Строка - Имя поля данных на подпись, содержащее двоичные данные
//		* СписокПредставлений - СписокЗначений - содержит:
//			** Значение - ОбработчикОповещения - Обработчик оповещения обработки элемента набора данных
//			** Представление - Представление элемента набора
//	ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//														завершения выбора сертификата
// 	ЗаголовокОперации - Строка - Заголовок операции
//
Процедура НачатьПодписаниеПакета(Контекст, ОписаниеДанных, ОписаниеОповещенияЗавершения, ЗаголовокОперации = "") Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОписаниеДанных", ОписаниеДанных); 
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗавершения", ОписаниеОповещенияЗавершения);
	ДополнительныеПараметры.Вставить("ЗаголовокОперации", ЗаголовокОперации);
	
	ОтборСертификатов = Неопределено;
	ОписаниеДанных.Свойство("ОтборСертификатов", ОтборСертификатов);
	ДополнительныеПараметры.Вставить("ОтборСертификатов", ОтборСертификатов);
	ПослеВыбораСертификата = Новый ОписаниеОповещения("НачатьПередВыполнениемПодписания", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ПослеВыбораСертификата", ПослеВыбораСертификата); 
	
	НачатьИнициализациюУстройства(Контекст, ДополнительныеПараметры);
		
КонецПроцедуры

// Обработчик оповещения ДО инициализации устройства подписания токеном
//
// Параметры:
// 	Контекст - Структура - Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст
//	ДополнительныеПараметры - Структура - содержит:
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
//
Процедура НачатьИнициализациюУстройства(Контекст, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИнициализацииУстройстваПодписаниеПакета", 
																	ЭтотОбъект, ДополнительныеПараметры);

 	ИнициализироватьУстройство(Контекст, ОписаниеОповещения);

КонецПроцедуры

// Обработчик оповещения ПОСЛЕ инициализации устройства подписания токеном
//
// Параметры:
// 	Результат - Структура - содержит:
//		* Успех - Булево - Признак успеха инициализации устройства подписания токеном
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//	ДополнительныеПараметры - Структура - содержит:
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
//
Процедура ПослеИнициализацииУстройстваПодписаниеПакета(Результат, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
	Если НЕ Результат.Успех Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Результат);
		Возврат;
	КонецЕсли;
	
	Контекст = Результат.Контекст;
	ДополнительныеПараметры.Вставить("Контекст", Контекст); 
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыборСертификата", ЭтотОбъект, ДополнительныеПараметры);
	ККСНГ_VPNKeyTLSКлиент.НачатьАвторизацию(Контекст, ОписаниеОповещения);

КонецПроцедуры

// Обработчик оповещения ДО подписания токеном
//
// Параметры:
// 	ПараметрыПодписания - Структура - содержит:
// 		* ОписаниеДанных - Структура - содержит:
//			** ОтборСертификатов - Неопределено, Массив - Данные для отбора сертификатов
//			** ПередВыполнением - ОписаниеОповещения - Описание оповещения обработчика 
//			  										   перед подписанием пакета файлов
//			** Данные - Произвольный - Данные подписания
//			** Представление - Структура - содержит:
//				*** Значение - ОбработчикОповещения - Обработчик оповещения обработки данныха
//				*** Представление - Строка - Представление данных
//			** ИмяПоляДД - Строка - Имя поля данных на подпись, содержащее двоичные данные
//			** ПредставлениеНабора - Строка - Представление набора данных на подпись
//			** НаборДанных - Массив из Структура - содержит:
//				*** Данные - Произвольный - Данные подписания
//				*** Представление - Структура - содержит:
//					**** Значение - Структура - содержит:
//						***** Данные - ДвоичныеДанные
//						***** ИмяФайла - Строка
//					**** Представление - Строка - Представление данных
//				*** ИмяПоляДД - Строка - Имя поля данных на подпись, содержащее двоичные данные
//			** СписокПредставлений - СписокЗначений - содержит:
//				*** Значение - ОбработчикОповещения - Обработчик оповещения обработки элемента набора данных
//				*** Представление - Представление элемента набора
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//	ДопПараметры - Неопределено
//
Процедура НачатьПередВыполнениемПодписания(ПараметрыПодписания, ДопПараметры = Неопределено) Экспорт
	
	ОписаниеДанных = ПараметрыПодписания.ОписаниеДанных;	
	ОписаниеДанных.Вставить("ВыбранныйСертификат", ПараметрыПодписания.Контекст.СертификатЭП);
	
	Если ОписаниеДанных.Свойство("ПередВыполнением")
		И ТипЗнч(ОписаниеДанных.ПередВыполнением) = Тип("ОписаниеОповещения") Тогда
		
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("ОписаниеДанных", ОписаниеДанных);
		
		ОписаниеОповещенияПослеОбработки = Новый ОписаниеОповещения("ПодписаниеПакетаПослеОбработкиПередВыполнением", ЭтотОбъект, ПараметрыПодписания);
		ПараметрыВыполнения.Вставить("Оповещение", ОписаниеОповещенияПослеОбработки);
		
		ВыполнитьОбработкуОповещения(ОписаниеДанных.ПередВыполнением, ПараметрыВыполнения);
	Иначе
		ПодписаниеПакетаПослеОбработкиПередВыполнением(Новый Структура, ПараметрыПодписания);
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик оповещения ПЕРЕД завершением подписания
//
// Параметры:
// 	Результат - Структура - содержит:
// 		* Успех - Булево		  
// 		* ОписаниеОшибки - Строка		  
// 		* Результат - Произвольный		  
//	ДополнительныеПараметры - Структура - содержит:
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//		* ЗаголовокОперации - Строка - Заголовок операции 
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
//
Процедура ПодписаниеПакетаПослеОбработкиПередВыполнением(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Свойство("ОписаниеОшибки") Тогда
		Ответ = ПолучитьСтруктуруОтвета();
		Ответ.ОписаниеОшибки = Результат.ОписаниеОшибки;
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияЗавершения, Ответ);
		Возврат;
	КонецЕсли;
	
	Контекст = ДополнительныеПараметры.Контекст;
	ЗаголовокОперации = ДополнительныеПараметры.ЗаголовокОперации;
	Параметры = Новый Структура;
	Параметры.Вставить("Кнопка", Контекст.Кнопка);
	Параметры.Вставить("Экран", Контекст.Экран);
	Параметры.Вставить("ИмяФайла", "");
	Параметры.Вставить("ЗаголовокОперации", ЗаголовокОперации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПодписаниеПакета", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_Подписание", Параметры, , , , , ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик оповещения ПОСЛЕ завершением подписания
//
// Параметры:
// 	Результат - Неопределено
//			  - УправляемаяФорма - Форма подписания токеном		  
//	ДополнительныеПараметры - Структура - содержит:
// 		* Контекст - Структура - Контекст подписания. Описание см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст		  
//		* ЗаголовокОперации - Строка - Заголовок операции 
//		* ОписаниеОповещенияЗавершения - ОписаниеОповещения - Описание обработчика оповещения 
//															  завершения выбора сертификата
// 		* ОписаниеДанных - Структура - содержит:
//			** ОтборСертификатов - Неопределено, Массив - Данные для отбора сертификатов
//			** ПередВыполнением - ОписаниеОповещения - Описание оповещения обработчика 
//			  										   перед подписанием пакета файлов
//			** Данные - Произвольный - Данные подписания
//			** Представление - Структура - содержит:
//				*** Значение - ОбработчикОповещения - Обработчик оповещения обработки данныха
//				*** Представление - Строка - Представление данных
//			** ИмяПоляДД - Строка - Имя поля данных на подпись, содержащее двоичные данные
//			** ПредставлениеНабора - Строка - Представление набора данных на подпись
//			** НаборДанных - Массив из Структура - содержит:
//				*** Данные - Произвольный - Данные подписания
//				*** Представление - Структура - содержит:
//					**** Значение - Структура - содержит:
//						***** Данные - ДвоичныеДанные
//						***** ИмяФайла - Строка
//					**** Представление - Строка - Представление данных
//				*** ИмяПоляДД - Строка - Имя поля данных на подпись, содержащее двоичные данные
//			** СписокПредставлений - СписокЗначений - содержит:
//				*** Значение - ОбработчикОповещения - Обработчик оповещения обработки элемента набора данных
//				*** Представление - Представление элемента набора
//
Процедура ЗавершитьПодписаниеПакета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда                                 
		// Стандартное оповещение при закрытии окна ожидания, нам оно не интересно
		Возврат;
	КонецЕсли;
	
	Ответ = ПолучитьСтруктуруОтвета();
	
	Контекст = ДополнительныеПараметры.Контекст;
	ОписаниеОповещенияЗавершения = ДополнительныеПараметры.ОписаниеОповещенияЗавершения;
	
	ОписаниеДанных = ДополнительныеПараметры.ОписаниеДанных;
	ЭтоНабор = ОписаниеДанных.Свойство("НаборДанных");
	МассивДанных = Новый Массив;
	Если ЭтоНабор Тогда // Передан массив данных
		Для каждого ТекНабор Из ОписаниеДанных.НаборДанных Цикл
			 МассивДанных.Добавить(ТекНабор.Данные);
		КонецЦикла;
	Иначе
		МассивДанных.Добавить(ОписаниеДанных.Данные);
	КонецЕсли;
		
	// SIGN_PACKET - ПодписаниеПакета
	obj_id = Контекст.СертификатЭП.ИдентификаторСертификата;
	Ответ_SIGN_PACKET = ККСНГ_APIVPNKeyTLSКлиент.SIGN_PACKET(Контекст.URL, Контекст.SID2, obj_id, МассивДанных);
	
	Если НЕ Ответ_SIGN_PACKET.Успех Тогда
		Если Ответ_SIGN_PACKET.Результат.retcode = "785" Тогда // таймаут согласия пользователя на операцию, пробуем сбросить контекст устройства 
			Запрос_LOGIN = ККСНГ_APIVPNKeyTLSКлиент.LOGIN(Контекст.URL, Контекст.SID0, Контекст.Пользователь, Контекст.Пароль);
		КонецЕсли;	
			
		ЗакрытьФормуОжидания(Результат);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, Ответ_SIGN_PACKET);
		Возврат;
	КонецЕсли;

	ЗакрытьФормуОжидания(Результат);
	count = Число(Ответ_SIGN_PACKET.Результат.count);
	
	// Обработка результатов
	Для Инд = 1 По count Цикл
		
		ИмяПоля = "cms" + XMLСтрока(Инд);
		
		cmsDataBase64 = Ответ_SIGN_PACKET.Результат[ИмяПоля];
		cmsDataBase64 = СтрЗаменить(cmsDataBase64, "-----BEGIN CMS-----" + Символы.ПС, "");
		cmsDataBase64 = СтрЗаменить(cmsDataBase64, Символы.ПС + "-----END CMS-----", "");
		
		СвойстваПодписи = Новый Структура("Подпись", ПолучитьДвоичныеДанныеИзBase64Строки(cmsDataBase64));
		
		Если ЭтоНабор Тогда // Передан массив данных
			ОписаниеДанных.НаборДанных[Инд - 1].Вставить("СвойстваПодписи", СвойстваПодписи);
		Иначе
			ОписаниеДанных.Вставить("СвойстваПодписи", СвойстваПодписи);
		КонецЕсли;
		
	КонецЦикла;
		
	ОписаниеДанных.Вставить("Успех", Истина);
	ОписаниеДанных.Вставить("КонтекстОперации", Контекст);
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияЗавершения, ОписаниеДанных);

КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСтруктуруОтвета() Экспорт
	
	Ответ = Новый Структура;	
	Ответ.Вставить("Результат");
	Ответ.Вставить("ОписаниеОшибки", "");
	Ответ.Вставить("Успех", Ложь);
	
	Возврат Ответ;
	
КонецФункции

Функция НайтиКлючевыеФайлыНаУстройстве(Контекст) Экспорт
	
	Контекст["ПрограммаЗапуска"] = "";
	Контекст["ФайлURL"] = "";
	
	Диски = "CDEFGHIJKLMNOPQRSTUVWXYZAB";
	
	Для Инд = 1 По СтрДлина(Диски) Цикл
		
		Диск = Сред(Диски, Инд, 1) + ":";
		ДискРДП = "\\tsclient\" + Лев(Диск, 1);
		
		НайденныеФайлыStart = НайтиФайлы(Диск , "start.exe", Ложь);
		НайденныеФайлыSslgate = НайтиФайлы(Диск , "sslgate.url", Ложь);
		
		Если НЕ НайденныеФайлыStart.Количество() * НайденныеФайлыSslgate.Количество() Тогда
			НайденныеФайлыStart = НайтиФайлы(ДискРДП , "start.exe", Ложь);
			НайденныеФайлыSslgate = НайтиФайлы(ДискРДП , "sslgate.url", Ложь);
		КонецЕсли;
		
		Если НайденныеФайлыStart.Количество() * НайденныеФайлыSslgate.Количество() Тогда
			
			Контекст["ПрограммаЗапуска"] = НайденныеФайлыStart[0].ПолноеИмя;
			Контекст["ФайлURL"] = НайденныеФайлыSslgate[0].ПолноеИмя;
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция СписокИздателейСертификатовЭПТокенаСбербанка() Экспорт
	
	СписокИздателей = Новый СписокЗначений;
	СписокИздателей.Добавить("007801392271", "ООО ""СберКорус""");
	СписокИздателей.Добавить("7801392271", "ООО ""СберКорус""");
	СписокИздателей.Добавить("007707083893", "ПАО ""Сбербанк России""");
	СписокИздателей.Добавить("007707329152", "ФНС РОССИИ"); 
	
	Возврат СписокИздателей;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеSslgate(Контекст)
	
	Контекст["URL"] = "";
	Контекст["SID0"] = "";
	
	Текст = Новый ЧтениеТекста(Контекст["ФайлURL"]);
	
	Стр = Текст.ПрочитатьСтроку();
	Пока Стр <> Неопределено Цикл
		
		Стр = СокрЛП(Стр);		
		Если ВРег(Лев(Стр, 4)) = "URL=" Тогда
			
			стрkeyurl = Прав(Стр, СтрДлина(Стр) - 4);
			
			ВремСтр = ?(Прав(стрkeyurl, 1) = "/", Лев(стрkeyurl, СтрДлина(стрkeyurl) - 1), стрkeyurl);
			ВремСтр = СтрЗаменить(ВремСтр, "/", Символы.ПС);
			
			стрkeyurl = "";
			
			Для Инд = 1 По СтрЧислоСтрок(ВремСтр) - 1 Цикл
				
				стрkeyurl = стрkeyurl + СтрПолучитьСтроку(ВремСтр, Инд) + "/";
				
				Если ВРег(СтрПолучитьСтроку(ВремСтр, Инд)) = "VPNKEYLOCAL" Тогда
					
					стрSID0 = СтрПолучитьСтроку(ВремСтр, Инд + 1);
					
					Контекст["SID0"] = стрSID0;
					Контекст["URL"] = стрkeyurl;
					
					Возврат Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Стр = Текст.ПрочитатьСтроку();
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработатьСтрокуDevCfg(Знач СтрокаDevCfg)
	
	СтрокаDevCfg = СтрокаDevCfg + " ";
	ПозицияVT = Найти(СтрокаDevCfg, "_VT");
	ИнформацияКонфигурации = Новый Соответствие;
	
	Если ПозицияVT Тогда
		
		ПозицияVT = ПозицияVT + 1;
		ТекущийКлюч = "";
		ТекущееЗначение = "";
		
		Для Инд = ПозицияVT По СтрДлина(СтрокаDevCfg) Цикл
			
			ТекущийСимвол = Сред(СтрокаDevCfg, Инд, 1); 			
			Если ТекущийСимвол >= "0" И ТекущийСимвол <= "9" Тогда 
				// Это цифра  - номер версии прошивки или модуля
				ТекущееЗначение = ТекущееЗначение + ТекущийСимвол; 
			Иначе
				// Это не цифра - имя прошивки или модуля				
				Если НЕ ПустаяСтрока(ТекущийКлюч) И НЕ ПустаяСтрока(ТекущееЗначение) Тогда
					ИнформацияКонфигурации.Вставить(ВРег(ТекущийКлюч), ТекущееЗначение);		
					ТекущийКлюч = "";
					ТекущееЗначение = "";
				КонецЕсли;				
				
				ТекущийКлюч = ТекущийКлюч + ТекущийСимвол;
				
			КонецЕсли;						
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИнформацияКонфигурации;
	
КонецФункции

Процедура ЗакрытьФормуОжидания(Форма)
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		Форма.ЗакрытьФормуПринудительно = Истина;
		Форма.Закрыть();
	КонецЕсли;
КонецПроцедуры	

Процедура ОчиститьАвторизационныеДанныеТокена(Контекст)
	
	Контекст.ПредСертификатЭП = Контекст.СертификатЭП;
	Контекст.ПредAuthCookie = Контекст.AuthCookie;
	
	Контекст.AuthCookie = "";	
	Контекст.SID2 = "";
	Контекст.Пользователь = "";
	Контекст.Пароль = "";
	Контекст.СертификатЭП = Неопределено;
	
КонецПроцедуры

Функция НайтиСертификатУстройстваПоОтпечатку(СертификатКонтекста, СписокСертификатов)
	
	НайдСертификат = Неопределено;
	
	Если ТипЗнч(СертификатКонтекста) = Тип("Структура") Тогда
		Отпечаток = СертификатКонтекста.Отпечаток;
		СертификатКонтекста = Неопределено;
		Для каждого ТекЭлемент Из СписокСертификатов Цикл
			ТекСертификат = ТекЭлемент.Значение;
			Если Отпечаток = ТекСертификат.Отпечаток Тогда
				НайдСертификат = ТекСертификат;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НайдСертификат;
	
КонецФункции

#КонецОбласти
