#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ТестовыйРежим

// Устанавливает настройку «Тестовый режим» (тест/прод)
//
// Параметры:
//  Использование	 - Булево	 - признак подключения к тестовому стенду
// 
// Возвращаемое значение:
//  Булево - успех обновления настройки
//
Функция УстановитьТестовыйРежим(Использование) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(СтрШаблон("Установка признака тестового режима работы с сервисом '%1'.", Использование));
	
	ЗапросУстановкиЗначения = УстановитьЗначение(Использование, УИД_ИспользованиеТестовогоРежима());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиЗначения.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиЗначения.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Получает настройку «Тестовый режим» (тест/прод)
// 
// Возвращаемое значение:
//  Булево - признак подключения к тестовому стенду
//
Функция ТестовыйРежим() Экспорт
	
	Возврат ПолучитьЗначение(УИД_ИспользованиеТестовогоРежима());
	
КонецФункции

#КонецОбласти

#Область НеОбновлятьПодключаемыеМодули

// Устанавливает настройку игнорирования обновления подключаемых модулей
//
// Параметры:
//  Использование	 - Булево	 - не обновлять подключаемые модули
// 
// Возвращаемое значение:
//  Булево - успех обновления настройки
//
Функция УстановитьОбновлениеПодключаемыхМодулей(Использование) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(СтрШаблон("Установка режима обновления подключаемых модулей '%1'.", Использование));
	
	ЗапросУстановкиЗначения = УстановитьЗначение(Не Использование, УИД_ОбновлениеПодключаемыхМодулей());
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиЗначения.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиЗначения.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Получает настройку игнорирования обновления подключаемых модулей
// 
// Возвращаемое значение:
//  Булево - обновлять подключаемые модули
//
Функция ОбновлятьПодключаемыеМодули() Экспорт
	
	Попытка
		Возврат Не ПолучитьЗначение(УИД_ОбновлениеПодключаемыхМодулей());
	Исключение
		Возврат Истина;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ОбновленияИзТестовогоРепозитория

// Устанавливает настройку обновления модулей из тестового репозитория
//
// Параметры:
//  Режим	 - Булево	 - использование тестового репозитория
// 
// Возвращаемое значение:
//  Булево - успех обновления настройки
//
Функция УстановитьОбновленияИзТестовогоРепозитория(Режим) Экспорт
	
	Возврат УстановитьЗначение(Режим, "3E0335C5-4D94-4C8B-AC29-EC6B7FB5A59F").Успех;
	
КонецФункции

// Проверяет настройку режима обновления модулей из тестового репозитория
// 
// Возвращаемое значение:
//  Булево - использование тестового репозитория
//
Функция ОбновленияИзТестовогоРепозитория() Экспорт
	
	Возврат ПолучитьЗначение("3E0335C5-4D94-4C8B-AC29-EC6B7FB5A59F");
	
КонецФункции

#КонецОбласти

#Область ПереносСобытий

// Устанавливает признак обработки событий при обновлении загрузке из сервиса
//
// Параметры:
//  Режим			 - Булево	 - Признак обработки событий
//  Идентификатор	 - Строка	 - Строковое представление профиля организации
// 
// Возвращаемое значение:
//  Булево - успех обновления настройки
//
Функция УстановитьПереносСобытийЗавершен(Режим, Идентификатор) Экспорт
	
	Возврат УстановитьЗначение(Не Режим, Идентификатор).Успех;
	
КонецФункции

// Проверяет признак обработки событий при обновлении загрузке из сервиса для организации
//
// Параметры:
//  Идентификатор	 - Строка	 - Строковое представление профиля организации
// 
// Возвращаемое значение:
//  Булево - признак «ПереносСобытийЗавершен» по указанной организации
//
Функция ПереносСобытийЗавершен(Идентификатор) Экспорт
	
	Возврат Не ПолучитьЗначение(Идентификатор);
	
КонецФункции

#КонецОбласти

#Область ОбновлениеДоступныхДействийЭД

// Устанавливает признак необходимости обновления доступных действий существующих электронных документов
//
// Параметры:
//  Режим	 - Булево	 - необходимость обновления действий документов
// 
// Возвращаемое значение:
//  Булево - успех обновления настройки
//
Функция УстановитьОбновлениеДоступныхДействийДокументовЗавершен(Режим) Экспорт
	
	Возврат УстановитьЗначение(Режим, "a666cfbb-f94f-4667-6663-0e6663a76663").Успех;
	
КонецФункции

// Проверяет необходимость обновления доступных действий существующих электронных документов
// 
// Возвращаемое значение:
//  Булево - необходимость обновления действий документов
//
Функция ОбновлятьДоступныеДействияДокументов() Экспорт
	
	Возврат ПолучитьЗначение("a666cfbb-f94f-4667-6663-0e6663a76663");
	
КонецФункции

#КонецОбласти

#Область УстаревшиеФорматыЭлектронныхДокументов

// Устанавливает доступность использования устаревших форматов электронных документов
//
// Параметры:
//  Режим	 - Булево	 - доступность устаревших форматов
// 
// Возвращаемое значение:
//  Булево - успех обновления настройки
//
Функция РазрешитьУстаревшиеФорматыЭлектронныхДокументов(Режим) Экспорт
	
	Перем Ответ;
	Перем ЗапросУстановкиЗначения;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(СтрШаблон("Разрешение использования устаревших форматов электронных документов '%1'.", Режим));
	
	ЗапросУстановкиЗначения = УстановитьЗначение(Режим, "2fd16cfe-f0bd-4792-834b-72241b9d7b81");
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУстановкиЗначения.Журнал, Ложь);
	Ответ.Успех = ЗапросУстановкиЗначения.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Проверяет доступность использования устаревших форматов электронных документов
// 
// Возвращаемое значение:
//  Булево - доступность устаревших форматов
//
Функция УстаревшиеФорматыЭлектронныхДокументовРазрешены() Экспорт
	
	Попытка
		Возврат ПолучитьЗначение("2fd16cfe-f0bd-4792-834b-72241b9d7b81");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИдентификаторыНастроек

// Возвращает уникальный идентификатор настройки «Использовать тестовый режим»
// 
// Возвращаемое значение:
//  Строка - идентификатор настройки «Использовать тестовый режим»
//
Функция УИД_ИспользованиеТестовогоРежима()
	
	Возврат "63E62BC3-9D80-4917-9A70-38048EFD35AF";
	
КонецФункции

// Возвращает уникальный идентификатор настройки «Обновлять подключаемые модули»
// 
// Возвращаемое значение:
//  Строка - идентификатор настройки «Обновлять подключаемые модули»
//
Функция УИД_ОбновлениеПодключаемыхМодулей()
	
	Возврат "8D9522C5-1686-43B4-BD23-B4AB2FDE514D";
	
КонецФункции

#КонецОбласти

#Область РаботаСРегистромСведений

// Устанавливает значение режима
//
// Параметры:
//  Режим			 - Булево	 - Значение режима
//  Идентификатор	 - Строка	 - Уникальный идентификатор режима
// 
// Возвращаемое значение:
//  Булево - Результат установки режима
//
Функция УстановитьЗначение(Режим, Идентификатор)
	
	Перем Ответ;
	Перем НаборЗаписей, НоваяЗапись;
	Перем ИнформацияОбОшибке, Шаблон, Описание, Комментарий;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(СтрШаблон("Установка значения '%1' с идентификатором '%2'", Режим, Идентификатор));
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
		Если Режим Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Идентификатор = Идентификатор;
		КонецЕсли;
		НаборЗаписей.Записать();
		
		Ответ.Успех = Истина;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Шаблон = "Ошибка установки значения '%1' с идентификатором '%2' в регистре сведений '%3'";
		Описание = СтрШаблон(Шаблон, Режим, Идентификатор, Метаданные.РегистрыСведений.ККСНГ_Служебный.Синоним);
		Комментарий = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, Описание, "SETT-00007", Комментарий);
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

// Проверяет значение режима
//
// Параметры:
//  Идентификатор	 - Строка	 - Уникальный идентификатор режима
// 
// Возвращаемое значение:
//  Булево - Значение режима
//
Функция ПолучитьЗначение(Идентификатор)
	
	Перем НаборЗаписей;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() > 0;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли