#Область ПрограммныйИнтерфейс

// Возвращает записанное регламентное задание
//
// Параметры:
//  КлючДляЗаписи	     - Строка	 - сформированная строка см. СформироватьСтрокуКлючаДляРегламентногоЗадания()
//  ИдентификаторКоманды - Строка    - см. ККСНГ_РегламентныеЗаданияКлиентСервер.ПолучитьНастройкиЗаписиРегЗаданияУведомленияОНачалеОтпуска().ИдентификаторКоманды
//  Использование	     - Булево    - использование регламентного задания
//  НаименованиеРЗ	     - Строка	 - сформированная строка см. СформироватьСтрокуНаименованияРегламентногоЗадания()
//  Расписание	         - РасписаниеРегламентногоЗадания - типовое расписание для записи регламентного задания.
//  ИмяПользователя      - Строка    - "Имя" пользователя ИБ под которым будет выполняться регламетное задание.
//  Данные       	     - Произвольно - дополнительные данные которые необходимо передавать в перехваченную процедуру в модуле "ДополнительныеОтчетыИОбработки"
//
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//  * Результат - РегламентноеЗадание - регламентное задание
//
Функция ЗаписатьРегламентноеЗадание(Ключ, Наименование, Расписание, Использование, Параметры, ИмяПользователя = "") Экспорт
	
	Перем МодульРегламентныеЗаданияСервер;
	Перем ПоискРегламентногоЗадания, РегламентноеЗадание;
	Перем СписокПараметров, ПараметрыЗадания;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запись регламентного задания");
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем модуль рег заданий для дальнейшего добавления или изменения задания
	МодульРегламентныеЗаданияСервер = ОбщегоНазначения.ОбщийМодуль("РегламентныеЗаданияСервер");
	Если МодульРегламентныеЗаданияСервер = Неопределено Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не обнаружен общий модуль РегламентныеЗаданияСервер", "RGZD-00004");
		Возврат Ответ;
	КонецЕсли;
	
	// Данные для запуска конкретного регламентного задания
	СписокПараметров = Новый Массив;
	СписокПараметров.Добавить(Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка());
	СписокПараметров.Добавить(Параметры);
	
	// Данные регламентного задания
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
	ПараметрыЗадания.Вставить("Использование", Использование);
	ПараметрыЗадания.Вставить("Наименование", Наименование);
	ПараметрыЗадания.Вставить("Ключ", Ключ);
	ПараметрыЗадания.Вставить("Расписание", Расписание);
	ПараметрыЗадания.Вставить("ИмяПользователя", ИмяПользователя);
	ПараметрыЗадания.Вставить("Параметры", СписокПараметров);
	
	// Ищем регламентное задание
	ПоискРегламентногоЗадания = НайтиРегламентноеЗадание(Ключ);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПоискРегламентногоЗадания.Журнал);
	Если ПоискРегламентногоЗадания.Успех Тогда
		РегламентноеЗадание = ПоискРегламентногоЗадания.Результат
	КонецЕсли;
	
	Если ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание") Тогда
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Обновление регламентного задания", Строка(РегламентноеЗадание));
		Попытка
			МодульРегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, ПараметрыЗадания);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось записать регламентное задание", "RGZD-00005", ОписаниеОшибки);
			Возврат Ответ;
		КонецПопытки;
		
	Иначе
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Добавление нового регламентного задания");
		Попытка
			РегламентноеЗадание = МодульРегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось записать регламентное задание", "RGZD-00006", ОписаниеОшибки);
			Возврат Ответ;
		КонецПопытки;
		
	КонецЕсли;
	
	Ответ.Результат = РегламентноеЗадание;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает регламентные задания в локальном режиме работы , соответствующие отбору.
//
// Параметры:
//  Ключ - Строка - Ключ регламентного задания
//
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//  * Результат - РегламентноеЗадание - регламентное задание, найденное по отбору
//
Функция НайтиРегламентноеЗадание(Ключ) Экспорт
	
	Перем Ответ, Отбор, РегламентноеЗадание;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Поиск регламентного задания");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
	Отбор.Вставить("Ключ", Ключ);
	
	Для каждого РегламентноеЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор) Цикл
		Ответ.Результат = РегламентноеЗадание;
		Ответ.Успех = Истина;
		Прервать;
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

#Область ОбновлениеДанныхИзКурьераПоПодписке

Процедура ОбновлениеДанныхИзКурьераПоПодписке(Параметры) Экспорт
	
	Перем ОрганизацияЭДО, ПользовательЭДО;
	Перем ПараметрыАвторизации;
	Перем АдресХранилища, РезультатОбновленияПодписки;
	Перем ПоследняяОшибка, ТекстСообщения;
	
	ОрганизацияЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОрганизацияЭДО");
	ПользовательЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПользовательЭДО");
	
	// Проверяем входные параметры
	Если ТипЗнч(ОрганизацияЭДО) <> Тип("СправочникСсылка.ККСНГ_Организации") Или Не ЗначениеЗаполнено(ОрганизацияЭДО) Тогда
		ВызватьИсключение "В настройках регламентного задания не указана организация";
	КонецЕсли;
	
	// Получаем параметры авторизации для Курьера
	ПараметрыАвторизации = ККСНГ_ДокументооборотВызовСервера.ПараметрыАвторизацииОрганизацииПоApiKey(ОрганизацияЭДО, ПользовательЭДО);
	
	Если Не ПараметрыАвторизации.Успех Тогда
		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ПараметрыАвторизации.Журнал);
		Если ПоследняяОшибка <> Неопределено Тогда
			ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	// Вызываем обновление данных из Курьера по подписке
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	ККСНГ_Подписки.ПолучитьИОбработатьСобытияИзСфераКурьер(ОрганизацияЭДО, АдресХранилища, ПараметрыАвторизации.Результат);
	
	РезультатОбновленияПодписки = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	КодыВыводимыхОшибок = СтрРазделить("SC-00001, BJ-00001", ", ", Ложь);
	Для каждого КодОшибки Из КодыВыводимыхОшибок Цикл
		ОшибкаПоКоду = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(РезультатОбновленияПодписки.Журнал, КодОшибки);
		Если ОшибкаПоКоду <> Неопределено И ОшибкаПоКоду.КодОшибки = КодОшибки Тогда
			ВызватьИсключение ОшибкаПоКоду;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеДанныхИзКурьераПоПодписке

// Сохраняет настройки регламентного задания
//
// Параметры:
//  ОрганизацияЭДО	 - СправочникСсылка.ККСНГ_Организации	 - организация ЭДО
//  Использование	 - Булево								 - использование регламентного задания
//  Расписание		 - РасписаниеРегламентногоЗадания		 - типовое расписание для записи регламентного задания
//  Пользователь	 - СправочникСсылка.Пользователи		 - пользователь для получения APIKey
//
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//  * Результат - РегламентноеЗадание - регламентное задание
//
Функция ЗаписатьНастройкиРегламентногоЗаданияАвтообмена(ОрганизацияЭДО, Пользователь, Расписание, Использование) Экспорт
	
	Перем Ответ, ПараметрыРегламентногоЗадания, ЗаписьЗадания;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Сохранение настроек регламентного задания");
	
	ПараметрыРегламентногоЗадания = ПолучитьПараметрыЗаданияОбновленияДанныхИзКурьераПоПодписке(ОрганизацияЭДО);
	ПараметрыДляЗапускаРегламентногоЗадания = ПолучитьПараметрыДляЗапускаЗаданияОбновленияДанныхИзКурьераПоПодписке(ОрганизацияЭДО, Пользователь);
	ЗаписьЗадания = ЗаписатьРегламентноеЗадание(ПараметрыРегламентногоЗадания.Ключ, ПараметрыРегламентногоЗадания.Наименование, Расписание, Использование, ПараметрыДляЗапускаРегламентногоЗадания);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьЗадания.Журнал);
	
	Ответ.Результат = ЗаписьЗадания.Результат;
	Ответ.Успех = ЗаписьЗадания.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает структуру данных найденного по ключу регламентного задания
//
// Параметры:
//  КлючДляЗаписи - Строка - сформированная строка см. СформироватьСтрокуКлючаДляРегЗадания()
//
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//    * КлючЗадания - параметр регламентного задания.
//    * Наименование - параметр регламентного задания.
//    * Использование - параметр регламентного задания.
//    * Расписание - параметр регламентного задания.
//
Функция ПрочитатьНастройкиРегламентногоЗаданияАвтообмена(ОрганизацияЭДО) Экспорт
	
	Перем Ответ;
	Перем ПользовательЭДО;
	Перем РегламентноеЗадание, ПараметрыРегламентногоЗадания, ПараметрЗадания, ПоискРегламентногоЗадания;
		
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение настроек регламентного задания");
	
	ПараметрыРегламентногоЗадания = ПолучитьПараметрыЗаданияОбновленияДанныхИзКурьераПоПодписке(ОрганизацияЭДО);
	
	ПоискРегламентногоЗадания = НайтиРегламентноеЗадание(ПараметрыРегламентногоЗадания.Ключ);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПоискРегламентногоЗадания.Журнал);
	
	Если ПоискРегламентногоЗадания.Успех Тогда
		
		РегламентноеЗадание = ПоискРегламентногоЗадания.Результат;
		
		ПользовательЭДО = Неопределено;
		Для Каждого ПараметрЗадания Из РегламентноеЗадание.Параметры Цикл
			Если ТипЗнч(ПараметрЗадания) = Тип("Структура") И ПараметрЗадания.Свойство("ПользовательЭДО") Тогда
				ПользовательЭДО = ПараметрЗадания.ПользовательЭДО;
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ПараметрыРегламентногоЗадания, РегламентноеЗадание);
		
	КонецЕсли;
	
	ПараметрыРегламентногоЗадания.Вставить("ПользовательЭДО", ПользовательЭДО);
	Ответ.Результат = ПараметрыРегламентногоЗадания;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыЗаданияОбновленияДанныхИзКурьераПоПодписке(ОрганизацияЭДО)
	
	Перем Результат;
	
	Результат = Новый Структура;
	Результат.Вставить("Ключ", СтрШаблон("ОбновлениеПодписки_%1", ОрганизацияЭДО.КодУчастникаЭДО));
	Результат.Вставить("Наименование", СтрШаблон("Модуль ЭДО: Обновление подписки %1", Строка(ОрганизацияЭДО)));
	Результат.Вставить("Использование", Ложь);
	Результат.Вставить("Расписание");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПараметрыДляЗапускаЗаданияОбновленияДанныхИзКурьераПоПодписке(ОрганизацияЭДО, ПользовательЭДО = "")
	
	Перем Результат;
	
	Результат = Новый Структура;
	Результат.Вставить("Команда", "ККСНГ_ОбновлениеДанныхИзКурьераПоПодписке");
	Результат.Вставить("ОрганизацияЭДО", ОрганизацияЭДО);
	Результат.Вставить("ПользовательЭДО", ПользовательЭДО);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти