
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ККСНГ_ПодключаемыеМодулиКлиент.РаботаСПодключаемымиМодулямиДоступна() Тогда
		
		ИмяФормыОбработки = "Обработка.ККСНГ_СфераКурьер.Форма.Форма";
		
		ОткрытьФорму(ИмяФормыОбработки, 
						, 
						ПараметрыВыполненияКоманды.Источник, 
						ПараметрыВыполненияКоманды.Уникальность, 
						ПараметрыВыполненияКоманды.Окно, 
						ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
