#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Получает данные инфо.полей из сохранненных данных XML электронного документа
//
// Параметры:
//   ЭлектронныйДокумент - СправочникСсылка.ККСНГ_ЭлектронныйДокумент - Ссылка на электронный документ, 
//                         значения заполнения инфо.полей которого нужно получить.
// Возвращаемое значение:
//   Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//   
Функция КарточкаИнфоПолейДанныеЗаполнения(ЭлектронныйДокумент) Экспорт
	
	ДанныеЗаполненияОтвет = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ПрисоединенныйФайлСсылка = ККСНГ_ОбъектыИБВызовСервера.ПолучитьСсылкуПрисоединенныйФайл(0, ЭлектронныйДокумент);
	ДанныеДокументаXML = ККСНГ_ОбъектыИБВызовСервера.ПолучитьДвоичныеДанныеФайла(ПрисоединенныйФайлСсылка);
	ЗапросОбъектаXDTO = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьОбъектXDTOПоСтруктурированномуXML(ДанныеДокументаXML);
	
	Если ЗапросОбъектаXDTO.Успех Тогда
		
		ДанныеДокументаСтруктура = ККСНГ_APIКурьер.ПолучитьСтруктуруПоОбъектуXDTO(ЗапросОбъектаXDTO.Результат);		
		ДанныеЗаполненияКарточкиИнфоПолей = СтруктураЗаполненияКарточкиИнфоПолей();
		
		ДанныеЗаполненияКарточкиИнфоПолей.Шапка.ПредставлениеДокумента = ЭлектронныйДокумент.Наименование;
		
		ДанныеФХЖ1 = ПолучитьДанныеИнфоПолейИзДанныхДокументаXML(ДанныеДокументаСтруктура, "ФХЖ1");
		Для каждого ИнфоПолеФХЖ1 Из ДанныеФХЖ1.Результат Цикл
			ДанныеЗаполненияКарточкиИнфоПолей.ДанныеФХЖ1.ИнфоПоля.Добавить(ИнфоПолеФЖХ(ИнфоПолеФХЖ1.Идентиф, ИнфоПолеФХЖ1.Значен));	
		КонецЦикла;
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(ДанныеЗаполненияОтвет.Журнал, ДанныеФХЖ1.Журнал);
		
		ДанныеФХЖ2 = ПолучитьДанныеИнфоПолейИзДанныхДокументаXML(ДанныеДокументаСтруктура, "ФХЖ2");
		Для каждого СтрокаТовараФХЖ2 Из ДанныеФХЖ2.Результат Цикл
			ИнфоПоляСтроки = Новый Массив;
			Для каждого ИнфоПолеФХЖ2 Из СтрокаТовараФХЖ2.ИнфПолФХЖ2 Цикл
				ИнфоПоляСтроки.Добавить(ИнфоПолеФЖХ(ИнфоПолеФХЖ2.Идентиф, ИнфоПолеФХЖ2.Значен));	
			КонецЦикла;
			Если ИнфоПоляСтроки.Количество() Тогда
				НоваяСтрокаТовараФХЖ2 = СтрокаТовараФХЖ(СтрокаТовараФХЖ2, ИнфоПоляСтроки);
				ДанныеЗаполненияКарточкиИнфоПолей.ДанныеФХЖ2.СписокТоваров.Добавить(НоваяСтрокаТовараФХЖ2);	
			КонецЕсли;
		КонецЦикла;
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(ДанныеЗаполненияОтвет.Журнал, ДанныеФХЖ2.Журнал);
		
		ДанныеФХЖ3 = ПолучитьДанныеИнфоПолейИзДанныхДокументаXML(ДанныеДокументаСтруктура, "ФХЖ3");
		Для каждого ИнфоПолеФХЖ3 Из ДанныеФХЖ3.Результат Цикл
			ДанныеЗаполненияКарточкиИнфоПолей.ДанныеФХЖ3.ИнфоПоля.Добавить(ИнфоПолеФЖХ(ИнфоПолеФХЖ3.Идентиф, ИнфоПолеФХЖ3.Значен));	
		КонецЦикла;
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(ДанныеЗаполненияОтвет.Журнал, ДанныеФХЖ3.Журнал);
		
		ДанныеЗаполненияОтвет.Результат = ДанныеЗаполненияКарточкиИнфоПолей;
		ДанныеЗаполненияОтвет.Успех = Истина;
		
	КонецЕсли;
	
	Возврат ДанныеЗаполненияОтвет;	
	
КонецФункции

// Получает актуальный макет вывода карточки инфо.полей электронного документа
//
// Возвращаемое значение:
//   ТабличныйДокумент - Макет для формирования карточки инфо.полей электронного документ
//
Функция КарточкаИнфоПолейМакет() Экспорт
	Возврат ПолучитьМакет("КарточкаИнфоПолей");		
КонецФункции

// Формирует табличный документ по данным заполнения
//
// Параметры:
//   ДанныеЗаполнения - Структура - Описание параметра
//   	* Шапка - Структура - Данные заполнения шапки табличного документа	
//			** ПредставлениеДокумента - Строка - Строковое представление документа
//		* ДанныеФХЖ1 - Массив из Структура - содержит:
//			** Идентификатор - Строка - Идентификатор инфо.поля ФХЖ1
//			** Значение - Строка - Значение инфо.поля ФХЖ1.
//		* ДанныеФХЖ2 - Массив из Структура - содержит:
//      	** СписокТоваров - Массив из Структура - содержит:
//				*** ИнфоПоля - Массив из Структура - содержит:
//					**** Идентификатор - Строка - Идентификатор инфо.поля ФХЖ2
//					**** Значение - Строка - Идентификатор инфо.поля ФХЖ2
//              *** Номенклатура - СправочникСсылка.Номенклатура - Номенклатура товара.
//				*** Количество - Число - Количество товара. 
//				*** Сумма - Число - Сумма товара.
//
//		* ДанныеФХЖ3 - Массив из Структура - содержит:
//			** Идентификатор - Строка - Идентификатор инфо.поля ФХЖ3
//			** Значение	- Строка - Значение инфо.поля ФХЖ3.
//
// Возвращаемое значение:
//   ТабличныйДокумент - Заполненный макет карточки инфо.полей 
//
Функция ТабличныйДокументКарточкиИнфоПолей(ДанныеЗаполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТабличныйДокументКарточки = Новый ТабличныйДокумент;
	
	Если ПроверитьДанныеЗаполнениеИнфоПолей(ДанныеЗаполнения) Тогда
		
		МакетКарточки = КарточкаИнфоПолейМакет();
		
		ВывестиВТабличныйДокументШапку(ТабличныйДокументКарточки, МакетКарточки, ДанныеЗаполнения.Шапка, ДополнительныеПараметры);
		ВывестиВТабличныйДокументИнфоПоляФХЖ1(ТабличныйДокументКарточки, МакетКарточки, ДанныеЗаполнения.ДанныеФХЖ1, ДополнительныеПараметры);
		ВывестиВТабличныйДокументИнфоПоляФХЖ2(ТабличныйДокументКарточки, МакетКарточки, ДанныеЗаполнения.ДанныеФХЖ2, ДополнительныеПараметры);
		ВывестиВТабличныйДокументИнфоПоляФХЖ3(ТабличныйДокументКарточки, МакетКарточки, ДанныеЗаполнения.ДанныеФХЖ3, ДополнительныеПараметры);
		
		ТабличныйДокументКарточки.Область().СоздатьФорматСтрок();
		
	КонецЕсли;
	
	Возврат ТабличныйДокументКарточки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанныхЗаполненияТабличногоДокумента

Функция СтруктураЗаполненияКарточкиИнфоПолей()
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Шапка", Новый Структура("ПредставлениеДокумента", ""));
	СтруктураЗаполнения.Вставить("ДанныеФХЖ1", Новый Структура("ИнфоПоля", Новый Массив));
	СтруктураЗаполнения.Вставить("ДанныеФХЖ2", Новый Структура("СписокТоваров", Новый Массив));
	СтруктураЗаполнения.Вставить("ДанныеФХЖ3", Новый Структура("ИнфоПоля", Новый Массив));
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

Функция ПолучитьДанныеИнфоПолейИзДанныхДокументаXML(ДанныеДокумента, ТипФХЖ)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	ДанныеФХЖ = Новый Массив;
	
	СвСчФакт = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "Документ.СвСчФакт");
	СвКСчФ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "Документ.СвКСчФ");
	СвПродПер = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "Документ.СвПродПер");
	ТаблСчФакт = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "Документ.ТаблСчФакт");
	ТаблКСчФ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "Документ.ТаблКСчФ");
	
	Если ТипФХЖ = "ФХЖ1" Тогда
		
		Если НЕ СвСчФакт = Неопределено Тогда
			ДанныеФХЖ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвСчФакт, "ИнфПолФХЖ1.ТекстИнф", Новый Массив);	
		ИначеЕсли НЕ СвКСчФ = Неопределено Тогда
			ДанныеФХЖ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвКСчФ, "ИнфПолФХЖ1.ТекстИнф", Новый Массив);	
		КонецЕсли;
		
	ИначеЕсли ТипФХЖ = "ФХЖ2" Тогда
		
		Если НЕ ТаблСчФакт = Неопределено Тогда
			ДанныеФХЖ =  ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТаблСчФакт, "СведТов", Новый Массив);	
		ИначеЕсли НЕ ТаблКСчФ = Неопределено Тогда
			ДанныеФХЖ =  ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТаблКСчФ, "СведТов", Новый Массив);	
		КонецЕсли;
		
	ИначеЕсли ТипФХЖ = "ФХЖ3" Тогда
		
		Если НЕ СвПродПер = Неопределено Тогда
			ДанныеФХЖ =  ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвПродПер, "ИнфПолФХЖ3.ТекстИнф", Новый Массив);	
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.Успех = Истина;
	Ответ.Результат = ДанныеФХЖ;
	
	Возврат Ответ;
		
КонецФункции

Функция ИнфоПолеФЖХ(Идентификатор = "", Значение = "")
	Возврат Новый Структура("Идентификатор, Значение", Идентификатор, Значение);	
КонецФункции

Функция СтрокаТовараФХЖ(ДанныеТовара, ИнфоПоля)
	
	СтрокаТовараФХЖ = Новый Структура;
	
	ОбщийМодуль = ККСНГ_ОбщегоНазначенияКлиентСервер;
	
	Номенклатура = ОбщийМодуль.СвойствоСтруктуры(ДанныеТовара, "НаимТов", "");
	Количество = ОбщийМодуль.СвойствоСтруктуры(ДанныеТовара, "КолТов");
	Если Количество = Неопределено Тогда
		Количество = ОбщийМодуль.СвойствоСтруктуры(ДанныеТовара, "КолТовПосле", "");
	КонецЕсли;
	Сумма = ОбщийМодуль.СвойствоСтруктуры(ДанныеТовара, "СтТовУчНал.СтоимПослеИзм");
	Если Сумма = Неопределено Тогда
		Сумма = ОбщийМодуль.СвойствоСтруктуры(ДанныеТовара, "СтТовУчНал", "");
	КонецЕсли;
	
	СтрокаТовараФХЖ.Вставить("Номенклатура", Номенклатура);
	СтрокаТовараФХЖ.Вставить("Количество", Количество);
	СтрокаТовараФХЖ.Вставить("Сумма", Сумма);
	СтрокаТовараФХЖ.Вставить("ИнфоПоля", ИнфоПоля);
	
	Возврат СтрокаТовараФХЖ;	
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеТабличногоДокумента

Функция ПроверитьДанныеЗаполнениеИнфоПолей(ДанныеЗаполнения)
	
	Возврат ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ДанныеФХЖ1.ИнфоПоля", Новый Массив).Количество()
			Или ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ДанныеФХЖ2.СписокТоваров", Новый Массив).Количество()
			Или ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ДанныеФХЖ3.ИнфоПоля", Новый Массив).Количество();	
	
КонецФункции

Процедура ВывестиВТабличныйДокументШапку(КарточкаИнфоПолей, МакетКарточки, ДанныеЗаполнения, ДополнительныеПараметры)

	ОбластьПустаяСтрока = МакетКарточки.ПолучитьОбласть("ОбластьПустаяСтрока");
	ОбластьШапка = МакетКарточки.ПолучитьОбласть("ОбластьШапка");
	
	КарточкаИнфоПолей.Вывести(ОбластьПустаяСтрока);
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеЗаполнения);
	КарточкаИнфоПолей.Вывести(ОбластьШапка);
	
КонецПроцедуры

Функция ВывестиВТабличныйДокументИнфоПоляФХЖ1(КарточкаИнфоПолей, МакетКарточки, ДанныеЗаполнения, ДополнительныеПараметры)

	Если НЕ ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ИнфоПоля", Новый Массив).Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбластьПустаяСтрока = МакетКарточки.ПолучитьОбласть("ОбластьПустаяСтрока");
	ОбластьШапкаФХЖ1 = МакетКарточки.ПолучитьОбласть("ОбластьШапкаФХЖ1");
	ОбластьИнфоПолеФХЖ1 = МакетКарточки.ПолучитьОбласть("ОбластьИнфоПолеФХЖ1");
	
	КарточкаИнфоПолей.Вывести(ОбластьПустаяСтрока);
	КарточкаИнфоПолей.Вывести(ОбластьШапкаФХЖ1);
	
	ИнфоПоляФХЖ1 = ДанныеЗаполнения.ИнфоПоля;
	Для каждого ИнфоПолеФХЖ1 Из ИнфоПоляФХЖ1 Цикл
		ЗаполнитьЗначенияСвойств(ОбластьИнфоПолеФХЖ1.Параметры, ИнфоПолеФХЖ1);
		КарточкаИнфоПолей.Вывести(ОбластьИнфоПолеФХЖ1);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВывестиВТабличныйДокументИнфоПоляФХЖ2(КарточкаИнфоПолей, МакетКарточки, ДанныеЗаполнения, ДополнительныеПараметры)

	СписокТоваров = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "СписокТоваров", Новый Массив);
	Если НЕ СписокТоваров.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ОбластьПустаяСтрока = МакетКарточки.ПолучитьОбласть("ОбластьПустаяСтрока");
	ОбластьШапкаФХЖ2 = МакетКарточки.ПолучитьОбласть("ОбластьШапкаФХЖ2");
	ОбластьТаблицаШапкаФХЖ2 = МакетКарточки.ПолучитьОбласть("ОбластьТаблицаШапкаФХЖ2");
	ОбластьТаблицаСтрокаФХЖ2 = МакетКарточки.ПолучитьОбласть("ОбластьТаблицаСтрокаФХЖ2");
	ОбластьТаблицаИнфоПолеФХЖ2 = МакетКарточки.ПолучитьОбласть("ОбластьТаблицаИнфоПолеФХЖ2");
	ОбластьТаблицаКонецФХЖ2 = МакетКарточки.ПолучитьОбласть("ОбластьТаблицаКонецФХЖ2");
	
	КарточкаИнфоПолей.Вывести(ОбластьПустаяСтрока);
	КарточкаИнфоПолей.Вывести(ОбластьШапкаФХЖ2);
	КарточкаИнфоПолей.Вывести(ОбластьТаблицаШапкаФХЖ2);
	
	СписокТоваров = ДанныеЗаполнения.СписокТоваров;
	
	КарточкаИнфоПолей.НачатьАвтоГруппировкуСтрок();
	Для каждого СтрокаТовара Из СписокТоваров Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьТаблицаСтрокаФХЖ2.Параметры, СтрокаТовара);
		КарточкаИнфоПолей.Вывести(ОбластьТаблицаСтрокаФХЖ2, 0);
		
		Для каждого ИнфоПолеФХЖ2 Из СтрокаТовара.ИнфоПоля Цикл
			ЗаполнитьЗначенияСвойств(ОбластьТаблицаИнфоПолеФХЖ2.Параметры, ИнфоПолеФХЖ2);
			КарточкаИнфоПолей.Вывести(ОбластьТаблицаИнфоПолеФХЖ2, 1);
		КонецЦикла;
		
	КонецЦикла;
	КарточкаИнфоПолей.ЗакончитьАвтоГруппировкуСтрок();
	
	КарточкаИнфоПолей.Вывести(ОбластьТаблицаКонецФХЖ2);
	
	Возврат Истина;
	
КонецФункции

Функция ВывестиВТабличныйДокументИнфоПоляФХЖ3(КарточкаИнфоПолей, МакетКарточки, ДанныеЗаполнения, ДополнительныеПараметры)

	Если НЕ ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ИнфоПоля", Новый Массив).Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбластьПустаяСтрока = МакетКарточки.ПолучитьОбласть("ОбластьПустаяСтрока");
	ОбластьШапкаФХЖ3 = МакетКарточки.ПолучитьОбласть("ОбластьШапкаФХЖ3");
	ОбластьИнфоПолеФХЖ3 = МакетКарточки.ПолучитьОбласть("ОбластьИнфоПолеФХЖ3");
	
	КарточкаИнфоПолей.Вывести(ОбластьПустаяСтрока);
	КарточкаИнфоПолей.Вывести(ОбластьШапкаФХЖ3);
	
	ИнфоПоляФХЖ3 = ДанныеЗаполнения.ИнфоПоля;
	Для каждого ИнфоПолеФХЖ3 Из ИнфоПоляФХЖ3 Цикл
		ЗаполнитьЗначенияСвойств(ОбластьИнфоПолеФХЖ3.Параметры, ИнфоПолеФХЖ3);
		КарточкаИнфоПолей.Вывести(ОбластьИнфоПолеФХЖ3);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли