
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ШаблонНаименования = СокрЛП(Type) + " " + XMLСтрока(Id) + " " + СокрЛП(Description_);
	ШаблонНаименования = СокрЛП(Description_);
	
	Если Наименование <> ШаблонНаименования Тогда
		Наименование = ШаблонНаименования;
	КонецЕсли;
		
	Если НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ОрганизацияДоступнаПользователю(Организация) Тогда
		Отказ = Истина;	
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			СсылкаНового = Справочники.ККСНГ_ЭлектронныеДокументы.ПолучитьСсылку();
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаНового);
			ГУИД = XMLСтрока(СсылкаНового);
		Иначе
			ГУИД = XMLСтрока(Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
