////////////////////////////////////////////////////////////////////////////////
// Модуль работы с приглашениями (Клиент-сервер)
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Возвращает соответствие доступных действий из строки маски действий СФЕРА Курьер
// см. https://confluence.esphere.ru/pages/viewpage.action?pageId=123469030 
//
// Параметры:
//	СтрокаМаскиДействий - строка - маска действий
//	Разделитель         - строка - разделитель для СтрРазделить
//
// Возвращаемое значение: 
//	ДоступныеДействия - Соответствие - ключ = действие, значение = доступность
//
Функция ПолучитьСоответствиеМаскиДействийИзСтроки(Знач СтрокаМаскиДействий, Разделитель = " ") Экспорт
	
	МассивДействий = СтрРазделить(СтрокаМаскиДействий, Разделитель, Ложь);
	ДоступныеДействия = Новый Соответствие;	
		
	Для Каждого Элем Из МассивДействий Цикл
		
		СтрокаДействие = СокрЛП(Элем);
		Если ДействиеДоступно(СтрокаДействие) Тогда
			ДоступныеДействия.Вставить(СтрокаДействие, Истина);			
		Иначе
			Продолжить;
		КонецЕсли; 		
		
	КонецЦикла; 
	
	Возврат ДоступныеДействия;
	
КонецФункции 

// Проверяет, доступно ли действие маски действий СФЕРА Курьер
//
// Возвращаемое значение: 
//
// Ложь,Истина - Булево - Доступность действия
//
Функция ДействиеДоступно(СтрокаДействие) Экспорт
	
	СписокНедоступныхДействий = Новый Соответствие();
	СписокНедоступныхДействий.Вставить("Add", "");
	СписокНедоступныхДействий.Вставить("Trash", "");
	СписокНедоступныхДействий.Вставить("Edit", "");
	СписокНедоступныхДействий.Вставить("Delete", "");
	СписокНедоступныхДействий.Вставить("EditableRoute", "");
	СписокНедоступныхДействий.Вставить("SubstituteSigner", "");
	СписокНедоступныхДействий.Вставить("PackageRouteSync", "");
	СписокНедоступныхДействий.Вставить("AcceptWithoutSign", "");
	СписокНедоступныхДействий.Вставить("RemoveFromPackage", "");
	СписокНедоступныхДействий.Вставить("SignReplyTicket", "");
	СписокНедоступныхДействий.Вставить("CreateSignatureTicket", "");
	
	// Временно убрал AssignableToSelf,RejectWithTicket,AvoidanceRequest,AcceptAvoidance
	
	Возврат СписокНедоступныхДействий.Получить(СтрокаДействие) = Неопределено;
	
КонецФункции

// Проверяет в структуре результата подписания ЭД данные о подписи. Если они помещены во временное хранилище (подпись производилась на сервере), 
//	то возвращает данные из хранилища, иначе возвраещает данные как есть.
//
// Параметры:
//	СтруктураРезультата - структура - содержит результаты подписания электронного документа.
// 
//	Возвращаемое значение:
//
// 	СвойстваПодписи - Структура - Данные о подписи.
//
Функция СвойстваПодписиИзРезультатаПодписания(СтруктураРезультата) Экспорт
	
	Если ТипЗнч(СтруктураРезультата.СвойстваПодписи) = Тип("Строка") Тогда
		СвойстваПодписи = ПолучитьИзВременногоХранилища(СтруктураРезультата.СвойстваПодписи);
	Иначе
		СвойстваПодписи = СтруктураРезультата.СвойстваПодписи;
	КонецЕсли;
			
	Возврат СвойстваПодписи;
	
КонецФункции

#КонецОбласти
