
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаСеанса = ТекущаяДатаСеанса();
	Период.ДатаНачала = НачалоМесяца(ДатаСеанса);
	Период.ДатаОкончания = КонецДня(ДатаСеанса);
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораПрофилейЭДО(ПрофильНастройкиЭДО, Элементы.ПрофильНастройкиЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ПрогрессБар.Видимость = Ложь;
	Элементы.ДекорацияИтоги.Видимость = Ложь;
	ИнициализироватьПараметрыСпискаДокументов();
	
	ВывестиПутьСохранения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастройкиКаталогВыгрузкиРасширенногоЭкспорта" Тогда
		ВывестиПутьСохранения();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрофильНастройкиЭДОПриИзменении(Элемент)
	
	УстановитьПараметрПрофиляСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьПараметрыПериодаСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьКаталогВыгрузкиЭкспортаНажатие(Элемент)
	
	КаталогВыгрузкиЭкспорта = НастройкиЭкспорта().Получить("КаталогВыгрузкиЭкспорта");
	Если ЗначениеЗаполнено(КаталогВыгрузкиЭкспорта) Тогда
		ЗапуститьПриложение(КаталогВыгрузкиЭкспорта);			
	Иначе
		ОткрытьОбщиеНастройки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено 
			Или Не Поле.Имя = "СписокДокументовВыгружен" 
			Или Не ЗначениеЗаполнено(АдресРезультатаЗапросаПакетов) Тогда
		Возврат;	
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;	
		
	ДанныеПакетов = ПолучитьИзВременногоХранилища(АдресРезультатаЗапросаПакетов);
	
	ДанныеПакета = ДанныеПакетов.Получить(ТекущиеДанные.Id);
	Если Не ДанныеПакета = Неопределено И Не ДанныеПакета.Успех Тогда
		ОтборПоСтатусам = "-1";
		КодыОшибокИсключения = "";
		ТекстовыйДокумент = ККСНГ_ЛогированиеКлиентСервер.ПолучитьЖурналКакТекстовыйДокумент(ДанныеПакета.Журнал, ОтборПоСтатусам, КодыОшибокИсключения);
		ТекстовыйДокумент.ТолькоПросмотр = Истина;
		ТекстовыйДокумент.Показать("Журнал ошибок при получении файлов по " + ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокДокументовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	АдресРезультатаЗапросаПакетов = Неопределено;
	Настройки.ДополнительныеСвойства.Свойство("АдресРезультатаЗапросаПакетов", АдресРезультатаЗапросаПакетов);
	
	ОчиститьСтатусы = Ложь;
	
	Если НЕ ЗначениеЗаполнено(АдресРезультатаЗапросаПакетов) Тогда
		ОчиститьСтатусы = Истина;
	Иначе
		ДанныеПакетов = ПолучитьИзВременногоХранилища(АдресРезультатаЗапросаПакетов);
		Если ДанныеПакетов = Неопределено Тогда
			ОчиститьСтатусы = Истина;
		КонецЕсли;		
	КонецЕсли;
	 
	Если ОчиститьСтатусы Тогда
		Для каждого СтрокаСписка Из Строки Цикл
			СтрокаСписка.Значение.Данные.Выгружен = "";	
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаСписка Из Строки Цикл
		
		ДанныеПакета = ДанныеПакетов.Получить(СтрокаСписка.Значение.Данные.Id);
		Если ДанныеПакета = Неопределено Тогда
			СтрокаСписка.Значение.Данные.Выгружен = "";
			Продолжить;	
		КонецЕсли;
		
		Если ДанныеПакета.Успех Тогда
			СтрокаСписка.Значение.Данные.Выгружен = "Архив сохранен";
		Иначе	
			
			ПоследняяОшибкаЖурнала = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ДанныеПакета.Журнал);
			
			Если ТипЗнч(ПоследняяОшибкаЖурнала) = Тип("Структура") Тогда
				СтрокаСписка.Значение.Данные.Выгружен = ПоследняяОшибкаЖурнала.Событие;
			Иначе	
				СтрокаСписка.Значение.Данные.Выгружен = "Ошибка";
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьАрхив(Команда)
	
	ОчиститьСообщения();
	Если ККСНГ_ОбщегоНазначенияВызовСервера.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Установлена блокировка работы с внешними ресурсами");
		Возврат;		
	КонецЕсли;                                 

	Если Не ЗначениеЗаполнено(НастройкиЭкспорта().Получить("КаталогВыгрузкиЭкспорта")) Тогда
		ПослеОтвета = Новый ОписаниеОповещения("ПослеОтветаНаВопросОПереходеКНастройкам", ЭтотОбъект);
		ТекстВопроса = "Не выбран каталог сохранения. Перейти к настройкам?";
		ЗаголовокВопроса = "Выбор каталога сохранения";
		ПоказатьВопрос(ПослеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса); 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите организацию ЭДО", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
	                                                           
	МассивИдентификаторовВыбранныхДокументов = МассивИдентификаторовВыбранныхДокументов();
	Если МассивИдентификаторовВыбранныхДокументов.Количество() = 0 Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите документы", , "СписокДокументов");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивИдентификаторовДокументов", МассивИдентификаторовВыбранныхДокументов);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапуститьФоновоеЗаданиеЭкспортаНаКлиенте", ЭтотОбъект, ДополнительныеПараметры);
	
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОПереходеКНастройкам(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьОбщиеНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьОбщиеНастройки();		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияСпискаДокументов

&НаКлиенте
Процедура УстановитьПараметрыПериодаСпискаДокументов()

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокДокументов, 
																				"ДатаНачала", НачалоДня(Период.ДатаНачала));
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокДокументов, 
																				"ДатаОкончания", КонецДня(Период.ДатаОкончания));	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрПрофиляСпискаДокументов()

	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокДокументов, 
																				"ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрТиповДокументовСпискаДокументов()

	ТипыДокументов = ВыбранныеТиповДокументов();
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокДокументов, 
																				"ТипыДокументов", ТипыДокументов);	

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьПараметрыСпискаДокументов()

	УстановитьПараметрПрофиляСпискаДокументов();
	
	УстановитьПараметрыПериодаСпискаДокументов();
	
	УстановитьПараметрТиповДокументовСпискаДокументов();

КонецПроцедуры

#КонецОбласти

#Область СохранениеАрхивовВФоне

&НаКлиенте
Процедура ОчиститьПеременныеФоновогоЗадания()

	ПрогрессБар = 0;
	Элементы.ПрогрессБар.Заголовок = "";
	Элементы.ПрогрессБар.Видимость = Истина;
	Элементы.ДекорацияИтоги.Заголовок = "";
	Элементы.ДекорацияИтоги.Видимость = Ложь;
	ИдентификаторЗаданияЭкспорта = Неопределено;
	ПоместитьВоВременноеХранилище(Неопределено, АдресРезультатаЗапросаПакетов);
	АдресРезультатаЗапросаПакетов = "";
	АдресРезультатаФоновогоЗадания = "";	

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновоеЗаданиеЭкспортаНаКлиенте(ЗапросПараметрыАвторизации, ДопПараметры = Неопределено) Экспорт

	ОчиститьПеременныеФоновогоЗадания();
	Элементы.СписокДокументов.Обновить();
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ЗаданиеЗапущено = ЗаданиеЗапущено();
		
		Если ЗаданиеЗапущено Тогда
			ПоказатьОповещениеПользователя(, , "Сохранение архива уже выполняется");
			Возврат;
		Иначе	
			ПоказатьОповещениеПользователя(, , "Сохранение архива");
		КонецЕсли;
		
		АдресРезультатаФоновогоЗадания = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
		ПараметрыФЗ = Новый Массив;
		ПараметрыФЗ.Добавить(ЗапросПараметрыАвторизации.Результат);
		ПараметрыФЗ.Добавить(ПрофильНастройкиЭДО);
		ПараметрыФЗ.Добавить(ДопПараметры.МассивИдентификаторовДокументов);
		ПараметрыФЗ.Добавить(АдресРезультатаФоновогоЗадания);
		
		КлючФЗ = "ЭкспортФайлов" + УникальныйИдентификатор;
		ИмяМетодаФЗ = "ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьДанныеПакетовФайловПоДокументам";
		
		ИдентификаторЗаданияЭкспорта = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьФоновоеЗадание(ИмяМетодаФЗ, ПараметрыФЗ, КлючФЗ, "Получение файлов документов");
		Если ЗначениеЗаполнено(ИдентификаторЗаданияЭкспорта) Тогда
			ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияЭкспорта", 2);
		Иначе
			УдалитьИзВременногоХранилища(АдресРезультатаФоновогоЗадания);
			АдресРезультатаФоновогоЗадания = "";			
		КонецЕсли;
		
	Иначе	
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗавершениеФоновогоЗаданияЭкспорта() Экспорт
	
	Если Не ЗаданиеЗапущено() Тогда
		Возврат;
	КонецЕсли;
	
	ИнфоОВыполнении = ККСНГ_ОбщегоНазначенияВызовСервера.ИнфоОВыполненииФоновогоЗадания(ИдентификаторЗаданияЭкспорта, 
																							"; пакет; ; пакета; пакетов; пакетов");
	Если ИнфоОВыполнении = Неопределено Тогда
		//ПрогрессБар = 0;
	Иначе	
		ПрогрессБар = ИнфоОВыполнении.Процент;
		Элементы.ПрогрессБар.Заголовок = СтрШаблон("Получение файлов: %1", ИнфоОВыполнении.Представление);
	КонецЕсли;
	
	Если ККСНГ_ОбщегоНазначенияВызовСервера.ЗаданиеВыполнено(ИдентификаторЗаданияЭкспорта) Тогда
		ОбработатьРезультатФоновогоЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаданиеЗапущено()

	Возврат ЗначениеЗаполнено(ИдентификаторЗаданияЭкспорта);

КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатФоновогоЗадания()

	Результат = ПроверитьРезультатФоновогоЗаданияНаСервере(АдресРезультатаФоновогоЗадания);
	Если Результат.Успех Тогда
		
		ИдентификаторЗаданияЭкспорта = Неопределено;
		ПрогрессБар = 100;
		Элементы.ПрогрессБар.Видимость = Ложь;
		
		РезультатФоновогоЗадания = ПолучитьИзВременногоХранилища(АдресРезультатаФоновогоЗадания);
		ДанныеПоФайлам = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатФоновогоЗадания, "ДанныеПоФайлам", Новый Массив());
		ПередаваемыеФайлы = ПодготовитьПередаваемыеФайлы(ДанныеПоФайлам);
		АдресРезультатаЗапросаПакетов = ПоместитьВоВременноеХранилище(ДанныеПоФайлам, УникальныйИдентификатор);
		
		ОписаниеОЗавершении = Новый ОписаниеОповещения("ПолучениеФайловЗавершение", ЭтотОбъект, , "ПолучениеФайловОшибки", ЭтотОбъект);
		НачатьПолучениеФайлов(ОписаниеОЗавершении, ПередаваемыеФайлы,, Ложь);
		
	Иначе	
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Результат.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеФайловОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПрогрессБар = 0;
	Элементы.ПрогрессБар.Заголовок = "";
	СписокДокументов.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресРезультатаЗапросаПакетов", АдресРезультатаЗапросаПакетов);
	Элементы.СписокДокументов.Обновить();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьПередаваемыеФайлы(ДанныеПоФайлам)
	
	ПередаваемыеФайлы = Новый Массив();
	Для каждого ДанныеФайла Из ДанныеПоФайлам Цикл
		
		ПараметрыПередаваемогоФайла = ДанныеФайла.Значение;
		Если ПараметрыПередаваемогоФайла.Успех Тогда
			
			ДвоичныеДанные = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПередаваемогоФайла, "Результат.Данные");
			Если ТипЗнч(ДвоичныеДанные) = Тип("ХранилищеЗначения") Тогда
				ДвоичныеДанные = ДвоичныеДанные.Получить();	
			ИначеЕсли ЭтоАдресВременногоХранилища(ДвоичныеДанные) Тогда
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДвоичныеДанные);
			КонецЕсли;
			
			Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные")  Тогда
				
				АдресПередаваемогоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
				ПолноеИмяПередаваемогоФайла = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПередаваемогоФайла, "Результат.ПолноеИмя", "");
				МаксДлинаПолногоПути = 259;
				Если СтрДлина(ПолноеИмяПередаваемогоФайла) > МаксДлинаПолногоПути Тогда
					ПараметрыПередаваемогоФайла.Успех = Ложь;
					ШаблонОшибки = НСтр("ru = 'Длина полного пути %1 превышает %2 символов'");
					ТекстОшибки = СтрШаблон(ШаблонОшибки, ПолноеИмяПередаваемогоФайла, МаксДлинаПолногоПути);
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ПараметрыПередаваемогоФайла.Журнал, ТекстОшибки, "FS-00001");
				ИначеЕсли Не ЗначениеЗаполнено(ПолноеИмяПередаваемогоФайла) Тогда
					ПараметрыПередаваемогоФайла.Успех = Ложь;
					ТекстОшибки = НСтр("ru = 'Не указано полное имя файла'");
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ПараметрыПередаваемогоФайла.Журнал, ТекстОшибки, "FS-00002");
				Иначе
					ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПолноеИмяПередаваемогоФайла, АдресПередаваемогоФайла));	
				КонецЕсли;			
				
			КонецЕсли;			
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат ПередаваемыеФайлы;
	
КонецФункции

&НаКлиенте
Процедура ПолучениеФайловЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	СохраненоКоличество = 0;
	Если Не ПолученныеФайлы = Неопределено Тогда
		Для каждого ПолученныйФайл Из ПолученныеФайлы Цикл
			ФайлНаДиске = Новый Файл(ПолученныйФайл.ПолноеИмя);
			Если ФайлНаДиске.Существует() Тогда
				ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СохраненоКоличество);	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	КоличествоСтрокой = ККСНГ_ОбщегоНазначенияВызовСервера.КоличествоСтрокой("; пакет; ; пакета; пакетов; пакетов", СохраненоКоличество);
	Элементы.ДекорацияИтоги.Заголовок = СтрШаблон("Сохранено на диск: %1", КоличествоСтрокой);
	Элементы.ДекорацияИтоги.Видимость = Истина;
	
	КаталогВыгрузки = НастройкиЭкспорта().Получить("КаталогВыгрузкиЭкспорта");
	ДопПараметры = Новый Структура("КаталогВыгрузки", КаталогВыгрузки);
	ОткрытиеПапки = Новый ОписаниеОповещения("ОткрытиеПапкиНаКлиенте", ЭтотОбъект, ДопПараметры);
	
	ПоказатьОповещениеПользователя(, ОткрытиеПапки, "Архив сохранен в " + Символы.ПС + КаталогВыгрузки);
	
	СписокДокументов.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресРезультатаЗапросаПакетов", АдресРезультатаЗапросаПакетов);
	Элементы.СписокДокументов.Обновить();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРезультатФоновогоЗаданияНаСервере(АдресХранилища)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Успех", Неопределено) <> Неопределено Тогда
		
		Ответ.Успех = Истина;
		
		Возврат Ответ;
		
	КонецЕсли;
	
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Фоновое задание экспорта файлов документов завершилось аварийно", "UPD-00001");
	
	Возврат Ответ;

КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОткрытиеПапкиНаКлиенте(Параметры) Экспорт

	ЗапуститьПриложение(Параметры.КаталогВыгрузки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиЭкспорта()
	Возврат ККСНГ_ЭлектронныеДокументыВызовСервера.НастройкиЭкспорта();
КонецФункции

&НаКлиенте
Функция МассивИдентификаторовВыбранныхДокументов()

	МассивИдентификаторовВыбранныхДокументов = Новый Массив;
	
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	Для каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		МассивИдентификаторовВыбранныхДокументов.Добавить(Элементы.СписокДокументов.ДанныеСтроки(ТекущаяСтрока).Id);
	КонецЦикла;

	Возврат МассивИдентификаторовВыбранныхДокументов;
	
КонецФункции

&НаКлиенте
Функция ВыбранныеТиповДокументов()

	ТипыДокументов = НастройкиЭкспорта().Получить("ТипыДокументовЭкспорта");
	Если ТипыДокументов = Неопределено Тогда
		
		ТипыДокументов = Новый СписокЗначений();
		ТипыДокументов.Добавить("UPD_DOP");
		ТипыДокументов.Добавить("UPD_SF");
		ТипыДокументов.Добавить("UPD_SF_DOP");
		ТипыДокументов.Добавить("UCD_DIC");
		ТипыДокументов.Добавить("UCD_CSF");
		ТипыДокументов.Добавить("UCD_CSF_DIC");
		
	Иначе	
		
		Для каждого ТипДокумента Из ТипыДокументов Цикл
			Если НЕ ТипДокумента.Пометка Тогда
				Продолжить;
			КонецЕсли;
			КраткоеПредставлениеТипа = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.КраткоеПредставлениеТипаДокумента(ТипДокумента.Значение);
			ТипыДокументов.Добавить(КраткоеПредставлениеТипа);
		КонецЦикла;
		
	КонецЕсли;

	Возврат ТипыДокументов;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОбщиеНастройки()
	
	Если ККСНГ_ПодключаемыеМодулиКлиент.РаботаСПодключаемымиМодулямиДоступна() Тогда
		ОткрытьФорму("ОбщаяФорма.ККСНГ_ОбщиеНастройки", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПутьСохранения()
	
	КаталогВыгрузкиЭкспорта = НастройкиЭкспорта().Получить("КаталогВыгрузкиЭкспорта");	
	Если ЗначениеЗаполнено(КаталогВыгрузкиЭкспорта) Тогда
		Элементы.НадписьКаталогВыгрузкиЭкспорта.Заголовок = КаталогВыгрузкиЭкспорта;
	Иначе
		Элементы.НадписьКаталогВыгрузкиЭкспорта.Заголовок = "<Заполните каталог сохранения>";
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти













