
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ККСНГ_ОбщегоНазначенияВызовСервера.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	
	Параметры.Свойство("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	Параметры.Свойство("БизнесПроцесс", БизнесПроцесс);
	
	ЭтаФорма.Заголовок = СтрШаблон("Отправка файлов (%1)", ПрофильНастройкиЭДО);
	
	ДатаДокумента = ТекущаяДатаСеанса();
	
	ДоступнаРаботаСЧерновиками = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяОтправкаЧерновиков();
	Элементы.ФормаДобавитьВЧерновики.Видимость = ДоступнаРаботаСЧерновиками;
	
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	Если НЕ МодульККСНГ_ПМ_РаботаСМетаданными = Неопределено Тогда
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.ДоговорУВХД, "ДоговорыСоглашения");
	КонецЕсли;
	
	Если БизнесПроцесс = "УВХД" Тогда
		СписокКонтрагентовСбер = ПолучитьСписокКонтрагентовСбер(ПрофильНастройкиЭДО, "КонтрагентЭДО");
		Если СписокКонтрагентовСбер.Количество() = 1 Тогда
			Получатель = СписокКонтрагентовСбер[0].Значение;
		КонецЕсли;
		
		СписокНаименованийДокумента = ККСНГ_ЭлектронныеДокументы.ПолучитьСписокНаименованийДокументаУВХД();
		ИмяДокументаСписокВыбора = Элементы.НаименованиеДокументаУВХД.СписокВыбора;
		ИмяДокументаСписокВыбора.Очистить();
		
		Для Каждого НаименованиеДокумента Из СписокНаименованийДокумента Цикл
			ИмяДокументаСписокВыбора.Добавить(НаименованиеДокумента.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступныеПрофилиЭДО = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДоступныеПрофилиЭДОПользователя();
	
	Если ЗначениеЗаполнено(ПрофильНастройкиЭДО) И ДоступныеПрофилиЭДО.Найти(ПрофильНастройкиЭДО) = Неопределено Тогда
		Отказ = Истина;
		ТекстОшибки = СтрШаблон("Организация %1 недоступна пользователю", ПрофильНастройкиЭДО);
		ККСНГ_ЛогированиеКлиентСервер.ВывестиСообщениеПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	УстановитьТипДокумента = Новый ОписаниеОповещения("ПослеЗаполнениеТиповДокументов", ЭтотОбъект);
	НачатьЗаполнениеТиповДокументов(УстановитьТипДокумента);
	
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПослеВыбораПолучателя(Получатель, Неопределено);
	КонецЕсли;
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьКонтрагентаЭДО" И Источник = Получатель Тогда
		ЗагрузитьСписокВыбораДоговоровУВХД(Получатель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если БизнесПроцесс = "УВХД" Тогда
		ПроверяемыеРеквизиты.Добавить("ДоговорУВХД");
		Если ТипДокумента = "DOCUMENT" Тогда
			ПроверяемыеРеквизиты.Добавить("НаименованиеДокументаУВХД");
		КонецЕсли;
	КонецЕсли;
	
	Если Не РежимНесколькоПолучателей Тогда
		ПроверяемыеРеквизиты.Добавить("Получатель");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ТипДокумента.СписокВыбора.Количество() = 0 Тогда
		Если Не ЗаполненПрофильЭДО() Тогда 
			СтандартнаяОбработка = Ложь;
		Иначе
			НачатьЗаполнениеТиповДокументов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИтогиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СтатусОтправки", 2);	
	СтрокиСОшибками = Получатели.НайтиСтроки(ПараметрыОтбора);
	ОтправленныеСОшибками = Новый Массив;
	Для каждого ТекСтрока Из СтрокиСОшибками Цикл 
		ТекОшибка = Новый Структура;
		ТекОшибка.Вставить("КонтрагентЭДО", ТекСтрока.КонтрагентЭДО); 
		ТекОшибка.Вставить("ТекстОшибки", ТекСтрока.ТекстОшибки); 
		
		ОтправленныеСОшибками.Добавить(ТекОшибка);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("ОтправленныеСОшибками", ОтправленныеСОшибками);
	ОткрытьФорму("Обработка.ККСНГ_СфераКурьер.Форма.ФормаОписаниеОшибок", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ПрофильНастройкиЭДО);
	
	Если БизнесПроцесс = "УВХД" Тогда
		СписокКонтрагентовСбер = ПолучитьСписокКонтрагентовСбер(ПрофильНастройкиЭДО);
		ПараметрыОтбора.Вставить("Контрагент", СписокКонтрагентовСбер);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораПолучателя", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ККСНГ_Контрагенты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКДокументуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтправляемыеФайлы.Очистить();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл для отправки";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорУВХДОчистка(Элемент, СтандартнаяОбработка)
	
	ДоговорУВХД = Неопределено;
	ЗагрузитьСписокВыбораТиповДокумента();
	ЗаполнитьДопПараметрыПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорУВХДОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДоговорУВХД = ВыбранноеЗначение;
	ЗагрузитьСписокВыбораТиповДокумента(ВыбранноеЗначение);
	ЗаполнитьДопПараметрыПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	
	ТипДокумента = "";
	ЗаполнитьДопПараметрыПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	ЗаполнитьДопПараметрыПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ПослеВыбораПолучателя(Получатель, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКДокументуПриИзменении(Элемент)
	
	ВыбранныеФайлы = Новый Массив;
	ВыбранныеФайлы.Добавить(ПутьКДокументу);
	
	ОбработатьВыборФайла(ВыбранныеФайлы, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДокументаУВХДПриИзменении(Элемент)
	
	ЗаполнитьДопПараметрыПоУмолчанию();
	
КонецПроцедуры

#Область ОбработчикиСобытийПоПолучателям

&НаКлиенте
Процедура ПодборКонтрагентовЭДО(Команда)
	
	Если Не ЗаполненПрофильЭДО() Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ПрофильНастройкиЭДО);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	// TODO: сделать общий универсальный метод получения реквизита по названию, обсудить в каком модуле
	ВозможноУстановитьОтборПоИНН = ВозможноУстановитьОтборПоИНН();
	Если ВозможноУстановитьОтборПоИНН Тогда
		
		НастройкиКД = Новый НастройкиКомпоновкиДанных;
		ОтборСсылка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСсылка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент.ИНН");
		ОтборСсылка.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборСсылка.ПравоеЗначение = "7707083893";
		ОтборСсылка.Использование = Истина;
		
	КонецЕсли;
	
	НестандартныйОтбор = Новый Структура;
	НестандартныйОтбор.Вставить("НестандартныйОтбор", НастройкиКД);
	
	ПараметрыФормы.Вставить("ДополнительныеПараметры", НестандартныйОтбор);
	
	ОткрытьФорму("Справочник.ККСНГ_Контрагенты.ФормаВыбора", ПараметрыФормы, Элементы.Получатели);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого ВыбранныйКонтрагентЭДО Из ВыбранноеЗначение Цикл
		
		ЭтоКонтрагентСбер = ККСНГ_РаботаСКонтрагентамиВызовСервера.ЭтоКонтрагентСбер(ВыбранныйКонтрагентЭДО);
		Если РежимНесколькоПолучателей И ЭтоКонтрагентСбер Тогда
			ТекстСообщения = "ПАО Сбербанк можно выбрать в режиме одного получателя";
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("КонтрагентЭДО", ВыбранныйКонтрагентЭДО);
		ТакиеЖеКонтрагентыЭДО = Получатели.НайтиСтроки(ПараметрыПоиска);
		
		Если ТакиеЖеКонтрагентыЭДО.Количество() = 0 Тогда 
			НоваяСтрока = Получатели.Добавить();
			НоваяСтрока.КонтрагентЭДО = ВыбранныйКонтрагентЭДО;
			
			РеквизитыКонтрагента = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИмеющегосяРеквизитаОбъекта(НоваяСтрока.КонтрагентЭДО, "Контрагент.ИНН, Контрагент.КПП");
			НоваяСтрока.ИНН = РеквизитыКонтрагента.Получить("ИНН");
			НоваяСтрока.КПП = РеквизитыКонтрагента.Получить("КПП");
		Иначе
			ШаблонСообщения = "Получатель был добавлен ранее: %1";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранныйКонтрагентЭДО);
			ИндексСтроки = Получатели.Индекс(ТакиеЖеКонтрагентыЭДО[0]);
			СтрокаПоля = СтрШаблон("Получатели[%1].КонтрагентЭДО", ИндексСтроки);
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , СтрокаПоля);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрокаПолучателя = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрокаПолучателя.ОтправленныйЭД) Тогда 
		ОткрываемыйЭлемент = ТекСтрокаПолучателя.ОтправленныйЭД;
	Иначе
		ОткрываемыйЭлемент = ТекСтрокаПолучателя.КонтрагентЭДО;
	КонецЕсли;
	
	ПоказатьЗначение(, ОткрываемыйЭлемент);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодписатьОтправить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		НачатьОтправкуДокумента(Истина, "ПодписатьОтправить");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		НачатьОтправкуДокумента(Ложь, "Отправить");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВЧерновики(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		НачатьОтправкуДокумента(Ложь, "ДобавитьВЧерновики");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДопПараметры(Команда)
	
	Если Не ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
		Возврат;
	КонецЕсли;
	
	Если РежимНесколькоПолучателей И Не Элементы.Получатели.ТекущиеДанные = Неопределено Тогда
		ТекущийПолучатель = Элементы.Получатели.ТекущиеДанные.КонтрагентЭДО;
	ИначеЕсли Не РежимНесколькоПолучателей И ЗначениеЗаполнено(Получатель) Тогда
		ТекущийПолучатель = Получатель;
	Иначе
		ТекущийПолучатель = Неопределено;
	КонецЕсли;
	
	Если ТекущийПолучатель = Неопределено Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран получатель.");
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПрофильНастройкиЭДО", ПрофильНастройкиЭДО);
	ДопПараметры.Вставить("ЭтоДокументУВХД", Элементы.ДоговорУВХД.СписокВыбора.Количество() > 0);
	ДопПараметры.Вставить("ВидЭД", ТипДокумента);
	ДопПараметры.Вставить("Получатель", ТекущийПолучатель);
	ДопПараметры.Вставить("ДокументСтруктурированный", Ложь);
	ДопПараметры.Вставить("Договор", ДоговорУВХД);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ДопАтрибуты", Неопределено);
	ПараметрыЗаполнения.Вставить("ДопПараметры", Неопределено);
	ПараметрыЗаполнения.Вставить("Вложения", Неопределено);
	ПараметрыЗаполнения.Вставить("ЗапросПодписи", Неопределено);
	ПараметрыЗаполнения.Вставить("Комментарий", Неопределено);
	ПараметрыЗаполнения.Вставить("УстановленыДопАтрибуты", Ложь);
	ПараметрыЗаполнения.Вставить("УстановленыДопПараметры", Ложь);
	ПараметрыЗаполнения.Вставить("ЕстьВложения", Ложь);
	
	ОтборПоиска = Новый Структура;
	ОтборПоиска.Вставить("КонтрагентЭДО", ТекущийПолучатель);
	НайденнныеСтроки = ДопРеквизитыПолучателей.НайтиСтроки(ОтборПоиска);
	Если НайденнныеСтроки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, НайденнныеСтроки[0]);
		ПараметрыЗаполнения.УстановленыДопАтрибуты = ЗначениеЗаполнено(ПараметрыЗаполнения.ДопАтрибуты);
		ПараметрыЗаполнения.УстановленыДопПараметры = ЗначениеЗаполнено(ПараметрыЗаполнения.ДопПараметры);
		ПараметрыЗаполнения.ЕстьВложения = ЗначениеЗаполнено(ПараметрыЗаполнения.Вложения);
	КонецЕсли;
	
	ДопПараметры.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеАвторизацииДополнительныеРеквизиты", ЭтотОбъект, ДопПараметры);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНесколькоПолучателей(Команда)
	
	Если РежимНесколькоПолучателей Тогда
		ДоговорУВХД = Неопределено;
		Если Получатели.Количество() > 0 Тогда
			ТекущийПолучатель = Получатели[0].КонтрагентЭДО;
		Иначе
			ТекущийПолучатель = Неопределено;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Получатель) Тогда
		ТекущийПолучатель = Получатель;
	Иначе
		ТекущийПолучатель = Неопределено;
	КонецЕсли;
	
	РежимНесколькоПолучателей = Не РежимНесколькоПолучателей;
	
	ОбновитьТаблицуПолучателей(ТекущийПолучатель);
	
	ЗагрузитьСписокВыбораТиповДокумента();
	
	ОчиститьРезультатыОтправки();
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЗаполненПрофильЭДО()
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		ТекстСообщения = "Сначала выберите, пожалуйста, организацию.";
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ПрофильНастройкиЭДО");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ЗаполненыОбязательныеРеквизиты()
	
	Успех = ЗаполненПрофильЭДО();
	
	ОбязательныеРеквизитыСообщения = Новый Соответствие;
	ОбязательныеРеквизитыСообщения.Вставить("НомерДокумента", "Заполните, пожалуйста, номер документа.");
	ОбязательныеРеквизитыСообщения.Вставить("ДатаДокумента", "Заполните, пожалуйста, дату документа.");
	ОбязательныеРеквизитыСообщения.Вставить("ТипДокумента", "Выберите, пожалуйста, тип документа.");
	ОбязательныеРеквизитыСообщения.Вставить("Получатели", "Выберите, пожалуйста, хотя бы одного получателя документа.");
	ОбязательныеРеквизитыСообщения.Вставить("ОтправляемыеФайлы", "Выберите, пожалуйста, файл для документа.");
	
	Для Каждого ТекЭлемент Из ОбязательныеРеквизитыСообщения Цикл
		ИмяРеквизита = ТекЭлемент.Ключ;
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]) Тогда
			ТекстСообщения = ТекЭлемент.Значение;
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяРеквизита);
			Успех = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Успех;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьРезультатыОтправки()
	
	Элементы.ДекорацияИтоги.Заголовок = "";
	Элементы.ДекорацияИтоги.Видимость = Ложь;
	
	Для каждого СтрокаПолучателя Из Получатели Цикл
		
		СтрокаПолучателя.СтатусОтправки = 0;
		СтрокаПолучателя.ОтправленныйЭД = Неопределено;
		СтрокаПолучателя.ТекстОшибки = "";
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокВыбораДоговоровУВХД(ВыбранныйПолучатель = Неопределено)
	
	ДоговорУВХДСписокВыбора = Элементы.ДоговорУВХД.СписокВыбора;
	ДоговорУВХДСписокВыбора.Очистить();
	
	СписокДоговоровУВХД = ПолучитьСписокДоговоровУВХД(ВыбранныйПолучатель);
	
	Для каждого ЭлементСписка Из СписокДоговоровУВХД Цикл
		ДоговорУВХДСписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
	Если ДоговорУВХДСписокВыбора.Количество() = 1 Тогда
		ДоговорУВХД = ДоговорУВХДСписокВыбора[0].Значение;
		ЗаполнитьДопПараметрыПоУмолчанию();
	Иначе
		ДоговорУВХД = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоговоровУВХД(ВыбранныйПолучатель)
	
	СписокДоговоров = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыДоговорыУВХД.Договор1С КАК Договор1С
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты.ДоговорыУВХД КАК КонтрагентыДоговорыУВХД
	|ГДЕ
	|	КонтрагентыДоговорыУВХД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранныйПолучатель);
	
	ДоговорыУВХД = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаДоговорыУВХД Из ДоговорыУВХД Цикл
		
		ДоговорСсылка = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуОбъектаПоЗначениюСвойства(СтрокаДоговорыУВХД.Договор1С);
		
		Если ЗначениеЗаполнено(ДоговорСсылка) Тогда
			СписокДоговоров.Добавить(ДоговорСсылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокДоговоров;
	
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеДанныхФормы()
	
	Если БизнесПроцесс = "УВХД" Тогда
		РежимНесколькоПолучателей = Ложь;
		Элементы.ПереключитьНесколькоПолучателей.Видимость = Ложь;
		Элементы.ДоговорУВХД.Видимость = Истина;
		
		Если ТипДокумента = "DOCUMENT" Тогда
			Элементы.НаименованиеДокументаУВХД.Видимость = Истина;
			Элементы.ГруппаДопПараметры.Видимость = Истина;
		Иначе
			Элементы.НаименованиеДокументаУВХД.Видимость = Ложь;
			Элементы.ГруппаДопПараметры.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		Элементы.ПереключитьНесколькоПолучателей.Видимость = Истина;
		Элементы.ДоговорУВХД.Видимость = Ложь;
		Элементы.НаименованиеДокументаУВХД.Видимость = Ложь;
		Элементы.ГруппаДопПараметры.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Получатели.Видимость = РежимНесколькоПолучателей;
	Элементы.ГруппаПолучатель.Видимость = Не РежимНесколькоПолучателей;
	Элементы.УстановитьДопПараметры.Видимость = Не РежимНесколькоПолучателей;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПолучателей(ТекущийПолучатель)
	
	Получатели.Очистить();
	Получатель = ТекущийПолучатель;
	Если ЗначениеЗаполнено(ТекущийПолучатель) Тогда
		НовыйПолучательМассив = Новый Массив;
		НовыйПолучательМассив.Добавить(ТекущийПолучатель);
		ПолучателиОбработкаВыбора(Элементы.Получатели, НовыйПолучательМассив, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлыПослеПомещенияФайлов(ПомещенныеФайлы, ДопПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = ДопПараметры.МассивФайлов;
	
	Для каждого ЭлФайл Из МассивФайлов Цикл
		Для каждого ОписаниеПереданногоФайла Из ПомещенныеФайлы Цикл
			Если ОписаниеПереданногоФайла.ПолноеИмя = ЭлФайл.ПолноеИмя Тогда
				ЭлФайл.АдресДанных = ОписаниеПереданногоФайла.Хранение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	Для каждого ЭлФайл Из МассивФайлов Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяФайла", ЭлФайл.Имя); 
		ЗаменяемыеФайлы = ОтправляемыеФайлы.НайтиСтроки(Отбор);
		Если ЗаменяемыеФайлы.Количество() > 0 Тогда
			СтрокаФайла = ЗаменяемыеФайлы[0];
		Иначе 
			СтрокаФайла = ОтправляемыеФайлы.Добавить();
		КонецЕсли;
		
		СтрокаФайла.ИмяФайла = ЭлФайл.Имя;
		СтрокаФайла.ПолноеИмя = ЭлФайл.ПолноеИмя;
		СтрокаФайла.АдресДанных = ЭлФайл.АдресДанных;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ОтправляемыеФайлы.Очистить();
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКДокументу = ВыбранныеФайлы[0];
	Если Не ЗначениеЗаполнено(ПутьКДокументу) Тогда
		Возврат;
	КонецЕсли;	
	
	Файл = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКДокументу);
	КороткоеИмяФайла = Файл.Имя;
	
	ФайлНаДиске = Новый Файл(ПутьКДокументу);
	
	Попытка
		РазмерФайла = ФайлНаДиске.Размер();
	Исключение
		ТекстОшибки = СтрШаблон("Файл не существует: %1", КороткоеИмяФайла);
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ПутьКДокументу = "";
		Возврат;
	КонецПопытки;
	
	Если РазмерФайла = 0 Тогда
		ТекстОшибки = СтрШаблон("Нельзя добавить пустой файл: %1", КороткоеИмяФайла);
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ПутьКДокументу = "";
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ПутьКДокументу);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещаемыеФайлы.Добавить(ОписаниеФайла);
	
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый Структура("Имя, ПолноеИмя, АдресДанных", КороткоеИмяФайла, Файл.ПолноеИмя));
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("МассивФайлов", МассивФайлов);
	ДопПараметры.Вставить("ПомещаемыеФайлы", ПомещаемыеФайлы);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьФайлыПослеПомещенияФайлов", ЭтотОбъект, ДопПараметры);
	
	НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАвторизацииДополнительныеРеквизиты(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Если ЗапросПараметрыАвторизации.Успех Тогда
		
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		ДопПараметры.Вставить("БизнесПроцесс", БизнесПроцесс);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУстановкиДопПараметров", ЭтотОбъект);
		ОткрытьФорму("Обработка.ККСНГ_ДополнительныеРеквизитыЭД.Форма.Форма", ДопПараметры, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДопПараметрыПоУмолчанию()
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ПрофильКонтрагента", Получатель);
	ПараметрыДокумента.Вставить("КодТипаДокумента", ТипДокумента);
	ПараметрыДокумента.Вставить("Договор", ДоговорУВХД);
	ПараметрыДокумента.Вставить("ДокументСсылка", Неопределено);
	
	ДопПараметрыЗапроса = Новый Структура();
	ДопПараметрыЗапроса.Вставить("БизнесПроцесс", БизнесПроцесс);
	ДопПараметрыЗапроса.Вставить("РезультатСтрокой", Истина);
	
	Если БизнесПроцесс = "УВХД" И ТипДокумента = "DOCUMENT" Тогда
		ДопПараметрыЗапроса.Вставить("НаименованиеДокументаУВХД", НаименованиеДокументаУВХД);
	КонецЕсли;
	
	Результат = ДополнительныеПараметрыДокумента(ПараметрыДокумента, ДопПараметрыЗапроса);
	
	СтрокаПолучателя = Неопределено;
	
	ОтборПоиска = Новый Структура;
	ОтборПоиска.Вставить("КонтрагентЭДО", Получатель);
	НайденнныеСтроки = ДопРеквизитыПолучателей.НайтиСтроки(ОтборПоиска);
	Если НайденнныеСтроки.Количество() > 0 Тогда
		СтрокаПолучателя = НайденнныеСтроки[0];
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		
		Если СтрокаПолучателя = Неопределено Тогда
			СтрокаПолучателя = ДопРеквизитыПолучателей.Добавить();
		КонецЕсли;
		
		СтрокаПолучателя.ДопПараметры = Результат;
		СтрокаПолучателя.КонтрагентЭДО = Получатель;
		
		// TODO: сделать вывод признака доп реквизитов и аттрибутов
		//НайденнныеСтрокиПолучатели = Получатели.НайтиСтроки(ОтборПоиска);
		//Если НайденнныеСтрокиПолучатели.Количество() > 0 Тогда
		//	СтрокаИзТаблицыПолучателей = НайденнныеСтрокиПолучатели[0];
		//	СтрокаИзТаблицыПолучателей. = ;
		//КонецЕсли;
		
	ИначеЕсли СтрокаПолучателя <> Неопределено  Тогда
		ДопРеквизитыПолучателей.Удалить(СтрокаПолучателя);
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозможноУстановитьОтборПоИНН()
	
	ЕстьИНН = Метаданные.Справочники.Контрагенты.Реквизиты.Найти("ИНН");
	
	Возврат ЕстьИНН <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросПриЗавершенииФЗ(Ответ, ДопПараметры) Экспорт
	
	Если Ответ Тогда
		ПутьКДокументу = "";
		НомерДокумента = "";
		ДатаДокумента = Дата(1, 1, 1);
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОбновитьТаблицуПолучателей(Результат);
		
		Получатель = Результат;
		
		Если БизнесПроцесс = "УВХД" Тогда
			ЗагрузитьСписокВыбораДоговоровУВХД(Получатель);
			ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД);
		КонецЕсли;
		
		ОбновитьОтображениеДанныхФормы();
		
	КонецЕсли;
	
КонецПроцедуры

#Область ЗаполнениеТиповДокументов

&НаКлиенте
Процедура НачатьЗаполнениеТиповДокументов(ПослеЗаполнения = Неопределено)
	
	Элементы.ТипДокумента.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПослеЗаполнения", ПослеЗаполнения);
		ПослеАвторизации = Новый ОписаниеОповещения("ПродолжитьЗаполнениеТиповДокументов", ЭтотОбъект, ДопПараметры);
		
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеТиповДокументов(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("");
	
	ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
	СобытиеОшибки = "Не удалось заполнить типы документов";
	КодОшибки = "MASS-00001";
	ШаблонСообщения = "Не удалось получить список доступных типов документов для организации по причине: ";
	ПослеЗаполнения = ДопПараметры.ПослеЗаполнения;
	
	Если Не ЗапросПараметрыАвторизации.Успех Тогда
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросПараметрыАвторизации.Журнал);
		Если ПоследняяОшибка <> Неопределено Тогда
			ТекстСообщения = ШаблонСообщения + Символы.ПС + ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
		КонецЕсли;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, ТекстСообщения);
		
		Если ПослеЗаполнения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ПослеЗаполнения, Ответ);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЗапросТиповДокументов = ККСНГ_ДокументооборотВызовСервера.СписокДоступныхНеструктурированныхТиповДокументов(ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросТиповДокументов.Журнал, Ложь);	
	
	Если ЗапросТиповДокументов.Успех Тогда	
		
		СписокНеструктурированныхТипов = ЗапросТиповДокументов.Результат;
		
		Для каждого ТекТип Из СписокНеструктурированныхТипов Цикл
			Элементы.ТипДокумента.СписокВыбора.Добавить(ТекТип.Значение, ТекТип.Представление);
		КонецЦикла;
		
		Ответ.Успех = Истина;
		
	Иначе
		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросТиповДокументов.Журнал);
		Если ПоследняяОшибка <> Неопределено Тогда
			ТекстСообщения = ШаблонСообщения + Символы.ПС + ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
		КонецЕсли;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, ТекстСообщения);
	КонецЕсли;
	
	Если ПослеЗаполнения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПослеЗаполнения, Ответ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполнениеТиповДокументов(Ответ, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДоговорУВХД) Тогда
		ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД);
	ИначеЕсли Ответ.Успех Тогда
		ЗаполнитьТипДокументаПоУмолчанию();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипДокументаПоУмолчанию()
	
	ТипДокументаПоУмолчанию = "DOCUMENT";
	
	Если Элементы.ТипДокумента.СписокВыбора.НайтиПоЗначению(ТипДокументаПоУмолчанию) <> Неопределено Тогда
		ТипДокумента = ТипДокументаПоУмолчанию;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД = Неопределено)
	
	ОграниченияТипов = Новый Массив();
	Если БизнесПроцесс = "УВХД" Тогда
		ОграниченияТипов.Добавить("ACT");
		ОграниченияТипов.Добавить("ACT_PROD");
		ОграниченияТипов.Добавить("DOCUMENT");
	КонецЕсли;
	
	ТипДокументаСписокВыбора = Элементы.ТипДокумента.СписокВыбора;
	ТипДокументаСписокВыбора.Очистить();
	Для каждого ТекТип Из СписокНеструктурированныхТипов Цикл
		Если ОграниченияТипов.Количество() И ОграниченияТипов.Найти(ТекТип.Значение) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипДокументаСписокВыбора.Добавить(ТекТип.Значение, ТекТип.Представление);
	КонецЦикла;
	
	Если ТипДокументаСписокВыбора.НайтиПоЗначению(ТипДокумента) = Неопределено Тогда
		ТипДокумента = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// ЗаполнениеТиповДокументов
#КонецОбласти

#Область ОтправкаДокумента

&НаКлиенте
Процедура НачатьОтправкуДокумента(Подписать, ВариантОтправки)
	
	Если Не ЗаполненыОбязательныеРеквизиты() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьРезультатыОтправки();
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Подписать", Подписать);
	ДопПараметры.Вставить("ВариантОтправки", ВариантОтправки);
	
	ПослеАвторизации = Новый ОписаниеОповещения("ПродолжитьОтправкуДокумента", ЭтотОбъект, ДопПараметры);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ПослеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтправкуДокумента(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
	
	Перем ПараметрыАвторизации, Подписать, ВариантОтправки;
	Перем ПоследняяОшибка, ТекстСообщения, ДопПараметрыУстановленныеСтроки;
	Перем ПараметрыДокумента, ДопПараметрыЗапроса, ДопПараметрыПоУмолчанию;
	Перем ДопПараметрыДополнение, ДанныеПроверки, ЗапросПроверкаДопПараметров;
	Перем ЗапросКарточкиДокумента, ДанныеКарточки, Получатель;
	Перем ДопРеквизиты, Реквизиты, ДанныеНаПодпись;
	Перем ПередПодписанием, ПослеПодписания, ДопПараметрыУстановленныеСтрока;
	
	ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
	
	Подписать = ДопПараметры.Подписать;
	ВариантОтправки = ДопПараметры.ВариантОтправки;
	
	Если Не ЗапросПараметрыАвторизации.Успех Тогда
		ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ПрофильНастройкиЭДО, ПараметрыАвторизации);
		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросПараметрыАвторизации.Журнал);
		Если ПоследняяОшибка <> Неопределено Тогда
			ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
		Иначе 
			ТекстСообщения = "Ошибка авторизации.";
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Отправка документов прервана.";
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если БизнесПроцесс = "УВХД" Тогда
		
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("ПрофильКонтрагента", ЭтотОбъект.Получатель);
		ПараметрыДокумента.Вставить("КодТипаДокумента", ТипДокумента);
		ПараметрыДокумента.Вставить("Договор", ДоговорУВХД);
		ПараметрыДокумента.Вставить("ДокументСсылка", Неопределено);
		
		ДопПараметрыЗапроса = Новый Структура();
		ДопПараметрыЗапроса.Вставить("БизнесПроцесс", БизнесПроцесс);
		
		ДопПараметрыПоУмолчанию = ДополнительныеПараметрыДокумента(ПараметрыДокумента, ДопПараметрыЗапроса);
		ДопПараметрыДополнение = Новый Структура("УстановленыДопПараметры, ДопПараметры", Ложь);
		
		ДопПараметрыУстановленныеСтроки = ДопРеквизитыПолучателей.НайтиСтроки(Новый Структура("КонтрагентЭДО", ЭтотОбъект.Получатель));
		Если ДопПараметрыУстановленныеСтроки.Количество() = 1 Тогда
			ДопПараметрыУстановленныеСтрока = ДопПараметрыУстановленныеСтроки[0];
			ЗаполнитьЗначенияСвойств(ДопПараметрыДополнение, ДопПараметрыУстановленныеСтрока);
			ДопПараметрыДополнение.УстановленыДопПараметры = ЗначениеЗаполнено(ДопПараметрыДополнение.ДопПараметры);
		КонецЕсли;
		
		ДанныеПроверки = ДополнитьДопПараметры(ДопПараметрыПоУмолчанию, ДопПараметрыДополнение);
		
		ЗапросПроверкаДопПараметров = ПроверитьЗаполнениеДопПараметровДокумента(ДанныеПроверки);
		Если Не ЗапросПроверкаДопПараметров.Успех Тогда	
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПроверкаДопПараметров.Журнал);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросКарточкиДокумента = КарточкаДокумента();
	Если Не ЗапросКарточкиДокумента.Успех Тогда
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросКарточкиДокумента.Журнал);
		Возврат;
	КонецЕсли;
	
	ДанныеКарточки = ЗапросКарточкиДокумента.Результат;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДанныеКарточки", ДанныеКарточки);
	ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	ДопПараметры.Вставить("Подписать", Подписать);
	ДопПараметры.Вставить("ВариантОтправки", ВариантОтправки);
	ДопПараметры.Вставить("ОрганизацияЭДО", ЭтотОбъект.ПрофильНастройкиЭДО);
	ДопПараметры.Вставить("КонтрагентыЭДО", Новый Массив);
	
	Для каждого Получатель Из ЭтотОбъект.Получатели Цикл
		ДопПараметры.КонтрагентыЭДО.Добавить(Получатель.КонтрагентЭДО);
	КонецЦикла;
	
	ДопПараметры.Вставить("ДопРеквизитыПолучателей", Новый Соответствие);
	
	Для каждого ДопРеквизиты Из ЭтотОбъект.ДопРеквизитыПолучателей Цикл
		Реквизиты = Новый Структура("Вложения, ДопАтрибуты, ДопПараметры, ЗапросПодписи, Комментарий");
		ЗаполнитьЗначенияСвойств(Реквизиты, ДопРеквизиты);
		ДопПараметры.ДопРеквизитыПолучателей.Вставить(ДопРеквизиты.КонтрагентЭДО, Реквизиты);
	КонецЦикла;
	
	Если Подписать Тогда
		
		ДанныеНаПодпись = Новый Структура("Данные, ИмяПоляДД, Представление", ДанныеКарточки, "Content", ДанныеКарточки.Filename);
		
		ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемНеструктурированногоЭлектронногоДокумента", ККСНГ_ОтправкаЭДКлиент, ДопПараметры);
		ПослеПодписания = Новый ОписаниеОповещения("ПослеПодписанияКарточкиДокумента", ЭтотОбъект, ДопПараметры);
		
		ПоказатьОповещениеПользователя("Подписание документа");
		ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ПрофильНастройкиЭДО, "Подписание электронного документа", ПослеПодписания, ПередПодписанием);
		
	Иначе
		
		ПослеПодписанияКарточкиДокумента(Неопределено, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодписанияКарточкиДокумента(РезультатПодписания, ДопПараметры) Экспорт
	
	Перем Подпись, Получатели;
	
	Подписать = ДопПараметры.Подписать;
	
	Если Подписать Тогда
		Если Не РезультатПодписания.Успех Тогда
			Если РезультатПодписания.Свойство("Журнал") Тогда 
				ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(РезультатПодписания.Журнал);
			Иначе
				ТекстСообщения = "Не удалось подписать документ. Отправка прервана.";
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(РезультатПодписания);
		Подпись = СвойстваПодписи.Подпись;
		
		РезультатПодписания.Свойство("Получатели", Получатели);
		
	КонецЕсли;
	
	ИдентификаторЗаданияОтправкиФайлов = ОтправитьФайлыВФоне(Подпись, Получатели, ДопПараметры);
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОтправкиФайлов) Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияОтправкиФайлов", 2);
		УстановитьДоступностьЭлементовФормы(Ложь);
		Элементы.ПрогрессБар.Видимость = Истина;
		Элементы.ПрогрессБар.Заголовок = "Отправлено 0 получателям из " + Получатели.Количество();
		ПоказатьОповещениеПользователя(, , "Отправка файлов");
	Иначе
		ИнициализироватьПослеОтправки("");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтправитьФайлыВФоне(Подпись, Получатели, ДопПараметры)
	
	Перем ПараметрыФЗ;
	Перем МассивПолучателей, ДанныеПолучателя, Получатель;
	Перем ИмяМетодаФЗ, КлючФЗ, ОписаниеФЗ, ИдентификаторФЗ;
	
	АдресРезультатаФоновогоЗаданияОтправкиФайлов = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	// Заполняем получателей для отправки документа без подписи
	Если Получатели = Неопределено Тогда
		Получатели = Новый Массив;
		Для каждого КонтрагентЭДО Из ДопПараметры.КонтрагентыЭДО Цикл
			Получатель = Новый Структура;
			Получатель.Вставить("КонтрагентЭДО", КонтрагентЭДО);
			Получатель.Вставить("ДанныеПодписанта", ККСНГ_ОтправкаЭДВызовСервера.ПолучитьСтруктуруДанныхПодписанта());
			Получатели.Добавить(Получатель);
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(ДопПараметры.ДанныеКарточки);
	ПараметрыФЗ.Добавить(ДопПараметры.ОрганизацияЭДО);
	ПараметрыФЗ.Добавить(ДопПараметры.ПараметрыАвторизации);
	ПараметрыФЗ.Добавить(Подпись);
	ПараметрыФЗ.Добавить(ДопПараметры.ВариантОтправки);
	ПараметрыФЗ.Добавить(АдресРезультатаФоновогоЗаданияОтправкиФайлов);
	ПараметрыФЗ.Добавить(Получатели);
	ПараметрыФЗ.Добавить(ДопПараметры.ДопРеквизитыПолучателей);
	
	ИмяМетодаФЗ = "ККСНГ_ЭлектронныеДокументыВызовСервера.ОтправитьДанныеПакетовФайловПолучателям";
	КлючФЗ = "ОтправкаФайлов" + УникальныйИдентификатор;
	ОписаниеФЗ = "Отправка файлов получателям";
	
	ИдентификаторФЗ = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьФоновоеЗадание(ИмяМетодаФЗ, ПараметрыФЗ, КлючФЗ, ОписаниеФЗ);
	Если Не ЗначениеЗаполнено(ИдентификаторФЗ) Тогда
		УдалитьИзВременногоХранилища(АдресРезультатаФоновогоЗаданияОтправкиФайлов);
	КонецЕсли;
	
	Возврат ИдентификаторФЗ;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьПослеОтправки(ТекстПрогрессБара)
	
	УдалитьИзВременногоХранилища(АдресРезультатаФоновогоЗаданияОтправкиФайлов);
	АдресРезультатаФоновогоЗаданияОтправкиФайлов = "";
	ОтключитьОбработчикОжидания("ПроверитьЗавершениеФоновогоЗаданияОтправкиФайлов");
	УстановитьДоступностьЭлементовФормы(Истина);
	Элементы.ПрогрессБар.Видимость = Ложь;
	Элементы.ПрогрессБар.Заголовок = ТекстПрогрессБара;
	ПрогрессБар = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы(Доступно)
	
	Элементы.ФормаПодписатьОтправить.Доступность = Доступно;
	Элементы.ФормаОтправить.Доступность = Доступно;
	Элементы.ФормаДобавитьВЧерновики.Доступность = Доступно;
	Элементы.УстановитьДопПараметры.Доступность = Доступно;
	Элементы.ПолучателиПодборКонтрагентовЭДО.Доступность = Доступно;
	Элементы.Получатель.Доступность = Доступно;
	Элементы.ПолучателиУдалить.Доступность = Доступно;
	Элементы.ПолучателиУстановитьДопПараметры.Доступность = Доступно;
	Элементы.ПолучателиПереключитьНесколькоПолучателей.Доступность = Доступно;
	Элементы.НомерДокумента.Доступность = Доступно;
	Элементы.ДатаДокумента.Доступность = Доступно;
	Элементы.ПутьКДокументу.Доступность = Доступно;
	Элементы.ТипДокумента.Доступность = Доступно;
	Элементы.ДоговорУВХД.Доступность = Доступно;
	Элементы.ПереключитьНесколькоПолучателей.Доступность = Доступно;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗавершениеФоновогоЗаданияОтправкиФайлов() Экспорт
	
	Перем НайденныеЧерновики, ИнформацияПоДокументу, ВариантОтправки;
	
	Если Не ЗаданиеЗапущено() Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоПолучателей = Получатели.Количество();
	
	ИнфоОВыполнении = ККСНГ_ОбщегоНазначенияВызовСервера.ИнфоОВыполненииФоновогоЗадания(ИдентификаторЗаданияОтправкиФайлов, "; получателю; ; получателям; получателям; получателям");
	Если Не ИнфоОВыполнении = Неопределено Тогда
		ПрогрессБар = ИнфоОВыполнении.Процент;
		Элементы.ПрогрессБар.Заголовок = СтрШаблон("Отправлено %1 из %2 ", ИнфоОВыполнении.Представление, ВсегоПолучателей);
	КонецЕсли;
	
	ОписаниеОшибкиВыполненияФЗ = "";
	ЗаданиеВыполнено = ККСНГ_ОбщегоНазначенияВызовСервера.ЗаданиеВыполнено(ИдентификаторЗаданияОтправкиФайлов, ОписаниеОшибкиВыполненияФЗ);
	
	Если ЗаданиеВыполнено И Не ОписаниеОшибкиВыполненияФЗ = "" Тогда
		ИнициализироватьПослеОтправки("");
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибкиВыполненияФЗ);
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресРезультатаФоновогоЗаданияОтправкиФайлов);
	Если Не ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущийПолучатель Из РезультатВыполнения.РезультатПоПолучателям Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("КонтрагентЭДО", ТекущийПолучатель.Ключ);
		
		СтрокиПолучателя = Получатели.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиПолучателя.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокиПолучателя[0], ТекущийПолучатель.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	НайденныеЧерновики = Получатели.НайтиСтроки(Новый Структура("ИмяСтатуса", "Черновик"));
	Если НайденныеЧерновики.Количество() <> 0 Тогда
		ВариантОтправки = "сохранен в черновики";
	Иначе
		ВариантОтправки = "отправлен";
	КонецЕсли;
	
	Если ЗаданиеВыполнено Тогда
		
		ЧастиИтогов = Новый Массив;
		
		КоличествоСтрокой = ККСНГ_ОбщегоНазначенияВызовСервера.КоличествоСтрокой("; получателю; ; получателям; получателям; получателям", РезультатВыполнения.ОтправленныхУспешно);
		
		ТекстИтогов = СтрШаблон("Файл %1 %2 из %3 ", ВариантОтправки, КоличествоСтрокой, ВсегоПолучателей);
		ЧастиИтогов.Добавить(ТекстИтогов);
		
		Получатели.Сортировать("СтатусОтправки Убыв"); 
		ИнициализироватьПослеОтправки("");
		
		Если РезультатВыполнения.ОтправленныхУспешно <> ВсегоПолучателей Тогда 
			
			ТекстСсылкиНаОшибки = "Перейти к ошибкам";
			СсылкаНаОшибки = "СсылкаНаОшибки";
			ЧастиИтогов.Добавить(Новый ФорматированнаяСтрока(ТекстСсылкиНаОшибки,,,, СсылкаНаОшибки));
			Элементы.ДекорацияИтоги.Заголовок = Новый ФорматированнаяСтрока(ЧастиИтогов);
			Элементы.ДекорацияИтоги.Видимость = Истина;
			
		Иначе	
			
			Элементы.ДекорацияИтоги.Видимость = Ложь;
			
			КнопкиВопроса = Новый СписокЗначений;
			КнопкиВопроса.Добавить(Ложь, "Завершить");
			КнопкиВопроса.Добавить(Истина, "Отправить ещё файлы");
			
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросПриЗавершенииФЗ", ЭтотОбъект);
			
			ТекстВопроса = СтрШаблон("Файл %1.", ВариантОтправки);
			ЗаголовокОкна = "Отправка файлов";
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, КнопкиВопроса, 0, , ЗаголовокОкна);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаданиеОтправкиФайловНаСервере(ДанныеВызоваФЗ, УникальныйИдентификатор)
	
	КлючЗадания = "ОтправкаФайлов" + УникальныйИдентификатор;
	
	ПараметрыФоновогоЗадания = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ДанныеВызоваФЗ);
	
	ТаблицаПолучателей = РеквизитФормыВЗначение("Получатели");
	ПараметрыФоновогоЗадания.Добавить(ТаблицаПолучателей.ВыгрузитьКолонку("КонтрагентЭДО"));
	
	ДопРеквизитыПоПолучателям = РеквизитФормыВЗначение("ДопРеквизитыПолучателей");
	ПараметрыФоновогоЗадания.Добавить(ДопРеквизитыПоПолучателям);
	
	ФоновоеЗаданиеИмяМетода = "ККСНГ_ЭлектронныеДокументыВызовСервера.ОтправитьДанныеПакетовФайловПолучателям";
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(ФоновоеЗаданиеИмяМетода, ПараметрыФоновогоЗадания, КлючЗадания, "Отправка файлов получателям ");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ФоновоеЗадание.УникальныйИдентификатор;
	
КонецФункции

&НаКлиенте
Функция КарточкаДокумента()
	
	ЗаголовокЖурнала = "Формирование карточки документа";
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ПоказатьОповещениеПользователя(ЗаголовокЖурнала); 
	
	ДанныеКарточки = Новый Структура;
	ДанныеКарточки.Вставить("Дата", ДатаДокумента);
	ДанныеКарточки.Вставить("Номер", НомерДокумента);
	ДанныеКарточки.Вставить("КодТипаДокумента", ТипДокумента);
	
	ДанныеСвязанногоДокумента = ДанныеСвязанногоДокумента();
	ДанныеКарточки.Вставить("ИдентификаторСвязанногоДокумента", ДанныеСвязанногоДокумента.Идентификатор);
	ДанныеКарточки.Вставить("ТипСвязи", ДанныеСвязанногоДокумента.ТипСвязи);
	
	ЕдинственныйФайл = ОтправляемыеФайлы[0];
	ИмяФайла = ЕдинственныйФайл.ИмяФайла;
	СодержимоеФайла = ПолучитьИзВременногоХранилища(ЕдинственныйФайл.АдресДанных);
	
	ДанныеКарточки.Вставить("Filename", ИмяФайла);
	ДанныеКарточки.Вставить("MimeType", "application/xml");
	
	Если СодержимоеФайла.Размер() = 0 Тогда
		СобытиеОшибки = "Отправляемые файлы пусты";
		КодОшибки = "MASS-00002";
		КомментарийОшибки = "Все отправляемые файлы пусты. Выберите, пожалуйста, другие файлы.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, СобытиеОшибки, КодОшибки, КомментарийОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	ДанныеКарточки.Вставить("Content", СодержимоеФайла);
	ДанныеКарточки.Вставить("Ссылка", Неопределено);
	ДанныеКарточки.Вставить("Комментарий", "");
	
	Ответ.Успех = Истина;
	Ответ.Результат = ДанныеКарточки;
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Функция ЗаданиеЗапущено()
	
	Возврат ЗначениеЗаполнено(ИдентификаторЗаданияОтправкиФайлов);
	
КонецФункции

&НаКлиенте
Процедура ПослеУстановкиДопПараметров(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ОтборПоиска = Новый Структура;
		ОтборПоиска.Вставить("КонтрагентЭДО", Результат.КонтрагентЭДО);
		НайденнныеСтроки = ДопРеквизитыПолучателей.НайтиСтроки(ОтборПоиска);
		Если НайденнныеСтроки.Количество() > 0 Тогда
			СтрокаПолучателя = НайденнныеСтроки[0];
		Иначе
			СтрокаПолучателя = ДопРеквизитыПолучателей.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаПолучателя, Результат);
		
		Если БизнесПроцесс = "УВХД" И ТипДокумента = "DOCUMENT" Тогда
			МассивДопПараметров = ДополнительныеПараметрыДокументаИзСтроки(СтрокаПолучателя.ДопПараметры);
			Для каждого ДопПараметр из МассивДопПараметров Цикл
				Если ДопПараметр.Ключ = "document.name" Тогда
					НаименованиеДокументаУВХД = ДопПараметр.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДополнительныеПараметрыДокумента(ПараметрыДокумента, ДопПараметрыЗапроса = Неопределено)
	
	ДопПараметрыДокумента = Неопределено;
	
	РезультатСтрокой = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметрыЗапроса, "РезультатСтрокой", Ложь);
	
	ДопПараметрыМассив = ККСНГ_ЭлектронныеДокументы.ДополнительныеПараметрыДокумента(ПараметрыДокумента, ДопПараметрыЗапроса);
	
	Если ТипЗнч(ДопПараметрыМассив) = Тип("Массив") Тогда
		Если РезультатСтрокой Тогда
			ДопПараметрыДокумента = ЗначениеВСтрокуВнутр(ДопПараметрыМассив);
		Иначе
			ДопПараметрыДокумента = ДопПараметрыМассив;
		КонецЕсли;
	ИначеЕсли РезультатСтрокой Тогда
		ДопПараметрыДокумента = "";
	КонецЕсли;
	
	Возврат ДопПараметрыДокумента;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДополнительныеПараметрыДокументаИзСтроки(ДопПараметрыСтрокой, ДопПараметрыЗапроса = Неопределено)
	
	Возврат ЗначениеИзСтрокиВнутр(ДопПараметрыСтрокой);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьЗаполнениеДопПараметровДокумента(ДанныеПроверки)
	
	Возврат ККСНГ_ЭлектронныеДокументы.ПроверитьЗаполнениеДопПараметровДокумента(ДанныеПроверки);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДополнитьДопПараметры(ДопПараметрыПоУмолчанию, ДопПараметрыДополнения)
	
	Возврат ККСНГ_ЭлектронныеДокументы.ДополнитьДопПараметры(ДопПараметрыПоУмолчанию, ДопПараметрыДополнения);
	
КонецФункции

&НаСервере
Функция ДанныеСвязанногоДокумента()
	
	ДанныеРезультат = Новый Структура();
	ДанныеРезультат.Вставить("Идентификатор", "");
	ДанныеРезультат.Вставить("ТипСвязи", "Other");
	
	Если ЗначениеЗаполнено(ДоговорУВХД) И НЕ РежимНесколькоПолучателей Тогда
		
		МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
		ДанныеДоговора1С = МодульККСНГ_ПМ_РаботаСМетаданными.ПолучитьДанныеДоговора(ДоговорУВХД);
		
		ДанныеДоговораУВХД = ККСНГ_ЭлектронныеДокументы.ПолучитьДанныеДоговораУВХД(ДанныеДоговора1С);
		
		Если ТипЗнч(ДанныеДоговораУВХД) = Тип("Структура") И ДанныеДоговораУВХД.ИдентификаторДоговора > 0 Тогда
			ДанныеРезультат.Идентификатор = ДанныеДоговораУВХД.ИдентификаторДоговора; 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеРезультат;
	
КонецФункции

// ОтправкаДокумента
#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтрагентовСбер(ПрофильНастройкиЭДО, ТипКонтрагента = "Контрагент")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыЭДО.Контрагент КАК Контрагент,
	|	КонтрагентыЭДО.Ссылка КАК КонтрагентЭДО
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК КонтрагентыЭДО
	|ГДЕ
	|	КонтрагентыЭДО.Контрагент.ИНН = &ИНН
	|	И КонтрагентыЭДО.Владелец = &Владелец
	|	И НЕ КонтрагентыЭДО.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", ПрофильНастройкиЭДО);
	Запрос.УстановитьПараметр("ИНН", "7707083893");
	
	СписокКонтрагентовСбер = Новый СписокЗначений();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Если ТипКонтрагента = "Контрагент" Тогда
			СписокКонтрагентовСбер.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент"));
		ИначеЕсли ТипКонтрагента = "КонтрагентЭДО" Тогда
			СписокКонтрагентовСбер.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КонтрагентЭДО"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокКонтрагентовСбер;
	
КонецФункции

#КонецОбласти