
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеПрофилиЭДО = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДоступныеПрофилиЭДОПользователя();
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", 
				ДоступныеПрофилиЭДО, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	НестандартныйОтбор = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ДополнительныеПараметры, "НестандартныйОтбор", Неопределено);
	Если НестандартныйОтбор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущийОтбор Из НестандартныйОтбор.Отбор.Элементы Цикл
	
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ТекущийОтбор.ЛевоеЗначение,
																						ТекущийОтбор.ПравоеЗначение,
																						ТекущийОтбор.ВидСравнения,
																						ТекущийОтбор.Представление,
																						ТекущийОтбор.Использование,
																						ТекущийОтбор.РежимОтображения,
																						ТекущийОтбор.ИдентификаторПользовательскойНастройки);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти