
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПрофильНастройкиЭДО", Отправитель);
	СписокНеструктурированныхТипов = Параметры.СписокНеструктурированныхТипов;
	ДатаДок = ТекущаяДатаСеанса();
	
	// Устанавливаем ограничение типов для реквизитов
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	
	Если НЕ МодульККСНГ_ПМ_РаботаСМетаданными = Неопределено Тогда
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.ДоговорУВХД, "Договоры");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД);
	ПредварительноеЗаполнениеФормы();
	
	ККСНГ_ДокументооборотКлиент.ПроверитьНаличиеКонтрагентовЭДО(Отправитель, Отказ);
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКДокументуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл для отправки";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", Отправитель);
	 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОбработкаОповещения = Новый ОписаниеОповещения("ПослеВыбораПолучателя", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ККСНГ_Контрагенты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , 
						ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	ЗагрузитьСписокВыбораДоговоровУВХД();
	ЗагрузитьСписокВыбораТиповДокумента();
	ЗагрузитьДопПараметрыДокумента();
	ОбновитьОтображениеДанныхФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорУВХДОчистка(Элемент, СтандартнаяОбработка)
	ЗагрузитьСписокВыбораТиповДокумента();
	ЗагрузитьДопПараметрыДокумента(Получатель);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорУВХДОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗагрузитьСписокВыбораТиповДокумента(ВыбранноеЗначение);	
	ЗагрузитьДопПараметрыДокумента(Получатель, ВыбранноеЗначение, ТипДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗагрузитьДопПараметрыДокумента(Получатель, ДоговорУВХД, ВыбранноеЗначение)
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	ЗагрузитьДопПараметрыДокумента(Получатель, ДоговорУВХД)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодписатьОтправить(Команда)
	
	НачатьОтправкуФайла("ПродолжитьПодписание");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВЧерновики(Команда)
	
	НачатьОтправкуФайла("ПродолжитьДобавлениеВЧерновики");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПредварительноеЗаполнениеФормы()
	
	ТипДокументаПоУмолчанию = "DOCUMENT";
	Если Элементы.ТипДокумента.СписокВыбора.НайтиПоЗначению(ТипДокументаПоУмолчанию) <> Неопределено Тогда
		ТипДокумента = ТипДокументаПоУмолчанию;	
	КонецЕсли;	
	                                  	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКДокументу = ВыбранныеФайлы[0];		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПродолжитьПодписание(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
		
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ОтветДанныеКарточки = ДанныеКарточки(Ложь);
		
		Если Не ОтветДанныеКарточки.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтветДанныеКарточки.Журнал);
			Возврат;
		КонецЕсли;
		
		ДанныеКарточки = ОтветДанныеКарточки.Результат;

		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДанныеКарточки", ДанныеКарточки);
		ПараметрыАвторизации = ЗапросПараметрыАвторизации.Результат;
		ДопПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		
		ДанныеНаПодпись = Новый Структура("Данные,ИмяПоляДД,Представление", 
											ДанныеКарточки, "Content", ДанныеКарточки.Filename);
											
		ПослеПодписания = Новый ОписаниеОповещения("ПодписатьДвоичныеДанныеЗавершение", ЭтотОбъект, ДопПараметры);
		
		ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, Отправитель, 
															"Подписание электронного документа", ПослеПодписания);
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);	
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
Функция ДанныеКарточки(Черновик)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Сформировать данные карточки произвольного документа");
			
	ДанныеКарточки = Новый Структура;
	ДанныеКарточки.Вставить("Дата", ДатаДок);
	ДанныеКарточки.Вставить("Номер", Номер);
	ДанныеКарточки.Вставить("КодТипаДокумента", ТипДокумента);
	
	Если ЗначениеЗаполнено(ДатаДоговора) Тогда
		ДанныеКарточки.Вставить("ДоговорДата", ДатаДоговора);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерДоговора) Тогда
		ДанныеКарточки.Вставить("ДоговорНомер", НомерДоговора);
	КонецЕсли;	
	
	ДанныеКарточки.Вставить("Получатель", Получатель);
	
	ВремФайл = Новый Файл(ПутьКДокументу);
	ДанныеКарточки.Вставить("Filename", ВремФайл.Имя);
	ДанныеКарточки.Вставить("MimeType", "application/xml");
	
	ДанныеСвязанногоДокумента = ДанныеСвязанногоДокумента();
	ДанныеКарточки.Вставить("ИдентификаторСвязанногоДокумента", ДанныеСвязанногоДокумента.Идентификатор);
	ДанныеКарточки.Вставить("ТипСвязи", ДанныеСвязанногоДокумента.ТипСвязи);
	
	Попытка
		СодержимоеДокумента = Новый ДвоичныеДанные(ПутьКДокументу);
	Исключение
		ТекстОшибки = "Не удалось получить содержимое документа по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
						+ Символы.ПС + "Проверьте, пожалуйста, доступность файла по указанному пути.";
	    ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "DT-00020");
	    Возврат Ответ;
	КонецПопытки;
	Если СодержимоеДокумента.Размер() = 0 Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, 
							"Документ пуст. Укажите, пожалуйста, путь к другому файлу.", "DT-00021");
	    Возврат Ответ;
	КонецЕсли;	
	
	ДанныеКарточки.Вставить("Content", СодержимоеДокумента);
	ДанныеКарточки.Вставить("ЗапроситьПодписание", ЗапроситьПодписание);
	ДанныеКарточки.Вставить("Комментарий", Комментарий);
	ДанныеКарточки.Вставить("Черновик", Черновик);
	ДанныеКарточки.Вставить("Ссылка", Неопределено);
	ДанныеКарточки.Вставить("ДопПараметры", ПолучитьДопПараметры());
	
	Ответ.Успех = Истина;
	Ответ.Результат = ДанныеКарточки;
		
	Возврат Ответ;
	
КонецФункции	
	
&НаКлиенте
Процедура ПодписатьДвоичныеДанныеЗавершение(Результат, ДопПараметры) Экспорт
			
	Если Результат.Успех Тогда
		Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
		ПараметрыАвторизации = ДопПараметры.ПараметрыАвторизации;
		ДанныеКарточки = ДопПараметры.ДанныеКарточки;
			
		Если ДанныеКарточки.Черновик Тогда
			
			ТекстОповещения = "Документ добавлен в черновики";
			ОтветОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьНеструктурированныйДокументВКурьер(
						ДанныеКарточки, Отправитель, ПараметрыАвторизации, , Ложь);
		Иначе
						
			СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(Результат);
			
			Подпись = СвойстваПодписи.Подпись;
			ТекстОповещения = "Документ отправлен";
				
			ОтветОтправки = ККСНГ_ОтправкаЭДВызовСервера.ОтправитьНеструктурированныйДокументВКурьер(
						ДанныеКарточки, Отправитель, ПараметрыАвторизации, Подпись, Истина);
		КонецЕсли;
		
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветОтправки.Журнал);
		Ответ.Успех = ОтветОтправки.Успех;
		
		Если Не Ответ.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Ответ.Журнал);
			ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(Отправитель, ПараметрыАвторизации);
			Возврат;
		КонецЕсли;

		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(Ответ.Журнал);
		ОшибкаПодписания = ТипЗнч(ПоследняяОшибка) = Тип("Структура") И ПоследняяОшибка.КодОшибки = "ER-12001";	
		Если ОшибкаПодписания Тогда
			ТекстОповещения = "Документ отправлен." + Символы.ПС + "Подписание не требуется.";
		КонецЕсли;
		
		СсылкаЭД = ОтветОтправки.Результат;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииНаСсылкуЭД", ЭтотОбъект, СсылкаЭД);
		ПоказатьОповещениеПользователя(ТекстОповещения,
			ОписаниеОповещения, СсылкаЭД, БиблиотекаКартинок.ККСНГ_ОтправитьДокумент);
		Закрыть(Истина);
	Иначе 
		Если Результат.Свойство("Журнал") Тогда 
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Результат.Журнал);	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаСсылкуЭД(СсылкаЭД) Экспорт
	
	Если ТипЗнч(СсылкаЭД) = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") И Не СсылкаЭД.Пустая() Тогда
		ПараметрыФормы = Новый Структура("Ключ", СсылкаЭД);
		ОткрытьФорму("Справочник.ККСНГ_ЭлектронныеДокументы.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьНезаполненныеРеквизиты()
	
	Результат = Ложь;
	
	МассивКонтролируемыхРеквизитов = Новый Массив;
	МассивКонтролируемыхРеквизитов.Добавить(Получатель);
	МассивКонтролируемыхРеквизитов.Добавить(ТипДокумента);
	МассивКонтролируемыхРеквизитов.Добавить(ПутьКДокументу);
	МассивКонтролируемыхРеквизитов.Добавить(Номер);
	МассивКонтролируемыхРеквизитов.Добавить(ДатаДок);
	
	Для Каждого ЭлементРеквизит Из МассивКонтролируемыхРеквизитов Цикл
		Если Не ЗначениеЗаполнено(ЭлементРеквизит) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура НачатьОтправкуФайла(ИмяПроцедурыПродолженияОтправки)
	
	ОчиститьСообщения();
	Если ЕстьНезаполненныеРеквизиты() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните, пожалуйста, все обязательные реквизиты.");
		Возврат;
	КонецЕсли;
	
	ПродолжитьОтправкуФайла = Новый ОписаниеОповещения(ИмяПроцедурыПродолженияОтправки, ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(Отправитель, ПродолжитьОтправкуФайла);	
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДобавлениеВЧерновики(ЗапросПараметрыАвторизации, ДопПараметры) Экспорт
		
	Если ЗапросПараметрыАвторизации.Успех Тогда
		ОтветДанныеКарточки = ДанныеКарточки(Истина);
		
		Если Не ОтветДанныеКарточки.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ОтветДанныеКарточки.Журнал);
			Возврат;
		КонецЕсли;
		
		ДанныеКарточки = ОтветДанныеКарточки.Результат;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДанныеКарточки", ДанныеКарточки);
		ДопПараметры.Вставить("ПараметрыАвторизации", ЗапросПараметрыАвторизации.Результат);
		
		ПодписатьДвоичныеДанныеЗавершение(Новый Структура("Успех", Истина), ДопПараметры);
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ЗапросПараметрыАвторизации.Журнал);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Получатель = Результат;
		
		ПолучательПредставление = СвоеПредставление(Получатель);
		
		ЗагрузитьСписокВыбораДоговоровУВХД(Получатель);
		ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД);
		ЗагрузитьДопПараметрыДокумента(Получатель, ДоговорУВХД, ТипДокумента);	
		
		ОбновитьОтображениеДанныхФормы();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокДоговоровУВХД(Контрагент)
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвоеПредставление(Контр)
	Возврат Контр.Контрагент.Наименование;	
КонецФункции	

&НаКлиенте
Процедура ВыборДоговораУВХДЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		
		ДоговорУВХД = Результат;
		
		ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД);		
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПолучателя(Получатель)
	
	ДанныеПолучателя = Новый Структура();
	ДанныеПолучателя.Вставить("Контрагент", Получатель.Контрагент);	
	ДанныеПолучателя.Вставить("Организация", Получатель.Владелец.Организация);	
	
	Возврат ДанныеПолучателя;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьСписокВыбораТиповДокумента(ДоговорУВХД = Неопределено)
	
	ТипДокумента = Неопределено;
	
	ОграниченияТипов = Новый Массив();
	Если ЗначениеЗаполнено(ДоговорУВХД) Тогда
		ОграниченияТипов.Добавить("ACT");
		ОграниченияТипов.Добавить("ACT_PROD");
		ОграниченияТипов.Добавить("DOCUMENT");
	КонецЕсли;
	
	ТипДокументаСписокВыбора = Элементы.ТипДокумента.СписокВыбора;
	ТипДокументаСписокВыбора.Очистить();
	Для каждого ТекТип Из СписокНеструктурированныхТипов Цикл
		Если ОграниченияТипов.Количество() И ОграниченияТипов.Найти(ТекТип.Значение) = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		ТипДокументаСписокВыбора.Добавить(ТекТип.Значение, ТекТип.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокВыбораДоговоровУВХД(Получатель = Неопределено)
	
	ДоговорУВХД = Неопределено;
	
	ДоговорУВХДСписокВыбора = Элементы.ДоговорУВХД.СписокВыбора;
	ДоговорУВХДСписокВыбора.Очистить();
	
	СписокДоговоровУВХД = ПолучитьСписокДоговоровУВХД(Получатель);
	
	Для каждого ЭлементСписка Из СписокДоговоровУВХД Цикл
		ДоговорУВХДСписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоговоровУВХД(Получатель)
	
	СписокДоговоров = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыДоговорыУВХД.Договор1С КАК Договор1С
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты.ДоговорыУВХД КАК КонтрагентыДоговорыУВХД
	|ГДЕ
	|	КонтрагентыДоговорыУВХД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Получатель);
	
	ДоговорыУВХД = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаДоговорыУВХД Из ДоговорыУВХД Цикл
		                                                                     
		ДоговорСсылка = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуОбъектаПоЗначениюСвойства(СтрокаДоговорыУВХД.Договор1С);
		
		Если ЗначениеЗаполнено(ДоговорСсылка) Тогда
			СписокДоговоров.Добавить(ДоговорСсылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокДоговоров;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьОтображениеДанныхФормы()
	
	Элементы.ДоговорУВХД.Видимость = Элементы.ДоговорУВХД.СписокВыбора.Количество();
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДопПараметрыДокумента(Получатель = Неопределено, ДоговорУВХД = Неопределено, ТипДокумента = Неопределено)
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("ПрофильКонтрагента", Получатель);
	ДанныеДокумента.Вставить("КодТипаДокумента", ТипДокумента);
	ДанныеДокумента.Вставить("Договор", ДоговорУВХД);	
	ДопПараметры = ККСНГ_ЭлектронныеДокументы.ДополнительныеПараметрыДокумента(ДанныеДокумента);
	СоздатьРеквизитыИЭлементыДопПараметры(ДопПараметры);
	ЗаполнитьДопПараметрыДокумента(ДопПараметры);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыИЭлементыДопПараметры(ДопПараметры)
	
	УдаляемыеРеквизиты = Новый Массив();
	Для каждого ДопПараметрРеквизит Из РеквизитыДопПараметров Цикл
		ИмяРеквизита = ДопПараметрРеквизит.Представление;
		НайденныйЭлемент = Элементы.Найти(ИмяРеквизита);
		Если Не НайденныйЭлемент = Неопределено Тогда
			Элементы.Удалить(НайденныйЭлемент);		
		КонецЕсли;		
		УдаляемыеРеквизиты.Добавить(ИмяРеквизита);	
	КонецЦикла;
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	РеквизитыДопПараметров.Очистить();
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		
		ШаблонИмени = "ExtraOptionID_%1";
			
		// Добавляем реквизиты формы
		СчетчикРеквизитов = 1;
		НовыеРеквизиты = Новый Массив;
		Для каждого ДопПараметр Из ДопПараметры Цикл
			
			ИмяРеквизита = СтрШаблон(ШаблонИмени, СокрЛП(СчетчикРеквизитов));
			ЗаголовокРеквизита = ДопПараметр.Представление;
			
			Тип = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(2000));	
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Тип, , ЗаголовокРеквизита, Истина);
			НовыеРеквизиты.Добавить(НовыйРеквизит);
			
			РеквизитыДопПараметров.Добавить(ДопПараметр.Ключ, ИмяРеквизита); 
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СчетчикРеквизитов);
			
		КонецЦикла;
		ИзменитьРеквизиты(НовыеРеквизиты);
		
		// Добавляем элементов формы
		СчетчикЭлементов = 1;
		Для каждого ДопПараметр Из ДопПараметры Цикл
			
			Если НРег(ДопПараметр.Ключ) = "document.currency" Тогда
				ДопПараметр.ВозможноИзменение = Истина;		
			КонецЕсли;
			
			ИмяЭлемента = СтрШаблон(ШаблонИмени, СокрЛП(СчетчикЭлементов));
			
			НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаДопПараметры);
			НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
			НовыйЭлемент.Заголовок = ДопПараметр.Представление;
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.КнопкаОчистки = ДопПараметр.ВозможноИзменение;
			НовыйЭлемент.Видимость = ДопПараметр.ВозможноИзменение;
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.Инкремент(СчетчикЭлементов);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопПараметрыДокумента(ДопПараметры)
	
	Если ДопПараметры = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого ДопПараметр Из ДопПараметры Цикл
		НайденныйРеквизит = РеквизитыДопПараметров.НайтиПоЗначению(ДопПараметр.Ключ);					
		Если Не НайденныйРеквизит = Неопределено Тогда
			Если НРег(ДопПараметр.Ключ) = "document.currency" Тогда
				ВалютаВзаиморасчетовДокумента = ПолучитьВалютуВзаиморасчетовДокумента(ДоговорУВХД);
				ЭтотОбъект[НайденныйРеквизит.Представление] = ВалютаВзаиморасчетовДокумента.Наименование;		
			Иначе
				ЭтотОбъект[НайденныйРеквизит.Представление] = ДопПараметр.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДопПараметры()
	
	Если РеквизитыДопПараметров.Количество() Тогда
		
		МассивДопПараметров = Новый Массив();
		Для Каждого РеквизитДопПараметров Из РеквизитыДопПараметров Цикл
			
			ПараметрСохраненияКлюч = РеквизитДопПараметров.Значение;
			ПараметрСохраненияЗначение = ЭтотОбъект[РеквизитДопПараметров.Представление];
			
			Если ЗначениеЗаполнено(ПараметрСохраненияЗначение) Тогда
				
				СтруктураСохраненияПараметров = Новый Структура();
				СтруктураСохраненияПараметров.Вставить("Ключ", ПараметрСохраненияКлюч);
				СтруктураСохраненияПараметров.Вставить("Значение", ПараметрСохраненияЗначение);
				
				МассивДопПараметров.Добавить(СтруктураСохраненияПараметров);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивДопПараметров.Количество() Тогда
			Возврат МассивДопПараметров;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВалютуВзаиморасчетовДокумента(Договор)
	ОбщийМодульРаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	Возврат ОбщийМодульРаботаСМетаданными.ПолучитьВалютуВзаиморасчетовДокумента(Договор);
КонецФункции

&НаСервере
Функция ДанныеСвязанногоДокумента()
	
	ДанныеРезультат = Новый Структура();
	ДанныеРезультат.Вставить("Идентификатор", "");
	ДанныеРезультат.Вставить("ТипСвязи", "Other");
	
	Если ЗначениеЗаполнено(ДоговорУВХД) Тогда
		ДанныеДоговораУВХД = ККСНГ_ЭлектронныеДокументы.ПолучитьДанныеДоговораУВХД(ДоговорУВХД);
		
		Если ТипЗнч(ДанныеДоговораУВХД) = Тип("Структура")
			И ДанныеДоговораУВХД.ИдентификаторДоговора > 0 Тогда
			ДанныеРезультат.Идентификатор = ДанныеДоговораУВХД.ИдентификаторДоговора; 
			
		КонецЕсли;
		
	КонецЕсли;	
		
	Возврат ДанныеРезультат;
	
КонецФункции

#КонецОбласти
