#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание ошибки обращения к API ЛКК по коду возврата и имени функции
//
// Параметры:
//   КодВозврата - Строка - Код ошибки, полученный от сервиса
//   ИмяФункции - Строка - Имя метода сервиса
//
// Возвращаемое значение:
//   Строка - Описание ошибки
//   
Функция ПолучитьОписаниеОшибкиИзМакета(КодВозврата, ИмяФункции) Экспорт

	Макет = ПолучитьОбщийМакет("ККСНГ_VPNKeyTLS_Errors");
	
	// Обходим строки
	ОбластьСтрок = Макет.ПолучитьОбласть("Строки");
	Для НомерСтроки = 1 По ОбластьСтрок.ВысотаТаблицы Цикл
		
		Если СокрЛП(КодВозврата) = СокрЛП(ОбластьСтрок.Область(НомерСтроки, 1).Текст) Тогда
			
			Если ЗначениеЗаполнено(ОбластьСтрок.Область(НомерСтроки, 5).Текст) Тогда
				Если СокрЛП(ИмяФункции) = СокрЛП(ОбластьСтрок.Область(НомерСтроки, 5).Текст) Тогда					
					Возврат СокрЛП(ОбластьСтрок.Область(НомерСтроки, 4).Текст);
				КонецЕсли;				
			Иначе
				Возврат СокрЛП(ОбластьСтрок.Область(НомерСтроки, 4).Текст);		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;       
	
	Возврат "Неизвестная ошибка устройства (" + КодВозврата + "), попробуйте переустановить токен в разъеме USB.";

КонецФункции

#КонецОбласти
