#Область ПрограммныйИнтерфейс

// Информация о системе
//	Cтрока «devcfg» строится согласно следующему шаблону:
//	<Идентификатор разработчика (напр."IC" для Фирмы ИнфоКрипт)> - Сведения об
//	аппаратной части токена,не несущие полезной нагрузки для программы-клиента
//	и гарантированно не содержащие подстроки "_VT">
//	VT<Версия прошивки>[<Имя Модуля 1><Версия Модуля 1>]...
//	[<Имя Модуля N><Версия Модуля N>] где N не больше восьми.
// 
//	-	Версия прошивки представляет из себя число, состоящее цифр без знака в
//		количестве от одной до пяти. Они заканчиваются концом строки, либо буквой,
//		являющейся первой буквой имени одного из модулей прошивки.
//	-	"Модуль" - это одна или несколько дополнительных программно-аппаратных
//		функций (свойств) данного токена, информирующих прикладную программу о её
//		новых возможностях или ограничениях при работе с токеном.
//	-	Имя модуля состоит строго из двух латинских букв (с учётом регистра) и от
//		одной до пяти цифр версии (возможно, в этом количестве присутствуют ведущие
//		нули). Цифры заканчиваются концом строки, либо буквой, являющейся первой
//		буквой имени очередного модуля прошивки.
//	-	Строка конфигурации может содержать информацию о модулях, количеством
//		до восьми.
//	-	Имена модулей не сортированы.
//	-	Порядок следования информации о модулях не имеет значения.
//	-	От версии к версии прошивки не гарантируется сохранение порядка следования
//		информации о модулях.
//
//	На момент написания настоящей документации, в различных прошивках
//	использовались следующие модули в различных комбинациях:
//	-	BU - кнопка
//	-	KA - поддержка кодов аутентификации (не используется в СББОЛ)
//	-	NT - новые технологии 
//	-	SC - экран с точскрином
//
//	Если в строке ответа значение ключа "pin_must_be_changed" равно "1", то
//	пользователь должен изменить PIN-код по умолчанию, назначенный при
//	инициализации устройства. Пока пользователь не задаст новый PIN-код,
//	ему не будут доступны функции создания запросов на личные сертификаты
//	и вход на бизнес-системы.
//
// Параметры:
//	keyurl      - Строка - адрес запроса
//	sid         - Строка - SID0 или SID или без SID
//  recalc_hash - Булево - пересчитать ли хеш прошивки и записанного на токене
//					"старт.ехе" Опц., умолч.:"0"
//
// Возвращаемое значение:
//	Структура:
//		devcfg				STRING_A	128 байт	информация о конфигурации	
//		rnginitdate			STRING_A	19 байт		HH:MM:SS dd.mm.YYYY (опционально)
//		serial				STRING_A	12 байт		серийный номер
//		buildid				NUMBER		8 байт		номер сборки
//		curuser				NUMBER		1..5		текущая учетная запись (1– 5)
//		pin_must_be_changed	ENUM		0, 1		Пользователю требуется сменить транспортный
//													PIN, иначе будет недоступна часть функционала.
//													(опционально)	
//		fw_hash_st			STRING_A	64 байта	записанное на токене контрольное значение
//													микрокода прошивки	
//		fw_hash_calc		STRING_A	64 байта	пересчитанное контрольное значение микрокода
//													прошивки (возвращается только если при вызове
//													был установлен параметр "recalc_hash")	
//		sw_hash_st			STRING_A	64 байта	записанное на токене контрольное значение
//													записанного на токене "Старт.ехе"	
//		sw_hash_calc		STRING_A	64 байта	пересчитанное контрольное значение
//													записанного на токене "Старт.ехе"
//													(возвращается только если при вызове
//													был установлен параметр "recalc_hash")	
//		retcode				ENUM		2 байт		код возврата ф-ии	
//
Функция GET_SYS_INFO_ID(keyurl, sid, recalc_hash = Ложь) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",			"GET_SYS_INFO_ID");
	СтруктураЗапроса.Параметры.Вставить("recalc_hash",	recalc_hash);
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Получение списка доступных учетных записей
//	В случае, если действие PIN приостановлено (т.е. требуется восстановление
//	PIN-кода на странице администрирования или при помощи команды
//	«CH_PIN_BY_PUK_ID»), в начале имени присутствует слово «BLOCKED_».
//	Например: pin="PIN 1"&user="1"&pin="BLOCKED_PIN 2"&user="2"&retcode="1"
//		
//	Если заблокирован PUK, то соответствующий PIN должен выводиться
//	с префиксом «SUSPEND».
//	Например: pin="PIN 1"&user="1"&pin="SUSPEND_PIN 2"&user="2"&retcode="1"
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//
// Возвращаемое значение: 
//	Структура:
//		pin		STRING_A	8 байт	номер учетной записи  - Массив
//		user	STRING_A	8 байт	имя учетной записи    - Массив
//		retcode	ENUM		2 байт	код возврата ф-ии
//
Функция GET_PIN_LIST(keyurl, sid) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
	
	СтруктураЗапроса.Параметры.Вставить("id", "GET_PIN_LIST");
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	// Гарантия того, что в результате всегда массив
	Если Ответ.Успех И Ответ.Результат.retcode = "1" Тогда
		Ответ.Результат.pin  = ПреобразоватьВМассив(Ответ.Результат.pin);
		Ответ.Результат.user = ПреобразоватьВМассив(Ответ.Результат.user);
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

// Логин
//	-	Для устройств с экраном передача PIN-кода с ПК (и само наличие в каком-либо виде PIN-кода на ПК) является недопустимым.
//		Поэтому при логине на экранное устройство строка «pin» должна быть пустой, иначе устройство вернёт код ошибки.
//	-	Если при использовании экранного устройства во входных аргументах команды номер учётной записи «user» равен «-1»,
//		то устройство предложит пользователю самому выбрать учётную запись из списка.
//		Иначе пользователю будет предложено ввести пин-код именно для заданной в явном виде аргументом «user» учётной записи.
//	-	Если при вызове команды «LOGIN» на устройстве уже была открыта сессия этого же или другого пользователя, то его сессия автоматически прекращается.
//		При успешном вызове команды "LOGIN" устанавливается использование по умолчанию первой "толстой" бизнес-системы из списка бизнес-систем.
//		То есть, любой запрос по локальному адресу , не содержащему "vpnkeylocal", будет переадресован на установленную к использованию бизнес-систему. 
//		Эта особенность не рекомендуется к использованию, т.к. не факт, что первой в списке окажется как раз нужная программе бизнес-система.
//		Правильнее выбирать бизнес-систему после логина явным образом.
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0
//	user	NUMBER	1 байт	номер учетной записи номер учетной записи 
//	pin		PIN_STR	6 байт	пин-код
//
// Возвращаемое значение: 
//	Структура:
//		sid		HANDLE	34 байт	идентификатор сессии (рекоменд.)
//		sid	HANDLE	34 байт	идентификатор сессии (опц., наслед., значение равно предыдущему полю "sid")
//		user	NUMBER	1 байт	номер залогинившейся учётной записи
//		retcode	ENUM	2 байт	код возврата ф-ии
//
Функция LOGIN(keyurl, sid, user, pin) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
	
	СтруктураЗапроса.Параметры.Вставить("id", 	"LOGIN");
	СтруктураЗапроса.Параметры.Вставить("user", user);
	СтруктураЗапроса.Параметры.Вставить("pin", 	pin);
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Логин1
//	Функция полностью совместима по входу и выходу с «LOGIN», однако имеет два отличия: 
//	-	Если при вызове команды на устройстве уже была открыта сессия этого же или другого пользователя,
//		то она не прерывается, а в ответ на команду выдаётся соответствующий код ошибки.
//	- 	При успешном вызове команды бизнес-системы не устанавливается к использованию автоматически.
//		Для работы по ТЛС следует указать нужную бизнес-систему явным образом (функциея «SET_BS_USE»).
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0
//	user	NUMBER	1 байт	номер учетной записи номер учетной записи 
//	pin		PIN_STR	6 байт	пин-код
//
// Возвращаемое значение: 
//	Структура:
//		sid		HANDLE	34 байт	идентификатор сессии (рекоменд.)
//		sid	HANDLE	34 байт	идентификатор сессии (опц., наслед., значение равно предыдущему полю "sid")
//		user	NUMBER	1 байт	номер залогинившейся учётной записи
//		retcode	ENUM	2 байт	код возврата ф-ии
//
Функция LOGIN1(keyurl, sid, user, pin) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
	
	СтруктураЗапроса.Параметры.Вставить("id", 	"LOGIN1");
	СтруктураЗапроса.Параметры.Вставить("user", user);
	СтруктураЗапроса.Параметры.Вставить("pin", 	pin);
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);

	Возврат Ответ;
	
КонецФункции

// Получение списка доступных бизнес-систем
//	Команда выдаёт только «толстые» бизнес-системы.
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//
// Возвращаемое значение: 
//	Структура:
//		bsid	NUMBER		1 байт		идентификатор системы
//		name	STRING_A	128 байт	имя системы
//		retcode	ENUM		2 байт		код возврата ф-ии
//
Функция GET_BS_LIST(keyurl, sid) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",	"GET_BS_LIST");
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	// Гарантия того, что в результате всегда массив
	Если Ответ.Успех И Ответ.Результат.retcode = "1" Тогда
		Ответ.Результат.bsid  = ПреобразоватьВМассив(Ответ.Результат.bsid);
		Ответ.Результат.name = ПреобразоватьВМассив(Ответ.Результат.name);
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

// Определение (установка) используемой бизнес-системы
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	bsid	NUMBER	1 байт	идентификатор системы
//
// Возвращаемое значение:
//	Структура:
//		sid	HANDLE	34 байт	идентификатор сессии (наследн., для совместимости с существущим ПО. Соответствует переданному на вход SID).
//		retcode	ENUM	2 байт	код возврата ф-ии
//
Функция SET_BS_USE(keyurl, sid, bsid) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",   "SET_BS_USE");
	СтруктураЗапроса.Параметры.Вставить("bsid",	bsid);
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);

	Возврат Ответ;
	
КонецФункции

// Открытие сессии с резервной бизнес-системой
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	name	STRING_A	128	Fully qualified DNS hostname	
//
// Возвращаемое значение: 
//	Структура:
//		retcode	ENUM	2 байт	код возврата ф-ии
//
Функция START_NEW_SYSTEM(keyurl, sid, name) Экспорт
			
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",   "START_NEW_SYSTEM");
	СтруктураЗапроса.Параметры.Вставить("name", name);
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);

	Возврат Ответ;
	
КонецФункции

// Получить список объектов  (сертификаты ЭП, TLS, корневые и УЦ)
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	obj_type	ENUM	1 байт	0 - сертификаты ЭП;
//								1 - сертификаты TLS;
//								2 - корневые сертификаты;
//								3 - запрос ЭП;
//								4 - запрос TLS;
//								5 - сертификаты УЦ;
//								6 - первичные ТЛС;
//								7 - транспортные ЭП;
//
// Возвращаемое значение:
//	Структура:
//		data	STRING_A	4096 байт	список id, сепаратор;
//		retcode	ENUM		2 байт		код возврата ф-ии
//
Функция GET_OBJ_LIST_ID(keyurl, sid, obj_type = 0) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",		"GET_OBJ_LIST_ID");
	СтруктураЗапроса.Параметры.Вставить("obj_type",	obj_type);
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);

	// Обработка строки с сеператором
	Если Ответ.Успех И Ответ.Результат.retcode = "1" Тогда
		Ответ.Результат.data  = СтрВМассив(Ответ.Результат.data, ";", Ложь);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получить сертификат Х.509/запрос на сертификат PKCS10
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	obj_id	HANDLE	8 байт	id объекта
//
// Возвращаемое значение:
//	Структура:
//		data	PEM		данные запроса/сертификата в формате PEM
//		retcode	ENUM	2 байт	код возврата ф-ии
//
Функция GET_OBJ_CERT_D_ID(keyurl, sid, obj_id) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",		"GET_OBJ_CERT_D_ID");
	СтруктураЗапроса.Параметры.Вставить("obj_id",	obj_id);
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Инициализация ЭП
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	datasize	NUMBER64	2^64 - 1			размер данных для ЭП	
//	hascert		NUMBER		1 байт				максимальное количество сертификатов из цепочки доверия, которое вложить в CMS
//													"-1" - вложить все сертификаты кроме корневого
//	hasdata		ENUM		1 байт				0 - не вкладывать в CMS подписанные данные; 1 - вложить в CMS подписанные данные	
//	mode		ENUM		1, 2				Стандарт криптооперации: 
//													1 - хеш данных считается "стартом.ехе", токен только генерирует подпись хеша,
//													2 - хеш данных считается токеном, подпись генерируется им же	Опционально, по умолч."2"
//	obj_id		HANDLE		8 байт				id сертификата для подписи	Опционально, рекомендуется.
//	name		BASE64		128 символов UTF8	Для экранных токенов. Имя подписываемого документа для отображения на экран. Опционально.
//							(размер BASE64
//							для их кодировки
//							не регламентирован)
//
// Возвращаемое значение:
//	Структура:
//		data	PEM		данные запроса/сертификата в формате PEM
//		retcode	ENUM	2 байт	код возврата ф-ии
//
Функция INIT_SIGN_H_ID(keyurl, sid, obj_id, datasize, hascert = 1, hasdata = Ложь, mode = 1, name = "") Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
	
	ПараметрыЗапроса = СтруктураЗапроса.Параметры;
	ПараметрыЗапроса.Вставить("id",		"INIT_SIGN_H_ID");
	ПараметрыЗапроса.Вставить("datasize",	datasize);
	ПараметрыЗапроса.Вставить("hascert",	hascert);
	ПараметрыЗапроса.Вставить("hasdata",	hasdata);
	ПараметрыЗапроса.Вставить("mode",		mode);
	ПараметрыЗапроса.Вставить("obj_id",		obj_id);
	ПараметрыЗапроса.Вставить("name",		ПолучитьBase64СтрокуИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзСтроки(name)));
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Загрузить порцию данных для ЭП
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	data		BASE64	16777216 байтов бинарных данных (размер base64, требуемый для их кодировки, не регламентирован)	данные для подписи	
//	blocknum	NUMBER	2^32 - 1	номер посылки	опциональное, если присутствует, то проверяется. Нумерация начинается с 1
//	ctx_handle	HANDLE	8 байт	хендл контекста операции
//
// Возвращаемое значение:
//	Структура:
//		data_length	NUMBER	2^64 - 1	суммарное количество данных, переданных для подписи (включая переданное данным вызовом)
//		retcode		ENUM	2 байт		код возврата ф-ии
//
Функция SET_SIGN_DATA_H_ID(keyurl, sid, data, blocknum, ctx_handle) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",			"SET_SIGN_DATA_H_ID");
	СтруктураЗапроса.Параметры.Вставить("data",			data);
	СтруктураЗапроса.Параметры.Вставить("blocknum",		blocknum);
	СтруктураЗапроса.Параметры.Вставить("ctx_handle",	ctx_handle);
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Вычисление ЭП
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	ctx_handle	HANDLE	8 байт	хендл контекста операции	
//	obj_id		HANDLE	8 байт	id сертификата для подписи. НАСЛЕДНОЕ! Не рекомендуется к использованию.
//
// Возвращаемое значение:
//	Структура:
//		retcode		ENUM	2 байт		код возврата ф-ии
//
Функция CALC_SIGN_H_ID(keyurl, sid, ctx_handle, obj_id = Неопределено) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",			"CALC_SIGN_H_ID");
	СтруктураЗапроса.Параметры.Вставить("ctx_handle",	ctx_handle);
	Если obj_id <> Неопределено Тогда
		СтруктураЗапроса.Параметры.Вставить("obj_id", 	obj_id);
	КонецЕсли;
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Получить ЭП в формате CMS
//	Пояснение: Если при инициализации подписания было указано, что выходной файл должен содержать подписанные данные,
//	то клиент должен сам сформировать выходной cms-файл следующим образом: Сначала записать возвращённое этой функцией поле “head”,
//	потом сами подписанные данные (чтобы не гонять их через токен туда-обратно), потом возвращённое этой функцией поле “suffix”.
//	Если при инициализации не собирались включать подписанные данные в cms-файл, то клиент должен просто записать сначала поле “head”, потом поле “suffix”.
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	ctx_handle	HANDLE	8 байт	хендл контекста операции
//
// Возвращаемое значение:
//	Структура:
//		head	BASE64	16384 байт 	данные начала CMS в base64
//		suffix	BASE64	16384 байт 	данные суффикса CMS в base64
//		retcode	ENUM	2 байт		код возврата ф-ии
//
Функция GET_SIGN_CMS_H_ID(keyurl, sid, ctx_handle) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",			"GET_SIGN_CMS_H_ID");
	СтруктураЗапроса.Параметры.Вставить("ctx_handle",	ctx_handle);
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Информация о контексте
//
// Параметры:
//	keyurl	- Строка - адрес запроса
//	sid		- Строка - SID0 или SID или без SID
//	ctx_handle	HANDLE	8 байт	хендл контекста операции
//
// Возвращаемое значение:
//	Структура:
//		status		ENUM		0 - READY,		состояние контекста устройства
//								1 - ACTIVE, 
//								2 - COMPLETE, 
//								3 - WAITING, 
//								4 - FAILED, 
//								5 - REJECTED	
//		data_length	NUMBER64	2^64 - 1		количество данных, переданных для подписи
//		sign_num	NUMBER		2^32 - 1		число уже рассчитанных за время данной сессии ЭП
//		retcode		NUM			2 байт			код возврата ф-ии
//
Функция GET_CTX_INFO_H_ID(keyurl, sid, ctx_handle) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",			"GET_CTX_INFO_H_ID");
	СтруктураЗапроса.Параметры.Вставить("ctx_handle",	ctx_handle);
		
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

// Подписание пакетов документов
//
// Параметры:
//	obj_id			HANDLE	8 байт	id сертификата для подписи	
//	spec			PEMDER	16000 	байтов бинарных данных. (размер base64 для их кодировки не регламентирован)	CMS 
//									c XML-правилами обработки подписываемого пакета	Опционально;         
//	vis_required	ENUM	0, 1	1 = Необходимо выдать подписи с типом "визуализировано", 
//									исключив  автоматическое переключение типа на "подтверждено кнопкой" 
//									при нехватке памяти на визуализацию исходных данных.Актуально только для устройств с экраном. 
//									Опционально; по умолчанию: "0".
//	mode			ENUM	1, 2	Стандарт криптооперации: 
//									1 - хеш данных считается "стартом.ехе", токен только генерирует подпись хеша,
//									2 - хеш данных считается токеном, подпись генерируется им же	Опционально, по умолч.2
//	docs_array  - Массив ДД -  		Данные для подписи
//
// Возвращаемое значение: 
//	Структура - содержит:
//		* Результат - Структура 
//		* ОписаниеОшибки - Строка
//		* Успех - Булево
//
Функция SIGN_PACKET(keyurl, sid, obj_id, docs_array, spec = Неопределено, vis_required = Ложь, mode = 1) Экспорт
		
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(keyurl, sid);
		
	СтруктураЗапроса.Параметры.Вставить("id",           "SIGN_PACKET");
	СтруктураЗапроса.Параметры.Вставить("obj_id",       obj_id);
	Если spec <> Неопределено Тогда
		СтруктураЗапроса.Параметры.Вставить("spec", spec);
	КонецЕсли;
	СтруктураЗапроса.Параметры.Вставить("vis_required", vis_required);
	СтруктураЗапроса.Параметры.Вставить("mode",         mode);
	СтруктураЗапроса.Параметры.Вставить("docs_count",   docs_array.Количество());
						 
	Для Инд = 0 По docs_array.ВГраница() Цикл			
		ИмяПараметра = "doc" + Формат(Инд + 1, "ЧГ=");
		ЗначПараметра = ПолучитьBase64СтрокуИзДвоичныхДанных(docs_array[Инд]);
		ЗначПараметра = СтрЗаменить(ЗначПараметра, Символы.ВК, "");
		ЗначПараметра = СтрЗаменить(ЗначПараметра, Символы.ПС, "");
		
		СтруктураЗапроса.Параметры.Вставить(ИмяПараметра, ЗначПараметра);
	КонецЦикла;
	
	Ответ = ВызватьМетодИОбработатьРезультат(СтруктураЗапроса);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызватьМетодИОбработатьРезультат(СтруктураЗапроса)
	
	Ответ = Новый Структура;	
	Ответ.Вставить("Результат");
	Ответ.Вставить("ОписаниеОшибки");
	Ответ.Вставить("Успех", Ложь);
	
	СтруктураЗапроса.Тело = СформироватьТелоЗапроса(СтруктураЗапроса.Параметры);
	ИмяФункции = "";
	СтруктураЗапроса.Параметры.Свойство("id", ИмяФункции);
	СтруктураЗапроса.Параметры = Новый Соответствие();
	
	СтруктураЗапроса.ПараметрыСоединения.Вставить("Таймаут", 300);
	
	ОтветAPI = ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
	
	Если ОтветAPI.Успех Тогда
				
		ОтветТокена = ОтветAPI.Результат.ПолучитьТелоКакСтроку("windows-1251");
		Ответ.Результат = ПреобразоватьОтветВСтруктуру(ОтветТокена);

		Если Ответ.Результат.retcode = "1" Тогда
			Ответ.Успех = Истина;
		Иначе
			Ответ.ОписаниеОшибки = ККСНГ_APIVPNKeyTLSВызовСервера.ПолучитьОписаниеОшибкиИзМакета(Ответ.Результат.retcode, ИмяФункции);
		КонецЕсли;
		
	// Пробуем найти сообщение об ошибке от API
	ИначеЕсли ОтветAPI.КодОшибки = 1515 Тогда
		Ответ.Результат = Новый Структура("retcode", "785"); 
		Ответ.ОписаниеОшибки = "Истёк таймаут согласия пользователя на операцию.";
	Иначе
		Ответ.Результат = Новый Структура("retcode", "-0");
		Ответ.ОписаниеОшибки = "Ошибка подключения к устройству.";						
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

Функция ПреобразоватьОтветВСтруктуру(Знач ТелоСтрокой)
	
	Результат = Новый Структура();
	
	МассивПараметров = СтрВМассив(ТелоСтрокой, "&", Ложь);
		
	Для Каждого Стр Из МассивПараметров Цикл
		
		ПозРазделителя = Найти(Стр, "=");
		
		Если ПозРазделителя Тогда
			
			ИмяПараметра      = Лев(Стр, ПозРазделителя - 1);
			ЗначениеПараметра = Прав(Стр, СтрДлина(Стр) - ПозРазделителя);
			
			Если Лев(ЗначениеПараметра, 1) + Прав(ЗначениеПараметра, 1) = """""" Тогда
				ЗначениеПараметра = Сред(ЗначениеПараметра, 2, СтрДлина(ЗначениеПараметра) - 2);
			КонецЕсли;
			
			ПредЗначПараметра = Неопределено;
			Если Результат.Свойство(ИмяПараметра, ПредЗначПараметра) Тогда
				
				Если ТипЗнч(ПредЗначПараметра) <> Тип("Массив") Тогда
					
					Результат[ИмяПараметра] = Новый Массив();					
					Результат[ИмяПараметра].Добавить(ПредЗначПараметра);
					
				КонецЕсли;
					
				Результат[ИмяПараметра].Добавить(ЗначениеПараметра);				
			Иначе
				Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
						
		КонецЕсли;
				
	КонецЦикла;
	
	Если НЕ Результат.Свойство("retcode") Тогда
		Результат.Вставить("retcode");
	КонецЕсли;
	
	Возврат Результат; 

КонецФункции

Функция ПолучитьСтруктуруЗапроса(keyurl, sid)
	
	СтруктураЗапроса = ККСНГ_ТранспортHTTPКлиентСервер.ПолучитьСтруктуруЗапроса();
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = keyurl + sid + "/";
	
	СтруктураЗапроса.Заголовки.Вставить("charset", "windows1251");	
	
	// Меняем "соответствие" на "структуру", чтобы при формировании тела сохранился 
	// порядок следования аргументов метода API ключа. 
	СтруктураЗапроса.Параметры = Новый Структура;
	
	Возврат СтруктураЗапроса;
	
КонецФункции

Функция СформироватьТелоЗапроса(СтруктураПараметров)

	Результат = "";
	Для Каждого Парам Из СтруктураПараметров Цикл
		
		ЗначениеПараметра = Формат(Парам.Значение, "ЧН=0; ЧГ=; БЛ=0; БИ=1");		
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "&") + Парам.Ключ + "=" + ЗначениеПараметра;	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьВМассив(НекоеЗначение)
	
	Результат = НекоеЗначение;
	
	Если ТипЗнч(НекоеЗначение) <> Тип("Массив") Тогда
		Результат = Новый Массив;
		Результат.Добавить(НекоеЗначение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрВМассив(ИсходнаяСтрока, Разделитель, ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	ОсновнаяСтрока = ИсходнаяСтрока;
	ПозицияРазделителя = Найти(ОсновнаяСтрока, Разделитель);
	
	Пока ПозицияРазделителя Цикл
		
		НоваяСтрока = Лев(ОсновнаяСтрока, ПозицияРазделителя - 1);
		ОсновнаяСтрока = Прав(ОсновнаяСтрока, СтрДлина(ОсновнаяСтрока) - ПозицияРазделителя - ДлинаРазделителя + 1);
		
		Если ВключатьПустые Или Не ПустаяСтрока(НоваяСтрока) Тогда
			Результат.Добавить(НоваяСтрока);
		КонецЕсли;
		
		ПозицияРазделителя = Найти(ОсновнаяСтрока, Разделитель);
		
	КонецЦикла;
	
	Если ВключатьПустые Или Не ПустаяСтрока(ОсновнаяСтрока) Тогда
		Результат.Добавить(ОсновнаяСтрока);
	КонецЕсли;
	
	Возврат Результат;
    
КонецФункции

#КонецОбласти