
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораПрофилейЭДО(ПрофильНастройкиЭДО, Элементы.Организация);
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьСписокПодписок();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПодписок

&НаКлиенте
Процедура СписокПодписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПолучитьДанныеПодписки(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокПодписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодписку(Команда)
	
	ОбработчикВопросаДобавитьПодписку = Новый ОписаниеОповещения("ОбработчикВопросаДобавитьПодписку", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикВопросаДобавитьПодписку, "Добавить новую подписку?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПодписку(Команда)
	
	ТекущиеДанные = Элементы.СписокПодписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ДопПараметры = Новый Структура("token", ТекущиеДанные.token);
		ОбработчикВопросаУдалитьПодписку = Новый ОписаниеОповещения("ОбработчикВопросаУдалитьПодписку", ЭтотОбъект, ДопПараметры);
		
		ПоказатьВопрос(ОбработчикВопросаУдалитьПодписку, "Удалить выбранную подписку?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПодписку(Команда)
	
	ПолучитьДанныеПодписки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСобытия(Команда)
	
	ПолучитьСобытияПодписки();
	
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов() 
	
	Элементы.Организация.Видимость = Режим = 0;
	Элементы.APIKey.Видимость = Режим = 1;
	
КонецПроцедуры	

#Область ПолучениеПараметровАвторизации

&НаКлиенте
Процедура НачатьОбновлениеПараметровАвторизации(ОповещениеЗавершения)
	
	Если Режим = 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(ПрофильНастройкиЭДО) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен профиль организации.", , "ПрофильНастройкиЭДО");
			Возврат;
		КонецЕсли;
						
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОповещениеЗавершения);
	Иначе
		Если Режим = 1 Тогда
			Если НЕ ЗначениеЗаполнено(КлючДоступаAPI) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен ключ доступа.", , "APIKey");
				Возврат;
			КонецЕсли;	
			СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ApiKey");
		Иначе // токен Сбербанка
			СпособАвторизации = ПредопределенноеЗначение("Перечисление.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка");
		КонецЕсли;
				
		ДанныеАвторизации = Новый Структура;
		ДанныеАвторизации.Вставить("СпособАвторизации", СпособАвторизации);
		ДанныеАвторизации.Вставить("КлючДоступаAPI", КлючДоступаAPI);
		ДанныеАвторизации.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		
		ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииНовойОрганизации(ДанныеАвторизации, ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеПодписками

#Область ОбновитьПодписки

&НаКлиенте
Процедура ОбновитьСписокПодписок()
	
	СписокПодписок.Очистить();
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ОбновитьСписокПодписокЗавершение", ЭтотОбъект);
	НачатьОбновлениеПараметровАвторизации(ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПодписокЗавершение(РезультатЗапроса, ДопПараметры) Экспорт
	
	Если РезультатЗапроса.Успех Тогда
		ПараметрыАвторизации = 	РезультатЗапроса.Результат;
		ОбновитьСписокПодписокНаСервере(ПараметрыАвторизации);
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПодписокНаСервере(ПараметрыАвторизации)
	
	РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionGetSubscriptions(ПараметрыАвторизации);
	
	Если РезультатЗапроса.Успех Тогда
		МассивСтруктурПодписок = РезультатЗапроса.Результат.Subscription;
		Для каждого СтруктураПодписка Из МассивСтруктурПодписок Цикл
			СтрокаПодписка = СписокПодписок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПодписка, СтруктураПодписка);
		КонецЦикла;
		
		СписокПодписок.Сортировать("Created ВОЗР");
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область УдалитьПодписку

&НаКлиенте
Процедура ОбработчикВопросаУдалитьПодписку(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("УдалитьПодпискуЗавершение", ЭтотОбъект, ДопПараметры);
		НачатьОбновлениеПараметровАвторизации(ОповещениеЗавершения);
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура УдалитьПодпискуЗавершение(РезультатЗапроса, ДопПараметры) Экспорт
	
	Если РезультатЗапроса.Успех Тогда
		ПараметрыАвторизации = РезультатЗапроса.Результат; 
		Ответ = УдалитьПодпискуНаСервере(ДопПараметры.token, ПараметрыАвторизации);
		Если Ответ.Успех Тогда
			ОбновитьСписокПодписок();
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(Ответ.Журнал, "-1");
		КонецЕсли; 
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли;
	
КонецПроцедуры 	

&НаСервереБезКонтекста
Функция УдалитьПодпискуНаСервере(token, ПараметрыАвторизации)
	
	РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionDelete(ПараметрыАвторизации, token);
		
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область ДобавитьПодписку

&НаКлиенте
Процедура ОбработчикВопросаДобавитьПодписку(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ДобавитьПодпискуЗавершение", ЭтотОбъект);
		НачатьОбновлениеПараметровАвторизации(ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьПодпискуЗавершение(РезультатЗапроса, ДопПараметры) Экспорт
	
	Если РезультатЗапроса.Успех Тогда
		ПараметрыАвторизации = РезультатЗапроса.Результат; 
		token = ДобавитьПодпискуНаСервере(ПараметрыАвторизации);
						
		Если token <> Неопределено Тогда
			ОбновитьСписокПодписок();
			ОткрытьФормуПодписки(token, ПараметрыАвторизации);
		КонецЕсли;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли;
	 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьПодпискуНаСервере(ПараметрыАвторизации)
	
	РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionAdd(ПараметрыАвторизации, Ложь);
	
	Если РезультатЗапроса.Успех Тогда
		СтруктураПодписка = РезультатЗапроса.Результат;
		token = СтруктураПодписка.token;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
		token = Неопределено;
	КонецЕсли;

	Возврат token;
	
КонецФункции

#КонецОбласти

#Область ПолучитьПодписку

&НаКлиенте
Процедура ПолучитьДанныеПодписки() 
	
	ТекущиеДанные = Элементы.СписокПодписок.ТекущиеДанные;
			
	Если ТекущиеДанные = Неопределено Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите подписку для отображения");
		Возврат;
	КонецЕсли;
	
	token = ТекущиеДанные.token;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("token", token);
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПолучитьПодпискуЗавершение", ЭтотОбъект, ДопПараметры);
	НачатьОбновлениеПараметровАвторизации(ОповещениеЗавершения);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПолучитьПодпискуЗавершение(РезультатЗапроса, ДопПараметры) Экспорт
	
	Если РезультатЗапроса.Успех Тогда
		ПараметрыАвторизации = РезультатЗапроса.Результат;
		ОткрытьФормуПодписки(ДопПараметры.token, ПараметрыАвторизации);
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуПодписки(token, ПараметрыАвторизации)
	
	ПараметрыОткрытияФормы = Новый Структура("token, ПараметрыАвторизации", token, ПараметрыАвторизации);
	ИмяФормыПодписки = "Обработка.ККСНГ_УправлениеПодписками.Форма.ФормаПодписки";
	ОткрытьФорму(ИмяФормыПодписки, ПараметрыОткрытияФормы, 
					ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
					
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#Область СобытияПодписки

&НаКлиенте
Процедура ПолучитьСобытияПодписки()
	
	ТекущиеДанные = Элементы.СписокПодписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ДопПараметры = Новый Структура("token", ТекущиеДанные.Token);
		ОбработчикВводаЧислаСобытий = Новый ОписаниеОповещения("ОбработчикВводаЧислаСобытий", ЭтотОбъект, ДопПараметры);
		ОписаниеТипов = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(0, 0, ДопустимыйЗнак.Неотрицательный));
		ПоказатьВводЗначения(ОбработчикВводаЧислаСобытий, 1000, "Количество событий", ОписаниеТипов); 
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите подписку для отображения событий");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаЧислаСобытий(Значение, ДопПараметры) Экспорт
	
	ДопПараметры.Вставить("Значение", Значение);
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПолучитьСобытияЗавершение", ЭтотОбъект, ДопПараметры);
	НачатьОбновлениеПараметровАвторизации(ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСобытияЗавершение(РезультатЗапроса, ДопПараметры) Экспорт
	
	Если РезультатЗапроса.Успех Тогда
		ПараметрыАвторизации = РезультатЗапроса.Результат;
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("token", ДопПараметры.token);
		ПараметрыОткрытияФормы.Вставить("count", ДопПараметры.Значение);
		ПараметрыОткрытияФормы.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
		
		ИмяФормыСобытий = "Обработка.ККСНГ_УправлениеПодписками.Форма.ФормаСобытия";
		ОткрытьФорму(ИмяФормыСобытий, ПараметрыОткрытияФормы, ЭтотОбъект, , , , , 
							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти