
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресОбновляемыхОбъектов", АдресОбновляемыхОбъектов);
	Параметры.Свойство("ЗаменяемыеФорматы", ЗаменяемыеФорматы);
	Параметры.Свойство("НовыйФормат", НовыйФормат);
	ТекстПредложения = "";
	Параметры.Свойство("ТекстПредложения", ТекстПредложения);
	Если ЗначениеЗаполнено(ТекстПредложения) Тогда 
		Элементы.ДекорацияТекстПредложения.Заголовок = ТекстПредложения;
	КонецЕсли;

	ОбновляемыеОбъекты = ПолучитьИзВременногоХранилища(АдресОбновляемыхОбъектов);
	
	ВыборкаПоОрганизациям = ОбновляемыеОбъекты.РезультатПоОрганизациям.Выбрать();
	Пока ВыборкаПоОрганизациям.Следующий() Цикл
		НовСтрока = ОбновляемыеОрганизации.Добавить();
		НовСтрока.Ссылка = ВыборкаПоОрганизациям.Ссылка;
	КонецЦикла;
	
	ВыборкаПоКонтрагентам = ОбновляемыеОбъекты.РезультатПоКонтрагентам.Выбрать();
	Пока ВыборкаПоКонтрагентам.Следующий() Цикл
		НовСтрока = ОбновляемыеКонтрагенты.Добавить();
		НовСтрока.Ссылка = ВыборкаПоКонтрагентам.Ссылка;
	КонецЦикла;
	
	Если ОбновляемыеОрганизации.Количество() = 0 Тогда
		Элементы.ГруппаОбновляемыеОбъекты.ТекущаяСтраница = Элементы.ГруппаКонтрагентыЭДО;
	КонецЕсли;
	
	Элементы.ДекорацияИтоги.Видимость = Ложь;
	Элементы.ОбновляемыеОрганизацииТекстОшибки.Видимость = Ложь;
	Элементы.ОбновляемыеКонтрагентыТекстОшибки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИтогиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ОбновляемыеОрганизацииТекстОшибки.Видимость = Не Элементы.ОбновляемыеОрганизацииТекстОшибки.Видимость;
	Элементы.ОбновляемыеКонтрагентыТекстОшибки.Видимость = Не Элементы.ОбновляемыеКонтрагентыТекстОшибки.Видимость;

	ТекЗаголовокИтогов = Элементы.ДекорацияИтоги.Заголовок;
	ЧастиИтогов = Новый Массив;
	ТекстИтогов = СтрЗаменить(ТекЗаголовокИтогов, "Показать ошибки", "");
	ТекстИтогов = СтрЗаменить(ТекстИтогов, "Скрыть ошибки", "");
	ЧастиИтогов.Добавить(ТекстИтогов);
	ТекстСсылкиНаОшибки = ?(Элементы.ОбновляемыеКонтрагентыТекстОшибки.Видимость, "Скрыть ошибки", "Показать ошибки");
	СсылкаНаОшибки = "СсылкаНаОшибки";
	ЧастиИтогов.Добавить(Новый ФорматированнаяСтрока(ТекстСсылкиНаОшибки,,,, СсылкаНаОшибки));
	
	Элементы.ДекорацияИтоги.Заголовок = Новый ФорматированнаяСтрока(ЧастиИтогов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьФорматы(Команда)
	
	ОчиститьИтоги();
	ОбновитьФорматыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	УдалитьИзВременногоХранилища(АдресОбновляемыхОбъектов);
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьИтоги()
	
	Элементы.ДекорацияИтоги.Заголовок = "";
	Элементы.ДекорацияИтоги.Видимость = Ложь;
	Элементы.ОбновляемыеОрганизацииТекстОшибки.Видимость = Ложь;
	Элементы.ОбновляемыеКонтрагентыТекстОшибки.Видимость = Ложь;

	Для Каждого СтрокаОрганизации Из ОбновляемыеОрганизации Цикл 
		
		СтрокаОрганизации.Успех = Ложь;
		СтрокаОрганизации.ТекстОшибки = "";
		
	КонецЦикла;
	
	Для Каждого СтрокаКонтрагента Из ОбновляемыеКонтрагенты Цикл 
		
		СтрокаКонтрагента.Успех = Ложь;
		СтрокаКонтрагента.ТекстОшибки = "";
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьФорматыНаСервере()
	
	ВариантыНастроекОбмена = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВариантыФорматовЭлектронныхДокументов();
	
	УспешноОбновленных = 0;
	
	Для Каждого СтрокаОрганизации Из ОбновляемыеОрганизации Цикл
		ЗаполнитьРезультатОбновленияФормата(СтрокаОрганизации, ВариантыНастроекОбмена, УспешноОбновленных);		
	КонецЦикла;
	
	Для Каждого СтрокаКонтрагента Из ОбновляемыеКонтрагенты Цикл
		ЗаполнитьРезультатОбновленияФормата(СтрокаКонтрагента, ВариантыНастроекОбмена, УспешноОбновленных);
	КонецЦикла;
	
	ВсегоОбъектов = ОбновляемыеОрганизации.Количество() + ОбновляемыеКонтрагенты.Количество();
	
	ЧастиИтогов = Новый Массив;
	
	ТекстИтогов = СтрШаблон(НСтр("ru = 'Обновлено объектов: %1 из %2. '"),
						УспешноОбновленных, ВсегоОбъектов);
	ЧастиИтогов.Добавить(ТекстИтогов);
	
	ВсеУспешны = УспешноОбновленных = ВсегоОбъектов;
	Элементы.ФормаОбновитьФорматы.Видимость = Не ВсеУспешны;
	Элементы.ФормаОбновитьФорматы.КнопкаПоУмолчанию = Не ВсеУспешны;
	Элементы.ФормаОтмена.Заголовок = ?(ВсеУспешны, "Завершить", "Отмена");
	Элементы.ФормаОтмена.КнопкаПоУмолчанию = ВсеУспешны;
	Если Не ВсеУспешны Тогда 
		ТекстСсылкиНаОшибки = "Показать ошибки";
		СсылкаНаОшибки = "СсылкаНаОшибки";
		ЧастиИтогов.Добавить(Новый ФорматированнаяСтрока(ТекстСсылкиНаОшибки,,,, СсылкаНаОшибки));	
	КонецЕсли;
	
	Элементы.ДекорацияТекстПредложения.Видимость = Ложь;
	Элементы.ДекорацияИтоги.Заголовок = Новый ФорматированнаяСтрока(ЧастиИтогов);
	Элементы.ДекорацияИтоги.Видимость = Истина;
	
	ОбновляемыеОрганизации.Сортировать("Успех Возр"); 
	ОбновляемыеКонтрагенты.Сортировать("Успех Возр"); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатОбновленияФормата(СтрокаОбъекта, ВариантыНастроекОбмена, УспешноОбновленных)
	
	ЗапросОбновитьФормат = ОбновитьФорматДокументооборота(СтрокаОбъекта.Ссылка, ВариантыНастроекОбмена);
	СтрокаОбъекта.Успех = ЗапросОбновитьФормат.Успех;
	Если СтрокаОбъекта.Успех Тогда
		УспешноОбновленных = УспешноОбновленных + 1;
	Иначе 
		ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросОбновитьФормат.Журнал);
		Если ПоследняяОшибка <> Неопределено Тогда
			ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
		Иначе 
			ТекстСообщения ="Ошибка обновления формата.";
		КонецЕсли;	
		СтрокаОбъекта.ТекстОшибки = ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьФорматДокументооборота(ОбновляемыйСсылка, ВариантыНастроекОбмена)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ОбновляемыйОбъект = ОбновляемыйСсылка.ПолучитьОбъект(); 
	Если ОбновляемыйОбъект = Неопределено Тогда
		ТекстОшибки = "Объект отсутствует в базе"; 
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UFD-00001");
		Возврат Ответ;
	КонецЕсли;
	
	ТекущийВариантНастройки = ОбновляемыйОбъект.ВариантНастройкиОбмена;
	Если СтрНайти(ТекущийВариантНастройки, НовыйФормат) > 0 Тогда
		Ответ.Результат = Неопределено;
		Ответ.Успех = Истина;
		Возврат Ответ;
	КонецЕсли;

	МассивЗаменяемых = СтрРазделить(ЗаменяемыеФорматы, ",", Ложь);
	Для Каждого ТекЗаменяемый Из МассивЗаменяемых Цикл
		ТекЗаменяемый = СокрЛП(ТекЗаменяемый);
		Если СтрНайти(ТекущийВариантНастройки, ТекЗаменяемый) = 0 Тогда
			Продолжить;
		КонецЕсли;
		НовыйВариантНастройки = СтрЗаменить(ТекущийВариантНастройки, ТекЗаменяемый, НовыйФормат);
	КонецЦикла;
		
	Если ТекущийВариантНастройки = НовыйВариантНастройки Тогда
		ТекстОшибки = "Текущий вариант настройки обмена ""%1"" не содержит заменяемых форматов ""%2"""; 
		ТекстОшибки = СтрШаблон(ТекстОшибки, ТекущийВариантНастройки, ЗаменяемыеФорматы);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UFD-00002");
		Возврат Ответ;
	КонецЕсли;
	
	Если ВариантыНастроекОбмена.Найти(НовыйВариантНастройки) = Неопределено Тогда
		ТекстОшибки = "Новый вариант настройки обмена ""%1"" не определен"; 
		ТекстОшибки = СтрШаблон(ТекстОшибки, НовыйВариантНастройки);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UFD-00003");
		Возврат Ответ;
	КонецЕсли;
	
	ОбновляемыйОбъект.ВариантНастройкиОбмена = НовыйВариантНастройки;
	
	Попытка
		ОбновляемыйОбъект.Записать();
	Исключение
		ТекстОшибки = "Не удалось записать объект ""%1"" по причине: " + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); 
		ТекстОшибки = СтрШаблон(ТекстОшибки, ОбновляемыйОбъект);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UFD-00004");
		Возврат Ответ;
	КонецПопытки;
	
	Ответ.Результат = Неопределено;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти