
#Область ПрограммныйИнтерфейс

// Возвращает структуру HTTP запроса
//
// Параметры:
// 	СтруктураЗапроса - Структура - структура данных запроса см. ПолучитьСтруктуруЗапроса().
// 	Лог              - Структура, Неопределенно - структура для логирования см. ПолучитьСтруктуруЛога(). 
//
// Возвращаемое значение: 
//  СтруктураЗапроса - Структура - содержит следующие поля:
//      * Метод - Строка - "ВыгрузитьВФайл", обязательный параметр, определяет режим открытия формы выгрузи документа.
//      * Адрес - Строка - строка http-ресурса, к которому будет отправлен запрос.
//      * Параметры - Соответствие - параметры, которые будут отправлены на сервер в виде Ключ=Значение.
//      * Заголовки - Соответствие - заголовки, которые будут отправлены на сервер в виде соответствия: "Заголовок" - "Значение".
//      * Тело - Строка, ДвоичныеДанные, Файл - тело HTTP-запроса. 
//      * ИмяВыходногоФайла - Строка - полное имя файла в которы будет записано тело ответа.
//      * ПараметрыСоединения - Структура - см. ПолучитьПараметрыHTTPСоединения().
//      * МаксРедиректов - Число - максимально возможное количество редиректов.
//      * МаксОшибок -  Число - максимально возможное количество ошибок.
//
Функция ПолучитьСтруктуруЗапроса() Экспорт

	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("Метод");
	СтруктураЗапроса.Вставить("Адрес");
	СтруктураЗапроса.Вставить("ПараметрыСоединения", Новый Структура());
	СтруктураЗапроса.Вставить("Заголовки", Новый Соответствие());
	СтруктураЗапроса.Вставить("Параметры", Новый Соответствие());
	СтруктураЗапроса.Вставить("Тело");
	СтруктураЗапроса.Вставить("ИмяВыходногоФайла");
	СтруктураЗапроса.Вставить("МаксРедиректов", 0);
	СтруктураЗапроса.Вставить("МаксОшибок", 0);

	Возврат СтруктураЗапроса;

КонецФункции

// Выполняет HTTP запрос. Метод, URI и остальные параметры задаются через
// структуру запроса см. ПолучитьСтруктуруЗапроса().
//
// Параметры:
// 	СтруктураЗапроса - Структура - структура данных запроса см. ПолучитьСтруктуруЗапроса().
//
// Возвращаемое значение: 
// 	Ответ - HTTPОтвет, Неопределенно - в случае успешного вызова возвращает стандартный объект HTTPОтвет,
//									  ниаче Неопределено
//
//
Функция ВыполнитьHTTPМетод(Знач СтруктураЗапроса) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	ОбработатьПараметрыURL(СтруктураЗапроса);

	СтруктураURL = ПолучитьСтруктуруURL(СтруктураЗапроса.Адрес);

	Повторять = Истина;
	КолВоЗапросов = 0;
	КолВоРедиректов = 0;
	КолВоОшибок = 0;

	ПараметрыHTTPСоединения = ПолучитьПараметрыHTTPСоединения(СтруктураURL, СтруктураЗапроса.ПараметрыСоединения);
	HTTPСоединение = УстановитьHTTPСоединение(ПараметрыHTTPСоединения);

	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Пока Повторять Цикл

		Если НеобходимоОбновитьHTTPСоединение(ПараметрыHTTPСоединения, СтруктураURL) Тогда
			HTTPСоединение = УстановитьHTTPСоединение(ПараметрыHTTPСоединения);
		КонецЕсли;

		Если ТипЗнч(СтруктураЗапроса.Тело) = Тип("Файл") Тогда
			Попытка
				СтруктураЗапроса.Тело = Новый ДвоичныеДанные(СтруктураЗапроса.Тело.ПолноеИмя);
			Исключение
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки(), ПолучитьКодОшибки(1510));
				Прервать;
			КонецПопытки;
		КонецЕсли;

		ПараметрыМетода = ПолучитьПараметрыHTTPМетода(СтруктураЗапроса.Метод,
		СтруктураURL.ПутьНаСервере,
		СтруктураЗапроса.Заголовки,
		СтруктураЗапроса.Тело,
		СтруктураЗапроса.ИмяВыходногоФайла);

		ОтветВнутренний = ВыполнитьHTTPМетодВнутренний(HTTPСоединение, ПараметрыМетода, СтруктураURL);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветВнутренний.Журнал, Ложь);
 		Рез = ОбработатьОтвет(ОтветВнутренний.Результат, ПараметрыМетода, СтруктураURL, Ответ.Журнал);
		
		Если ОтветВнутренний.Успех Тогда
			Ответ.Успех = ОтветВнутренний.Результат.КодСостояния < 300;
			Ответ.КодОшибки = ОтветВнутренний.Результат.КодСостояния;
			Ответ.Результат = ОтветВнутренний.Результат;
		Иначе
			Ответ.КодОшибки = ОтветВнутренний.КодОшибки;
		КонецЕсли;

		КолВоЗапросов = КолВоЗапросов + 1;
		Если Рез.Ошибка Тогда
			КолВоОшибок = КолВоОшибок + 1;
			Повторять = Истина;
		ИначеЕсли Рез.Редирект Тогда
			КолВоРедиректов = КолВоРедиректов + 1;
			Повторять = Истина;
		Иначе
			Повторять = Ложь;
		КонецЕсли;

		Если КолВоРедиректов > СтруктураЗапроса.МаксРедиректов Тогда
			Расположение = Ответ.Результат.Заголовки.Получить("Location");
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Превышено максимальное количество редиректов",
			ПолучитьКодОшибки(ОтветВнутренний.Результат.КодСостояния), Расположение);
			Прервать;
		КонецЕсли;

		Если КолВоОшибок > СтруктураЗапроса.МаксОшибок Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ответ;

КонецФункции

// ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает параметры HTTP соединения
//
// Параметры:
//	СтруктураURL - Структура - см. ПолучитьСтруктуруURL().
//	ДополнительныеПараметры - Структура "Ключ" - "Значение"
//      Устанавливаются в ПараметрыHTTPСоединения, структуру см. в возвращаемых значениях.
//		Возможные ключи: Пользователь, Пароль, Прокси, Таймаут, ЗащищенноеСоединение, ИспользоватьАутентификациюОС.
//
// Возвращаемое значение:
//  ПараметрыHTTPСоединения - Структура - содержит следующие поля:
//      * Сервер - Строка - сервер, с которым произведено соединение.
//      * Порт - Строка - порт сервера, с которым произведено соединение.
//      * Пользователь - Строка - пользователь, от имени которого установлено соединение.
//								  Не поддерживаются имена, содержащие символы алфавита, отличного от латинского.
//      * Прокси - ИнтернетПрокси - прокси, через который установлено соединение. 
//      * Таймаут - Число - определяет время ожидания осуществляемого соединения и операций, в секундах.
//      * ЗащищенноеСоединение - ЗащищенноеСоединениеOpenSSL,
//								 Неопределено - Содержит объект защищенного соединения для осуществления HTTPS-соединения.
//      * ИспользоватьАутентификациюОС - Булево - содержит текущее значение использования аутентификации NTLM или Negotiate на сервере.
//
Функция ПолучитьПараметрыHTTPСоединения(СтруктураURL, ДополнительныеПараметры) Экспорт

	ПараметрыHTTPСоединения = Новый Структура;
	ПараметрыHTTPСоединения.Вставить("Сервер");
	ПараметрыHTTPСоединения.Вставить("Порт");
	ПараметрыHTTPСоединения.Вставить("Пользователь");
	ПараметрыHTTPСоединения.Вставить("Пароль");
	ПараметрыHTTPСоединения.Вставить("Прокси");
	ПараметрыHTTPСоединения.Вставить("Таймаут");
	ПараметрыHTTPСоединения.Вставить("ЗащищенноеСоединение");
	ПараметрыHTTPСоединения.Вставить("ИспользоватьАутентификациюОС");

	ПараметрыHTTPСоединения.Таймаут = 60;
	ПараметрыHTTPСоединения.ИспользоватьАутентификациюОС = Ложь;

	ЗаполнитьЗначенияСвойств(ПараметрыHTTPСоединения, СтруктураURL);
	ЗаполнитьЗначенияСвойств(ПараметрыHTTPСоединения, ДополнительныеПараметры);

	Если ПараметрыHTTPСоединения.ЗащищенноеСоединение = Неопределено И СтруктураURL.Схема = "https" Тогда
		ПараметрыHTTPСоединения.ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	КонецЕсли;

	Возврат ПараметрыHTTPСоединения;

КонецФункции

// Возвращает структуру параметров HTTP метода.
//
// Параметры:
//	HTTPМетод - Строка - строка, содержащая имя HTTP-метода для запроса.
//  АдресРесурса - Строка - Строка http-ресурса, к которому будет отправлен запрос.
//	Заголовки - Соответствие - Заголовки, которые будут отправлены на сервер в виде соответствия: "Заголовок" - "Значение".  
//	Тело - Строка, ДвоичныеДанные, Файл - тело HTTP-запроса.
//  ИмяВыходногоФайла - Строка - полное имя файла в которы будет записано тело ответа.
//
// Возвращаемое значение:
//  ПараметрыМетода - Структура - содержит следующие поля
//      * HTTPМетод - Строка - описывает HTTP-метод.	
//      * HTTPЗапрос - HTTPЗапрос - описание HTTP-запроса см. справку. 
//      * ИмяВыходногоФайла - Строка - полное имя файла в которы будет записано тело ответа.
//
Функция ПолучитьПараметрыHTTPМетода(HTTPМетод, АдресРесурса,
		Заголовки = Неопределено, Тело = Неопределено, ИмяВыходногоФайла = "") Экспорт

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Метод");
	ПараметрыЗапроса.Вставить("АдресРесурса");
	ПараметрыЗапроса.Вставить("Заголовки");
	ПараметрыЗапроса.Вставить("Тело");
	ПараметрыЗапроса.Метод = ?(HTTPМетод = Неопределено, "GET", HTTPМетод);
	ПараметрыЗапроса.АдресРесурса = АдресРесурса;
	Если Заголовки = Неопределено Тогда
		ПараметрыЗапроса.Заголовки = Новый Соответствие();
	Иначе
		ПараметрыЗапроса.Заголовки = Заголовки;
	КонецЕсли;

	ПараметрыЗапроса.Тело = Тело;

	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("HTTPМетод");
	ПараметрыМетода.Вставить("HTTPЗапрос");
	ПараметрыМетода.Вставить("ИмяВыходногоФайла");
	ПараметрыМетода.HTTPМетод  = ПараметрыЗапроса.Метод;
	ПараметрыМетода.ИмяВыходногоФайла = ИмяВыходногоФайла;

	ПараметрыМетода.HTTPЗапрос = СформироватьHTTPЗапрос(ПараметрыЗапроса);

	Возврат ПараметрыМетода;

КонецФункции

// Создает новое HTTPСоединение 
//
// Параметры:
//	ПараметрыHTTPСоединения - Структура - см. ПолучитьПараметрыHTTPСоединения().
//
// Возвращаемое значение: 
//	HTTPСоединение - HTTPСоединение - см. справку.
//
Функция УстановитьHTTPСоединение(ПараметрыHTTPСоединения) Экспорт

	HTTPСоединение = Новый HTTPСоединение(ПараметрыHTTPСоединения.Сервер,
	ПараметрыHTTPСоединения.Порт,
	ПараметрыHTTPСоединения.Пользователь,
	ПараметрыHTTPСоединения.Пароль,
	ПараметрыHTTPСоединения.Прокси,
	ПараметрыHTTPСоединения.Таймаут,
	ПараметрыHTTPСоединения.ЗащищенноеСоединение,
	ПараметрыHTTPСоединения.ИспользоватьАутентификациюОС);

	Возврат HTTPСоединение;

КонецФункции

// Формирует HTTPЗапрос из параметров запроса
//
// Параметры:
//	ПараметрыЗапроса - Структура - см. ПолучитьСтруктуруЗапроса().
//
// Возвращаемое значение:
//	HTTPЗапрос - HTTPЗапрос - см. справку.
//
Функция СформироватьHTTPЗапрос(ПараметрыЗапроса) Экспорт

	HTTPЗапрос = Новый HTTPЗапрос;

	ЗаполнитьЗначенияСвойств(HTTPЗапрос, ПараметрыЗапроса);

	Если ТипЗнч(ПараметрыЗапроса.Тело) = Тип("Строка")  Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.Тело, , ИспользованиеByteOrderMark.НеИспользовать);
	ИначеЕсли ТипЗнч(ПараметрыЗапроса.Тело) = Тип("ДвоичныеДанные") Тогда
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ПараметрыЗапроса.Тело);
	Иначе
		Если ПараметрыЗапроса.Метод = "PUT" Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки("", , ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;
	КонецЕсли;

	Возврат HTTPЗапрос;

КонецФункции

// Отправляет данные на указанный адрес в СтруктураURL для обработки 
// с использованием указанного HTTPСоединения, параметров метода. 
//
// Параметры:
//	HTTPСоединение - HTTPСоединение - см. справку
//  ПараметрыМетода - Структура - см. ПолучитьПараметрыHTTPМетода().
//
// Возвращаемое значение:
//	HTTPОтвет - HTTPОтвет - см. справку.
//
Функция ВыполнитьHTTPМетодВнутренний(HTTPСоединение, ПараметрыМетода, СтруктураURL) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	HTTPОтвет = Неопределено;
	АдресРесурсаВСообщении = ОбработанныйАдресРесурса(ПараметрыМетода.HTTPЗапрос.АдресРесурса);

	Попытка

		ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(ПараметрыМетода.HTTPМетод, ПараметрыМетода.HTTPЗапрос, ПараметрыМетода.ИмяВыходногоФайла);
		Ответ.Результат = HTTPОтвет;
		Ответ.Успех = Истина;

		стрШаблон = "Получен код ответа %6: %1 -> %2%3:%4/%5";
		ТекстСообщения = стрШаблон(стрШаблон,
		ПараметрыМетода.HTTPМетод,
		?(СтруктураURL.Схема = "", "", СтруктураURL.Схема + "://"),
		HTTPСоединение.Сервер,
		XMLСтрока(HTTPСоединение.Порт),
		АдресРесурсаВСообщении,
		XMLСтрока(HTTPОтвет.КодСостояния));

	Исключение

		КодОшибки = 1500;
		Если HTTPСоединение.Таймаут > 0 Тогда
			Если (ТекущаяУниверсальнаяДатаВМиллисекундах() - ТекДата)/1000 >= HTTPСоединение.Таймаут Тогда
				КодОшибки = 1515;
			КонецЕсли;
		КонецЕсли;

		стрШаблон = "Ошибка запроса %1 -> %2%3:%4/%5";
		ТекстСообщения = СтрШаблон(стрШаблон,
			ПараметрыМетода.HTTPМетод,
			?(СтруктураURL.Схема="","",СтруктураURL.Схема + "://"),
			HTTPСоединение.Сервер,
			XMLСтрока(HTTPСоединение.Порт),
			АдресРесурсаВСообщении);

		Ответ.КодОшибки = КодОшибки;
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, ПолучитьКодОшибки(КодОшибки), ОписаниеОшибки);

	КонецПопытки;

	Возврат Ответ;

КонецФункции

// Обрабатывает HTTPОтвет: 
// для кодов состояния >= 300 и <400 устанавливает признак редиректа,
// для кодов состояния >= 400 устанавливает признак ошибки.
// Более подробная информация в RFC 2616 см. http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html - Status Code Definitions
//
// Параметры:
//	HTTPОтвет - HTTPОтвет - см. справку.
//  ПараметрыМетода - Структура - см. ПолучитьПараметрыHTTPМетода().
//  СтруктураURL - Структура - см. ПолучитьСтруктуруURL().
//
// Возвращаемое значение:
//  ПараметрыМетода - Структура - содержит следующие поля
//      * Ошибка - Булево - признак ошибки.	
//      * Редирект - Булево - признак редиректа. 
//
Функция ОбработатьОтвет(HTTPОтвет, ПараметрыМетода, СтруктураURL, Лог) Экспорт

	ЕстьОшибка = Истина;
	ЕстьРедирект = Ложь;

	Если HTTPОтвет <> Неопределено Тогда

		КодСостояния  = HTTPОтвет.КодСостояния;

		//Если (КодСостояния >= 500 И КодСостояния < 600)
		//	// Ошибки 5XX говорят о проблемах на сервере (возможно, прокси-сервер)
		//	// Это может быть программная ошибка, нехватка памяти, ошибка конфигурации и т.д.
		//	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5
		//	Или (КодСостояния >= 400 И КодСостояния < 500) Тогда
		//	// Ошибки 4XX говорят о неправильном запросе - в широком смысле
		//	// Может быть неправильный адрес, ошибка аутентификации, плохой формат запроса
		//	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4
		//
		//	ЕстьОшибка = Истина;

		Если КодСостояния >= 300 И КодСостояния < 400  Тогда

			ВалидныеПеренаправления = Новый Соответствие();
			ВалидныеПеренаправления.Вставить(301, "Moved Permanently");
			ВалидныеПеренаправления.Вставить(302, "Found");
			ВалидныеПеренаправления.Вставить(303, "See Other");
			ВалидныеПеренаправления.Вставить(307, "Temporary Redirect");
			ВалидныеПеренаправления.Вставить(308, "Permanent Redirect");

			ОписаниеПеренаправления = ВалидныеПеренаправления.Получить(КодСостояния);

			Если ЗначениеЗаполнено(ОписаниеПеренаправления) Тогда

				АдресРесурса = HTTPОтвет.Заголовки.Получить("Location");
				Если ЗначениеЗаполнено(АдресРесурса) Тогда

					ЕстьРедирект = Истина;
					ЕстьОшибка = Ложь;
					СтруктураURL = ПолучитьСтруктуруURL(АдресРесурса);

					ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Лог,
						СтрШаблон("%1 - %2, выполняю запрос по новому адресу %3",
						КодСостояния, ОписаниеПеренаправления, АдресРесурса));

				Иначе
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Лог, "Не удалось найти адрес перенаправления", ПолучитьКодОшибки(КодСостояния));
				КонецЕсли;		

			КонецЕсли;

			// Статусы 1XX и 2XX считаем хорошими
		ИначеЕсли КодСостояния < 300 Тогда

			ЕстьОшибка = Ложь;

		Иначе

			ЕстьОшибка = Истина;

		КонецЕсли;

		СтрокаURL = ОбработанныйАдресРесурса(СтруктураURL.СтрокаURL);
		
		стрШаблон = "%1 запрос к %2 вернул статус %3";
		ТекстСообщения = СтрШаблон(стрШаблон,
		ПараметрыМетода.HTTPМетод,
		СтрокаURL,
		HTTPОтвет.КодСостояния);
		
		Если ЕстьОшибка Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Лог, ТекстСообщения, ПолучитьКодОшибки(HTTPОтвет.КодСостояния));
		КонецЕсли;

	КонецЕсли;

	Рез = Новый Структура("Ошибка, Редирект", ЕстьОшибка, ЕстьРедирект);

	Возврат Рез;

КонецФункции

// Заполняет параметры прокси из настроек
//
// Параметры:
// 	СтруктураЗапроса - Структура - Параметры HTTP-запроса. см. ПолучитьСтруктуруЗапроса()		  
//
Процедура ЗаполнитьПараметрыПрокси(СтруктураЗапроса, НастройкаПроксиСервера = Неопределено) Экспорт
	
	Если НастройкаПроксиСервера = Неопределено Тогда
		НастройкаПроксиСервера = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НастройкиПроксиСервера();
	КонецЕсли;
	Если ТипЗнч(НастройкаПроксиСервера) = Тип("Соответствие") Тогда
		
		ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
		Если ИспользоватьПрокси Тогда
			
			ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
			Если ИспользоватьСистемныеНастройки Тогда
				
				Прокси = Новый ИнтернетПрокси(Истина);
				
			Иначе
				
				Сервер = НастройкаПроксиСервера.Получить("Сервер");
				Порт = НастройкаПроксиСервера.Получить("Порт");
				Пользователь = НастройкаПроксиСервера.Получить("Пользователь");
				Пароль = НастройкаПроксиСервера.Получить("Пароль");
				ИспользоватьАутентификациюОС = НастройкаПроксиСервера.Получить("ИспользоватьАутентификациюОС");
				
				Прокси = Новый ИнтернетПрокси();
				Прокси.Установить("HTTPS", Сервер, Порт, Пользователь, Пароль, ИспользоватьАутентификациюОС);
				
			КонецЕсли;
			
			СтруктураЗапроса.ПараметрыСоединения.Вставить("Прокси", Прокси);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработанныйАдресРесурса(АдресРесурса)
	
	ОбработанныйАдрес = АдресРесурса;
	ИмяПараметра = "key=";
	СоставныеЧасти = СтрРазделить(ОбработанныйАдрес, "?&", Ложь);
	Для каждого СоставнаяЧасть Из СоставныеЧасти Цикл
		Если СтрНачинаетсяС(ВРег(СоставнаяЧасть), ВРег(ИмяПараметра)) Тогда
			ОбработанныйАдрес = СтрЗаменить(ОбработанныйАдрес, СоставнаяЧасть, ИмяПараметра + "***"); 
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ОбработанныйАдрес;
	
КонецФункции

// Возвращает структуру URL по строке URL 
//
// Параметры:
//	СтрокаURL - Строка - строка URL. 
//
// Возвращаемое значение: 
//	Результат - Структура - содержит следующие поля:
//		*СтрокаURL - Строка - строка URL.
//		*Схема - Строка - схема http или https.
//		*Логин - Строка - имя пользователя.
//		*Пароль - Строка - пароль пользователя.
//		*ИмяСервера - Строка - хост:порт.
//		*Сервер - Строка - хост.
//		*Порт - Строка - порт.
//		*ПутьНаСервере - Строка - путь без хоста
//
Функция ПолучитьСтруктуруURL(Знач СтрокаURL)

	исхСтрокаURL = СокрЛП(СтрокаURL);
	СтрокаURL = СокрЛП(СтрокаURL);

	// схема
	Схема = "";
	Позиция = СтрНайти(СтрокаURL, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURL, Позиция - 1));
		СтрокаURL = Сред(СтрокаURL, Позиция + 3);
	КонецЕсли;

	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURL;
	ПутьНаСервере = "";
	Позиция = СтрНайти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;

	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = СтрНайти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;	

	// логин и пароль
	Пользователь = СтрокаАвторизации;
	Пароль = "";
	Позиция = СтрНайти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Пользователь = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;

	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = СтрНайти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("СтрокаURL", исхСтрокаURL);
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Сервер", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);

	Возврат Результат;

КонецФункции

// Обработка параметров URL. Подставит в СтруктураЗапроса.Адрес, АдресСПараметрами.
//
// Параметры: см. ПолучитьСтруктуруЗапроса(). 
//
Процедура ОбработатьПараметрыURL(СтруктураЗапроса)

	ЧастиПараметрыЗапроса = Новый Массив;

	Если ТипЗнч(СтруктураЗапроса.Параметры) = Тип("Соответствие") Тогда
		Для Каждого Параметр Из СтруктураЗапроса.Параметры Цикл
			ЗначениеПараметра = Формат(Параметр.Значение,"ЧГ=; БЛ=false; БИ=true");
			ЗначениеПараметра = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьКодировкуСтроки(ЗначениеПараметра);
			ЗначениеШаблона = СтрШаблон("{%1}",Параметр.Ключ);
			Если СтрНайти(СтруктураЗапроса.Адрес, ЗначениеШаблона)>0 Тогда
				СтруктураЗапроса.Адрес = СтрЗаменить(СтруктураЗапроса.Адрес, ЗначениеШаблона, ЗначениеПараметра);
			Иначе
				КлючПараметра = ККСНГ_ОбщегоНазначенияВызовСервера.ВыполнитьКодировкуСтроки(Параметр.Ключ);
				ЧастиПараметрыЗапроса.Добавить(СтрШаблон("%1=%2", КлючПараметра, ЗначениеПараметра));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ЧастиПараметрыЗапроса.Количество() Тогда
		СтрокаПараметров = СтрСоединить(ЧастиПараметрыЗапроса, "&");
		СтруктураЗапроса.Адрес = СтрШаблон("%1?%2", СтруктураЗапроса.Адрес, СтрокаПараметров);
	КонецЕсли;

КонецПроцедуры

// При перенаправлениях (редиректах), проверяет необходимость
// обновить HTTPСоединение: смена хоста, схемы и т.п.
//
// Параметры:
// 	ПараметрыHTTPСоединения - Структура - см. ПолучитьПараметрыHTTPСоединения().
// 	СтруктураURL            - Структура - см. ПолучитьСтруктуруURL().
//
// Возвращаемое значение: 
//  Возвращает Истина в случае когда необходимо обновить HTTPСоединение
//
Функция НеобходимоОбновитьHTTPСоединение(ПараметрыHTTPСоединения, СтруктураURL)

	Рез = Ложь;
	ДП = Новый Соответствие();
	П = ПолучитьПараметрыHTTPСоединения(СтруктураURL, ДП);

	Если ПараметрыHTTPСоединения.Сервер <> П.Сервер Тогда
		ПараметрыHTTPСоединения.Сервер = П.Сервер;
		Рез = Истина;
	КонецЕсли;

	Если ПараметрыHTTPСоединения.Порт <> П.Порт Тогда
		ПараметрыHTTPСоединения.Порт = П.Порт;
		Рез = Истина;
	КонецЕсли;

	Если ПараметрыHTTPСоединения.ЗащищенноеСоединение=Неопределено И СтруктураURL.Схема = "https" Тогда
		ПараметрыHTTPСоединения.ЗащищенноеСоединение = П.ЗащищенноеСоединение;
		Рез = Истина;
	КонецЕсли;

	Возврат Рез;

КонецФункции

Функция ПолучитьКодОшибки(КодОтвета)

	Результат = "HTTP-" + XMLСтрока(КодОтвета);
	Возврат "HTTP-" + Формат(КодОтвета, "ЧН=0; ЧГ=0");

КонецФункции

// СлужебныеПроцедурыИФункции
#КонецОбласти
