
#Область ОписаниеПеременных

&НаКлиенте
// Указывает на необходимость закрытия текущей формы из-за завершения операции, 
// инициировавшей ее открытие или отмену действия пользователем
Перем ЗакрытьФормуПринудительно Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ЗаголовокОперации) Тогда
		Элементы.НадписьОжидание.Заголовок = Параметры.ЗаголовокОперации + "...";
	Иначе	
		Элементы.НадписьОжидание.Заголовок = Элементы.НадписьОжидание.Заголовок + ?(ЗначениеЗаполнено(Параметры.ИмяФайла), 
																	" " + Параметры.ИмяФайла, "") + "...";
	КонецЕсли;
	
	Таймаут = 0;
	
	Параметры.Свойство("Таймаут", Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВремяОткрытияФормы = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Элементы.НадписьОжиданиеДействия.Видимость = Параметры.Кнопка ИЛИ Параметры.Экран;
	
	Если Параметры.Кнопка Тогда
		НадписьОжиданияДействия = "Нажмите кнопку на устройстве";	
	ИначеЕсли Параметры.Экран Тогда
		НадписьОжиданияДействия = "Подтвердите действие на экране устройства";	
	Иначе
		НадписьОжиданияДействия = "";
	КонецЕсли;
	
	Элементы.НадписьОжиданиеДействия.Заголовок = НадписьОжиданияДействия;	
	
	ПодключитьОбработчикОжидания("ОбработчикОжидания", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрытьФормуПринудительно = Неопределено Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОжидания()
	
	Если Таймаут > 0 Тогда
		Если (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяОткрытияФормы) / 1000 >= Таймаут Тогда
			ЗавершеноПоТаймауту = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ЭтотОбъект.ОписаниеОповещенияОЗакрытии, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти