
#Область ПрограммныйИнтерфейс

// Проверяет необходимость перехода на формат УКД 2020.
// В случае необходимости выводит предложение о переводе организаций и контрагентов на новый формат.
//
// Параметры:
//  БлокируемаяФорма - УправляемаяФорма - Форма, поверх которой будет выведено предложение о переводе на новый формат.
//
Процедура ПредложитьОбновитьФорматУКД(БлокируемаяФорма) Экспорт
	
	ТекДата = ККСНГ_ОбщегоНазначенияВызовСервера.ТекущаяДатаВремяСеанса();
	Если ТекДата < Дата('2021.09.01 00:00:00') Или ТекДата >= Дата('2021.10.01 00:00:00') Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоиска = ККСНГ_ЭлектронныеДокументыВызовСервера.ОрганизацииКонтрагентыСФорматомДокументов("УКД_501, УКД_502");
	Если Не РезультатПоиска.НайденыОбъекты Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресОбновляемыхОбъектов", РезультатПоиска.АдресИскомыхОбъектов);
	ПараметрыФормы.Вставить("ЗаменяемыеФорматы", "УКД (ФНС 5.01), УКД (ФНС 5.02)");
	ПараметрыФормы.Вставить("НовыйФормат", "УКД (ФНС 2020)");
	ТекстПредложения = "С 1.10.2021 изменится формат выгрузки УКД по Приказу ЕД-7-26/736@. 
						|Изменить настройки документооборота автоматически для следующих организаций и контрагентов ЭДО?";
	ПараметрыФормы.Вставить("ТекстПредложения", ТекстПредложения);
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ОбновлениеФорматаДокументов",
			ПараметрыФормы, БлокируемаяФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет таблицу подписи формы ЭД
//
// Параметры:
//  ТаблицаПодписи				 - ДанныеФормыКоллекция 	 - Поля таблицы: "ДатаПодписи", "КомуВыданСертификат", "Сертификат"
//  МассивЭП                     - Массив структур:
//		* КомуВыданСертификат    - Строка
//  	* ДатаПодписи            - Дата
//  	* Сертификат             - СправочникСсылка.ККСНГ_СертификатыКлючейЭлектроннойПодписи
//  	* Отпечаток              - Строка
//  	* СрокДействия           - Строка
//  	* ИздательСертификата    - Строка
//  	* ПрочитанСертификат     - Булево
//  	* Подпись                - Неопределено
//
Процедура ЗаполнитьТаблицуПодписиНаФорме(ТаблицаПодписи, МассивЭП) Экспорт
	
	ТаблицаПодписи.Очистить();
	
	Для каждого СтруктураЭП Из МассивЭП Цикл
		НоваяСтрока = ТаблицаПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЭП);
	КонецЦикла;
	
КонецПроцедуры

// Получает данные ЭП подписей для электронного документа
//
// Параметры:
//	Оповещение                - вызывается после получения и обработки данных ЭД
//	ОбъектЭДО                 - ККСНГ_ЭлектронныеДокументы.Ссылка
//  ТипТранспортногоДокумента - тип (см. ОбъектЭДО.Type)
//
//  Заполняет параметр Подписи из обьекта ЭД и вызывает оповещение для проверки и заполнения
//  отсутствующих полей по данным ЭП - массив структур формата:
//
//		* КомуВыданСертификат    - Строка
//   	* ДатаПодписи            - Дата
//   	* Сертификат             - СправочникСсылка.ККСНГ_СертификатыКлючейЭлектроннойПодписи
//   	* Отпечаток              - Строка
//   	* СрокДействия           - Строка
//   	* ИздательСертификата    - Строка
//   	* ПрочитанСертификат     - Булево
//   	* Подпись
//
Процедура ПолучитьМассивЭПОбъектаЭДОНаКлиенте(Оповещение, ОбъектЭДО, ТипТранспортногоДокумента) Экспорт
	
	МассивЭП = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьМассивЭПОбъектаЭДО(ОбъектЭДО, ТипТранспортногоДокумента);
	ПараметрыОбработки = Новый Структура("Оповещение, Подписи", Оповещение, МассивЭП);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьМенеджерКриптографииЗавершение", 
																ЭтотОбъект, ПараметрыОбработки);
	
	ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(ОписаниеОповещения, "ПолучениеСертификатов", Ложь);
	
КонецПроцедуры

// Заполняет данные ЭП подписей для электронного документа
//
// Параметры:
//	МенеджерКриптографии               - Менеджер криптографии
//	ПараметрыОбработки                 - Содержит массив структур Подписи
//
//  Если пусто заполняет в параметре Подписи значения - структура формата:
//
//		* КомуВыданСертификат    - Строка
//  	* Отпечаток              - Строка
//  	* СрокДействия           - Строка
//  	* ИздательСертификата    - Строка
//  	* ПрочитанСертификат     - Булево
//
Процедура СоздатьМенеджерКриптографииЗавершение(МенеджерКриптографии, ПараметрыОбработки) Экспорт
	
	МассивЭП = ПараметрыОбработки.Подписи;
	
	Если ТипЗнч(МенеджерКриптографии) = Тип("МенеджерКриптографии") Тогда
		
		Для каждого ДанныеЭП Из МассивЭП Цикл
			ОбработатьДанныеЭП(ДанныеЭП, МенеджерКриптографии);
		КонецЦикла;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыОбработки.Оповещение, МассивЭП);
	
КонецПроцедуры

#Область ПользовательскийИнтерфейс

// Строковое представление ЭД
//
// Параметры:
//	DocumentTypeCode  - Строка
//	TypeName          - Строка
//	Number            - Строка
//	Date              - Дата
//
// Возвращаемое значение:
//	Строка
//
Функция СформироватьЗаголовокЭлектронногоДокумента(DocumentTypeCode, TypeName, Number, Date) Экспорт

	ТипыДокументов = Новый Соответствие;
	ТипыДокументов.Вставить("UPD_DOP",		"УПД.ДОП");
	ТипыДокументов.Вставить("UPD_SF",		"УПД.СЧФ");
	ТипыДокументов.Вставить("UPD_SF_DOP",	"УПД.СЧФДОП");
	ТипыДокументов.Вставить("UCD_CSF",		"УКД.КСЧФ");
	ТипыДокументов.Вставить("UCD_DIC",		"УКД.ДИС");
	ТипыДокументов.Вставить("UCD_CSF_DIC",	"УКД.КСЧФДИС");
	
	СокращениеТипаДокумента = ТипыДокументов.Получить(DocumentTypeCode);
	Если СокращениеТипаДокумента = Неопределено Тогда
		СокращениеТипаДокумента = TypeName;
	КонецЕсли;
	
	Возврат СокращениеТипаДокумента + " № " + Number + " от " + Формат(Date, "ДФ=дд.ММ.гггг");

КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьДанныеЭП(ДанныеЭП, МенеджерКриптографии)
	
	Если ДанныеЭП.ПрочитанСертификат Тогда
		Возврат;
	КонецЕсли; 

	Попытка
		Сертификаты = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ДанныеЭП.Подпись);
	Исключение
		Возврат;
	КонецПопытки;

	Если Сертификаты.Количество() > 0 Тогда
		
		Сертификат = Сертификаты[0];
		
		Если Не ЗначениеЗаполнено(ДанныеЭП.КомуВыданСертификат) Тогда
			ПредставлениеСубъекта = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеСубъекта(Сертификат);
			ДанныеЭП.Вставить("КомуВыданСертификат", ПредставлениеСубъекта);
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ДанныеЭП.Отпечаток) Тогда
			ДанныеЭП.Вставить("Отпечаток", СтрЗаменить(Строка(Сертификат.Отпечаток), " ", ""));			
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ДанныеЭП.СрокДействия) Тогда
			СрокДействияСертификатаСтрокой = ККСНГ_ЭлектроннаяПодписьКлиентСервер.СрокДействияСертификатаСтрокой(Сертификат.ДатаНачала, Сертификат.ДатаОкончания);
			ДанныеЭП.Вставить("СрокДействия", СрокДействияСертификатаСтрокой);
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ДанныеЭП.ИздательСертификата) Тогда
			ПредставлениеИздателя = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПредставлениеИздателя(Сертификат);
			ДанныеЭП.Вставить("ИздательСертификата", ПредставлениеИздателя);
		КонецЕсли;				
		
		ДанныеЭП.Вставить("ПрочитанСертификат", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти