
#Область ПрограммныйИнтерфейс

#Область ПреобразованиеДанных

// Возвращает объект XDTO, заполненный по XML с помощью указанной или глобальной фабрики XDTO
//
// Параметры:
//  ТекстXML - Строка	- исходный текст XML
//  ТипXDTO	 - ТипЗначенияXDTO, ТипОбъектаXDTO - тип элемента данных XDTO
//
// Возвращаемое значение:
//  ОбъектXDTO - элемент данных XDTO указанного типа
//
Функция ПолучитьОбъектXDTOПоXML(ТекстXML, ТипXDTO = Неопределено, ФабрикаXDTOДляЧтения = Неопределено) Экспорт
	
	Перем ЧтениеXML, ОбъектXDTO, ТекстОписанияОшибки;
	
	ОбъектXDTO = Неопределено;
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		
		Если ФабрикаXDTOДляЧтения <> Неопределено Тогда
			ОбъектXDTO = ФабрикаXDTOДляЧтения.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		Иначе
			ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		КонецЕсли;
		
		ЧтениеXML.Закрыть();
		
	Исключение
		
		ТекстОписанияОшибки = ОписаниеОшибки();
		ВызватьИсключение ТекстОписанияОшибки + Символы.ПС  + ТекстXML;
		
	КонецПопытки;
	
	Возврат ОбъектXDTO;
	
КонецФункции

// Формирует структуру по объекту XDTO
//
// Параметры:
//	 ОбъектXDTO                - ОбъектXDTO
//
// Возвращаемое значение:
//	Структура -  произвольный
//
Функция ПолучитьСтруктуруПоОбъектуXDTO(ОбъектXDTO) Экспорт
	
	Результат =  Новый Структура;
	
	Если ТипЗнч(ОбъектXDTO) = Тип("ЗначениеXDTO") Тогда
		Возврат ОбъектXDTO.Значение;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекцииСвойств Из ОбъектXDTO.Свойства() Цикл
		
		ЭлементДанных = ОбъектXDTO[ЭлементКоллекцииСвойств.Имя];
		Если (ТипЗнч(ЭлементДанных) = Тип("СписокXDTO")) Тогда
			
			Список = Новый Массив;
			
			Для Каждого ЭлементСписка Из ЭлементДанных Цикл
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					НовыйЭлементМассива = ПолучитьСтруктуруПоОбъектуXDTO(ЭлементСписка);
				Иначе
					НовыйЭлементМассива = ЭлементСписка;
				КонецЕсли;
				
				Список.Добавить(НовыйЭлементМассива);
			КонецЦикла;
			
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, Список);
			
		ИначеЕсли (ТипЗнч(ЭлементДанных) = Тип("ОбъектXDTO")) Тогда
			
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, ПолучитьСтруктуруПоОбъектуXDTO(ЭлементДанных));
			
		Иначе
			
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, ЭлементДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьПространствоИменИПолучитьXML(ДокументDOM, ПространствоИмен) Экспорт
	
	Перем ЗаписьXML, ЗаписьDOM;
	
	Если ПустаяСтрока(ДокументDOM.ЭлементДокумента.URIПространстваИмен) Тогда
		ДокументDOM.ЭлементДокумента.УстановитьСоответствиеПространстваИмен("", ПространствоИмен);
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция ПолучитьТипXDTOКорневогоСвойства(ФабрикаXDTO, ПространствоИмен, ИмяЭлемента) Экспорт
	
	Перем Результат, Пакет, Свойство;
	
	Пакет = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен);
	Свойство = Пакет.КорневыеСвойства.Получить(ИмяЭлемента);
	
	Если Свойство <> Неопределено Тогда
		Результат = Свойство.Тип;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьФабрикуXDTOПоОбщемуМакету(ИмяОбщегоМакета) Экспорт
	
	Если ПустаяСтрока(ИмяОбщегоМакета) Тогда
		ВызватьИсключение "Не указано имя общего макета для получения текста XSD";
	КонецЕсли;
	
	ТекстСхемыXSD = ПолучитьОбщийМакет(ИмяОбщегоМакета).ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСхемыXSD);
	
	Построитель = Новый ПостроительDOM;
	Документ = Построитель.Прочитать(ЧтениеXML);
	
	ПостроительСхемы = Новый ПостроительСхемXML;
	Схема = ПостроительСхемы.СоздатьСхемуXML(Документ.ЭлементДокумента);
	
	НаборСхем = Новый НаборСхемXML;
	НаборСхем.Добавить(Схема);
	
	НоваяФабрикаXDTO = Новый ФабрикаXDTO(НаборСхем);
	
	Возврат НоваяФабрикаXDTO;
	
КонецФункции

Функция ПолучитьДокументDOMПоXML(ДвоичныеДанные) Экспорт
	
	Перем ЧтениеXML, ПостроительDOM, ДокументDOM;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(ДвоичныеДанные.ОткрытьПотокДляЧтения());
	
	ПостроительDOM = Новый ПостроительDOM();
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Возврат ДокументDOM;
	
КонецФункции

// Преобразует (сериализует) любое значение в JSON-строку.
//  Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
//  См. также ЗначениеИзСтрокиJSON.
//
// Параметры:
//  ЗаписываемыеДанные - Произвольный - значение, которое необходимо сериализовать в JSON-строку.
// 
// Возвращаемое значение:
//  Строка - JSON-строка.
//
Функция СтрокаJSON(ЗаписываемыеДанные) Экспорт
	
	Перем ЗаписьJSON;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ЗаписываемыеДанные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Преобразует строку JSON в структуру
//
// Параметры:
//  СтрокаJSON	 - Строка - строка в формате JSON 
// 
// Возвращаемое значение:
//  Структура - Результат преоборазования
//
Функция ДанныеИзJSON(СтрокаJSON) Экспорт
	
	Перем ЧтениеJSON, ПолученныеДанные;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		ПолученныеДанные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		
	КонецПопытки;
	
	Возврат ПолученныеДанные;
	
КонецФункции

#КонецОбласти

// Формирует СхемаКомпоновкиДанных с переданным текстом запроса
//
// Параметры:
//	ТекстЗапроса - Строка - Текст запроса для набора данных создаваемой СКД 
//
// Возвращаемое значение:
//	см. СхемаКомпоновкиДанных() 
//
Функция ПолучитьСхемуКомпоновкиДанныхИзЗапроса(ТекстЗапроса) Экспорт
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных();

	Источник = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	Источник.Имя = "ИсточникДанных1";
	Источник.СтрокаСоединения = "";
	Источник.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
			
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

// Заполняет настройки схемы компоновки данных по умолчанию
//
// Параметры:
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных	 - Компоновщик
//  Параметры			 - Соответствие							 - Значения параметров
//
Процедура ЗаполнитьНастройкиСхемыКомпоновкиДанных(КомпоновщикНастроек, ЗначенияПараметров = Неопределено) Экспорт
	
	Перем Настройки;
	Перем КлючИЗначение, Параметр, Структура, ДоступноеПоле, ВыбранноеПоле;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	// Параметры
	Если ТипЗнч(ЗначенияПараметров) = Тип("Соответствие") Тогда
		Для каждого КлючИЗначение Из ЗначенияПараметров Цикл
			Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(КлючИЗначение.Ключ));
			Если Параметр <> Неопределено Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Поля
	Структура = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Структура.Использование = Истина;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	Для каждого ДоступноеПоле Из Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если Не ДоступноеПоле.Папка Тогда
			ВыбранноеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ДоступноеПоле.Поле;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заменяет выбираемые поля в запросе схемы запроса
//
// Параметры:
//  ЗапросСхемыЗапроса			 - ЗапросВыбораСхемыЗапроса.
//  ПсевдонимКолонки			 - Строка - Имя колонки, выражение которой необходимо поменять.
//  ТекстВыраженияСхемыЗапроса	 - Строка - Новый текст выражения схемы запроса.
//
Процедура ЗаменитьВыбираемыеПоляЗапроса(ЗапросСхемыЗапроса, ПсевдонимКолонки, ТекстВыраженияСхемыЗапроса) Экспорт
	
	Перем ВыбираемыеПоля, ИндексКолонки, Колонки, Колонка, Оператор;
	
	УстановитьПривилегированныйРежим(Истина);
	Колонки = ЗапросСхемыЗапроса.Колонки;
	Колонка = Колонки.Найти(ПсевдонимКолонки);
	
	Если Колонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Оператор Из ЗапросСхемыЗапроса.Операторы Цикл
		
		ВыбираемыеПоля = Оператор.ВыбираемыеПоля;
		ИндексКолонки = Колонки.Индекс(Колонка);
		Если ИндексКолонки >= 0 Тогда
			ВыбираемыеПоля[ИндексКолонки] = Новый ВыражениеСхемыЗапроса(ТекстВыраженияСхемыЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Создает массив и копирует в него значения, содержащиеся в колонке объекта, для
// которого доступен обход посредством оператора Для каждого … Из.
//
// Параметры:
//  КоллекцияСтрок           - ТаблицаЗначений
//                           - ДеревоЗначений
//                           - СписокЗначений
//                           - ТабличнаяЧасть
//                           - Соответствие
//                           - Структура - коллекция, колонку которой нужно выгрузить в массив.
//                                         А так же другие объекты, для которых доступен обход
//                                         посредством оператора Для каждого … Из … Цикл.
//  ИмяКолонки               - Строка - имя поля коллекции, значения которого нужно выгрузить.
//  ТолькоУникальныеЗначения - Булево - если Истина, то в массив будут включены
//                                      только различающиеся значения.
//
// Возвращаемое значение:
//  Массив - значения колонки.
//
Функция ВыгрузитьКолонку(КоллекцияСтрок, ИмяКолонки, ТолькоУникальныеЗначения = Ложь) Экспорт

	МассивЗначений = Новый Массив;
	
	УникальныеЗначения = Новый Соответствие;
	
	Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		Значение = СтрокаКоллекции[ИмяКолонки];
		Если ТолькоУникальныеЗначения И УникальныеЗначения[Значение] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивЗначений.Добавить(Значение);
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла; 
	
	Возврат МассивЗначений;
	
КонецФункции

// Позволяет определить, есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъекта) Экспорт

	Возврат НЕ (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

КонецФункции

// Получает массив объектов метаданных, на которые есть право на чтение.
//
// Параметры:
//  ОписаниеТипов	 - ОписаниеТипов.
//  ИмяРеквизита	 - Строка - Если передан, то отбираются только объекты, имеющие этот реквизит.
// 
// Возвращаемое значение:
//  Массив- массив объектов метаданных.
//
Функция ПолучитьМассивДоступныхОбъектовМетаданныхПоОписаниюТипов(ОписаниеТипов, ИмяРеквизита = "") Экспорт
	
	Перем МассивДоступныхОбъектовМетаданных, НайденныйОбъектМетаданных, Тип;
	
	МассивДоступныхОбъектовМетаданных = Новый Массив;

	Для Каждого Тип Из ОписаниеТипов.Типы() Цикл
		
		НайденныйОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		
		Если НайденныйОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если ПравоДоступа("Чтение", НайденныйОбъектМетаданных) Тогда
			Если ПустаяСтрока(ИмяРеквизита) Или НайденныйОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
				МассивДоступныхОбъектовМетаданных.Добавить(НайденныйОбъектМетаданных);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДоступныхОбъектовМетаданных;

КонецФункции

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы по ссылке на объект.
//  Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
//  для быстрого чтения отдельных реквизитов объекта из базы данных.
//  
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка									 - ЛюбаяСсылка, Строка	 - - ЛюбаяСсылка, Строка - - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//  	- Строка - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты								 - Строка, ФиксированнаяСтруктура	 - - Строка, ФиксированнаяСтруктура - - Строка - имена реквизитов, перечисленные через запятую, в формате
//  	требований к свойствам структуры.
//  	Например, "Код, Наименование, Родитель".
//  	- Структура
//  	- ФиксированнаяСтруктура - в качестве ключа передается
//  	псевдоним поля для возвращаемой структуры с результатом, а в качестве
//  	значения (опционально) фактическое имя поля в таблице.
//  	Если ключ задан, а значение не определено, то имя поля берется из ключа.
//  	Допускается указание имени поля через точку, но при этом параметр КодЯзыка для такого поля
//  	учитываться не будет.
//  	- Массив из Строка
//  	- ФиксированныйМассив из Строка - имена реквизитов в формате требований к свойствам структуры.
//  	ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//  	если есть ограничение на уровне записей, то все реквизиты вернутся со
//  	значением Неопределено; если нет прав для работы с таблицей, то возникнет исключение;
//  	если Ложь, то возникнет исключение при отсутствии прав на таблицу
//  ВыдаватьОшибкуОтсутствующегоРеквизита	 - Булево - признак, который выдает ошибку, если не найдено имя переданного реквизита
// 
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//  Если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//  Если в параметр Ссылка передана пустая ссылка, то возвращается структура,
//  соответствующая именам реквизитов со значениями Неопределено.
//  Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка),
//  то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыдаватьОшибкуОтсутствующихРеквизитов = Истина) Экспорт
	
	Перем ОписаниеТипов, МетаданныеОбъекта, СтандартныеРеквизитыОбъекта;
	Перем Результат, РеквизитыКПолучению, ОтсутствующиеРеквизиты;
	Перем ПсевдонимПоля, ИмяПоля, ТекстЗапроса, СтруктураПолей, ОписаниеОшибки, Запрос, Выборка;
	
	ОписаниеТипов = ОписаниеТиповСправочникСсылкаДокументСсылка();
	Если Не ЗначениеЗаполнено(Ссылка) Или ОписаниеТипов.СодержитТип(ТипЗнч(Ссылка)) = Ложь Тогда
		ВызватьИсключение "Неверный параметр 'Ссылка', значение должно быть ссылкой";
	КонецЕсли;
	
	// Разбор реквизитов, если второй параметр Строка.
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		Реквизиты = СтрЗаменить(Реквизиты, " ", "");
		Реквизиты = СтрРазделить(Реквизиты, ",");
		
	КонецЕсли;
	
	Если ТипЗнч(Реквизиты) <> Тип("Массив") Тогда
		ВызватьИсключение "Некорректный тип параметра 'Реквизиты', ожидается массив";
	КонецЕсли;
	
	Если Реквизиты.Количество() = 0 Тогда
		ВызватьИсключение "Неверный параметр 'Реквизиты', значение не должно быть пустым";
	КонецЕсли;
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	
	// Стандартные реквизиты
	СтандартныеРеквизиты = Новый Массив;
	СтандартныеРеквизитыОбъекта = Ссылка.Метаданные().СтандартныеРеквизиты;
	Для каждого СтандартныйРеквизит Из СтандартныеРеквизитыОбъекта Цикл
		СтандартныеРеквизиты.Добавить(СтандартныйРеквизит.Имя);
	КонецЦикла;
	
	Результат = Новый Структура;
	РеквизитыКПолучению = Новый Массив;
	ОтсутствующиеРеквизиты = Новый Массив;
	
	// Поиск реквизитов в метаданных объекта
	Для каждого ИмяРеквизита Из Реквизиты Цикл
		
		Результат.Вставить(ИмяРеквизита);
		
		Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Или СтандартныеРеквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			РеквизитыКПолучению.Добавить(ИмяРеквизита);
		Иначе
			ОтсутствующиеРеквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтсутствующиеРеквизиты.Количество() > 0 И ВыдаватьОшибкуОтсутствующихРеквизитов Тогда
		ВызватьИсключение СтрШаблон("У объекта '%1' не найдены реквизиты: '%2'", МетаданныеОбъекта.ПолноеИмя(), СтрСоединить(ОтсутствующиеРеквизиты, ", "));
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	Для каждого ИмяРеквизита Из РеквизитыКПолучению Цикл
		
		Попытка
			ПсевдонимПоля = СтрЗаменить(ИмяРеквизита, ".", "");
			СтруктураПолей.Вставить(ПсевдонимПоля, ИмяРеквизита);
		Исключение 
			ВызватьИсключение СтрШаблон("Некорректное имя реквизита '%1'", ИмяРеквизита);
		КонецПопытки;
		
	КонецЦикла;
	
	// Формирование текста запроса к выбираемым полям.
	ТекстЗапросаПолей = "";
	Для каждого КлючИЗначение Из СтруктураПолей Цикл
		
		ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), КлючИЗначение.Значение, КлючИЗначение.Ключ);
		ПсевдонимПоля = КлючИЗначение.Ключ;
		
		ТекстЗапросаПолей = ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + ПсевдонимПоля;
		
		Результат.Вставить(ПсевдонимПоля);
		
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстЗапросаПолей) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|&ТекстЗапросаПолей
	|ИЗ
	|	&ПолноеИмяОбъектаМетаданных КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", МетаданныеОбъекта.ПолноеИмя());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ВызватьИсключение СтрШаблон("Ошибка получения значений реквизитов: %1", ОписаниеОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы по ссылке на объект.
//  Рекомендуется использовать вместо обращения к реквизитам объекта через точку от ссылки на объект
//  для быстрого чтения отдельных реквизитов объекта из базы данных.
//  
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка									 - ЛюбаяСсылка, Строка	 - - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//  	- Строка - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита							 - Строка				 - имя получаемого реквизита.
//  				Допускается указание имени реквизита через точку, но при этом параметр КодЯзыка для
//  				такого реквизита учитываться не будет.
//  				ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя;
//  				если есть ограничение на уровне записей, то возвращается Неопределено;
//  				если нет прав для работы с таблицей, то возникнет исключение;
//  				если Ложь, то возникнет исключение при отсутствии прав на таблицу
//  				или любой из реквизитов.
//  ВыдаватьОшибкуОтсутствующегоРеквизита	 - Булево - признак, который выдает ошибку, если не найдено имя переданного реквизита
// 
// Возвращаемое значение:
//  Произвольный - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//  Если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка),
//  то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыдаватьОшибкуОтсутствующегоРеквизита = Истина) Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ВызватьИсключение "Не указан параметр 'ИмяРеквизита'";
	КонецЕсли;
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита, ВыдаватьОшибкуОтсутствующегоРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции

// Возвращает представление реквизитов организации строкой
//
// Параметры:
//  ИНН	 - Строка - ИНН организации
//  КПП	 - Строка - КПП организации
//  ОГРН - Строка - ОРГН организации
// 
// Возвращаемое значение:
// Строка - реквизиты организации
//
Функция ПредставлениеРеквизитовОрганизации(ИНН = "", КПП = "", ОГРН = "") Экспорт
	
	Перем Массив, ТекстИнформации;
	
	Массив = Новый Массив;
	Если Не ПустаяСтрока(ИНН) Тогда
		Массив.Добавить("ИНН:" + Символы.НПП + ИНН);
	КонецЕсли;
	Если Не ПустаяСтрока(КПП) Тогда
		Массив.Добавить("КПП:" + Символы.НПП + КПП);
	КонецЕсли;
	Если Не ПустаяСтрока(ОГРН) Тогда
		Массив.Добавить("ОГРН:" + Символы.НПП + ОГРН);
	КонецЕсли;
	ТекстИнформации = СтрСоединить(Массив, ", ");
	
	Возврат ТекстИнформации;
	
КонецФункции

// Возвращает предопределенное значение.
Функция ПолучитьПредопределенное(ПолноеИмяЗначения, ЗначениеПоУмолчанию = null) Экспорт

	Перем ЧастиИмени, ТипМетаданных, ИмяМетаданных, ЗначениеПредопределенного;
	Перем ОбъектМетаданных, МенедежерыМетаданных, МенеджерМетаданных, МенеджерОбъекта;

	Если ТипЗнч(ПолноеИмяЗначения) <> Тип("Строка") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	ЧастиИмени = СтрРазделить(ПолноеИмяЗначения, ".");
	Если ЧастиИмени.Количество() <> 3 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	ТипМетаданных = ЧастиИмени[0];
	ИмяМетаданных = ЧастиИмени[1];
	ЗначениеПредопределенного = ЧастиИмени[2];

	// Проверка существования объекта
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТипМетаданных + "." + ИмяМетаданных);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	// Получение менеджера объекта
	МенедежерыМетаданных = СоответствиеМенеджеровОбъектов();
	МенеджерМетаданных = МенедежерыМетаданных.Получить(ТипМетаданных);
	Если МенеджерМетаданных = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	МенеджерОбъекта = МенеджерМетаданных[ИмяМетаданных];

	// Получение предопределенного значения объекта
	Если Врег(ЗначениеПредопределенного) = "ПУСТАЯССЫЛКА" Тогда
		Возврат МенеджерОбъекта.ПустаяСсылка();
	ИначеЕсли ККСНГ_ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МенеджерОбъекта, ЗначениеПредопределенного) Тогда
		Возврат МенеджерОбъекта[ЗначениеПредопределенного];
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;

КонецФункции

Функция СоответствиеМенеджеровОбъектов()

	СоответствиеМенеджеров = Новый Соответствие;
	СоответствиеМенеджеров.Вставить("Перечисление", Перечисления);
	СоответствиеМенеджеров.Вставить("Справочник", Справочники);
	СоответствиеМенеджеров.Вставить("Документ", Документы);
	СоответствиеМенеджеров.Вставить("ПланВидовХарактеристик", ПланыВидовХарактеристик);
	СоответствиеМенеджеров.Вставить("ПланСчетов", ПланыСчетов);
	СоответствиеМенеджеров.Вставить("ПланВидовРасчета", ПланыВидовРасчета);
	СоответствиеМенеджеров.Вставить("БизнесПроцесс", БизнесПроцессы);
	СоответствиеМенеджеров.Вставить("Задача", Задачи);

	Возврат СоответствиеМенеджеров;

КонецФункции

#Область РаботаСформулами

// Вычисляет результат выполнения формулы.
// 
// Параметры:
// 	Формула - Строка - формула.
// 	ЗначенияОперандов - Соответствие - ключом является имя операнда, значением - его значение.
// 	ВерсияМеханикиРасчета - Строка - версия механики. Возможные значения: "1.0", "2.0".
// Возвращаемое значение:
// 	Строка - результата вычисления.
Функция РезультатВычисленияФормулы(Знач Формула, ЗначенияОперандов, ВерсияМеханикиРасчета = "1.0") Экспорт

	КоллекцияПриведенныхЗначенийОперандов = КоллекцияПриведенныхЗначенийОперандов(ЗначенияОперандов, ВерсияМеханикиРасчета);

	ПараметрыФормулы = Новый Структура;
	ИдентификаторПараметра = 1;
	ШаблонОперанда = ККСНГ_ОбщегоНазначенияКлиентСервер.ШаблонОперанда(Формула);
	
	Для Каждого ЗначениеОперанда Из КоллекцияПриведенныхЗначенийОперандов Цикл
		
		ИмяПараметра = "Параметр" + ИдентификаторПараметра;
		ПараметрыФормулы.Вставить(ИмяПараметра, ЗначениеОперанда.Значение);

		Формула = СтрЗаменить(Формула, СтрШаблон(ШаблонОперанда, ЗначениеОперанда.Ключ), "Параметры." + ИмяПараметра);
		
		ИдентификаторПараметра = ИдентификаторПараметра + 1;
		
	КонецЦикла;
	
	Возврат Строка(ОбщегоНазначения.ВычислитьВБезопасномРежиме(Формула, ПараметрыФормулы));

КонецФункции

// Проверяет корректность указанной формулы.
// 
// Параметры:
// 	Формула - Строка - формула.
// 	ДоступныеПоля - ДоступныеПоляКомпоновкиДанных - доступные поля отбора.
// 	ТекстОшибки - Строка - в этот параметр будет возвращен текст ошибки в случае ее возникновения. Выходной параметр.
// Возвращаемое значение:
// 	Булево - Истина, если формула корректна.
Функция ПроверитьФормулу(Формула, ДоступныеПоля, ТекстОшибки = "") Экспорт
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Формула) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстРасчета = """Строка"" + " + Формула;
	ЗначениеЗамены = """1""";
	
	Операнды = МассивОперандовФормулы(Формула);
	
	ЕстьНедоступныеПоля = Ложь;
	ШаблонОперанда = ККСНГ_ОбщегоНазначенияКлиентСервер.ШаблонОперанда(Формула);
	Для Каждого Операнд Из Операнды Цикл
		ТекстОперанда = СтрШаблон(ШаблонОперанда, Операнд);
		ТекстРасчета = СтрЗаменить(ТекстРасчета, ТекстОперанда, ЗначениеЗамены);
		
		Если ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(Операнд)) = Неопределено Тогда
			ЕстьНедоступныеПоля = Истина;
			Формула = СтрЗаменить(Формула, ТекстОперанда,
				СтрШаблон(НСтр("ru = '!""Поле не найдено: %1""'"), Операнд));
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНедоступныеПоля Тогда
		Результат = Ложь;
		ТекстОшибки = НСтр("ru='Операндами должны быть реквизиты источника доступные для выбора.'");
	КонецЕсли;
	
	Попытка
		ОбщегоНазначения.ВычислитьВБезопасномРежиме(ТекстРасчета);
	Исключение
		Результат = Ложь;
		ТекстОшибки = НСтр("ru='Проверьте формулу. Формулы должны составляться по правилам написания выражений на встроенном языке 1С:Предприятия.'");
	КонецПопытки;
	
	ОткрывающийсяРазделитель = ККСНГ_ОбщегоНазначенияКлиентСервер.ОткрывающийсяРазделитель(Формула);
	ЗакрывающийсяРазделитель = ККСНГ_ОбщегоНазначенияКлиентСервер.ЗакрывающийсяРазделитель(Формула);
	ТекстПроверки = СтрЗаменить(Формула, Символы.ПС, "");
	ТекстПроверки = СтрЗаменить(ТекстПроверки, " ", "");
	ОтсутствиеРазделителей = СтрНайти(ТекстПроверки, ЗакрывающийсяРазделитель + ОткрывающийсяРазделитель)
		+ СтрНайти(ТекстПроверки, """" + ОткрывающийсяРазделитель)
		+ СтрНайти(ТекстПроверки, """" + ЗакрывающийсяРазделитель);
	Если ОтсутствиеРазделителей > 0 Тогда
		Результат = Ложь;
		ТекстОшибки = НСтр("ru='Между операндами должен присутствовать оператор или разделитель'");
	КонецЕсли;
	
	Если Не Результат Тогда
		ТекстОшибки = НСтр("ru='В формуле обнаружены ошибки.'") + " " + ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Получает из формулы набор операндов
// 
// Параметры:
// 	Формула - Строка - формула
// Возвращаемое значение:
// 	Массив Из Строка - набор операндов формулы.
Функция МассивОперандовФормулы(Знач Формула) Экспорт
	
	Операнды = Новый Массив;
	
	// Формула может содержать операнды с произвольным количеством вложенных квадратных скобок.
	
	// Сначала находим все скобки и запоминаем их позиции.
	ТаблицаСкобок = Новый ТаблицаЗначений;
	ТаблицаСкобок.Колонки.Добавить("Скобка",  Новый ОписаниеТипов("Строка"));
	ТаблицаСкобок.Колонки.Добавить("Позиция", Новый ОписаниеТипов("Число"));
	
	ОткрывающийсяРазделитель = ККСНГ_ОбщегоНазначенияКлиентСервер.ОткрывающийсяРазделитель(Формула);
	ЗакрывающийсяРазделитель = ККСНГ_ОбщегоНазначенияКлиентСервер.ЗакрывающийсяРазделитель(Формула);
	
	ПозицииОткрывающейСкобки = ПозицииСимволаВСтроке(ОткрывающийсяРазделитель, Формула);
	Для Каждого ПозицияСкобки Из ПозицииОткрывающейСкобки Цикл
		НоваяСтрока = ТаблицаСкобок.Добавить();
		НоваяСтрока.Скобка  = ОткрывающийсяРазделитель;
		НоваяСтрока.Позиция = ПозицияСкобки;
	КонецЦикла;
	
	ПозицииЗакрывающейСкобки = ПозицииСимволаВСтроке(ЗакрывающийсяРазделитель, Формула);
	Для Каждого ПозицияСкобки Из ПозицииЗакрывающейСкобки Цикл
		НоваяСтрока = ТаблицаСкобок.Добавить();
		НоваяСтрока.Скобка  = ЗакрывающийсяРазделитель;
		НоваяСтрока.Позиция = ПозицияСкобки;
	КонецЦикла;
	
	// В порядке следования позиций скобок обходим таблицу и запоминаем позиции, в которых количество
	// открывающих скобок становится равно количеству закрывающих. Это концы операндов.
	
	ТаблицаСкобок.Сортировать("Позиция");
	НачалоОперанда = 0;
	КоличествоОткрывающихСкобок = 0;
	КоличествоЗакрывающихСкобок = 0;
	
	Для Каждого СтрокаСкобки Из ТаблицаСкобок Цикл
		Если СтрокаСкобки.Скобка = ОткрывающийсяРазделитель Тогда			
			Если Не ЗначениеЗаполнено(НачалоОперанда) Тогда
				НачалоОперанда = СтрокаСкобки.Позиция;
			КонецЕсли;
			
			КоличествоОткрывающихСкобок = КоличествоОткрывающихСкобок + 1;
		Иначе
			Если Не ЗначениеЗаполнено(НачалоОперанда) Тогда
				Продолжить; // начинать нужно обязательно с открывающей скобки
			КонецЕсли;
			КоличествоЗакрывающихСкобок = КоличествоЗакрывающихСкобок + 1;
		КонецЕсли;
		
		Если КоличествоОткрывающихСкобок = КоличествоЗакрывающихСкобок Тогда
			КонецОперанда = СтрокаСкобки.Позиция;
			
			Операнд = Сред(Формула, НачалоОперанда + 1, КонецОперанда - НачалоОперанда - 1);
			Если Операнды.Найти(Операнд) = Неопределено Тогда
				Операнды.Добавить(Операнд);
			КонецЕсли;
			
			НачалоОперанда = 0;
			КоличествоОткрывающихСкобок = 0;
			КоличествоЗакрывающихСкобок = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Операнды;
	
КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// Заполняет структуру после чтения архива с МЧД и подписью
//
// Параметры:
//  Содержимое	 - Строка	 - Адрес временного хранилища
// 
// Возвращаемое значение:
//  Структура - Двоичные данные файла доверенности и файла подписи
//
Функция ЭтоZipАрхив(ДвоичныеДанные) Экспорт
	
	Перем ВариантыНачалаZIP, НачалоФайла;
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		
		// Варианты начала файла zip-архива
		ВариантыНачалаZIP = Новый Массив;
		ВариантыНачалаZIP.Добавить("UEsDB"); // "PK\x03\x04
		ВариантыНачалаZIP.Добавить("UEsFB"); // "PK\x05\x06
		ВариантыНачалаZIP.Добавить("UEsHC"); // "PK\x07\x08
		
		Попытка
			НачалоФайла = Лев(Base64Строка(ДвоичныеДанные), 5);
		Исключение
			
		КонецПопытки;
		
		// Проверим, что первые 5 байт файла соответствуют началу zip-архива 
		Возврат ВариантыНачалаZIP.Найти(НачалоФайла) <> Неопределено;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Извлекает двоичные данные файлов из zip-архива по переданным расширениям
//
// Параметры:
//  Содержимое			 - АдресВременногоХранилища, ДвоичныеДанные	 - содержимое файла zip-архива
//  РасширенияФайлов	 - Массив									 - массив строк расширений файлов
// 
// Возвращаемое значение:
//  Структура, см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ИзвлечьФайлыИзZipАрхива(Содержимое, РасширенияФайлов) Экспорт
	
	Перем ВариантыНачалаZIP, ИмяВременногоКаталогаФайла;
	Перем МассивРасширений, НаборРасширенийСтрокой;
	Перем НайденныеФайлы, НайденныйФайл, НачалоФайла;
	Перем ОписаниеОшибки, Ответ, ПолученноеИмяФайла;
	Перем СодержимоеФайла, СодержимоеФайлаZIP;
	Перем СписокНаборовФайлов, СписокФайлов;
	Перем ТекстОшибки, ЧтениеZip, ЭлементZipФайла;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	// Получим двоичные данные по переданному содержимому файла zip-архива
	Если ТипЗнч(Содержимое) = Тип("Строка") И ЭтоАдресВременногоХранилища(Содержимое) Тогда
		СодержимоеФайлаZIP = ПолучитьИзВременногоХранилища(Содержимое);
	Иначе
		СодержимоеФайлаZIP = Содержимое;
	КонецЕсли;
	
	Если ТипЗнч(СодержимоеФайлаZIP) <> Тип("ДвоичныеДанные") Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Неверный тип значения параметра 'Содержимое'. Ожидаются двоичные данные.", "ZIP-00001");
		Возврат Ответ;
	КонецЕсли;
	
	Если ТипЗнч(РасширенияФайлов) <> Тип("Массив") Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Неверный тип значения параметра 'РасширенияФайлов'. Ожидается тип 'Массив'.", "ZIP-00002");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ЭтоZipАрхив(СодержимоеФайлаZIP) Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Переданный файл не является zip-архивом", "ZIP-00003");
		Возврат Ответ;
	КонецЕсли;
	
	// Прочитаем zip-архив из потока двоичных данных
	Попытка
		ЧтениеZip = Новый ЧтениеZipФайла(СодержимоеФайлаZIP.ОткрытьПотокДляЧтения());
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка чтения zip-архива из временного файла", "ZIP-00004", ОписаниеОшибки);
		
		Возврат Ответ;
		
	КонецПопытки;
	
	СписокНаборовФайлов = Новый Массив;
	Для каждого НаборРасширенийСтрокой Из РасширенияФайлов Цикл
		
		Если ТипЗнч(НаборРасширенийСтрокой) <> Тип("Строка") Или ПустаяСтрока(НаборРасширенийСтрокой) Тогда
			Продолжить;
		КонецЕсли;
		
		// Разбор набора расширений строкой в массив
		НаборРасширенийСтрокой = СтрЗаменить(НаборРасширенийСтрокой, " ", "");
		МассивРасширений = СтрРазделить(ВРег(НаборРасширенийСтрокой), ",");
		
		// Найдем нужный файл по расширению
		НайденныеФайлы = Новый Массив;
		Для каждого ЭлементZipФайла Из ЧтениеZip.Элементы Цикл
			
			Если МассивРасширений.Найти(ВРег(ЭлементZipФайла.Расширение)) <> Неопределено Тогда
				НайденныеФайлы.Добавить(ЭлементZipФайла);
			КонецЕсли;
			
		КонецЦикла;
		
		СписокФайлов = Новый Массив;
		Для каждого НайденныйФайл Из НайденныеФайлы Цикл
			
			// Получим имя нужного файла из zip-архива
			ПолученноеИмяФайла = Строка(НайденныйФайл.Имя);
			
			// Распакуем файл из архива
			Попытка
				ИмяВременногоКаталогаФайла = ПолучитьИмяВременногоФайла();
				ЧтениеZip.Извлечь(НайденныйФайл, ИмяВременногоКаталогаФайла, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			Исключение
				
				ОписаниеОшибки = ОписаниеОшибки();
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка извлечения файла из zip-архива: " + ПолученноеИмяФайла, "ZIP-00005", ОписаниеОшибки);
				
				ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьФайлыБезопасно(ИмяВременногоКаталогаФайла);
				
				Возврат Ответ;
				
			КонецПопытки;
			
			// Получим двоичные данные распакованного файла
			Попытка
				СодержимоеФайла = Новый ДвоичныеДанные(ИмяВременногоКаталогаФайла + ПолучитьРазделительПути() + ПолученноеИмяФайла);
				СписокФайлов.Добавить(СодержимоеФайла);
			Исключение
				
				ОписаниеОшибки = ОписаниеОшибки();
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка получения двоичных данных файла из zip-архива: " + ПолученноеИмяФайла, "ZIP-00006", ОписаниеОшибки);
				
				ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьФайлыБезопасно(ИмяВременногоКаталогаФайла);
				
				Возврат Ответ;
				
			КонецПопытки;
			
			ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьФайлыБезопасно(ИмяВременногоКаталогаФайла);
			
		КонецЦикла;
		
		СписокНаборовФайлов.Добавить(СписокФайлов);
		
	КонецЦикла;
	
	ЧтениеZip.Закрыть();
	
	Ответ.Успех = Истина;
	Ответ.Результат = СписокНаборовФайлов;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает описание типов, содержащее типы ссылок на все справочники и документы конфигурации
// 
// Возвращаемое значение:
//  ОписаниеТипов - все типы ссылок на все справочники и документы
//
Функция ОписаниеТиповСправочникСсылкаДокументСсылка() Экспорт
	
	// TODO: Дополнить объектами расширений и сделать повт.исп
	ОписаниеТипов = Новый ОписаниеТипов(Справочники.ТипВсеСсылки(), Документы.ТипВсеСсылки().Типы());
	Возврат Новый ОписаниеТипов(ОписаниеТипов, "СправочникСсылка.ККСНГ_МашиночитаемыеДоверенности");
	
КонецФункции

#Область РаботаСформулами

Функция КоллекцияПриведенныхЗначенийОперандов(ЗначенияОперандов, ВерсияМеханикиРасчета) Экспорт
	
	КоллекцияПриведенныхЗначенийОперандов = Новый Соответствие;	
	
	Для Каждого ЗначениеОперанда Из ЗначенияОперандов Цикл
	
		Значение = ЗначениеОперанда.Значение;
		
		ТипЗначения = ТипЗнч(Значение);
		Если ТипЗначения = Тип("Число") Тогда
			ПриведенноеЗначение = Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=");
		ИначеЕсли ТипЗначения = Тип("Дата") Тогда
			ПриведенноеЗначение = СтрШаблон("'%1'", Формат(Значение, "ДФ=ггггММддччммсс; ДП=00010101"));
		ИначеЕсли ТипЗначения = Тип("Булево") Или ТипЗначения = Тип("Строка") Или ВерсияМеханикиРасчета = "2.0" Тогда
			ПриведенноеЗначение = Значение;
		Иначе			
			ПриведенноеЗначение = СтрЗаменить(Значение, """", """""");			
		КонецЕсли;
		
		КоллекцияПриведенныхЗначенийОперандов.Вставить(ЗначениеОперанда.Ключ, ПриведенноеЗначение);
		
	КонецЦикла;	
	
	Возврат КоллекцияПриведенныхЗначенийОперандов;

КонецФункции

Функция ПозицииСимволаВСтроке(Символ, Строка) Экспорт

	Результат = Новый Массив;
	
	ПозицияВСтроке = 1;
	ДлинаСтроки    = СтрДлина(Строка);
	Пока Истина Цикл
		ПозицияВСтроке = СтрНайти(Строка, Символ,, ПозицияВСтроке);
		
		Если ЗначениеЗаполнено(ПозицияВСтроке) Тогда
			Результат.Добавить(ПозицияВСтроке);
			ПозицияВСтроке = ПозицияВСтроке + 1;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПозицияВСтроке) Или ПозицияВСтроке > ДлинаСтроки Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти