
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// См. ОбщегоНазначения.ОбщийМодуль
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//  ОбщийМодуль, МодульМенеджераОбъекта - общий модуль.
//
// Пример:
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщегоНазначения.ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщегоНазначения.ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Попытка
		Модуль = Вычислить(Имя);
	Исключение
		Модуль = Неопределено;
		ВызватьИсключение "Не найден модуль " + Имя + " подключаемого модуля приложения ""Модуль ЭДО"".";
	КонецПопытки;
	
#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтрШаблон("Общий модуль ""%1"" не найден.", Имя);
	КонецЕсли;
	
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

// Удаляет указанные файлы, см. УдалитьФайлы()
//
// Параметры:
//  Путь	 - Строка	 - Путь к удаляемым файлам
//  Маска	 - Строка	 - Маска для выбора удаляемых файлов
//
Процедура УдалитьФайлыБезопасно(Путь, Маска = "") Экспорт
	
	Попытка
		УдалитьФайлы(Путь, Маска);
	Исключение
		Возврат
	КонецПопытки;
	
КонецПроцедуры

 // Сравнивает текущую версию приложения с переданной в параметре
//
// Параметры:
//  Версия	 - Строка	 - версия, с которой нужно сравнить текущую версию приложения
// 
// Возвращаемое значение:
//  Число - см. СравнитьВерсии()
//
Функция СравнитьВерсиюПриложения(Версия) Экспорт
	
	Перем СистемнаяИнформация;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, Версия);
	
КонецФункции

// Приводит переданное значение к числу.
//
// Параметры:
//	ПриводимоеЗначение	- Произвольный - исходное значение
//
// Возвращаемое значение:
//	Произвольный - приведенное значение
//
Функция ПривестиКЧислу(ПриводимоеЗначение) Экспорт
	
	Перем ТипЧисло;
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Возврат ТипЧисло.ПривестиЗначение(ПриводимоеЗначение);
	
КонецФункции

// Структура типового ответа для функций
//
// Параметры:
//  ИмяГруппы - Строка - Группа сообщений журнала
//
// Возвращаемое значение: 
//  Структура:
//		* Результат      - Произвольный - результат выполнения
//		* Успех          - Булево
//		* КодОшибки      - Строка
//		* Журнал         - см. ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений()
//	
Функция ПолучитьСтруктуруОтвета(ИмяГруппы = "") Экспорт

	СтруктураОтвета = Новый Структура;	
	СтруктураОтвета.Вставить("Результат");
	СтруктураОтвета.Вставить("Успех", Ложь);
	СтруктураОтвета.Вставить("КодОшибки");
	СтруктураОтвета.Вставить("Журнал", ККСНГ_ЛогированиеКлиентСервер.СоздатьЖурналСообщений(ИмяГруппы));
	
	Возврат СтруктураОтвета;
	
КонецФункции

// Заполняет КодОшибки в СтруктураОтвета последней ошибкой журнала 
//
// Параметры:
//  СтруктураОтвета - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Процедура ОбновитьСтруктуруОтвета(СтруктураОтвета) Экспорт 
	ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(СтруктураОтвета.Журнал);
	Если ЗначениеЗаполнено(ПоследняяОшибка) Тогда
		СтруктураОтвета.КодОшибки = ПоследняяОшибка.КодОшибки;	
	Иначе
		СтруктураОтвета.КодОшибки = "";	
	КонецЕсли;	
	
КонецПроцедуры	

// Формирует и выводит сообщение, которое может быть связано с элементом 
// управления формы.
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных                 - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле                       - Строка - наименование реквизита формы.
//  ПутьКДанным                - Строка - путь к данным (путь к реквизиту формы).
//  Отказ                      - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимых.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
#Если НЕ ТонкийКлиент И НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	Если КлючДанных <> Неопределено
	   И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = СтрНайти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяРеквизита) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

#Область РаботаСформулами

// Возвращает открывающийся разделитель операнда формулы.
//
// Параметры:
//  Формула - Строка - формула, для которой нужно получить разделитель.
//
// Возвращаемое значение: 
//  Строка  - содержит открывающийся разделитель операнда формулы.
//
Функция ОткрывающийсяРазделитель(Формула) Экспорт

	Если СтрНайти(Формула, "{") Тогда
		Возврат "{";
	Иначе 
		Возврат "[";
	КонецЕсли;
	
КонецФункции

// Возвращает закрывающийся разделитель операнда формулы.
//
// Параметры:
//  Формула - Строка - формула, для которой нужно получить разделитель.
//
// Возвращаемое значение: 
//  Строка  - содержит закрывающийся разделитель операнда формулы.
//
Функция ЗакрывающийсяРазделитель(Формула) Экспорт

	Если СтрНайти(Формула, "}") Тогда
		Возврат "}";
	Иначе 
		Возврат "]";
	КонецЕсли;
	
КонецФункции

// Возвращает шаблон операнда формулы с разделителями.
//
// Параметры:
//  Формула - Строка - формула, для которой нужно получить шаблон операнда.
//
// Возвращаемое значение: 
//  Строка  - содержит шаблон операнда формулы с разделителями.
//
Функция ШаблонОперанда(Формула) Экспорт

	Если ОткрывающийсяРазделитель(Формула) = "{" Тогда
		Возврат "{%1}";
	Иначе 
		Возврат "[%1]";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ВерсионированиеКонфигураций

// Приводит строку с номером конфигурации к виду, пригодному для сравнения
//
// Параметры:
//  Версия	 - Строка	 - Исходная строка с номером версии конфигурации
// 
// Возвращаемое значение:
//  Строка - результат
//
Функция ВерсияКонфигурацииСтрокой(Версия) Экспорт
	
	Рез = "";
	Если НЕ ПустаяСтрока(Версия) Тогда
		// Убираем "лишнюю" версию для решений БИТ с версионированием в формате НомерКонфигурации/НомерРешения.
		ПозицияСимвола = СтрНайти(Версия, "/");
		ВременнаяСтрока = Лев(Версия, ?(ПозицияСимвола > 0, ПозицияСимвола - 1, СтрДлина(Версия)));
		
		ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
		ВременнаяСтрока = СтрЗаменить(ВременнаяСтрока,".",Символы.ПС);
		Для Инд = 1 По СтрЧислоСтрок(ВременнаяСтрока) Цикл
			Разряд = СокрЛП(СтрПолучитьСтроку(ВременнаяСтрока, Инд));
			РазрядЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Разряд);
			Если РазрядЧислом <> 0
				Или (Не ПустаяСтрока(Разряд) И ПустаяСтрока(СтрЗаменить(Разряд, "0", ""))) Тогда
					Разряд = РазрядЧислом;
			КонецЕсли;
			Рез = Рез + Формат(Разряд,"ЧЦ=10; ЧН=0000000000; ЧВН=; ЧГ=0");
		КонецЦикла;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ВерсияКонфигурацииСтрокой(СтрокаВерсии1);
	Строка2 = ВерсияКонфигурацииСтрокой(СтрокаВерсии2);
	
	Возврат СтрСравнить(Строка1, Строка2);
	
КонецФункции

// Сравнивает версии подсистем
Функция СравнитьВерсииПодсистемы(ИдентификаторПодсистемы, ВерсияСравнения) Экспорт
	
	Перем ВерсияПодсистемы;
	
	ВерсияПодсистемы = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьВерсиюПодсистемы(ИдентификаторПодсистемы);
	Возврат СравнитьВерсии(ВерсияПодсистемы, ВерсияСравнения);
	
КонецФункции

#КонецОбласти

// Возвращает структуру с ключами, аналогичными полям указанного типа XDTO
//
// Параметры:
//	ТипXDTO - строка с именем типа или тип объекта XDTO
//	ПространствоИмен - пространство имен
//
// Возвращаемое значение:
//	Структура
//
// Пример:
//	СтруктураДокумента = ПолучитьСтруктуруПоТипуXDTO("type_Document", "http://schemas.datacontract.org/2004/07/Korus.Eds.Api");
//
Функция ПолучитьСтруктуруПоТипуXDTO(ТипXDTO, ПространствоИмен = "") Экспорт
	
	Возврат СкопироватьРекурсивно(ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСтруктуруПоТипуXDTO(ТипXDTO, ПространствоИмен));
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПринятиеКУчету

// Определение признака корректировки по названию файла
//
// Параметры:
//  ИдентификаторФайла - Строка - ИдФайла , пример ON_KORSCHFDOPPR***
//
// Возвращаемое значение:
// Булево
//
Функция ЭтоКорректировка(ИдентификаторФайла) Экспорт
	
	ЭтоКорректировка189 = (Врег(Лев(ИдентификаторФайла, 15)) = "ON_KORSCHFDOPPR");
	ЭтоКорректировка736 = (Врег(Лев(ИдентификаторФайла, 16)) = "ON_NKORSCHFDOPPR");
	
	Возврат (ЭтоКорректировка189 Или ЭтоКорректировка736);
	
КонецФункции

// Определение признака исправления
//
// Параметры:
//  НомерИсправления - Строка
//
// Возвращаемое значение:
// Булево
//
Функция ЭтоИсправление(НомерИсправления) Экспорт

	 Возврат ЗначениеЗаполнено(НомерИсправления);

КонецФункции

Функция ЕстьПрослеживаемость(ИдентификаторФайла, ТаблицыТоваров) Экспорт
	
	ТекИдентификаторФайла = Врег(ИдентификаторФайла);
	
	МассивПрефиксов = Новый Массив;
	МассивПрефиксов.Добавить("ON_NSCHFDOPPRPROS_");
	МассивПрефиксов.Добавить("ON_NSCHFDOPPOKPROS_");
	МассивПрефиксов.Добавить("ON_NKORSCHFDOPPRPROS_");
	МассивПрефиксов.Добавить("ON_NKORSCHFDOPPOKPROS_");
	
	Для Каждого Префикс Из МассивПрефиксов Цикл
		Если СтрНачинаетсяС(ТекИдентификаторФайла, Префикс) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	МассивПрефиксов = Новый Массив;
	МассивПрефиксов.Добавить("ON_NSCHFDOPPRMARK_");
	МассивПрефиксов.Добавить("ON_NSCHFDOPPOKMARK_");
	МассивПрефиксов.Добавить("ON_NKORSCHFDOPPRMARK_");
	МассивПрефиксов.Добавить("ON_NKORSCHFDOPPOKMARK_");
	
	СодержитПризнакМаркировки = Ложь;
	Для Каждого Префикс Из МассивПрефиксов Цикл
		Если СтрНачинаетсяС(ТекИдентификаторФайла, Префикс) Тогда
			СодержитПризнакМаркировки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СодержитПризнакМаркировки Тогда
		Для каждого ТекЭлемент Из ТаблицыТоваров Цикл
			ТекТаблица = ТекЭлемент.Значение;
			Для каждого ТекСтрока Из ТекТаблица Цикл
				Если ТекСтрока.ЭтоПрослеживаемыйТовар Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если СтрНачинаетсяС(ТекИдентификаторФайла, "ON_NSCHFDOPPR_") Тогда
		
		ЧастиИдентификатора = СтрРазделить(ИдентификаторФайла, "_");
		Если ЧастиИдентификатора.Количество() > 6 И ЧастиИдентификатора[6] = "1" Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Математика

// Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//  РаспределяемаяСумма - Число - сумма, которую надо распределить;
//  Коэффициенты - Массив - коэффициенты распределения;
//  Точность - Число - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае если распределить не удалось (сумма = 0, кол-во коэффициентов = 0,
//           или суммарный вес коэффициентов = 0), тогда возвращается значение Неопределено.
//
Функция РаспределитьПропорционально(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт

	Если Коэффициенты.Количество() = 0 Или Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	РаспределеннаяСумма = 0;
	СуммаКоэффициентов  = 0;
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Коэффициент = Коэффициенты[Индекс];
		
		АбсолютноеЗначениеКоэффициента = Макс(Коэффициент, -Коэффициент);
		Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
			МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(Коэффициенты.Количество());
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * Коэффициенты[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
		
	Дельта = РаспределяемаяСумма - РаспределеннаяСумма;
	
	Если Дельта > 0 Тогда 
		
		// Погрешности округления отнесем на коэффициент с максимальным весом.
		Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
			Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + Дельта;
		КонецЕсли;
		
	ИначеЕсли Дельта < 0 Тогда 
		
		// Если распределили больше чем положено, размазываем погрешность по ближайшим максимальным весам.
		ЗначениеПогрешности = 1 / Pow(10, Точность);
		КоличествоЭлементовПогрешности = -Дельта / ЗначениеПогрешности;
		
		КоэффициентыРешето = Новый Массив(Новый ФиксированныйМассив(Коэффициенты));
		
		Для Сч = 1 По КоличествоЭлементовПогрешности Цикл 
			МаксимальныйКоэффициент = МаксимальноеЗначениеВМассиве(КоэффициентыРешето);
			Индекс = КоэффициентыРешето.Найти(МаксимальныйКоэффициент);
			Результат[Индекс] = Результат[Индекс] - ЗначениеПогрешности;
			КоэффициентыРешето[Индекс] = 0;
		КонецЦикла;
		
	Иначе 
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СтроковыеФункции

// Оставляет в строке только символы латинского алфавита.
//
// Параметры:
//  СтрокаПроверки           - Строка - проверяемая строка.
//  УчитыватьРазделителиСлов - Булево - учитывать ли разделители слов или они являются исключением.
//  ДопустимыеСимволы        - Строка - дополнительные разрешенные символы, кроме латиницы.
//
// Возвращаемое значение:
//  Строка - Строка - Строка содержащая только латинские (или допустимые) символы;
//
Функция ОставитьТолькоЛатиницуВСтроке(Знач СтрокаПроверки, Знач УчитыватьРазделителиСлов = Истина, ДопустимыеСимволы = "") Экспорт
	
	НоваяСтрока = "";
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат НоваяСтрока;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат НоваяСтрока;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	
	Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		КодыДопустимыхСимволов.Добавить(КодСимвола(Сред(ДопустимыеСимволы, Индекс, 1)));
	КонецЦикла;
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122))
			И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) 
			И Не (Не УчитыватьРазделителиСлов И ЭтоРазделительСлов(КодСимвола)) Тогда
				Продолжить;
		Иначе
			НоваяСтрока = НоваяСтрока + Символ(КодСимвола);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоваяСтрока;
	
КонецФункции

// Проверяет, содержит ли строка только символы латинского алфавита.
//
// Параметры:
//  СтрокаПроверки - Строка - проверяемая строка.
//  УчитыватьРазделителиСлов - Булево - учитывать ли разделители слов или они являются исключением.
//  ДопустимыеСимволы - Строка - дополнительные разрешенные символы, кроме латиницы.
//
// Возвращаемое значение:
//  Булево - Истина, если строка содержит только латинские (или допустимые) символы;
//         - Ложь, если строка содержит иные символы.
//
Функция ТолькоЛатиницаВСтроке(Знач СтрокаПроверки, Знач УчитыватьРазделителиСлов = Истина, ДопустимыеСимволы = "") Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	
	Для Индекс = 1 По СтрДлина(ДопустимыеСимволы) Цикл
		КодыДопустимыхСимволов.Добавить(КодСимвола(Сред(ДопустимыеСимволы, Индекс, 1)));
	КонецЦикла;
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122))
			И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) 
			И Не (Не УчитыватьРазделителиСлов И ЭтоРазделительСлов(КодСимвола)) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей. Если параметр не указан, то 
//                             разделителем считаются все символы, не являющиеся цифрами, 
//                             латинскими и кириллическими буквами, а также знаком подчеркивания.
//
// Возвращаемое значение:
//  Булево - Истина, если символ с кодом КодСимвола является разделителем.
//
Функция ЭтоРазделительСлов(КодСимвола, РазделителиСлов = Неопределено) Экспорт
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат СтрНайти(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
		
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 		// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 		// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 		// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103)); 	// кириллица
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025)); 	// символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105)); 	// символ "ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 		// символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Преобразует исходную строку в дату.
//
// Параметры:
//  Значение - Строка - Строка, которую необходимо привести к дате.
//                      Формат даты должен быть в виде "ДД.ММ.ГГГГ" или "ДД/ММ/ГГ" или "ДД-ММ-ГГ",
//                      Например, "23.02.1980" или "23/02/80".
// 
// Возвращаемое значение:
//  Дата - полученная дата.
//
Функция СтрокаВДату(Знач Значение) Экспорт
	
	Значение = СтрЗаменить(Значение, " ", "");
	Значение = СокрЛП(СтрЗаменить(Значение, ".", ""));
	Значение = СокрЛП(СтрЗаменить(Значение, "/", ""));
	Значение = СокрЛП(СтрЗаменить(Значение, "-", ""));
	Значение = Сред(Значение, 5) + Сред(Значение, 3, 2) + Лев(Значение, 2);
	Если СтрДлина(Значение) = 6 Тогда  
		// TO DO СтрокаВЧисло можно заменить на ПривестиКЧислу
		Год = СтрокаВЧисло(Лев(Значение, 2));
		Если Год = Неопределено Тогда 
			Возврат Дата('0001.01.01');
		КонецЕсли;
		Значение = ?(Год > 29, "19", "20") + Значение;
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат    = ОписаниеТипа.ПривестиЗначение(Значение);
	
	Возврат Результат;
	
КонецФункции

// Преобразует исходную строку в число без вызова исключений.
//
// Параметры:
//   Значение - Строка - Строка, которую необходимо привести к числу.
//                       Например, "10", "+10", "010", вернет 10;
//                                 "(10)", "-10",вернет -10;
//                                 "10,2", "10.2",вернет 10.2;
//                                 "000", " ", "",вернет 0;
//                                 "10текст", вернет Неопределено.
//
// Возвращаемое значение:
//   Число, Неопределено - Полученное число, либо Неопределено, если строка не является числом.
//
Функция СтрокаВЧисло(Знач Значение) Экспорт
	
	Значение  = СтрЗаменить(Значение, " ", "");
	Если СтрНачинаетсяС(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	
КонецФункции

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123"); // Истина
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123abc"); // Ложь
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("01 2 3", Ложь); // Истина
//
Функция ТолькоЦифрыВСтроке(Знач Значение, Знач ПробелыЗапрещены = Истина) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, " ", ""), Символы.ВК, ""), Символы.ВТаб, ""), Символы.НПП, ""), Символы.ПС, ""), Символы.ПФ, ""), Символы.Таб, "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

// Определяет наличие только цифр и букв (английские и русские) в строке
//
// Параметры:
//  ИсходнаяСтрока                   - Строка для проверки
//  ДополнительныеРазрешенныеСимволы - Массив, символы-исключения
//
// Возвращаемое значение:
// Булево
//
Функция ТолькоБуквыИЦифрыВСтроке(ИсходнаяСтрока, ДополнительныеРазрешенныеСимволы = Неопределено) Экспорт

	РазрешенныеСимволы = "1234567890qwertyuiopasdfghjklzxcvbnmабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	Если НЕ ДополнительныеРазрешенныеСимволы = Неопределено И ТипЗнч(ДополнительныеРазрешенныеСимволы) = Тип("Массив") Тогда
		Для каждого ДопСимвол Из ДополнительныеРазрешенныеСимволы Цикл
			РазрешенныеСимволы = РазрешенныеСимволы + ДопСимвол;	
		КонецЦикла;	
	КонецЕсли;
	
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Если СтрДлина(ИсходнаяСтрока) > 0 Тогда
		Для Сч = 1 По СтрДлина(ИсходнаяСтрока) Цикл
			Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1));
			Если СтрНайти(РазрешенныеСимволы, Символ) = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

// Готовит строку для использования в качестве имени файла.
//
// Параметры:
//  Строка        - Строка для обработки
//  ЗаменаПробела - Символ замены пробела
//
// Возвращаемое значение:
// Строка
//
Функция ПодготовитьСтрокуДляИмениФайла(Строка, ЗаменаПробела = Неопределено) Экспорт
	
	ЗаменаСимволов = Новый Соответствие;
	ЗаменаСимволов.Вставить("\", " ");
	ЗаменаСимволов.Вставить("/", " ");
	ЗаменаСимволов.Вставить("*", " ");
	ЗаменаСимволов.Вставить("<", " ");
	ЗаменаСимволов.Вставить(">", " ");
	ЗаменаСимволов.Вставить("|", " ");
	ЗаменаСимволов.Вставить(":", "");
	ЗаменаСимволов.Вставить("""", "");
	ЗаменаСимволов.Вставить("?", "");
	ЗаменаСимволов.Вставить(Символы.ВК, "");
	ЗаменаСимволов.Вставить(Символы.ПС, " ");
	ЗаменаСимволов.Вставить(Символы.Таб, " ");
	ЗаменаСимволов.Вставить(Символы.НПП, " ");
	// замена символов кавычек
	ЗаменаСимволов.Вставить(Символ(171), "");
	ЗаменаСимволов.Вставить(Символ(187), "");
	ЗаменаСимволов.Вставить(Символ(8195), "");
	ЗаменаСимволов.Вставить(Символ(8194), "");
	ЗаменаСимволов.Вставить(Символ(8216), "");
	ЗаменаСимволов.Вставить(Символ(8218), "");
	ЗаменаСимволов.Вставить(Символ(8217), "");
	ЗаменаСимволов.Вставить(Символ(8220), "");
	ЗаменаСимволов.Вставить(Символ(8222), "");
	ЗаменаСимволов.Вставить(Символ(8221), "");
	
	СтрокаПодготовленная = "";
	
	КоличествоСимволов = СтрДлина(Строка);
	
	Для НомерСимвола = 1 По КоличествоСимволов Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если ЗаменаСимволов[Символ] <> Неопределено Тогда
			Символ = ЗаменаСимволов[Символ];
		КонецЕсли;
		СтрокаПодготовленная = СтрокаПодготовленная + Символ;
	КонецЦикла;
	
	Если ЗаменаПробела <> Неопределено Тогда
		СтрокаПодготовленная = СтрЗаменить(ЗаменаПробела, " ", ЗаменаПробела);
	КонецЕсли;
	
	Возврат СокрЛП(СтрокаПодготовленная);
	
КонецФункции

// Преобразует строковое представление даты в форматах DD.MM.YYYY, YYYY-MM-DD в дату.
//
// Параметры:
//  Строка	 - Строка - представление даты.
// Возвращаемое значение:
//  Дата - преобразованное значение.
//
Функция ДатаИзСтроки(Строка) Экспорт
	
	ЧастьДаты    = "";
	ЧастьВремени = "000000";
	Если Не ТолькоЦифрыВСтроке(Сред(Строка, 3, 1)) Тогда
		ЧастьДаты = Сред(Строка, 7, 4) + Сред(Строка, 4, 2) + Сред(Строка, 1, 2);
		// заполним дополнительно время для формата "dd.MM.yyyy HH.mm.ss".
		Если СтрДлина(Строка) = 19 Тогда
			ЧастьВремени = СтрЗаменить(Сред(Строка, 12), ".", "");
		КонецЕсли;
	Иначе
		ЧастьДаты = Сред(Строка, 1, 4) + Сред(Строка, 6, 2) + Сред(Строка, 9, 2);
		// заполним дополнительно время для формата 20 символов.
		Если СтрДлина(Строка) = 20 Тогда
			ЧастьВремени = СтрЗаменить(Сред(Строка, 12), ":", "");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Дата(ЧастьДаты + ЧастьВремени);
	
КонецФункции

// Удаляет указанные символы из строки
//
// Параметры:
//  Строка					 - Строка	 - Исходная строка
//  УдаляемыеСимволы		 - Строка	 - Символы, которые подлежат удалению
//  УдалитьНезначащиеСимволы - Булево	 - если Истина, то будут также удалены незначащие символы.
// 
// Возвращаемое значение:
//  Строка - результат
//
Функция УдалитьСимволыИзСтроки(Строка, УдаляемыеСимволы, УдалитьНезначащиеСимволы = Истина) Экспорт
	
	Перем НезначащиеСимволы, НоваяСтрока, СоставныеЧастиСтроки;
	
	НезначащиеСимволы = "";
	Если УдалитьНезначащиеСимволы Тогда
		НезначащиеСимволы = "" + Символы.НПП + Символы.Таб + Символы.ВТаб + Символы.ВК + Символы.ПС + Символы.ПФ;
	КонецЕсли;
	СоставныеЧастиСтроки = СтрРазделить(Строка, УдаляемыеСимволы + НезначащиеСимволы, Ложь);
	НоваяСтрока = СтрСоединить(СоставныеЧастиСтроки, "");
	
	Возврат НоваяСтрока;
	
КонецФункции

// Соединяет переданые строки в одну разделяя пробелом
//
// Параметры:
//  Строка1	 - Строка
//  Строка2	 - Строка
//  Строка3	 - Строка
//  Строка4	 - Строка
//  Строка5	 - Строка 
// 
// Возвращаемое значение:
//  Строка - соединенные строки
//
Функция СоединитьСтрокиСПробелом(Строка1 = "", Строка2 = "", Строка3 = "", Строка4 = "", Строка5 = "") Экспорт
	
	Перем Результат;
	
	Строка1 = ?(Строка1 = Неопределено, "", Строка1);
	Строка2 = ?(Строка2 = Неопределено, "", Строка2);
	Строка3 = ?(Строка3 = Неопределено, "", Строка3);
	Строка4 = ?(Строка4 = Неопределено, "", Строка4);
	Строка5 = ?(Строка5 = Неопределено, "", Строка5);
	
	Результат = СтрШаблон("%1 %2 %3 %4 %5", Строка1, Строка2, Строка3, Строка4, Строка5);
	Результат = СтрСоединить(СтрРазделить(Результат, " " + Символы.НПП + Символы.Таб + Символы.ВТаб + Символы.ВК + Символы.ПС + Символы.ПФ, Ложь), " ");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область ДинамическиеСписки

// Найти элемент или группу отбора по заданному имени поля или представлению.
//
// Параметры:
//  ОбластьПоиска - ОтборКомпоновкиДанных, КоллекцияЭлементовОтбораКомпоновкиДанных,
//                  ГруппаЭлементовОтбораКомпоновкиДанных - контейнер
//                  с элементами и группами отбора, например Список.Отбор или группа в отборе.
//  ИмяПоля       - Строка - имя поля компоновки (не используется для групп).
//  Представление - Строка - представление поля компоновки.
//
// Возвращаемое значение:
//  Массив - коллекция отборов.
//
Функция НайтиЭлементыИГруппыОтбора(Знач ОбластьПоиска,
									Знач ИмяПоля = Неопределено,
									Знач Представление = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Возврат МассивЭлементов;
	
КонецФункции

// Выполняет поиск элемента отбора в коллекции по заданному представлению.
//
// Параметры:
//  КоллекцияЭлементов - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                                  например, Список.Отбор.Элементы или группа в отборе.
//  Представление - Строка - представление группы.
// 
// Возвращаемое значение:
//  ЭлементОтбораКомпоновкиДанных - элемент отбора.
//
Функция НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;          
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если ЭлементОтбора.Представление = Представление Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Добавить группу отбора в коллекцию КоллекцияЭлементов.
//
// Параметры:
//  КоллекцияЭлементов - ОтборКомпоновкиДанных, КоллекцияЭлементовОтбораКомпоновкиДанных,
//                       ГруппаЭлементовОтбораКомпоновкиДанных - контейнер
//                       с элементами и группами отбора, например Список.Отбор или группа в отборе.
//  Представление      - Строка - представление группы.
//  ТипГруппы          - ТипГруппыЭлементовОтбораКомпоновкиДанных - тип группы.
//
// Возвращаемое значение:
//  ГруппаЭлементовОтбораКомпоновкиДанных - группа отбора.
//
Функция СоздатьГруппуЭлементовОтбора(Знач КоллекцияЭлементов, Представление, ТипГруппы) Экспорт
	
	Если ТипЗнч(КоллекцияЭлементов) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		КоллекцияЭлементов = КоллекцияЭлементов.Элементы;
	КонецЕсли;
	
	ГруппаЭлементовОтбора = НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление);
	Если ГруппаЭлементовОтбора = Неопределено Тогда
		ГруппаЭлементовОтбора = КоллекцияЭлементов.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Иначе
		ГруппаЭлементовОтбора.Элементы.Очистить();
	КонецЕсли;
	
	ГруппаЭлементовОтбора.Представление    = Представление;
	ГруппаЭлементовОтбора.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	ГруппаЭлементовОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ГруппаЭлементовОтбора.ТипГруппы        = ТипГруппы;
	ГруппаЭлементовОтбора.Использование    = Истина;
	
	Возврат ГруппаЭлементовОтбора;
	
КонецФункции

// Добавить элемент компоновки в контейнер элементов компоновки.
//
// Параметры:
//  ОбластьДобавления - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                                 например, Список.Отбор или группа в отборе.
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда).
//  ПравоеЗначение          - Произвольный - сравниваемое значение.
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения.
//  Представление           - Строка - представление элемента компоновки данных.
//  Использование           - Булево - использование элемента.
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения.
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
// Возвращаемое значение:
//  ЭлементОтбораКомпоновкиДанных - элемент компоновки.
//
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									Знач ИмяПоля,
									Знач ВидСравнения,
									Знач ПравоеЗначение = Неопределено,
									Знач Представление  = Неопределено,
									Знач Использование  = Неопределено,
									Знач РежимОтображения = Неопределено,
									Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	
	Если РежимОтображения = Неопределено Тогда
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элемент.РежимОтображения = РежимОтображения;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	// Важно: установка идентификатора должна выполняться
	// в конце настройки элемента, иначе он будет скопирован
	// в пользовательские настройки частично заполненным.
	Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	ИначеЕсли Элемент.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИмяПоля;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

// Изменить элемент отбора с заданным именем поля или представлением.
//
// Параметры:
//  ОбластьПоиска - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                             например, Список.Отбор или группа в отборе.
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда).
//  Представление           - Строка - представление элемента компоновки данных.
//  ПравоеЗначение          - Произвольный - сравниваемое значение.
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения.
//  Использование           - Булево - использование элемента.
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения.
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
//
// Возвращаемое значение:
//  Число - количество измененных элементов.
//
Функция ИзменитьЭлементыОтбора(ОбластьПоиска,
								Знач ИмяПоля = Неопределено,
								Знач Представление = Неопределено,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если ИмяПоля <> Неопределено Тогда
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
		Если РежимОтображения <> Неопределено Тогда
			Элемент.РежимОтображения = РежимОтображения;
		КонецЕсли;
		Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
			Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции

// Удалить элементы отбора с заданным именем поля или представлением.
//
// Параметры:
//  ОбластьУдаления - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                                               например, Список.Отбор или группа в отборе..
//  ИмяПоля         - Строка - имя поля компоновки (не используется для групп).
//  Представление   - Строка - представление поля компоновки.
//
Процедура УдалитьЭлементыГруппыОтбора(Знач ОбластьУдаления, Знач ИмяПоля = Неопределено, Знач Представление = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьУдаления.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если Элемент.Родитель = Неопределено Тогда
			ОбластьУдаления.Элементы.Удалить(Элемент);
		Иначе
			Элемент.Родитель.Элементы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавить или заменить существующий элемент отбора.
//
// Параметры:
//  ОбластьПоискаДобавления - КоллекцияЭлементовОтбораКомпоновкиДанных - контейнер с элементами и группами отбора,
//                                     например, Список.Отбор или группа в отборе.
//  ИмяПоля                 - Строка - имя поля компоновки данных (заполняется всегда).
//  ПравоеЗначение          - произвольный - сравниваемое значение.
//  ВидСравнения            - ВидСравненияКомпоновкиДанных - вид сравнения.
//  Представление           - Строка - представление элемента компоновки данных.
//  Использование           - Булево - использование элемента.
//  РежимОтображения        - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения.
//  ИдентификаторПользовательскойНастройки - Строка - см. ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки
//                                                    в синтакс-помощнике.
//
Процедура УстановитьЭлементОтбора(ОбластьПоискаДобавления,
								Знач ИмяПоля,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Представление = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	ЧислоИзмененных = ИзменитьЭлементыОтбора(ОбластьПоискаДобавления, ИмяПоля, Представление,
							ПравоеЗначение, ВидСравнения, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	
	Если ЧислоИзмененных = 0 Тогда
		Если ВидСравнения = Неопределено Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("Массив")
				Или ТипЗнч(ПравоеЗначение) = Тип("ФиксированныйМассив")
				Или ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		КонецЕсли;
		Если РежимОтображения = Неопределено Тогда
			РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		ДобавитьЭлементКомпоновки(ОбластьПоискаДобавления, ИмяПоля, ВидСравнения,
								ПравоеЗначение, Представление, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
КонецПроцедуры

// Добавить или заменить существующий элемент отбора динамического списка.
//
// Параметры:
//   ДинамическийСписок - ДинамическийСписок - Список, в котором требуется установить отбор.
//   ИмяПоля            - Строка - Поле, по которому необходимо установить отбор.
//   ПравоеЗначение     - Произвольный - Значение отбора.
//       Необязательный. Значение по умолчанию: Неопределено.
//       Внимание! Если передать Неопределено, то значение не будет изменено.
//   ВидСравнения  - ВидСравненияКомпоновкиДанных - Условие отбора.
//   Представление - Строка - Представление элемента компоновки данных.
//       Необязательный. Значение по умолчанию: Неопределено.
//       Если указано, то выводится только флажок использования с указанным представлением (значение не выводится).
//       Для очистки (чтобы значение снова выводилось) следует передать пустую строку.
//   Использование - Булево - Флажок использования этого отбора.
//       Необязательный. Значение по умолчанию: Неопределено.
//   РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - Способ отображения этого отбора
//                                                                          пользователю.
//       * РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ - В группе быстрых настроек над списком.
//       * РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный       - В настройка списка (в подменю Еще).
//       * РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный   - Запретить пользователю менять этот отбор.
//   ИдентификаторПользовательскойНастройки - Строка - Уникальный идентификатор этого отбора.
//       Используется для связи с пользовательскими настройками.
//
Процедура УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля,
	ПравоеЗначение = Неопределено,
	ВидСравнения = Неопределено,
	Представление = Неопределено,
	Использование = Неопределено,
	РежимОтображения = Неопределено,
	ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если РежимОтображения = Неопределено Тогда
		РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	Иначе
		ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	КонецЕсли;
	
	УстановитьЭлементОтбора(
		ОтборДинамическогоСписка,
		ИмяПоля,
		ПравоеЗначение,
		ВидСравнения,
		Представление,
		Использование,
		РежимОтображения,
		ИдентификаторПользовательскойНастройки);
	
КонецПроцедуры

// Удалить элемент группы отбора динамического списка.
//
// Параметры:
//  ДинамическийСписок - ДинамическийСписок - реквизит формы, для которого требуется установить отбор.
//  ИмяПоля         - Строка - имя поля компоновки (не используется для групп).
//  Представление   - Строка - представление поля компоновки.
//
Процедура УдалитьЭлементыГруппыОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля = Неопределено, Представление = Неопределено) Экспорт
	
	УдалитьЭлементыГруппыОтбора(
		ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		ИмяПоля,
		Представление);
	
	УдалитьЭлементыГруппыОтбора(
		ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор,
		ИмяПоля,
		Представление);
	
КонецПроцедуры

// Установить или обновить значение параметра ИмяПараметра динамического списка Список.
//
// Параметры:
//  Список          - ДинамическийСписок - реквизит формы, для которого требуется установить параметр.
//  ИмяПараметра    - Строка             - имя параметра динамического списка.
//  Значение        - Произвольный        - новое значение параметра.
//  Использование   - Булево             - признак использования параметра.
//
Процедура УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		Если Использование И ЗначениеПараметраКомпоновкиДанных.Значение <> Значение Тогда
			ЗначениеПараметраКомпоновкиДанных.Значение = Значение;
		КонецЕсли;
		Если ЗначениеПараметраКомпоновкиДанных.Использование <> Использование Тогда
			ЗначениеПараметраКомпоновкиДанных.Использование = Использование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтруктурыДанных

// Проверяет заполненность полей структуры
//
// Параметры:
//  Структура		- Структура - структура для проверки
//
// Возвращаемое значение:
//	Булево
//
Функция СтруктураПустая(Структура) Экспорт
	
	Результат = Истина;
	
	Для каждого КлючЗначение Из Структура Цикл
		ТекКлюч = КлючЗначение.Ключ;
		ТекЗначение = КлючЗначение.Значение;
		Если ТипЗнч(ТекЗначение) = Тип("Структура") Тогда
			Результат = СтруктураПустая(ТекЗначение);							
		Иначе
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЕсли; 				
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

// Возвращает значение свойства структуры
//
// Параметры:
//	Структура           - Структура, ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа
//	Ключ                - Строка - имя свойства структуры, для которого необходимо прочитать значение
//	ЗначениеПоУмолчанию - Произвольный - необязательный, возвращается когда в структуре нет значения по указанному
//
// Возвращаемое значение:
//	Произвольный - значение свойства структуры, ЗначениеПоУмолчанию если в структуре нет указанного свойства
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Результат = ЗначениеПоУмолчанию;

	Если ТипЗнч(Ключ) = Тип("Строка") Тогда

		СписокКлючей = СтрРазделить(Ключ, ".");
		ТекущийЭлемент = Структура;

		Для Каждого ОчереднойКлюч Из СписокКлючей Цикл

			ЭтоСтруктура = ТипЗнч(ТекущийЭлемент) = Тип("Структура")
			Или ТипЗнч(ТекущийЭлемент) = Тип("ФиксированнаяСтруктура")
			Или ТипЗнч(ТекущийЭлемент) = Тип("ДанныеФормыСтруктура")
			Или ТипЗнч(ТекущийЭлемент) = Тип("ДанныеФормыСтруктураСКоллекцией")
			Или ТипЗнч(ТекущийЭлемент) = Тип("ДанныеФормыЭлементКоллекции")
			Или ТипЗнч(ТекущийЭлемент) = Тип("ДанныеФормыЭлементДерева");

			Если ЭтоСтруктура
				И Не ПустаяСтрока(ОчереднойКлюч)
				И ТекущийЭлемент.Свойство(ОчереднойКлюч, ТекущийЭлемент) Тогда
				Продолжить;

			Иначе
				Возврат ЗначениеПоУмолчанию;

			КонецЕсли;

		КонецЦикла;

		Результат = ТекущийЭлемент;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Дополняет таблицу значений - приемник данными из таблицы значений - источника.
// Типы ТаблицаЗначений, ДеревоЗначений, ТабличнаяЧасть не доступны на клиенте.
//
// Параметры:
//  ТаблицаИсточник - ТаблицаЗначений
//                  - ДеревоЗначений
//                  - ТабличнаяЧасть
//                  - ДанныеФормыКоллекция - таблица, из которой будут
//                    браться строки для заполнения;
//  ТаблицаПриемник - ТаблицаЗначений
//                  - ДеревоЗначений
//                  - ТабличнаяЧасть
//                  - ДанныеФормыКоллекция - таблица, в которую будут
//                    добавлены строки из таблицы-источника.
//
Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет структуру или соответствие значениями из другой структуры.
//
// Параметры:
//   Приемник - Структура или Соответствие - коллекция, в которую будут добавляться новые значения.
//   Источник - Структура или Соответствие - коллекция, из которой будут считываться пары Ключ и Значение для заполнения.
//   Заменять - Булево, Неопределено - Что делать в местах пересечения ключей источника и приемника:
//                                       Истина - Заменять значения приемника (самый быстрый способ),
//                                       Ложь   - Не заменять значения приемника (пропускать),
//                                       Неопределено - Значение по умолчанию. Бросать исключение.
//
Процедура ДополнитьСтруктуру(Приемник, Источник, Заменять = Неопределено) Экспорт
	
	ЭтоСоответсвие = ТипЗнч(Приемник) = Тип("Соответствие");
	
	Для Каждого Элемент Из Источник Цикл
		
		Если ЭтоСоответсвие И Приемник.Получить(Элемент.Ключ) <> Неопределено Тогда
			КлючВПриемнике = Истина;
		ИначеЕсли НЕ ЭтоСоответсвие И Приемник.Свойство(Элемент.Ключ) Тогда
			КлючВПриемнике = Истина;
		Иначе
			КлючВПриемнике = Ложь;
		КонецЕсли;
		
		Если Заменять <> Истина И КлючВПриемнике Тогда
			Если Заменять = Ложь Тогда
				Продолжить;
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Пересечение ключей источника и приемника: ""%1"".'"), Элемент.Ключ);
			КонецЕсли;
		КонецЕсли;
		
		Приемник.Вставить(Элемент.Ключ, Элемент.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Создание копии объекта, поддерживает коллекции
//
// Параметры:
//  Источник		- Объект источник
//
// Возвращаемое значение:
//	Копия обьекта
//
Функция СкопироватьРекурсивно(Источник) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("Структура") Тогда
		Приемник = СкопироватьСтруктуру(Источник);
	ИначеЕсли ТипИсточника = Тип("Соответствие") Тогда
		Приемник = СкопироватьСоответствие(Источник);
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		Приемник = СкопироватьМассив(Источник);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначений(Источник);
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ИначеЕсли ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Приемник = Источник.Скопировать();
#КонецЕсли
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

// Создание копии объекта типа Структура
//
// Параметры:
//  СтруктураИсточник - Структура
//
// Возвращаемое значение:
//	Копия обьекта
//
Функция СкопироватьСтруктуру(СтруктураИсточник) Экспорт
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Создание копии объекта типа Соответствие
//
// Параметры:
//  СоответствиеИсточник - Соответствие
//
// Возвращаемое значение:
//	Копия обьекта
//
Функция СкопироватьСоответствие(СоответствиеИсточник) Экспорт
	
	СоответствиеРезультат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, СкопироватьРекурсивно(КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СоответствиеРезультат;

КонецФункции

// Создание копии объекта типа Массив
//
// Параметры:
//  МассивИсточник - Массив
//
// Возвращаемое значение:
//	Копия обьекта
//
Функция СкопироватьМассив(МассивИсточник) Экспорт
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(СкопироватьРекурсивно(Элемент));
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

// Создание копии объекта типа Список
//
// Параметры:
//  СписокИсточник - СписокЗначений
//
// Возвращаемое значение:
//	Копия обьекта
//
Функция СкопироватьСписокЗначений(СписокИсточник) Экспорт
	
	СписокРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
			СкопироватьРекурсивно(ЭлементСписка.Значение), 
			ЭлементСписка.Представление, 
			ЭлементСписка.Пометка, 
			ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

// Преобразует Источник в массив из переданного значения если он не является массивом
//
// Параметры:
//  Источник - Произвольный
//
// Возвращаемое значение:
//	Массив
//
Функция МассивПоЗначению(Источник) Экспорт

	Если ТипЗнч(Источник) = Тип("Массив") Тогда
		Возврат Источник;	
	Иначе	
		Результат = Новый Массив;
		Результат.Добавить(Источник);
		Возврат Результат;
	КонецЕсли;	

КонецФункции

// Возвращает новый массив, заполненный значениями другого массива структур.
//  - Если элементы массива не типа Структура - вернется пустой массив.
//
// Параметры:
//   МассивСтруктур - Массив из Структура - Массив элементов типа структура произвольной структуры
//   КлючЗначения - Строка - Ключ значения структуры, который необходимо загрузить в новый массив
//
// Возвращаемое значение:
//   Массив - Массив произвольных значений
//
Функция СкопироватьЗначениеИзМассиваСтруктур(МассивСтруктур, КлючЗначения) Экспорт
	
	МассивРезультат = Новый Массив;
	Для каждого ЭлементСтруктура Из МассивСтруктур Цикл
		Если ТипЗнч(ЭлементСтруктура) = Тип("Структура") Тогда
			Значение = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭлементСтруктура, КлючЗначения);
			Если Не Значение = Неопределено Тогда
				МассивРезультат.Добавить(Значение);					
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

#КонецОбласти

#Область УстановкаПараметровВыбораПрофилейВФормах

// Устанавливает отбор по доступным профилям пользователя
//
// Параметры:
//  ПрофильЭДООрганизации		- Справочник.ККСНГ_Организации- Отбор по выбранному профилю
//  ПолеНастройки				- Поле ввода
//  БезПометкиУдаления			- Булево - Отбор по помеченным на удаление
//
Процедура УстановитьПараметрыВыбораПрофилейЭДО(ПрофильЭДООрганизации, ПолеНастройки, БезПометкиУдаления = Истина) Экспорт
	
	МассивПараметровВыбора = Новый Массив();
	
	ДоступныеПрофилиЭДО = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДоступныеПрофилиЭДОПользователя();
	
	Если ЗначениеЗаполнено(ПрофильЭДООрганизации) 
		И ДоступныеПрофилиЭДО.Найти(ПрофильЭДООрганизации) = Неопределено Тогда 
		ПрофильЭДООрганизации = Неопределено;		
	КонецЕсли;
	
	ПараметрДоступныеПрофили = Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеПрофилиЭДО);
	
	МассивПараметровВыбора.Добавить(ПараметрДоступныеПрофили);
	
	Если БезПометкиУдаления Тогда
		ПараметрБезПометкиУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
	    МассивПараметровВыбора.Добавить(ПараметрБезПометкиУдаления);
	КонецЕсли;	
		
	ПолеНастройки.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
КонецПроцедуры

#КонецОбласти

#Область ФайловаяСистема

// Удаляет временные файлы или каталог.
//
// Параметры:
//  Путь - Строка - полный путь к файлу или каталогу
//  Маска - Строка - маска для выбора удаляемых файлов,
//        - Неопределено - удаляются все файлы и каталог <Путь>.
//
Процедура УдалитьВременныеФайлы(Путь, Маска = Неопределено, ВызыватьИсключение = Ложь) Экспорт
	
	Попытка
		УдалитьФайлы(Путь, Маска);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ВызыватьИсключение Тогда
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

// Получается индекс пиктограммы файла - индекс в картинке КоллекцияПиктограммФайлов.
Функция ПолучитьИндексПиктограммыФайла(Знач РасширениеФайла) Экспорт
	
	Если ТипЗнч(РасширениеФайла) <> Тип("Строка")
		ИЛИ ПустаяСтрока(РасширениеФайла) Тогда
		Возврат 0;
	КонецЕсли;
	
	РасширениеФайла = РасширениеБезТочки(РасширениеФайла);
	
	Расширение = "." + НРег(РасширениеФайла) + ";";
	
	Если СтрНайти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
		Возврат 6; // Файлы 1С.
		
	ИначеЕсли Расширение = ".mxl;" Тогда
		Возврат 8; // Табличный Файл.
		
	ИначеЕсли СтрНайти(".txt;.log;.ini;", Расширение) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли Расширение = ".epf;" Тогда
		Возврат 12; // Внешние обработки.
		
	ИначеЕсли СтрНайти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли СтрНайти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли СтрНайти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли СтрНайти(".xls;.xlw;",Расширение) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли СтрНайти(".ppt;.pps;",Расширение) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли СтрНайти(".vsd;",Расширение) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mpp;",Расширение) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли СтрНайти(".xml;",Расширение) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли СтрНайти(".msg;.eml;",Расширение) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли СтрНайти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли СтрНайти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли СтрНайти(".grs;",Расширение) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли СтрНайти(".geo;",Расширение) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли СтрНайти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли СтрНайти(".bmp;.dib;",Расширение) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли СтрНайти(".tif;.tiff;",Расширение) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли СтрНайти(".gif;",Расширение) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли СтрНайти(".png;",Расширение) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли СтрНайти(".pdf;",Расширение) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли СтрНайти(".odt;",Расширение) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли СтрНайти(".odf;",Расширение) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли СтрНайти(".odp;",Расширение) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли СтрНайти(".odg;",Расширение) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли СтрНайти(".ods;",Расширение) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли СтрНайти(".mp3;",Расширение) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли СтрНайти(".erf;",Расширение) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли СтрНайти(".docx;",Расширение) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли СтрНайти(".xlsx;",Расширение) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли СтрНайти(".pptx;",Расширение) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли СтрНайти(".p7s;",Расширение) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли СтрНайти(".p7m;",Расширение) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

// Преобразует расширение файла в нижний регистр без точки.
//
// Параметры:
//  Расширение - Строка - расширение для преобразования.
//
// Возвращаемое значение:
//  Строка - преобразованное расширение.
//
Функция РасширениеБезТочки(Знач Расширение) Экспорт
	
	Расширение = НРег(СокрЛП(Расширение));
	
	Если Сред(Расширение, 1, 1) = "." Тогда
		Расширение = Сред(Расширение, 2);
	КонецЕсли;
	
	Возврат Расширение;
	
КонецФункции

#КонецОбласти

// Получает общий модуль по имени
//
// Параметры:
//  ИмяМодуля          - Строка - Имя модуля
//  ВызыватьИсключение - Булево
//
// Возвращаемое значение:
//	Тип Общий модуль или Неопределено
//
Функция ПолучитьМодульПодсистемы(ИмяМодуля, ВызыватьИсключение = Истина) Экспорт

	Попытка
		МодульПодсистемы = Вычислить(ИмяМодуля);
	Исключение
		МодульПодсистемы = Неопределено;
		Если ВызыватьИсключение Тогда
			ВызватьИсключение "Не найден модуль " + ИмяМодуля + " приложения ""Модуль ЭДО"".";
		КонецЕсли;
	КонецПопытки;

	Возврат МодульПодсистемы;

КонецФункции

// Получает общий модуль по одному из имен
//
// Параметры:
//  ВариантыИменМодуля          - Массив строк - имена модуля
//
// Возвращаемое значение:
//	Тип Общий модуль или Неопределено
//
Функция НайтиМодульПодсистем(ВариантыИменМодуля) Экспорт
		
	ИскомыйМодуль = Неопределено;
	ВариантыИменМодуля = СтрРазделить(ВариантыИменМодуля, ",", Ложь);
	Для каждого ИмяМодуля Из ВариантыИменМодуля Цикл
		ИскомыйМодуль = ПолучитьМодульПодсистемы(СокрЛП(ИмяМодуля), Ложь);
		Если ИскомыйМодуль <> Неопределено Тогда
		    Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ИскомыйМодуль;
	
КонецФункции

// Увеличение значения
//
// Параметры:
//  Значение - Число - Исходное значение
//  Шаг      - Число - Увеличение
//
Процедура Инкремент(Значение, Шаг = 1) Экспорт
	
	Значение = Значение + Шаг;
	
КонецПроцедуры

// Оставляет в строке только символы латинского алфавита
//
// Параметры:
//  КодУчастникаЭДО - Строка - Исходная строка
//
Процедура ФорматироватьКодУчастникаЭДО(КодУчастникаЭДО) Экспорт
	
	КодУчастникаЭДО = ОставитьТолькоЛатиницуВСтроке(КодУчастникаЭДО, Истина, "0123456789-");
		
КонецПроцедуры

// Проверяет что ЭД структурированный
//
// Параметры:
//  КодТипаЭД - Строка - Код типа документа 
//
// Возвращаемое значение: 
//  Булево
//
Функция ЭтоСтруктурированныйЭД(КодТипаЭД) Экспорт
	
	МассивКодовСтруктурированныхДокументов = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьКодыСтруктурированныхДокументов();
	
	Возврат МассивКодовСтруктурированныхДокументов.Найти(КодТипаЭД) <> Неопределено;
	
КонецФункции

// Формирует название обмена документами по настройкке организации
//
// Параметры:
//  нет 
//
// Возвращаемое значение: 
//  Строка
//
Функция ВариантНастройкиОбменаОрганизации() Экспорт
	
	Возврат "Использовать настройки организации";
	
КонецФункции

// Заменяет недопустимые символы в XML-строке на заданные символы.
//
// Параметры:
//   Текст        - Строка - строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены - Строка - строка, на которую требуется выполнить замену недопустимого символа в XML-строке.
// 
//  Возвращаемое значение:
//    Строка - строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
#Если НЕ ВебКлиент Тогда
	ПозицияНачала = 1;
	Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	Пока Позиция > 0 Цикл
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		ПозицияНачала = Позиция + СтрДлина(СимволЗамены);
		Если ПозицияНачала > СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	КонецЦикла;
	
	Возврат Текст;
#Иначе
	// Коды символов от 0 до 2^16-1, которые метод НайтиНедопустимыеСимволыXML
	// считает недопустимыми: 0-8, 11-12, 14-31, 55296-57343.
	Итог = "";
	ДлинаСтроки = СтрДлина(Текст);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Текст, НомерСимвола, 1);
		КодСимвола = КодСимвола(Символ);
		
		Если КодСимвола < 9
		 Или КодСимвола > 10    И КодСимвола < 13
		 Или КодСимвола > 13    И КодСимвола < 32
		 Или КодСимвола > 55295 И КодСимвола < 57344 Тогда
			
			Символ = " ";
		КонецЕсли;
		Итог = Итог + Символ;
	КонецЦикла;
	
	Возврат Итог;
#КонецЕсли
	
КонецФункции

// Определяет физ лицо или нет по ИНН
//
// Параметры:
//   ИНН - Строка - Строка ИНН
// 
//  Возвращаемое значение:
//    Булево
//
Функция ЭтоИННФизЛица(ИНН) Экспорт
	
	Если СтрДлина(ИНН) <> 12 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для НомерСимвола = 1 По 12 Цикл
		Если СтрНайти("0123456789", Сред(ИНН, НомерСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрНачинаетсяС(ИНН, "00") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие ИНН требованиям.
//
// Параметры:
//  ИНН                - Строка - проверяемый индивидуальный номер налогоплательщика.
//  ЭтоЮридическоеЛицо - Булево - признак, является ли владелец ИНН юридическим лицом.
//  ТекстСообщения     - Строка - текст сообщения о найденных ошибках.
//
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
Функция ИННСоответствуетТребованиям(Знач ИНН, ЭтоЮридическоеЛицо, ТекстСообщения) Экспорт

	СоответствуетТребованиям = Истина;
	ТекстСообщения = "";

	ИНН      = СокрЛП(ИНН);
	ДлинаИНН = СтрДлина(ИНН);

	Если ЭтоЮридическоеЛицо = Неопределено Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не определен тип владельца ИНН.';
												|en = 'TIN owner type is not specified.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(ИНН) Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'ИНН должен состоять только из цифр.';
												|en = 'TIN contains only digits.'");
	КонецЕсли;

	Если  ЭтоЮридическоеЛицо И ДлинаИНН <> 10 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
			+ НСтр("ru = 'ИНН юридического лица должен состоять из 10 цифр.';
					|en = 'TIN of a business entity must contain 10 digits.'");
	ИначеЕсли НЕ ЭтоЮридическоеЛицо И ДлинаИНН <> 12 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
			+ НСтр("ru = 'ИНН физического лица должен состоять из 12 цифр.';
					|en = 'TIN of an individual must contain 12 digits.'");
	КонецЕсли;

	Если НЕ СоответствуетТребованиям Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если ЭтоЮридическоеЛицо Тогда
		
		Множители = Новый Соответствие;
		Множители.Вставить(1, 2);
		Множители.Вставить(2, 4);
		Множители.Вставить(3, 10);
		Множители.Вставить(4, 3);
		Множители.Вставить(5, 5);
		Множители.Вставить(6, 9);
		Множители.Вставить(7, 4);
		Множители.Вставить(8, 6);
		Множители.Вставить(9, 8);
		КонтрольнаяСумма = 0;
		
		Для Индекс = 1 По 9 Цикл
			Множитель = Множители[Индекс];
			Цифра = Число(Сред(ИНН, Индекс, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
		КонецЦикла;
		
		КонтрольныйРазряд = (КонтрольнаяСумма % 11) % 10;
		
		СоответствуетТребованиям = (КонтрольныйРазряд = Число(Сред(ИНН, 10, 1)));
		
	Иначе
		
		Множители = Новый Соответствие;
		Множители.Вставить(1,  Новый Структура("М11, М12", 7,  3));
		Множители.Вставить(2,  Новый Структура("М11, М12", 2,  7));
		Множители.Вставить(3,  Новый Структура("М11, М12", 4,  2));
		Множители.Вставить(4,  Новый Структура("М11, М12", 10, 4));
		Множители.Вставить(5,  Новый Структура("М11, М12", 3, 10));
		Множители.Вставить(6,  Новый Структура("М11, М12", 5,  3));
		Множители.Вставить(7,  Новый Структура("М11, М12", 9,  5));
		Множители.Вставить(8,  Новый Структура("М11, М12", 4,  9));
		Множители.Вставить(9,  Новый Структура("М11, М12", 6,  4));
		Множители.Вставить(10, Новый Структура("М11, М12", 8,  6));
		Множители.Вставить(11, Новый Структура("М11, М12", 0,  8));
		
		КонтрольнаяСумма11 = 0;
		КонтрольнаяСумма12 = 0;
		
		Для Индекс = 1 По 11 Цикл
			Множитель11 = Множители[Индекс].М11;
			Множитель12 = Множители[Индекс].М12;
			Цифра = Число(Сред(ИНН, Индекс, 1));
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;
		КонецЦикла;
		
		КонтрольныйРазряд11 = (КонтрольнаяСумма11 % 11) % 10;
		КонтрольныйРазряд12 = (КонтрольнаяСумма12 % 11) % 10;
		
		СоответствуетТребованиям = (КонтрольныйРазряд11 = Число(Сред(ИНН, 11, 1)) И КонтрольныйРазряд12 = Число(Сред(ИНН, 12, 1)));
		
	КонецЕсли;
	
	Если Не СоответствуетТребованиям Тогда
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
		+ НСтр("ru = 'Контрольное число для ИНН не совпадает с рассчитанным.';
		|en = 'Check digit of TIN does not match the calculated value.'");
	КонецЕсли;
	
	Возврат СоответствуетТребованиям;

КонецФункции

// Формирует текст запроса по всем полям для указанной таблицы
//
// Параметры:
//  ИмяТаблицы                - Строка - Имя таблицы
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьТекстЗапросаПоТаблице(ИмяТаблицы) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ * ИЗ " + ИмяТаблицы;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Математика

Функция МаксимальноеЗначениеВМассиве(Массив)
	
	// Рассчитываем, что на вход будет получен массив, в котором все элементы либо все положительные, либо отрицательные.
	// Поэтому для определения максимального значения сравниваем абсолютное значение элемента.
	//
	// В случае, если на вход получен массив, в котором элементы с разными знаками, то максимальное значение будет
	// определено не правильно. Но этот случай оставлен для совместимости с предыдущими версиями.
	
	МаксимальноеЗначение = 0;
	Множитель            = 1;
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		АбсолютноеЗначение = ?(Значение > 0, Значение, -Значение);
		Если МаксимальноеЗначение < АбсолютноеЗначение Тогда
			МаксимальноеЗначение = АбсолютноеЗначение;
			Множитель = ?(Значение > 0, 1, -1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение * Множитель;
	
КонецФункции

#КонецОбласти

#Область ДинамическиеСписки

Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ДобавитьЭлементПоУсловию(СпособПоиска, ЭлементОтбора, ЗначениеПоиска, МассивЭлементов);
			
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлементПоУсловию(СпособПоиска, ЭлементОтбора, ЗначениеПоиска, МассивЭлементов)

	Если СпособПоиска = 1 Тогда
		Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
			МассивЭлементов.Добавить(ЭлементОтбора);
		КонецЕсли;
	ИначеЕсли СпособПоиска = 2 Тогда
		Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
			МассивЭлементов.Добавить(ЭлементОтбора);
		КонецЕсли;
	Иначе
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти