
#Область ПрограммныйИнтерфейс

// Удаляет указанное пространство имени из заголовка файла XML
//
// Параметры:
//	СтрокаXML - Строка - Документ XML, в котором необходимо удалить пространство имен
//  ПространствоИмен - Строка - URI пространства имени удаления
//
Процедура УдалитьПространствоИменИзСтроки(СтрокаXML, ПространствоИмен) Экспорт

	СтрокаXML = СтрЗаменить(СтрокаXML, "xmlns=""" + ПространствоИмен + """", "");

КонецПроцедуры

// Создает Объект данных модели XDTO
//
// Параметры:
//   URIПространстваИмен - Строка - URI пространства имен запрашиваемого типа
//   Тип - Строка - Полный путь имени типа XDTO
//
// Возвращаемое значение:
// 	- ЗначениеXDTO
//  - ОбъектXDTO
//	- Неопределено
//
Функция СоздатьОбъектXDTO(URIПространстваИмен, Тип) Экспорт

	МассивИменТипов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Тип, ".");
	ИмяКорневогоТипа = МассивИменТипов[0];

	ТипОбъекта = ФабрикаXDTO.Тип(URIПространстваИмен, ИмяКорневогоТипа);
	СвойстваТипа = ТипОбъекта.Свойства;

	Для Индекс = 1 По МассивИменТипов.ВГраница() Цикл
		ИмяСвойства = МассивИменТипов[Индекс];
		Свойство = СвойстваТипа.Получить(ИмяСвойства);
		Если Свойство = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;

		ТипОбъекта = Свойство.Тип;
		СвойстваТипа = ТипОбъекта.Свойства;
	КонецЦикла;

	Возврат ФабрикаXDTO.Создать(ТипОбъекта);

КонецФункции

// Устанавливает значение свойства объекта XDTO
//
// Параметры:
// 	Объект - ЗначениеXDTO, ОбъектXDTO - Приемник установки значения свойства
//	ИмяСвойства - Строка - Имя устанавливаемого свойства
//	ЗначениеСвойства - Строка - Устанавливаемое значение свойства
//  Ошибки - Массив - Журнал ошибок
//  Обязательное - Булево - Признак обязательной установки значения
// 	УстанавливатьПустоеЗначение - Признак установки значения, в случае отсутствия значения
//
Процедура УстановитьЗначениеСвойстваXDTO(Объект, ИмяСвойства, ЗначениеСвойства, Ошибки, Обязательное = Ложь, УстанавливатьПустоеЗначение = Ложь) Экспорт

	Если Не ТипЗнч(ЗначениеСвойства) = Тип("ЗначениеXDTO") И Не ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
		Если Не Обязательное И Не ЗначениеЗаполнено(ЗначениеСвойства) И Не УстанавливатьПустоеЗначение Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Попытка
		Объект.Установить(ИмяСвойства, ЗначениеСвойства);
	Исключение
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон("Ошибка установки значения свойства XDTO ""%1""." + " " + ПредставлениеОшибки, ИмяСвойства);
		Ошибки.Добавить(ТекстСообщения);
		
	КонецПопытки;

КонецПроцедуры

// Устанавливает пространство имен в тексте XML
//
// Параметры:
//  ТекстXML             - Строка
//  URIПространстваИмен  - Строка
//
//
Процедура УстановитьПространствоИменПервогоЭлемента(ТекстXML, URIПространстваИмен) Экспорт
	
	Если НЕ СтрНайти(ТекстXML, URIПространстваИмен) Тогда
		
		НачальнаяПозиция = 1;
		
		ОпределениеXML = СтрНайти(ТекстXML, "<?xml");
		Если ОпределениеXML > 0 Тогда
			НачальнаяПозиция = СтрНайти(ТекстXML, "?>", , ОпределениеXML) + 2;  	
		КонецЕсли; 
		
		ПервыйТэгЗакрытие = СтрНайти(ТекстXML, ">", , НачальнаяПозиция);
		
		Если ПервыйТэгЗакрытие Тогда
			
			Отступ = 1;
			
			Если Сред(ТекстXML, ПервыйТэгЗакрытие - 1, ПервыйТэгЗакрытие) = "/>" Тогда
				Отступ = 2;
			КонецЕсли;
			
			ТекстXML = Лев(ТекстXML, ПервыйТэгЗакрытие - Отступ) + " xmlns=""" + URIПространстваИмен + """ " 
						+ Прав(ТекстXML, СтрДлина(ТекстXML) - ПервыйТэгЗакрытие + Отступ);
			
		КонецЕсли; 
		
	КонецЕсли;	
	
КонецПроцедуры

// Сериализизут переданное значение в XML с помощью глобальной фабрики XDTO
//
// Параметры:
//  Значение - Произвольный - значение для сериализации
//
Функция СериализоватьВXML(Значение) Экспорт

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение);

	Возврат ЗаписьXML.Закрыть();

КонецФункции

// Десериализизут переданный XML в значение с помощью глобальной фабрики XDTO
//
// Параметры:
//  ТекстXML		 - Строка	- исходный текст XML
//
// Возвращаемое значение:
//  Значение - Произвольный - значение, полученное из XML
//
Функция ДесериализоватьИзXML(ТекстXML) Экспорт

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возврает заполненную структуру 1с, соответствующую структуре типа объекта XDTO
//
// Параметры:
//   Данные - Структура - Значения заполнения структуры
//   ПространствоИмен - Строка - URI пространства имен запрашиваемого типа
//   ТипXDTO - Строка - Имя запрашиваемого типа
//   ЛокальноеИмя - Строка, Неопределено - Локальное имя записываемого элемента данных
//   УдалятьПространствоИмен - Булево - Признак удаления указанного пространства имени из заголовка файла XML
//   Кодировка - Строка - Устанавливает кодировку в заголовке файла XML
//   ЗаписатьОбъявлениеXML - Булево - Признак записи объявлений XML
//   ПроверитьXDTO - Булево - Признак проверки созданного объекта XDTO
//
// Возвращаемое значение:
//   Структура - Описание см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		Результат - Строка - Сформированный документ XML
//				  - Неопределено - Не удалось сформировать документ XML
//
Функция ПолучитьXMLПоСтруктуре(Данные, ПространствоИмен, ТипXDTO,
							ЛокальноеИмя = Неопределено, УдалятьПространствоИмен = Ложь,
							Кодировка = "", ЗаписатьОбъявлениеXML = Ложь, ПроверитьXDTO = Истина) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();

	Попытка

		ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПространствоИмен, ТипXDTO);
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO, Данные);
		
		Если ПроверитьXDTO Тогда
			ОбъектXDTO.Проверить();
		КонецЕсли;

		ЗаписьXML = Новый ЗаписьXML;
		Если ПустаяСтрока(Кодировка) Тогда
			ЗаписьXML.УстановитьСтроку();
		Иначе
			ЗаписьXML.УстановитьСтроку(Кодировка);
		КонецЕсли;
		Если ЗаписатьОбъявлениеXML Тогда
				ЗаписьXML.ЗаписатьОбъявлениеXML();
		КонецЕсли;
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ЛокальноеИмя);
		СтрокаXML = ЗаписьXML.Закрыть();

		Если (УдалятьПространствоИмен) Тогда
			СтрокаXML = СтрЗаменить(СтрокаXML, "xmlns=""" + ПространствоИмен + """", "");
		КонецЕсли;

		Ответ.Результат = СтрокаXML;
		Ответ.Успех = Истина;

	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка формирования XML", "XM-00019", ОписаниеОшибки);

	КонецПопытки;

	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO, Данные)

	Для Каждого ЭлементКоллекцииСвойств Из ОбъектXDTO.Свойства() Цикл

		ЭлементДанных = ОбъектXDTO[ЭлементКоллекцииСвойств.Имя];

		Если ТипЗнч(ЭлементДанных) = Тип("СписокXDTO")
			И Данные.Свойство(ЭлементКоллекцииСвойств.Имя)
				И ТипЗнч(Данные[ЭлементКоллекцииСвойств.Имя]) = Тип("Массив") Тогда

			ОбработатьЭлементДанныхСписокXDTO(Данные, ЭлементКоллекцииСвойств, ЭлементДанных);		

		ИначеЕсли ТипЗнч(ЭлементКоллекцииСвойств.Тип) = Тип("ТипОбъектаXDTO") И ТипЗнч(ЭлементДанных) <> Тип("СписокXDTO") Тогда

			Если Данные.Свойство(ЭлементКоллекцииСвойств.Имя) Тогда
				ОбъектXDTO[ЭлементКоллекцииСвойств.Имя] = ФабрикаXDTO.Создать(ЭлементКоллекцииСвойств.Тип);
				ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO[ЭлементКоллекцииСвойств.Имя],
														Данные[ЭлементКоллекцииСвойств.Имя]);
			КонецЕсли;

		ИначеЕсли ТипЗнч(ЭлементКоллекцииСвойств.Тип) = Тип("ТипЗначенияXDTO") И Данные.Свойство(ЭлементКоллекцииСвойств.Имя)
			И (ЭлементКоллекцииСвойств.ВозможноПустое Или ЗначениеЗаполнено(Данные[ЭлементКоллекцииСвойств.Имя])) Тогда
			
			ЗаполнитьЗначенияСвойств(ОбъектXDTO, Данные, ЭлементКоллекцииСвойств.Имя);
				
		Иначе 
			Продолжить;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьЭлементДанныхСписокXDTO(Данные, ЭлементКоллекцииСвойств, ЭлементДанных)

	Для Каждого СтрокаДанных Из Данные[ЭлементКоллекцииСвойств.Имя] Цикл
		НовыйЭлемент = ФабрикаXDTO.Создать(ЭлементКоллекцииСвойств.Тип);
		Если НовыйЭлемент = Неопределено Тогда
			// Это конечный элемент
			НовыйЭлемент = СтрокаДанных;
		Иначе
			// Рекурсивно заполняем дальше
			ЗаполнитьОбъектXDTOПоСтруктуре(НовыйЭлемент, СтрокаДанных);
		КонецЕсли;
		ЭлементДанных.Добавить(НовыйЭлемент);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
