////////////////////////////////////////////////////////////////////////////////
// Логирование (вызов сервера)
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Формирует табличный документ описания ошибок
//
// Параметры: 
//	ТаблицаОшибок - ТаблицаЗначений - Таблица с указанием наименований и значений реквзитов ошибок,
//									где наименование реквизита - представление колонки таблицы значений,
//									значение реквизита - значение в строке и колонке таблицы значений 
// Возвращаемое значение:
//   ТабличныйДокумент - заполненный макет описания логов
//  
//
Функция ПолучитьТабличныйДокументОписанияЛогов(Знач ТаблицаОшибок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("ККСНГ_ОписаниеЛогов");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьОтправитель = Макет.ПолучитьОбласть("ОбластьОтправитель");
	ОбластьДетали = Макет.ПолучитьОбласть("ОбластьДетали");
	ОбластьОшибка = Макет.ПолучитьОбласть("ОбластьОшибка");
	
	ОбластьШапка.Параметры.ДатаФормирования = ТекущаяДатаСеанса();
	ТабличныйДокумент.Вывести(ОбластьШапка);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.НомерДокумента КАК НомерДокумента,
	|	Таблица.ДатаДокумента КАК ДатаДокумента,
	|	Таблица.ИННОтправителя КАК ИННОтправителя,
	|	Таблица.ИННПолучателя КАК ИННПолучателя,
	|	Таблица.ТипДокумента КАК ТипДокумента,
	|	Таблица.ВерсияФормата КАК ВерсияФормата,
	|	Таблица.ОтветСервера КАК ОтветСервера,
	|	Таблица.ТекстСообщения КАК ТекстСообщения,
	|	Таблица.Обработать КАК Обработать,
	|	Таблица.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	Таблица.ТекстСообщенияБезДокумента КАК ТекстСообщенияБезДокумента
	|ПОМЕСТИТЬ Ошибки
	|ИЗ
	|	&ТаблицаОшибок КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ошибки.НомерДокумента КАК НомерДокумента,
	|	Ошибки.ДатаДокумента КАК ДатаДокумента,
	|	Ошибки.ИННОтправителя КАК ИННОтправителя,
	|	Ошибки.ИННПолучателя КАК ИННПолучателя,
	|	Ошибки.ТипДокумента КАК ТипДокумента,
	|	Ошибки.ВерсияФормата КАК ВерсияФормата,
	|	Ошибки.ОтветСервера КАК ОтветСервера,
	|	Ошибки.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	Ошибки.ТекстСообщенияБезДокумента КАК ТекстСообщенияБезДокумента
	|ИЗ
	|	Ошибки КАК Ошибки";
	
	Запрос.УстановитьПараметр("ТаблицаОшибок", ТаблицаОшибок);
	
	ТаблицаДетали = Запрос.Выполнить().Выгрузить();	
	
	ТаблицаОтправитель = ТаблицаДетали.Скопировать();
	ТаблицаОтправитель.Свернуть("ИННОтправителя,ИННПолучателя", "");
	ТаблицаОшибка = ТаблицаДетали.Скопировать();
	ТаблицаОшибка.Свернуть("ОтветСервера,ИННОтправителя,ИННПолучателя,ТекстСообщенияБезДокумента", "");
	
	Для каждого СтрокаОтправитель Из ТаблицаОтправитель Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьОтправитель.Параметры, СтрокаОтправитель);
		ТабличныйДокумент.Вывести(ОбластьОтправитель);
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИННОтправителя", СтрокаОтправитель.ИННОтправителя);
		ПараметрыОтбора.Вставить("ИННПолучателя", СтрокаОтправитель.ИННПолучателя);
		
		СтрокиОшибки = ТаблицаОшибка.НайтиСтроки(ПараметрыОтбора);
		Для каждого СтрокаОшибки Из СтрокиОшибки Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьОшибка.Параметры, СтрокаОшибки);
			ТабличныйДокумент.Вывести(ОбластьОшибка);
			
			ПараметрыОтбора.Вставить("ОтветСервера", СтрокаОшибки.ОтветСервера);
			ПараметрыОтбора.Вставить("ТекстСообщенияБезДокумента", СтрокаОшибки.ТекстСообщенияБезДокумента);
			СтрокиДеталей = ТаблицаДетали.НайтиСтроки(ПараметрыОтбора);
			Для каждого СтрокаДетали Из СтрокиДеталей Цикл
				ЗаполнитьЗначенияСвойств(ОбластьДетали.Параметры, СтрокаДетали);
				ТабличныйДокумент.Вывести(ОбластьДетали);				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполнение информации по ошибке из сообщения журнала
//
// Параметры: 
//	ОтветПоОшибке - Структура - структура для заполнения формата ПолучитьСтруктуруИнформацииОбОшибкеПриОтправкеДокумента()
//  Сообщение - Сообщение журнала
//  ПрофильНастройкиЭДО - Ссылка на организацию-отправитель
//  
//
Процедура ИнициализироватьДанныеОшибки(ОтветПоОшибке, Сообщение, ПрофильНастройкиЭДО = Неопределено) Экспорт

	Данные = Сообщение.Данные;
	ДанныеЭтоДокумент = Ложь;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		ТипЗначения = ТипЗнч(Данные);
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
			ОтветПоОшибке.ДатаДокумента = Данные.Дата;
			ОтветПоОшибке.НомерДокумента = Данные.Номер;
			ОтветПоОшибке.ПредставлениеДокумента  = ОбъектМетаданных.Синоним;
			ДанныеЭтоДокумент = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрофильНастройкиЭДО) И ЗначениеЗаполнено(ПрофильНастройкиЭДО.Организация) Тогда
		ОтветПоОшибке.ИННОтправителя = ПрофильНастройкиЭДО.Организация.ИНН;
	КонецЕсли;
	
	ОтветПоОшибке.ОтветСервера = Сообщение.КодОшибки;
	ОтветПоОшибке.ТекстСообщения = Сообщение.Событие + " " + Сообщение.Комментарий;	
	
	Если ДанныеЭтоДокумент Тогда
	    ОтветПоОшибке.ТекстСообщенияБезДокумента = СтрЗаменить(ОтветПоОшибке.ТекстСообщения, Строка(Данные), "");
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбщийМодульПолучениеДанных = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПолучениеДанных");
	Ответ = ОбщийМодульПолучениеДанных.ПолучитьПредставлениеЭД(Данные);	
	Если Ответ.Успех Тогда
		ЗаполнитьОтветПоОшибке(Ответ, ОтветПоОшибке, ПрофильНастройкиЭДО);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру для формирования записи лога из сообщения журнала
//
// Возвращаемое значение:
//   Структура
//
Функция ПолучитьСтруктуруИнформацииОбОшибкеПриОтправкеДокумента() Экспорт

	СтруктураОтвета = Новый Структура;	
	СтруктураОтвета.Вставить("ДатаДокумента");
	СтруктураОтвета.Вставить("НомерДокумента");
	СтруктураОтвета.Вставить("ИННОтправителя");
	СтруктураОтвета.Вставить("ИННПолучателя");
	СтруктураОтвета.Вставить("ТипДокумента");
	СтруктураОтвета.Вставить("ОтветСервера");
	СтруктураОтвета.Вставить("ТекстСообщения");
	СтруктураОтвета.Вставить("ВерсияФормата");
	СтруктураОтвета.Вставить("ПредставлениеДокумента");
	СтруктураОтвета.Вставить("ТекстСообщенияБезДокумента");
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОтветПоОшибке(Ответ, ОтветПоОшибке, ПрофильНастройкиЭДО)

	Если ЗначениеЗаполнено(Ответ.Результат.ПолучательЭД) И ТипЗнч(Ответ.Результат.ПолучательЭД) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОтветПоОшибке.ИННПолучателя = Ответ.Результат.ПолучательЭД.ИНН;	
	КонецЕсли;
	
	ОтветПоДополнению = ККСНГ_ОтправкаЭДВызовСервера.ДополнитьДанныеДокументаДаннымиЭДО(Ответ.Результат, ПрофильНастройкиЭДО);
	Если ОтветПоДополнению.Успех Тогда
		ОтветПоФормату = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеФорматаДокументаЭД(Ответ.Результат);	
		Если ОтветПоФормату.Успех Тогда
			ОтветПоОшибке.ТипДокумента = ОтветПоФормату.Результат.Идентификатор;	
			ОтветПоОшибке.ВерсияФормата = ОтветПоФормату.Результат.ВерсияФормата;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти