
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОтборПоАктивностиСертификатов", УстановленОтборПоАктивности);
		
	СписокИздателейСертификатов = Неопределено;
	Если Параметры.Свойство("СписокИздателейСертификатов", СписокИздателейСертификатов) Тогда
		УстановленОтборПоИздателю = ТипЗнч(СписокИздателейСертификатов) = Тип("СписокЗначений"); 
		
	Иначе
		Элементы.ДоступныеСертификатыПоказатьВсехИздателей.Видимость = Ложь;
		
	КонецЕсли;
	
	ДополнительныеОтборы = Неопределено;
	Если Параметры.Свойство("ДополнительныеОтборы", ДополнительныеОтборы) Тогда
		УстановленыДополнительныеОтборы = ТипЗнч(ДополнительныеОтборы) = Тип("Массив"); 
	КонецЕсли;
	
	ЗаполнитьТаблицуДоступныхСертификатов(Параметры.СписокСертификатов, СписокИздателейСертификатов, ДополнительныеОтборы);
	
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборыСертификатов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоступныеСертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ВыбратьСертификат();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаДляПереходаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке(Элемент.Заголовок);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьСертификат();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоИздателям(Команда)
	
	УстановленОтборПоИздателю = НЕ УстановленОтборПоИздателю;
	
	Элементы.ДоступныеСертификатыПоказатьВсехИздателей.Пометка = НЕ УстановленОтборПоИздателю;
	
	УстановитьОтборыСертификатов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказатьАктивные(Команда)
	
	УстановленОтборПоАктивности = Истина;
	УстановитьОтборыСертификатов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказатьВсе(Команда)
	
	УстановленОтборПоАктивности = Ложь;
	УстановитьОтборыСертификатов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));

    // Условие
	ЭлементУсловия  = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоступныеСертификаты.СоответствуетОтборуАктивность");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;

	// Поле
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДоступныеСертификаты");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДоступныхСертификатов(СписокСертификатов, СписокИздателейСертификатов, ДополнительныеОтборы)
	
	ДоступныеСертификаты.Очистить();
	
	Для каждого ТекЭлемент Из СписокСертификатов Цикл
		ТекСертификат = ТекЭлемент.Значение;
		СтрокаСертификата = ДоступныеСертификаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСертификата, ТекСертификат);
		СтрокаСертификата.СвойстваСертификата = ТекСертификат;
				
		УстановитьСоответствиеСертификатаОтбору(СтрокаСертификата, СписокИздателейСертификатов, ДополнительныеОтборы);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеСертификатаОтбору(СтрокаСертификата, СписокИздателей = Неопределено, ДополнительныеОтборы = Неопределено)
	
	Перем СвойстваСертификата, ТекущаяДатаСеанса, ИздательИНН;
	
	СвойстваСертификата = СтрокаСертификата.СвойстваСертификата;
	
	// Срок действия и УКЭП (активность сертификата)
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	Если СтрокаСертификата.ДатаОкончания > ТекущаяДатаСеанса И ЗначениеЗаполнено(ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСертификата, "СНИЛС", "")) Тогда
		СтрокаСертификата.СоответствуетОтборуАктивность = Истина;
	КонецЕсли;
	
	// Издатели
	Если ТипЗнч(СписокИздателей) = Тип("СписокЗначений") Тогда
		ИздательИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСертификата, "ИздательСтруктурой.OID1_2_643_100_4");
		Если ПустаяСтрока(ИздательИНН) Тогда
			ИздательИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСертификата, "ИздательСтруктурой.OID1_2_643_3_131_1_1");
		КонецЕсли;
		СтрокаСертификата.СоответствуетОтборуИздатель = СписокИздателей.НайтиПоЗначению(ИздательИНН) <> Неопределено;
	Иначе
		СтрокаСертификата.СоответствуетОтборуИздатель = Истина;
	КонецЕсли;
	
	// Дополнительные отборы
	Если ТипЗнч(ДополнительныеОтборы) = Тип("Массив") Тогда
		СтрокаСертификата.СоответствуетОтборуДопОтборы = СертификатСоответствуетОтбору(СвойстваСертификата, ДополнительныеОтборы);
	Иначе
		СтрокаСертификата.СоответствуетОтборуДопОтборы = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СертификатСоответствуетОтбору(ТекСертификат, ОтборСертификатов)
	
	РезультатПроверки = Истина;
	
	Для каждого ТекОтбор Из ОтборСертификатов Цикл
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекСертификат, ТекОтбор.ЛевоеЗначение) <> ТекОтбор.ПравоеЗначение Тогда
			РезультатПроверки = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборыСертификатов()
	
	СтруктураОтбора = Новый Структура;
	
	Если УстановленОтборПоАктивности Тогда
		
		Элементы.ДоступныеСертификатыГруппаОтборАктивность.Заголовок = "Показать: " + Элементы.ДоступныеСертификатыКнопкаПоказатьАктивные.Заголовок;
		
		СтруктураОтбора.Вставить("СоответствуетОтборуАктивность", Истина);	
		
	Иначе
		
		Элементы.ДоступныеСертификатыГруппаОтборАктивность.Заголовок =  "Показать: " + Элементы.ДоступныеСертификатыКнопкаПоказатьВсе.Заголовок;

	КонецЕсли;
	
	Элементы.ДоступныеСертификатыКнопкаПоказатьАктивные.Пометка = УстановленОтборПоАктивности;
	Элементы.ДоступныеСертификатыКнопкаПоказатьВсе.Пометка = НЕ УстановленОтборПоАктивности;
	
	Если УстановленОтборПоИздателю Тогда
		
		СтруктураОтбора.Вставить("СоответствуетОтборуИздатель", Истина);
		
	КонецЕсли;
			
	Если УстановленыДополнительныеОтборы Тогда
		
		СтруктураОтбора.Вставить("СоответствуетОтборуДопОтборы", Истина);
		
	КонецЕсли;
	
	Элементы.ДоступныеСертификаты.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
	ДоступныеСертификаты.Сортировать("СоответствуетОтборуАктивность убыв, ДатаОкончания убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСертификат()
	
	ОчиститьСообщения();
	ТекСтрока = Элементы.ДоступныеСертификаты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
	    ВыбранныйСертификат = ТекСтрока.СвойстваСертификата;
		Закрыть(ВыбранныйСертификат);
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Выберите, пожалуйста, сертификат.";
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти