#Область ПрограммныйИнтерфейс

#Область СтруктурыДанных

// Возвращает структуру с ключами, аналогичными полям указанного типа XDTO
//
// Параметры:
//	ТипXDTO - строка с именем типа или тип объекта XDTO
//	ПространствоИмен - пространство имен
//
// Возвращаемое значение:
//	Структура
//
// Пример:
//	СтруктураДокумента = ПолучитьСтруктуруПоТипуXDTO("type_Document", "http://schemas.datacontract.org/2004/07/Korus.Eds.Api");
//
Функция ПолучитьСтруктуруПоТипуXDTO(Знач ТипXDTO, Знач ПространствоИмен = "") Экспорт
	
	Результат =  Новый Структура;
	
	Если (ТипЗнч(ТипXDTO) = Тип("Строка")) Тогда
		
		ИменаТипов = СтрРазделить(ТипXDTO, ".", Ложь);
		
		Если ИменаТипов.Количество() > 0 Тогда
			
			ПространствоИмен = ?(ЗначениеЗаполнено(ПространствоИмен), ПространствоИмен, ПолучитьПространствоИменПоУмолчанию());
			
			ТипXDTO = ФабрикаXDTO.Тип(ПространствоИмен, ИменаТипов[0]);
			ИменаТипов.Удалить(0);
			
			Для каждого ИмяТипа Из ИменаТипов Цикл
				
				Свойство = ТипXDTO.Свойства.Получить(ИмяТипа);
				
				Если Свойство = Неопределено Тогда
					Возврат Результат;
				КонецЕсли;
				
				ТипXDTO = Свойство.Тип;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли (ТипЗнч(ТипXDTO) <> Тип("ТипОбъектаXDTO")) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипXDTO);
	
	Для каждого ЭлементКоллекцииСвойств Из ОбъектXDTO.Свойства() Цикл
		
		ЭлементДанных = ОбъектXDTO[ЭлементКоллекцииСвойств.Имя];
		Если (ТипЗнч(ЭлементДанных) = Тип("СписокXDTO")) Тогда
			
			Список = Новый Массив;
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, Список);
			
		ИначеЕсли (ТипЗнч(ЭлементКоллекцииСвойств.Тип) = Тип("ТипОбъектаXDTO")) Тогда
			
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, ПолучитьСтруктуруПоТипуXDTO(ЭлементКоллекцииСвойств.Тип));
			
		Иначе
			
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, ЭлементДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область МетодыАутентификации

// Вызов метода LogonByApiKey API СФЕРА Курьер
//	См. https://confluence.esphere.ru/display/SBER/LogonByApiKey
//
// Параметры:
//	Key - строка, ключ доступа к API
//
// Возвращаемое значение:
//	структура LogonResponse, см. https://confluence.esphere.ru/display/SBER/LogonResponse
//
Функция v1_LogonByApiKey(Key) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса();
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/auth/logonByApiKey/";
	СтруктураЗапроса.Параметры.Вставить("key", Key);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_LogonResponse",
														"Вызов API сервиса ЭДО: LogonByApiKey");

КонецФункции

// Вызов метода Logon API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Logon
//
// Параметры:
//	Credentials - структура Credentials, см. https://confluence.esphere.ru/display/SBER/Credentials
//
// Возвращаемое значение:
//	структура LogonResponse, см. https://confluence.esphere.ru/display/SBER/LogonResponse
//
Функция v1_Logon(Credentials) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса();
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/auth/logon/";

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(Credentials, "type_Credentials", "Credentials", Истина);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_LogonResponse", "Вызов API сервиса ЭДО: Logon");

КонецФункции

#КонецОбласти

#Область ПолучениеИнформацииОКлиенте

// Вызов метода v2.0.client.self API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/v2.0.client.self
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Структура Company, см. https://confluence.esphere.ru/display/SBER/Company
//
Функция v2_ClientSelf(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client/self";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Company", "Вызов API сервиса ЭДО: v2.0.client.self");

КонецФункции

// Вызов метода v2.0.client API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/v2.0.client
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Inn			- ИНН клиента
//	Ogrn		- ОГРН клиента
//	Kpp			- КПП клиента
//	Filter		- Свойства фильтра (в данный момент не используется)
//	Skip		- Параметры постраничной выборки данных
//	Take		- Количество строк
//
// Возвращаемое значение:
//	Массив структур Company, см. https://confluence.esphere.ru/display/SBER/Company
//
Функция v2_Client(ПараметрыАвторизации, Inn = "", Ogrn = "", Kpp = "", Filter = Неопределено, Skip = 0, Take = 20) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client";
	СтруктураЗапроса.Параметры.Вставить("Inn",  Inn);
	СтруктураЗапроса.Параметры.Вставить("Ogrn", Ogrn);
	СтруктураЗапроса.Параметры.Вставить("Kpp",  Kpp);
	СтруктураЗапроса.Параметры.Вставить("Skip", Skip);
	СтруктураЗапроса.Параметры.Вставить("Take", Take);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfCompany", "Вызов API сервиса ЭДО: v2.0.client");

КонецФункции

// Вызов метода Dictionary.FindClient API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Dictionary.FindClient
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	ClientSearchInfo	- структура ClientSearchInfo, см. https://confluence.esphere.ru/display/SBER/ClientSearchInfo
//
// Возвращаемое значение:
//	Структура Company, см. https://confluence.esphere.ru/display/SBER/Company
//
// Пример:
//	ClientSearchInfo = ПолучитьСтруктуруПоТипуXDTO("type_ClientSearchInfo");
//	ClientSearchInfo.Inn = ИНН;
//	ClientSearchInfo.Kpp = КПП;
//	ClientSearchInfo.Ogrn = ОГРН;
//	РезультатВызова = FindClient(ClientSearchInfo);
//
Функция v1_FindClient(ПараметрыАвторизации, ClientSearchInfo) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/dictionary/findClient";

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(ClientSearchInfo, "type_ClientSearchInfo",
														"ClientSearchInfo", Истина);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Company",
													"Вызов API сервиса ЭДО: Dictionary.FindClient");

КонецФункции

// Вызов метода Dictionary.ContractorDocumentTypes API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Dictionary.ContractorDocumentTypes
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	ClientSearchInfo	- структура ClientSearchInfo, см. https://confluence.esphere.ru/display/SBER/ClientSearchInfo
//
// Возвращаемое значение:
//	Массив структур ContractorDocumentTypes, см. https://confluence.esphere.ru/display/SBER/ContractorDocumentTypes
//
Функция v1_ContractorDocumentTypes(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/dictionary/contractorDocumentTypes";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfContractorDocumentTypes",
													"Вызов API сервиса ЭДО: Dictionary.ContractorDocumentTypes");

КонецФункции

// Вызов метода Client.Discover v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/v2.0.client.discover
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	ClientDiscovery - массив структур ClientDiscovery см.https://confluence.esphere.ru/display/SBER/ClientDiscovery
//
// Возвращаемое значение:
//	ClientRelation см. https://confluence.esphere.ru/display/SBER/ClientRelation
//
Функция v2_ClientDiscover(ПараметрыАвторизации, ClientDiscovery) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.ПараметрыСоединения.Вставить("Таймаут", 300);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client/discover";

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(ClientDiscovery,
								"type_ArrayOfClientDiscovery", "ArrayOfClientDiscovery");

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfClientRelation",
														"Вызов API сервиса ЭДО: Client.Discover v.2");

КонецФункции

// Вызов метода Dictionary.Client API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Dictionary.Client
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	ClientDiscovery - массив структур ClientDiscovery см.https://confluence.esphere.ru/display/SBER/ClientDiscovery
//	id - число, идентификатор контрагента.
//
// Возвращаемое значение:
//	Структура Company, см. https://confluence.esphere.ru/display/SBER/Company
//
Функция v1_DictionaryClient(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/dictionary/client/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Company",
													"Вызов API сервиса ЭДО: Dictionary.Company");

КонецФункции

// Вызов метода v2.0.documentType API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/TypeDocument+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	Массив структур DocumentType, см. https://confluence.esphere.ru/display/SBER/DocumentType
//
Функция v2_TypeDocument(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/documentType";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentType",
														"Вызов API сервиса ЭДО: v2.0.DocumentType");

КонецФункции

// Вызов метода v2.0 client.ediCode API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/v2.0+client.ediCode
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	inn - строка, ИНН получателя
//	kpp - строка, КПП получателя
//	documentTypeCode - строка, код типа документа
//	hasRelation - булево, признак поиска только активных связей
//
// Возвращаемое значение:
//	Структура ClientEdiCode, см. https://confluence.esphere.ru/display/SBER/ClientEdiCode
//
Функция v2_СlientEdiCode(ПараметрыАвторизации, inn, kpp, documentTypeCode, hasRelation) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client/ediCode";
	СтруктураЗапроса.Параметры.Вставить("inn", inn);
	СтруктураЗапроса.Параметры.Вставить("kpp", kpp);
	СтруктураЗапроса.Параметры.Вставить("documentTypeCode",  documentTypeCode);
	СтруктураЗапроса.Параметры.Вставить("hasRelation", Формат(hasRelation, "БЛ=false; БИ=true"));

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ClientEdiCode",
													"Вызов API сервиса ЭДО: v2.0 client.ediCode");

КонецФункции

// Вызов метода v2.0 client.ediCodes API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/v2.0+client.ediCodes
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	inn - строка, ИНН получателя
//	kpp - строка, КПП получателя
//
// Возвращаемое значение:
//	Массив ClientEdiCode, см. https://confluence.esphere.ru/display/SBER/ClientEdiCode
//
Функция v2_СlientEdiCodes(ПараметрыАвторизации, inn, kpp) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client/ediCodes";
	СтруктураЗапроса.Параметры.Вставить("inn", inn);
	СтруктураЗапроса.Параметры.Вставить("kpp", kpp);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfClientEdiCode", "Вызов API сервиса ЭДО: v2.0 client.ediCodes");

КонецФункции

// Вызов метода v2.0 client.ediCode API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/v2.0+client.ediCode
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	receiverId - число, идентификатор получателя
//	documentTypeId - число, идентификатор типа документа
//
// Возвращаемое значение:
//	Структура ClientEdiCode, см. https://confluence.esphere.ru/display/SBER/ClientEdiCode
//
Функция v2_СlientEdiCodeByID(ПараметрыАвторизации, receiverId, documentTypeId) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client/ediCode";
	СтруктураЗапроса.Параметры.Вставить("receiverId",     receiverId);
	СтруктураЗапроса.Параметры.Вставить("documentTypeId", documentTypeId);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ClientEdiCode",
													"Вызов API сервиса ЭДО: v2.0 client.ediCode");

КонецФункции

// Вызов метода v2.0 client.{code} API СФЕРА Курьер
// См. https://confluence.esphere.ru/pages/viewpage.action?pageId=81694796
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	code - строка, идентификатор участника ЭДО
//
// Возвращаемое значение:
//	Структура Company, см. https://confluence.esphere.ru/display/SBER/Company
//
Функция v2_СlientCode(ПараметрыАвторизации, code) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/client/code/{code}";
	СтруктураЗапроса.Параметры.Вставить("code", code);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Company",
													"Вызов API сервиса ЭДО: v2.0 client.{code}");

КонецФункции

#КонецОбласти

#Область РаботаСТипамиДокументов

// Вызов метода v2.0 DocumentType.Code API СФЕРА Курьер
// https://confluence.esphere.ru/display/SBER/TypeDocument.Code+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	code - строка, код типа документая
//
// Возвращаемое значение:
//	Структура DocumentType, см. https://confluence.esphere.ru/display/SBER/DocumentType
//
Функция v2_TypeDocumentCode(ПараметрыАвторизации, code) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/documentType/code:{code}";
	СтруктураЗапроса.Параметры.Вставить("code", code);
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_DocumentType",
													"Вызов API сервиса ЭДО: v2.0 DocumentType.Code");

КонецФункции

#КонецОбласти

#Область РаботаСПодписками

// Вызов метода Subscription.Add v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.Add+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	isRestricted - булево, признак подписки с ограниченным доступом
//
// Возвращаемое значение:
//	структура Subscription, см. https://confluence.esphere.ru/display/SBER/Subscription
//
Функция v2_SubscriptionAdd(ПараметрыАвторизации, isRestricted) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "PUT";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription";
	СтруктураЗапроса.Параметры.Вставить("isRestricted", Формат(isRestricted, "БЛ=false; БИ=true"));

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Subscription",
													"Вызов API сервиса ЭДО: Subscription.Add v.2.0");

КонецФункции

// Вызов метода Subscription.DeleteEvents v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.DeleteEvents+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	token - строка, токен подписки.
//	ArrayOflong - массив, список идентификаторов событий, которые необходимо удалить
//
// Возвращаемое значение:
//	нет
//
Функция v2_SubscriptionDeleteEvents(ПараметрыАвторизации, token, ArrayOfLong) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "DELETE";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription/{token}/event";
	СтруктураЗапроса.Параметры.Вставить("token", token);

	НоваяЗапись = Новый ЗаписьXML;
	НоваяЗапись.УстановитьСтроку();
	НоваяЗапись.ЗаписатьОбъявлениеXML();
	НоваяЗапись.ЗаписатьНачалоЭлемента("ArrayOflong");
	НоваяЗапись.ЗаписатьСоответствиеПространстваИмен("i", "http://www.w3.org/2001/XMLSchema-instance");
	НоваяЗапись.ЗаписатьСоответствиеПространстваИмен("", "http://schemas.microsoft.com/2003/10/Serialization/Arrays");
	Для каждого Элемент Из ArrayOfLong Цикл
		НоваяЗапись.ЗаписатьНачалоЭлемента("long");
		НоваяЗапись.ЗаписатьТекст(XMLСтрока(Элемент));
		НоваяЗапись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	НоваяЗапись.ЗаписатьКонецЭлемента();
	СтруктураЗапроса.Тело = НоваяЗапись.Закрыть();

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Subscription.DeleteEvents v.2.0");

КонецФункции

// Вызов метода Subscription.DeleteEvent v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.DeleteEvent+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	token - строка, токен подписки.
//	eventId - число, идентификатор события, которое необходимо удалить
//
// Возвращаемое значение:
//	нет
//
Функция v2_SubscriptionDeleteEvent(ПараметрыАвторизации, token, eventId) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "DELETE";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription/{token}/event/{eventId}";
	СтруктураЗапроса.Параметры.Вставить("token", token);
	СтруктураЗапроса.Параметры.Вставить("eventId", eventId);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Subscription.DeleteEvent v.2.0");

КонецФункции

// Вызов метода Subscription.Delete v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.Delete+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	token - строка, уникальный токен подписки
//
// Возвращаемое значение:
//	нет
//
Функция v2_SubscriptionDelete(ПараметрыАвторизации, token) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "DELETE";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription/{token}";
	СтруктураЗапроса.Параметры.Вставить("token", token);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Subscription.Delete v.2.0");

КонецФункции

// Вызов метода Subscription.Events.Totals v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.Events.Totals+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	token - строка, токен подписки
//	count - число, количество событий которое необходимо вернуть
//
// Возвращаемое значение:
//	структура DocumentEvents, см. https://confluence.esphere.ru/display/SBER/DocumentEvents
//
Функция v2_SubscriptionEventsTotals(ПараметрыАвторизации, token, count = 0) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription/{token}/event/totals";
	СтруктураЗапроса.Параметры.Вставить("token", token);
	Если ЗначениеЗаполнено(count) Тогда
		СтруктураЗапроса.Параметры.Вставить("count", count);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_DocumentEvents",
														"Вызов API сервиса ЭДО: Subscription.Events.Totals v.2.0");

КонецФункции

// Вызов метода Subscription.Events v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.Events+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	token - строка, токен подписки
//	count - число, количество событий которое необходимо вернуть
//
// Возвращаемое значение:
//	массив структур DocumentEvent, см. https://confluence.esphere.ru/display/SBER/DocumentEvent
//
Функция v2_SubscriptionEvents(ПараметрыАвторизации, token, count = 0) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription/{token}/event";
	СтруктураЗапроса.Параметры.Вставить("token", token);
	Если ЗначениеЗаполнено(count) Тогда
		СтруктураЗапроса.Параметры.Вставить("count", count);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentEvent",
														"Вызов API сервиса ЭДО: Subscription.Events v.2.0");

КонецФункции

// Вызов метода Subscription.GetSubscriptionDetails v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.GetSubscriptionDetails+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	token - строка, токен подписки
//
// Возвращаемое значение:
//	структура Subscription, см. https://confluence.esphere.ru/display/SBER/Subscription
//
Функция v2_SubscriptionGetSubscriptionDetails(ПараметрыАвторизации, token) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription/{token}";
	СтруктураЗапроса.Параметры.Вставить("token", token);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Subscription",
														"Вызов API сервиса ЭДО: Subscription.GetSubscriptionDetails v.2.0");

КонецФункции

// Вызов метода Subscription.GetSubscriptions v.2.0 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Subscription.GetSubscriptions+v.2.0
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	массив структур Subscription, см. https://confluence.esphere.ru/display/SBER/Subscription
//
Функция v2_SubscriptionGetSubscriptions(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/subscription";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfSubscription",
														"Вызов API сервиса ЭДО: Subscription.GetSubscriptions v.2.0");

КонецФункции

#КонецОбласти

#Область РаботаССобытиями

// Вызов метода Event.GetDocumentEvents API СФЕРА Курьер
// https://confluence.esphere.ru/display/SBER/GetDocumentEvents
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Id - число, идентификатор документа
//
// Возвращаемое значение:
//	массив структур DocumentEvent, https://confluence.esphere.ru/display/SBER/DocumentEvent
//
Функция	v1_getDocumentEvents(ПараметрыАвторизации, Id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/event/getDocumentEvents/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", Id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentEvent",
														"Вызов API сервиса ЭДО: Event.GetDocumentEvents");

КонецФункции

// Вызов метода Event.events-index API СФЕРА Курьер
// https://confluence.esphere.ru/display/SBER/events-index
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор последнего события
//	count - число, количество событий которое необходимо вернуть
//
// Возвращаемое значение:
//	массив структур DocumentEvent, https://confluence.esphere.ru/display/SBER/DocumentEvent
//
Функция	v1_events_index(ПараметрыАвторизации, id, count = 0) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/events/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	
	Если ЗначениеЗаполнено(count) Тогда
		СтруктураЗапроса.Параметры.Вставить("count", count);
	КонецЕсли;
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentEvent",
														"Вызов API сервиса ЭДО: Event.events-index");

КонецФункции

// Вызов метода Event.GetLastEventId API СФЕРА Курьер
// https://confluence.esphere.ru/display/SBER/GetLastEventId
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
// Возвращаемое значение:
//	Идентификатор последнего события.
//
Функция	v1_GetLastEventId(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/event/getlasteventid";
	 
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "long",
														"Вызов API сервиса ЭДО: Event.events-index");
КонецФункции

#КонецОбласти

#Область РаботаСКвитанциями

// Вызов метода Ticket.AcceptAvoidanceRequest v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.AcceptAvoidanceRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	signature - структура Signature, см. https://confluence.esphere.ru/display/SBER/Signature
//
// Возвращаемое значение:
//	нет
//
Функция v2_TicketAcceptAvoidanceRequest(ПараметрыАвторизации, id, signature) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/ticket/{id}/acceptAvoidanceRequest";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(signature, "type_Signature", "signature");

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, ,
													"Вызов API сервиса ЭДО: Ticket.AcceptAvoidanceRequest v.2");

КонецФункции

// Вызов метода Ticket.Add API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.Add
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор транспортного документа в ответ на который формируется квитанция
//	ticket - структура SignedContent, см. https://confluence.esphere.ru/display/SBER/SignedContent
//
// Возвращаемое значение:
//	нет
//
Функция v1_TicketAdd(ПараметрыАвторизации, id, ticket) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/add/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(ticket, "type_SignedContent", "SignedContent", Истина);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Ticket.Add");

КонецФункции

// Вызов метода Ticket.CreateAcceptenceCertificateAcceptTicket API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.CreateAcceptenceCertificateAcceptTicket
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор транспортного документа.(параметр Id из структуры TicketDetails)
//	data - структура AcceptanceCertificateAcceptInfo, см. https://confluence.esphere.ru/display/SBER/AcceptanceCertificateAcceptInfo
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v1_TicketCreateAcceptenceCertificateAcceptTicket(ПараметрыАвторизации, id, data) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/createAcceptenceCertificateAcceptTicket/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(data, "type_AcceptanceCertificateAcceptInfo", "data", Истина);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
												"Вызов API сервиса ЭДО: Ticket.CreateAcceptenceCertificateAcceptTicket");

КонецФункции

// Вызов метода Ticket.CreateClarification API СФЕРА Курьер
//  См. https://confluence.esphere.ru/display/SBER/Ticket.CreateClarification
//
// Параметры:
//  ПараметрыАвторизации - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  id					 - 			 - число, идентификатор документа
//  comment				 - 			 - строка, текст причины отклонения
//  MchdData			 - 			 - Структура - см.https://confluence.esphere.ru/display/SBER/MchdData
// 
// Возвращаемое значение:
//  структура - FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v1_TicketCreateClarification(ПараметрыАвторизации, id, comment, MchdData = Неопределено) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/createclarification/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("comment", comment);
	
	Если MchdData <> Неопределено И MchdData.Количество() <> 0 Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(MchdData, "type_MchdData", "MchdData", Истина);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Ticket.CreateClarification");

КонецФункции

// Вызов метода Ticket.CreateClarificationNotice v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.CreateClarificationNotice+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	reason - строка, причина формирования отказа аннулирования документа
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v2_TicketCreateClarificationNotice(ПараметрыАвторизации, id, reason) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/ticket/{id}/createClarificationNotice";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("reason", reason);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Ticket.CreateClarificationNotice v.2");

КонецФункции

// Вызов метода Ticket.CreateReply API СФЕРА Курьер
//  См. https://confluence.esphere.ru/display/SBER/Ticket.CreateReply
//
// Параметры:
//  ПараметрыАвторизации - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  id					 - 			 - число, идентификатор документа
//  MchdData			 - 			 - Структура - см.https://confluence.esphere.ru/display/SBER/MchdData
// 
// Возвращаемое значение:
//  структура - FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v1_TicketCreateReply(ПараметрыАвторизации, id, MchdData = Неопределено) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/createreply/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	
	Если MchdData <> Неопределено И MchdData.Количество() <> 0 Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(MchdData, "type_MchdData", "MchdData", Истина);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Ticket.CreateReply");

КонецФункции

// Вызов метода Ticket.CreateTorg12AcceptTicket API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.CreateTorg12AcceptTicket
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	data - структура Torg12AcceptInfo, см. https://confluence.esphere.ru/display/SBER/Torg12AcceptInfo
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v1_TicketCreateTorg12AcceptTicket(ПараметрыАвторизации, id, data) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/createTorg12AcceptTicket/" + Формат(id, "ЧГ=0");
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Ticket.CreateTorg12AcceptTicket");

КонецФункции

// Вызов метода Ticket.DocumentReply v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.DocumentReply+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	нет
//
Функция v2_TicketDocumentReply(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/ticket/documentReply/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Ticket.DocumentReply v.2");

КонецФункции

// Вызов метода Ticket.GetTicketIdList API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.GetTicketIdList
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	fileName - Строка, наименование файла
//
// Возвращаемое значение:
//	???
//
Функция v1_TicketGetTicketIdList(ПараметрыАвторизации, fileName) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/getTicketIdList/";
	СтруктураЗапроса.Параметры.Вставить("fileName", fileName);

	// TODO сделать обработку результата
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfLong",
													"Вызов API сервиса ЭДО: Ticket.GetTicketIdList");

КонецФункции

// Вызов метода Ticket.Index API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.Index
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
// Возвращаемое значение:
//	массив структур Ticket, см. https://confluence.esphere.ru/display/SBER/Ticket
//
Функция v1_TicketIndex(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Ticket",
													"Вызов API сервиса ЭДО: Ticket.Index");

КонецФункции

// Вызов метода Ticket.Unreplied v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.Unreplied+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	TicketFilter - структура, см. https://confluence.esphere.ru/display/SBER/TicketFilter
//
// Возвращаемое значение:
//	структура TicketInfo, см. https://confluence.esphere.ru/display/SBER/TicketInfo
//
Функция v2_TicketUnreplied(ПараметрыАвторизации, TicketFilter) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/ticket/unreplied";

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(TicketFilter, "type_TicketFilter", "TicketFilter");

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfTicketInfo",
													"Вызов API сервиса ЭДО: Ticket.Unreplied v.2");

КонецФункции

// Вызов метода Tickets.Ticket API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Tickets.Ticket
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор транспортного документа
//
// Возвращаемое значение:
//	структура TicketDetails, см. https://confluence.esphere.ru/display/SBER/TicketDetails
//
Функция v1_TicketsTicket(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/ticket/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_TicketDetails",
													"Вызов API сервиса ЭДО: Tickets.Ticket");

КонецФункции

// Вызов метода Tickets.Tickets API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Tickets.Tickets
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	массив структур TicketDetails, см. https://confluence.esphere.ru/display/SBER/TicketDetails
//
Функция v1_TicketsTickets(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/tickets/tickets/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfTicketDetails",
													"Вызов API сервиса ЭДО: Tickets.Tickets");

КонецФункции

#КонецОбласти

#Область РаботаСДокументами

// Вызов метода Document.Add API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Add
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО получателя
//	document - структура, данные документа см. https://confluence.esphere.ru/display/SBER/DocumentCard
//
// Возвращаемое значение:
//	структура Document, см. https://confluence.esphere.ru/display/SBER/Document
//
Функция	v1_DocumentAdd(ПараметрыАвторизации, Id, DocumentCard) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/add/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	
	ЗаполнитьStringKeyValue(ПараметрыАвторизации, DocumentCard);
	
	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(DocumentCard, "type_DocumentCard", "DocumentCard", Истина);
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Document", "Вызов API сервиса ЭДО: Document.Add");
	
КонецФункции

// Вызов метода Document.Sign API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Sign
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	signature - структура SignatureWithTicket, см. https://confluence.esphere.ru/display/SBER/SignatureWithTicket
//
// Возвращаемое значение:
//	нет
//
Функция	v1_DocumentSign(ПараметрыАвторизации, Id, Signature) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/sign/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(Signature, "type_Signature", "SignatureWithTicket", Истина);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Document.Sign");

КонецФункции

// Вызов метода Document.Send API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Send
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	нет
//
Функция	v1_DocumentSend(ПараметрыАвторизации, Id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/send/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Document.Send");

КонецФункции

// Вызов метода Document.Details API СФЕРА Курьер
// https://confluence.esphere.ru/display/SBER/Document.Details
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Id - число, идентификатор документа
//
// Возвращаемое значение:
//	структура Document, см. https://confluence.esphere.ru/display/SBER/Document
//
Функция	v1_DocumentDetails(ПараметрыАвторизации, Id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/details/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Document",
													"Вызов API сервиса ЭДО: Document.Details");

КонецФункции

// Вызов метода Document.Card v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.Card+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	структура Document, см. https://confluence.esphere.ru/display/SBER/Document
//
Функция v2_DocumentCard(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Document",
													"Вызов API сервиса ЭДО: Document.Card v.2");

КонецФункции

// Вызов метода Document.Content v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.Content+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v2_DocumentContent(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/content";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Document.Content v.2");

КонецФункции

// Вызов метода Document.DocumentProtocol API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.DocumentProtocol
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v1_DocumentProtocol(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/documentProtocol/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Document.DocumentProtocol");

КонецФункции

// Вызов метода Document.Pdf API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.Pdf
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v1_DocumentPdf(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/pdf/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent", "Вызов API сервиса ЭДО: Document.Pdf");

КонецФункции

// Вызов метода Document.Pdf v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.Pdf+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	parentId - число, идентификатор родительского документа
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция v2_DocumentPdf(ПараметрыАвторизации, parentId, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{parentId}/ref/{id}/pdf";
	СтруктураЗапроса.Параметры.Вставить("parentId", parentId);
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Document.Pdf v.2");

КонецФункции

// Вызов метода Document.SelfRoute API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.SelfRoute
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	нет
//
Функция v1_DocumentSelfRoute(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/selfRoute";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Document.SelfRoute");

КонецФункции

// Вызов метода Document.DocumentRoute API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.DocumentRoute
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	массив структур DocumentRouteStage, см. https://confluence.esphere.ru/display/SBER/DocumentRouteStage
//
Функция v1_DocumentRoute(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/documentRoute";
	СтруктураЗапроса.Параметры.Вставить("docId", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentRouteStage",
													"Вызов API сервиса ЭДО: Document.DocumentRoute");

КонецФункции

// Вызов метода Document.GetSignatures API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.GetSignatures
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//
// Возвращаемое значение:
//	массив структура DocumentSign, см. https://confluence.esphere.ru/display/SBER/DocumentSign
//
Функция v1_DocumentGetSignatures(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/getsignatures/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentSign",
													"Вызов API сервиса ЭДО: Document.GetSignatures");

КонецФункции

// Вызов метода Document.GetSignatureDetails API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.GetSignatureDetails
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор подписи
//
// Возвращаемое значение:
//	структура SignatureDetails, см. https://confluence.esphere.ru/display/SBER/SignatureDetails
//
Функция v1_DocumentGetSignatureDetails(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/getSignatureDetails/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_SignatureDetails",
													"Вызов API сервиса ЭДО: Document.GetSignatureDetails");

КонецФункции

// Вызов метода Document.Accept API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.Accept
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	ticket - структура SignedContent, см. https://confluence.esphere.ru/display/SBER/SignedContent
//
// Возвращаемое значение:
//	нет
//
Функция v1_DocumentAccept(ПараметрыАвторизации, id, ticket = Неопределено) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/accept/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Если ticket <> Неопределено Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(ticket, "type_SignedContent", "SignedContent", Истина);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.Accept");

КонецФункции

// Вызов метода Document.Reject API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.Reject
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	comment - строка, причина отклонения документа
//
// Возвращаемое значение:
//	нет
//
Функция v1_DocumentReject(ПараметрыАвторизации, id, comment) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/reject/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("comment", comment);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.Reject");

КонецФункции

// Вызов метода Document.RequestClarification API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.RequestClarification
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число, идентификатор документа
//	ticket - структура SignedContent, см. https://confluence.esphere.ru/display/SBER/SignedContent
//
// Возвращаемое значение:
//	нет
//
Функция v1_DocumentRequestClarification(ПараметрыАвторизации, id, ticket) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/requestClarification/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Если ticket <> Неопределено Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(ticket, "type_SignedContent", "SignedContent", Истина);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.RequestClarification");

КонецФункции

// Вызов метода Document.List API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Document.List
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	filter - структура ApiDocumentFilter, см. https://confluence.esphere.ru/display/SBER/ApiDocumentFilter
//
// Возвращаемое значение:
//	массив структур Document, см. https://confluence.esphere.ru/display/SBER/Document
//
Функция v1_DocumentList(ПараметрыАвторизации, filter) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/list";

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(filter, "type_ApiDocumentFilter", "ApiDocumentFilter", Истина);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocument",
													"Вызов API сервиса ЭДО: Document.List");

КонецФункции

// Вызов метода Document.AcceptTitle v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.AcceptTitle+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	Id - число, идентификатор документа
//	AcceptInfo - структура UniversalDocumentAcceptInfo, см. https://confluence.esphere.ru/display/SBER/UniversalDocumentAcceptInfo
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция	v2_DocumentAcceptTitle(ПараметрыАвторизации, Id, AcceptInfo) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/acceptTitle";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	
	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(AcceptInfo, "type_UniversalDocumentAcceptInfo", "UniversalDocumentAcceptInfo");
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent", "Вызов API сервиса ЭДО: Document.AcceptTitle v.2");
	
КонецФункции

// Вызов метода Document.CreateAvoidanceRequest v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.CreateAvoidanceRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	reason - строка, причина создания предложения об аннулировании документа
//
// Возвращаемое значение:
//	структура FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция	v2_DocumentCreateAvoidanceRequest(ПараметрыАвторизации, id, reason) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";

	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес
									+ "/v2.0/document/{id}/createAvoidanceRequest?reason={reason}";

	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("reason", reason);
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
													"Вызов API сервиса ЭДО: Document.CreateAvoidanceRequest");

КонецФункции

// Вызов метода Document.AvoidanceRequest v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.AvoidanceRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	BODY - структура SignedContent, см. https://confluence.esphere.ru/display/SBER/SignedContent
//
// Возвращаемое значение:
//	нет
//
Функция	v2_DocumentAvoidanceRequest(ПараметрыАвторизации, id, BODY) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/avoidanceRequest";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Если BODY <> Неопределено Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(BODY, "type_SignedContent", "SignedContent", Ложь);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.AvoidanceRequest");

КонецФункции

// Вызов метода Document.CreateAvoidanceRequestClarificationNotice v.2 API СФЕРА Курьер
//  см. https://confluence.esphere.ru/display/SBER/Document.CreateAvoidanceRequestClarificationNotice+v.2
//
// Параметры:
//  ПараметрыАвторизации - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  id					 - 			 - строка, идентификатор ЭДО документа
//  reason				 - 			 - строка, причина формирования отказа аннулирования документа
//  MchdData			 - 			 - Структура - см.https://confluence.esphere.ru/display/SBER/MchdData
// 
// Возвращаемое значение:
//  структура - FileContent, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция	v2_DocumentCreateAvoidanceRequestClarificationNotice(ПараметрыАвторизации, id, reason, MchdData = Неопределено) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";

	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес
									+ "/v2.0/document/{id}/createAvoidanceRequestClarificationNotice?reason={reason}";

	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("reason", reason);
	
	Если MchdData <> Неопределено И MchdData.Количество() <> 0 Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(MchdData, "type_MchdData", "MchdData", Истина);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent",
											"Вызов API сервиса ЭДО: Document.CreateAvoidanceRequestClarificationNotice");

КонецФункции

// Вызов метода Document.RejectAvoidanceRequest v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.RejectAvoidanceRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	ticket - структура SignedContent, см. https://confluence.esphere.ru/display/SBER/SignedContent
//
// Возвращаемое значение:
//	нет
//
Функция	v2_DocumentRejectAvoidanceRequest(ПараметрыАвторизации, id, ticket) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/rejectAvoidanceRequest";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Если ticket <> Неопределено Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(ticket, "type_SignedContent", "SignedContent", Ложь);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "",
													"Вызов API сервиса ЭДО: Document.RejectAvoidanceRequest");

КонецФункции

// Вызов метода Document.AcceptAvoidanceRequest v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.RejectAvoidanceRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	signature - структура Signature, см. https://confluence.esphere.ru/display/SBER/Signature
//
// Возвращаемое значение:
//	нет
//
Функция	v2_DocumentAcceptAvoidanceRequest(ПараметрыАвторизации, id, signature) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/acceptAvoidanceRequest";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Если signature <> Неопределено Тогда
		СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(signature, "type_Signature", "Signature", Ложь);
	КонецЕсли;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "",
													"Вызов API сервиса ЭДО: Document.AcceptAvoidanceRequest");

КонецФункции

// Вызов метода Document.History v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.History+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//
// Возвращаемое значение:
//	массив структур DocumentHistory, см. https://confluence.esphere.ru/display/SBER/DocumentHistory
//
Функция	v2_DocumentHistory(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/history";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentHistory",
													"Вызов API сервиса ЭДО: Document.History");

КонецФункции

// Вызов метода Document.Revoke v.1 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Revoke
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	comment - строка, причина отзыва документа
//
// Возвращаемое значение:
//	нет
//
Функция	v1_DocumentRevoke(ПараметрыАвторизации, id, comment) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/revoke/{id}?comment={comment}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("comment", comment);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.Revoke");

КонецФункции

// Вызов метода Document.Trash API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Trash
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//
// Возвращаемое значение:
//	нет
//
Функция	v1_DocumentTrash(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/trash/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.Trash");

КонецФункции

// Вызов метода Document.Delete API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Delete
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//
// Возвращаемое значение:
//	нет
//
Функция	v1_DocumentDelete(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/delete/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "", "Вызов API сервиса ЭДО: Document.Delete");

КонецФункции

// Вызов метода Document.AddAttachment API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.AddAttachment
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	attachment - структура, см. https://confluence.esphere.ru/display/SBER/FileContent
//
// Возвращаемое значение:
//	число, идентификатор добавленного вложения
//
Функция	v1_DocumentAddAttachment(ПараметрыАвторизации, id, attachment) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/addAttachment/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	
	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(attachment, "type_FileContent", "FileContent", Истина);
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "long", "Вызов API сервиса ЭДО: Document.AddAttachment");

КонецФункции

// Вызов метода Document.Attachment API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Attachment
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор вложения
//
// Возвращаемое значение:
//	структура, см. https://confluence.esphere.ru/display/SBER/FileContent
//
Функция	v1_DocumentAttachment(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/attachment/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
		
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_FileContent", "Вызов API сервиса ЭДО: Document.Attachment");

КонецФункции

// Вызов метода Document.Attributes API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.Attributes
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - число или строка, идентификатор документа
//
// Возвращаемое значение:
//	структура, см. https://confluence.esphere.ru/display/SBER/KeyValueObject
//
Функция	v1_DocumentAttributes(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/document/attributes/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
		
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayKeyValueObject", "Вызов API сервиса ЭДО: Document.Attributes");

КонецФункции

// Вызов метода Document.RoamingInfo v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.RoamingInfo
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//
// Возвращаемое значение:
//	массив структур DocumentRoamingInfo, см. https://confluence.esphere.ru/display/SBER/DocumentRoamingInfo
//
Функция	v2_DocumentRoamingInfo(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/RoamingInfo";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfDocumentRoamingInfo",
													"Вызов API сервиса ЭДО: Document.RoamingInfo");

КонецФункции

// Вызов метода Document.ExternalServices v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.ExternalServices+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//
// Возвращаемое значение:
//	массив структур ExternalServiceData, см. https://confluence.esphere.ru/display/SBER/API
//
Функция	v2_DocumentExternalServices(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/externalServices";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfExternalServiceData",
													"Вызов API сервиса ЭДО: Document.ExternalServices");

КонецФункции

// Вызов метода Document.GetPropetryValue v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.GetPropetryValue+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО документа
//	key - строка, ключ свойства ЭДО документа
//
// Возвращаемое значение:
//	строка, содержащая тело ответа
//
Функция	v2_DocumentGetPropetryValue(ПараметрыАвторизации, id, key) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/property/{key}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("key", key);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "",
													"Вызов API сервиса ЭДО: Document.GetPropetryValue", Истина);

КонецФункции

// Вызов метода Document.GetProperties v.2 API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.GetProperties+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - Число, Идентификатор документа
//
// Возвращаемое значение:
//	строка, содержащая тело ответа
//
Функция	v2_DocumentGetProperties(ПараметрыАвторизации, id) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/property";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayStringKeyValue",
													"Вызов API сервиса ЭДО: Document.GetProperties");

КонецФункции 

// Вызов метода Document.Add API СФЕРА Курьер
// см. https://confluence.esphere.ru/display/SBER/Document.ChangeSigner+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - строка, идентификатор ЭДО получателя
//	DocumentSigner - структура, данные документа см. https://confluence.esphere.ru/display/SBER/DocumentCard
//
// Возвращаемое значение:
//	структура Document, см. https://confluence.esphere.ru/pages/viewpage.action?spaceKey=SBER&title=DocumentSigner
//
Функция	v2_DocumentChangeSigner(ПараметрыАвторизации, id, DocumentSigner) Экспорт
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "PATCH";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/document/{id}/signer";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	
	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(DocumentSigner, "type_DocumentSigner", "DocumentSigner");
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Document", "Вызов API сервиса ЭДО: Document.ChangeSigner", Истина);
	
КонецФункции

#КонецОбласти

#Область РаботаСПользователями

// Вызов метода Dictionary.UserCertificate API СФЕРА Курьер
//	См. https://confluence.esphere.ru/display/SBER/Dictionary.UserCertificate
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	структура Certificate, см. https://confluence.esphere.ru/display/SBER/Certificate
//
Функция v1_DictionaryUserCertificate(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/dictionary/usercertificate";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_Certificate",
												"Вызов API сервиса ЭДО: Dictionary.UserCertificate");

КонецФункции

// РаботаСПользователями
#КонецОбласти

#Область НастройкаВзаимосвязей

// Вызов метода Relation.AddDocumentType v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Relation.AddDocumentType+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - integer, идентификатор взаимосвязи
//	documentTypeId - integer, идентификатор типа документа
//
// Возвращаемое значение:
//	нет
//
Функция v2_RelationAddDocumentType(ПараметрыАвторизации, id, documentTypeId) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "PUT";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation/{id}/documentType/{documentTypeId}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("documentTypeId", documentTypeId);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Relation.AddDocumentType v.2");

КонецФункции

// Вызов метода Relation.DeleteDocumentType v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Relation.DeleteDocumentType+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - integer, идентификатор взаимосвязи
//	documentTypeId - integer, идентификатор типа документа
//
// Возвращаемое значение:
//	нет
//
Функция v2_RelationDeleteDocumentType(ПараметрыАвторизации, id, documentTypeId) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "DELETE";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation/{id}/documentType/{documentTypeId}";
	СтруктураЗапроса.Параметры.Вставить("id", id);
	СтруктураЗапроса.Параметры.Вставить("documentTypeId", documentTypeId);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: Relation.DeleteDocumentType v.2");

КонецФункции

// Вызов метода RelationRequest.Accept v.2 API СФЕРА Курьер
// См.https://confluence.esphere.ru/display/SBER/RelationRequest.Accept+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - integer, идентификатор запроса на создание взаимосвязи
//
// Возвращаемое значение:
//	нет
//
Функция v2_RelationRequestAccept(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation-request/{id}/accept";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: RelationRequest.Accept v.2");

КонецФункции

// Вызов метода RelationRequest.AddRequest v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/RelationRequest.AddRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	RelationRequest - структура, данные о клиенте в виде структуры данных см. https://confluence.esphere.ru/display/SBER/RelationRequest
//
// Возвращаемое значение:
//	нет
//
Функция v2_RelationRequestAddRequest(ПараметрыАвторизации, RelationRequest) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "PUT";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation-request";

	СтруктураЗапроса.Тело = ПолучитьXMLПоСтруктуре(RelationRequest, "type_RelationRequest", "RelationRequest", Ложь);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: RelationRequest.AddRequest v.2");

КонецФункции

// Вызов метода RelationRequest.DeleteRequest v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/RelationRequest.DeleteRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - integer, идентификатор запроса на создание взаимосвязи
//
// Возвращаемое значение:
//	нет
//
Функция v2_RelationRequestDeleteRequest(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "DELETE";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation-request/{id}";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: RelationRequest.DeleteRequest v.2");

КонецФункции

// Вызов метода RelationRequest.ListRequest v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/RelationRequest.ListRequest+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	RelationRequestDetails - массив, список запросов на создание взаимосвязей, созданных в указанный период времени,
//  в виде структуры данных RelationRequestDetails. См. https://confluence.esphere.ru/display/SBER/RelationRequestDetails
//
Функция v2_RelationRequestListRequest(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation-request";

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfRelationRequestDetails",
													"Вызов API сервиса ЭДО: RelationRequest.ListRequest v.2");

КонецФункции

// Вызов метода RelationRequest.Reject v.2 API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/RelationRequest.Reject+v.2
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	id - integer, идентификатор запроса на создание взаимосвязи
//
// Возвращаемое значение:
//	нет
//
Функция v2_RelationRequestReject(ПараметрыАвторизации, id) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/v2.0/relation-request/{id}/reject";
	СтруктураЗапроса.Параметры.Вставить("id", id);

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, , "Вызов API сервиса ЭДО: RelationRequest.Reject v.2");

КонецФункции

#КонецОбласти

#Область РаботаСоСправочниками

// Вызов метода Classifier.GetClassifiers API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Classifier.GetClassifiers
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
// Возвращаемое значение:
//	список структур Classifier, см. https://confluence.esphere.ru/display/SBER/Classifier
//
Функция v1_ClassifierGetClassifiers(ПараметрыАвторизации) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/classifier/getClassifiers";
		
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfClassifier", "Вызов API сервиса ЭДО: Classifier.GetClassifiers");

КонецФункции

// Вызов метода Classifier.Template API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Classifier.Template
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
//	documentTypeCode - строка, код типа документа
//  receiverCode - строка, идентификатор участника ЭДО получателя 
//
// Возвращаемое значение:
//	список структур ClassifierTemplate, см. https://confluence.esphere.ru/display/SBER/ClassifierTemplate
//
Функция v1_ClassifierTemplate(ПараметрыАвторизации, documentTypeCode, receiverCode) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/classifier/template";
	СтруктураЗапроса.Параметры.Вставить("documentTypeCode", documentTypeCode);
	СтруктураЗапроса.Параметры.Вставить("receiverCode", receiverCode);
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfClassifierTemplate", "Вызов API сервиса ЭДО: Classifier.Template");

КонецФункции

// Вызов метода Classifier.ClassifierValues API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Classifier.ClassifierValues
//
// Параметры:
//	ПараметрыАвторизации  - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//
//	classifierId - строка, идентификатор справочника
//  isNotActive - булево, признак включения в список и неактивных значений. 
//
// Возвращаемое значение:
//	список структур ClassifierValue, см. https://confluence.esphere.ru/display/SBER/ClassifierValue
//
Функция v1_ClassifierClassifierValues(ПараметрыАвторизации, classifierId, isNotActive) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ПараметрыАвторизации);
	СтруктураЗапроса.Метод = "POST";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/classifier/classifierValues";
	СтруктураЗапроса.Параметры.Вставить("classifierId", classifierId);
	СтруктураЗапроса.Параметры.Вставить("isNotActive", isNotActive);
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_ArrayOfClassifierValue", "Вызов API сервиса ЭДО: Classifier.ClassifierValues");

КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

// Вызов метода Version API СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Version
// Также может использоваться для проверки настроек прокси-сервера.
//
// Параметры:
//	ПроверяемыеПараметрыПрокси - Неопределено, Соответствие - настройки прокси-сервера, с которыми нужно выполнить запрос:
//        см. РегистрыСведений.ККСНГ_Настройки.СохранитьНастройкиПроксиСервера()
//
// Возвращаемое значение:
//	список структур VersionInfo, см. https://confluence.esphere.ru/display/SBER/VersionInfo
//	либо КодОшибки ответа выполение HTTP-метода, если передан параметр ПроверяемыеПараметрыПрокси.
//
Функция v1_Version(ПроверяемыеПараметрыПрокси = Неопределено) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(Неопределено);
	СтруктураЗапроса.Метод = "GET";
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + "/api/about/version";
	ЗаголовокЖурнала = "Вызов API сервиса ЭДО: Version";
	
	Если ЗначениеЗаполнено(ПроверяемыеПараметрыПрокси) Тогда
		Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
		
		ККСНГ_ТранспортHTTPКлиентСервер.ЗаполнитьПараметрыПрокси(СтруктураЗапроса, ПроверяемыеПараметрыПрокси);
		
		СтруктураЗапроса.МаксРедиректов = 2;
		ОтветAPI = ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветAPI.Журнал);
		Ответ.Результат = ОтветAPI.КодОшибки;
		Ответ.Успех = ОтветAPI.Успех;
		
		ЗапросРасшифровки = РасшифроватьОшибкуКурьера(ОтветAPI);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросРасшифровки.Журнал);
		
		Возврат Ответ;
	КонецЕсли;
	
	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, "type_VersionInfo", ЗаголовокЖурнала);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует строку формата XML по данным типа Структура
//
// Параметры:
//	 Данные                  - Структура
//	 ТипXDTO                 - ТипXDTO
//	 ЛокальноеИмя            - Строка
//	 УдалятьПространствоИмен - Булево
//	 ПространствоИмен        - Строка
//
// Возвращаемое значение:
//	Строка XML
//
Функция ПолучитьXMLПоСтруктуре(Данные, ТипXDTO, ЛокальноеИмя = Неопределено, УдалятьПространствоИмен = Ложь, Знач ПространствоИмен = "") Экспорт

	ПространствоИмен = ?(ЗначениеЗаполнено(ПространствоИмен), ПространствоИмен, ПолучитьПространствоИменПоУмолчанию());

	ТипОбъектаXDTO = ФабрикаXDTO.Тип(ПространствоИмен, ТипXDTO);
	ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
	ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO, Данные);

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ЛокальноеИмя);
	СтрокаXML = ЗаписьXML.Закрыть();

	Если (УдалятьПространствоИмен) Тогда
		СтрокаXML = СтрЗаменить(СтрокаXML, "xmlns=""" + ПространствоИмен + """", "");
	КонецЕсли;

	Возврат СтрокаXML;

КонецФункции

// Формирует структуру по строке формата XML
//
// Параметры:
//	 ТекстXML                  - Строка XML
//	 ТипXDTO                   - ТипXDTO
//	 BodyRoot                  - Булево - добавление пространства имен
//
// Возвращаемое значение:
//	Структура -  произвольный
//
Функция ПолучитьСтруктуруПоXML(ТекстXML, ТипXDTO, BodyRoot = Ложь) Экспорт

	ПространствоXDTO = ПолучитьПространствоИменПоУмолчанию();
	ОбъектXDTO = ПолучитьОбъектXDTO(ТекстXML, ПространствоXDTO, ТипXDTO, BodyRoot);
	Возврат ПолучитьСтруктуруПоОбъектуXDTO(ОбъектXDTO);

КонецФункции

// Формирует структуру по объекту XDTO
//
// Параметры:
//	 ОбъектXDTO                - ОбъектXDTO
//
// Возвращаемое значение:
//	Структура -  произвольный
//
Функция ПолучитьСтруктуруПоОбъектуXDTO(ОбъектXDTO) Экспорт

	Результат =  Новый Структура;

	Если ТипЗнч(ОбъектXDTO) = Тип("ЗначениеXDTO") Тогда
		Возврат ОбъектXDTO.Значение;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекцииСвойств Из ОбъектXDTO.Свойства() Цикл

		ЭлементДанных = ОбъектXDTO[ЭлементКоллекцииСвойств.Имя];
		Если (ТипЗнч(ЭлементДанных) = Тип("СписокXDTO")) Тогда

			Список = Новый Массив;
	
			Для Каждого ЭлементСписка Из ЭлементДанных Цикл
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					НовыйЭлементМассива = ПолучитьСтруктуруПоОбъектуXDTO(ЭлементСписка);
				Иначе
					НовыйЭлементМассива = ЭлементСписка;
				КонецЕсли;
				
				Список.Добавить(НовыйЭлементМассива);
			КонецЦикла;
			
			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, Список);

		ИначеЕсли (ТипЗнч(ЭлементДанных) = Тип("ОбъектXDTO")) Тогда

			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, ПолучитьСтруктуруПоОбъектуXDTO(ЭлементДанных));

		Иначе

			Результат.Вставить(ЭлементКоллекцииСвойств.Имя, ЭлементДанных);

		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Формирует ОбъектXDTO по строке формата XML
//
// Параметры:
//	 ТекстXML                  - Строка XML
//	 ПространствоИменXML       - Строка
//	 ТипXDTO                   - ТипXDTO
//	 BodyRoot                  - Булево - добавление пространства имен
//
// Возвращаемое значение:
//	ОбъектXDTO
//
Функция ПолучитьОбъектXDTO(Знач ТекстXML, Знач ПространствоИменXML = Неопределено, Знач ТипXDTO = Неопределено, BodyRoot = Ложь) Экспорт

	ОбXDTO = Неопределено;

	Если ТипXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(ПространствоИменXML)) Тогда
		ПространствоИменXML = ПолучитьПространствоИменПоУмолчанию();
	КонецЕсли;

	Если BodyRoot Тогда
		ТекстXML = "<BodyRoot xmlns=""" + ПространствоИменXML + """>" + ТекстXML + "</BodyRoot>";
	КонецЕсли;

	ККСНГ_XDTOКлиентСервер.УстановитьПространствоИменПервогоЭлемента(ТекстXML, ПространствоИменXML);

	Попытка

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстXML);

		ТипXDTO = ФабрикаXDTO.Тип(ПространствоИменXML, ТипXDTO);

		ОбXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO);
		ЧтениеXML.Закрыть();

	Исключение

		ТекстОписанияОшибки = ОписаниеОшибки();
		ВызватьИсключение ТекстОписанияОшибки + Символы.ПС  + ТекстXML;

	КонецПопытки;

	Возврат ОбXDTO;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПространствоИменПоУмолчанию()

	Возврат "http://schemas.datacontract.org/2004/07/Korus.Eds.Api";

КонецФункции

Процедура ЗаполнитьStringKeyValue(ПараметрыАвторизации, DocumentCard)
	
	СпособПередачи = Новый Структура();
	СпособПередачи.Вставить("Key", "send.mode");
	СпособПередачи.Вставить("Value", "modul1c");
			
	ЗначениеСпособаАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыАвторизации,"СпособАвторизации", "undefined");
	
	Если ЗначениеСпособаАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ApiKey Тогда
		ЗначениеСпособаАвторизации = "apikey";
	ИначеЕсли ЗначениеСпособаАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка Тогда
		ЗначениеСпособаАвторизации = "vpnkeytls";
	Иначе
		ЗначениеСпособаАвторизации = "unqualified";
	КонецЕсли;

	СпособАвторизации = Новый Структура();
	СпособАвторизации.Вставить("Key", "auth.mode");	
	СпособАвторизации.Вставить("Value", ЗначениеСпособаАвторизации);

	StringKeyValue = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(DocumentCard,	"Properties.StringKeyValue", Неопределено);
	
	Если StringKeyValue <> Неопределено
		И ТипЗнч(StringKeyValue) = Тип("Массив") Тогда
		
		StringKeyValue.Добавить(СпособПередачи);
		StringKeyValue.Добавить(СпособАвторизации);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO, Данные)
	
	Перем ЗначениеЗаполнения;
	
	Для Каждого ЭлементКоллекцииСвойств Из ОбъектXDTO.Свойства() Цикл

		ЭлементДанных = ОбъектXDTO[ЭлементКоллекцииСвойств.Имя];

		Если (ТипЗнч(ЭлементДанных) = Тип("СписокXDTO")) Тогда
			
			// Заполнение списка
			ОбработатьЭлементДанныхСписокXDTO(Данные, ЭлементКоллекцииСвойств, ЭлементДанных);
			
		ИначеЕсли (ТипЗнч(ЭлементКоллекцииСвойств.Тип) = Тип("ТипОбъектаXDTO")) Тогда 
			
			// Заполнение вложенного объекта
			Если (Данные.Свойство(ЭлементКоллекцииСвойств.Имя)) Тогда
				ОбъектXDTO[ЭлементКоллекцииСвойств.Имя] = ФабрикаXDTO.Создать(ЭлементКоллекцииСвойств.Тип);
				ЗаполнитьОбъектXDTOПоСтруктуре(ОбъектXDTO[ЭлементКоллекцииСвойств.Имя], Данные[ЭлементКоллекцииСвойств.Имя]);
			КонецЕсли;
			
		Иначе
				
			// Заполнение значения (заполняем только не пустые)
			Если Данные.Свойство(ЭлементКоллекцииСвойств.Имя, ЗначениеЗаполнения) И ЗначениеЗаполнения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОбъектXDTO, Данные, ЭлементКоллекцииСвойств.Имя);
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьЭлементДанныхСписокXDTO(Данные, ЭлементКоллекцииСвойств, ЭлементДанных)

	Если (Данные.Свойство(ЭлементКоллекцииСвойств.Имя)
		И (ТипЗнч(Данные[ЭлементКоллекцииСвойств.Имя]) = Тип("Массив"))) Тогда
		
		Для Каждого СтрокаДанных Из Данные[ЭлементКоллекцииСвойств.Имя] Цикл
			
			НовыйЭлемент = ФабрикаXDTO.Создать(ЭлементКоллекцииСвойств.Тип);
			
			Если НовыйЭлемент = Неопределено Тогда
				// Это конечный элемент
				НовыйЭлемент = СтрокаДанных;
			Иначе
				// Рекурсивно заполняем дальше
				ЗаполнитьОбъектXDTOПоСтруктуре(НовыйЭлемент, СтрокаДанных);
			КонецЕсли;
			
			ЭлементДанных.Добавить(НовыйЭлемент);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСтруктуруЗапроса(ПараметрыАвторизации = Неопределено)

	СтруктураЗапроса = ККСНГ_ТранспортHTTPКлиентСервер.ПолучитьСтруктуруЗапроса();

	АвторизацияТокеном = Ложь;
	AuthToken = "";
	Если ПараметрыАвторизации <> Неопределено Тогда
		СпособАвторизации = ПараметрыАвторизации.СпособАвторизации;
		AuthToken = ПараметрыАвторизации.AuthToken;
	    АвторизацияТокеном = СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка;
	КонецЕсли;
	Если АвторизацияТокеном Тогда
		Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим() Тогда
			СтруктураЗапроса.Адрес = "https://einv-preprod.esphere.ru:9443/auxch/courier_webapi";
		Иначе
			СтруктураЗапроса.Адрес = "https://einv.esphere.ru:9443/auxch/courier_webapi";
		КонецЕсли;
		СтруктураЗапроса.Заголовки.Вставить("Cookie", ПараметрыАвторизации.КонтекстТокена.AuthCookie);
	Иначе	// AuthToken
		Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим() Тогда
			СтруктураЗапроса.Адрес = "https://courier-demo.esphere.ru/api";
		Иначе
			СтруктураЗапроса.Адрес = "https://courier-api.esphere.ru";
		КонецЕсли;
		Если Не ПустаяСтрока(AuthToken) Тогда
			СтруктураЗапроса.Заголовки.Вставить("Auth-token", AuthToken);
		КонецЕсли;
	КонецЕсли;

	СтруктураЗапроса.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);

	СтруктураЗапроса.Заголовки.Вставить("Accept", "application/xml"); // "application/json"
	СтруктураЗапроса.Заголовки.Вставить("Content-Type", "application/xml");

	Возврат СтруктураЗапроса;

КонецФункции

Функция ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, ТипXDTO = "", ЗаголовокЖурнала = "", РезультатСтрокой = Ложь)

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ККСНГ_ТранспортHTTPКлиентСервер.ЗаполнитьПараметрыПрокси(СтруктураЗапроса);
	
	ОтветAPI = ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
	Ответ.Результат = ОтветAPI.КодОшибки;
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветAPI.Журнал);
	
	Если ОтветAPI.Успех И ТипЗнч(ОтветAPI.Результат) = Тип("HTTPОтвет") Тогда
		
		Попытка

			ИсходныеДанные = ОтветAPI.Результат.ПолучитьТелоКакСтроку();
			Если РезультатСтрокой = Истина Тогда 
				Ответ.Результат = ИсходныеДанные;
			ИначеЕсли Не ПустаяСтрока(ТипXDTO) Тогда
				// Обрабатываем результат
				Ответ.Результат = ПолучитьСтруктуруПоXML(ИсходныеДанные, ТипXDTO);
			КонецЕсли;

			Ответ.Успех = Истина;

		Исключение

			// Не удалось прочитать XML
			ОписаниеОшибки = ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка обработки ответа API сервиса ЭДО", "XT-00013", ОписаниеОшибки);

		КонецПопытки;
		
	// Пробуем найти сообщение об ошибке от API
	ИначеЕсли ОтветAPI.КодОшибки = 302 Тогда
		ПараметрыАвторизации = СтруктураЗапроса.ПараметрыАвторизации;

		Если ТипЗнч(ПараметрыАвторизации) = Тип("Структура")
			И ПараметрыАвторизации.СпособАвторизации
					= Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка Тогда

			ПараметрыАвторизации.Вставить("НеобходимаПереинициализация", Истина);

			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал,
						"Пользовательская сессия устарела, пожалуйста, повторите действие.", "AU-00002");

		КонецЕсли;

	Иначе
		
		ЗапросРасшифровки = РасшифроватьОшибкуКурьера(ОтветAPI);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросРасшифровки.Журнал);
		
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

Функция РасшифроватьОшибкуКурьера(ОтветAPI)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если ОтветAPI.КодОшибки < 500 И ТипЗнч(ОтветAPI.Результат) = Тип("HTTPОтвет") Тогда

		Попытка

			ИсходныеДанные = ОтветAPI.Результат.ПолучитьТелоКакСтроку();
			ОбъектXDTO = ПолучитьОбъектXDTO(ИсходныеДанные, "http://www.cc.org/Errors", "BodyRoot", Истина);
			ДанныеОшибки = ПолучитьСтруктуруПоОбъектуXDTO(ОбъектXDTO);

			// Пробежим по всем вариантам и добавим в журнал, если есть данные
			Для Каждого Элемент Из ДанныеОшибки Цикл

				ОписаниеОшибки = Элемент.Значение;

				Если НЕ ТипЗнч(ОписаниеОшибки) = Тип("Структура") Тогда
					Продолжить;
				КонецЕсли;

				КодОшибки = "ER-00000";
				ТекстОшибки = "";
				ОписаниеОшибки.Свойство("ErrorNumber", КодОшибки);
				ОписаниеОшибки.Свойство("Message", ТекстОшибки);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, КодОшибки);

			КонецЦикла;

		Исключение

			ОписаниеОшибки = ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ОписаниеОшибки,
													"Не удалось прочитать текст ошибки API сервиса ЭДО.");

		КонецПопытки;
			
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

#КонецОбласти