
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаДляПерехода = Неопределено;
	Параметры.Свойство("СсылкаДляПерехода", СсылкаДляПерехода);
		
	ОсновнойТекст = Неопределено;
	Параметры.Свойство("ОсновнойТекст", ОсновнойТекст);
	
	Элементы.ДекорацияОсновнойТекст.Заголовок = ОсновнойТекст;
	
	ОписаниеСсылки = Неопределено;
	Параметры.Свойство("ОписаниеСсылки", ОписаниеСсылки);
	
	Элементы.ДекорацияОписаниеСсылки.Заголовок = ОписаниеСсылки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	
	Если ЗначениеЗаполнено(СсылкаДляПерехода) Тогда
		ПерейтиПоНавигационнойСсылке(СсылкаДляПерехода);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
