
#Область ПрограммныйИнтерфейс

// Проверяет предполагается ли подписание квитанций перед выполнением команды 
//
// Параметры:
//	ИмяКоманды - строка с именем команды
//
// Возвращаемое значение:
//	булево - требуется\нет подписание квитанций
//
Функция ТребуетсяПодписаниеКвитанций(ИмяКоманды) Экспорт
	
	Перем Результат;
	
	Результат = Новый Массив;
	Результат.Добавить("КурьерAcceptWithTicket");
	Результат.Добавить("КурьерAvoidanceRequest");
	Результат.Добавить("КурьерReject");
	Результат.Добавить("КурьерRejectWithTicket");
	Результат.Добавить("КурьерSign");
	Результат.Добавить("КурьерAccept");
	
	Возврат Результат.Найти(ИмяКоманды) <> Неопределено;
	
КонецФункции

// Создает, подписывает и отправляет ответную пользовательскую квитанцию
//
// Параметры:
//  КвитанцияСсылка					 - 	 - СправочникСсылка.ККСНГ_Квитанции
//  ПрофильНастройкиЭДО				 - 	 - СправочникСсылка.ККСНГ_Организации
//  ПараметрыАвторизации			 - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена   - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  ОписаниеОповещенияОЗавершении	 - 			 - 
//  ДанныеМЧД						 - Структура - данные по МЧД
//
Процедура ОтправитьОтветНаКвитанцию(КвитанцияСсылка, ОрганизацияЭДО, ПараметрыАвторизации, Сертификат, КонтрагентЭДОКвитанции, ДанныеПодписантаКвитанции, ИмяКоманды = "", УникальныйИдентификатор = "") Экспорт
	
	Перем Ответ;
	Перем СписокКвитанций, МассивДанных, MchdData;
	Перем ДанныеПодписанта, ЗапросДанныеКвитанции, ДанныеФормирования;
	Перем ДанныеОтветнойКвитанции, idКвитанции, ТекКвитанция;
	Перем ДополнительныеПараметры, ПередПодписанием, ПослеПодписания, ДанныеНаПодпись;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Истина;

	Если ТипЗнч(КвитанцияСсылка) <> Тип("Массив") Тогда
		СписокКвитанций = Новый Массив;
		СписокКвитанций.Добавить(КвитанцияСсылка);
	Иначе
		СписокКвитанций = КвитанцияСсылка;
	КонецЕсли;
	
	МассивДанных = Новый Массив;
	
	Для каждого КвитанцияСсылка Из СписокКвитанций Цикл
		
		ДанныеПодписанта = ДанныеПодписантаКвитанции.Получить(КвитанцияСсылка);
		
		// Данные МЧД для создания квитанций
		Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "НеОтправлять") <> 0 Тогда
			
			MchdData = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_MchdData");
			MchdData.Uuid = ДанныеПодписанта.МЧД.Номер;
			MchdData.StartDate = ДанныеПодписанта.МЧД.ДатаНачала;
			
			Если СтрСравнить(ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
				MchdData.MchdViewType = "Meta";
				MchdData.AccessMode = ДанныеПодписанта.МЧД.ИнформационнаяСистема;
			Иначе
				MchdData.MchdViewType = "File";
			КонецЕсли;
			
		КонецЕсли;
		
		ЗапросДанныеКвитанции = ККСНГ_КвитанцииВызовСервера.СформироватьОтветнуюКвитанциюНаСервере(КвитанцияСсылка, ПараметрыАвторизации, MchdData);
		Если Не ЗапросДанныеКвитанции.Успех Тогда
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныеКвитанции.Журнал, Ложь);
			Ответ.Успех = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДанныеФормирования = ПолучитьИзВременногоХранилища(ЗапросДанныеКвитанции.Результат);
		
		ДанныеОтветнойКвитанции = ДанныеФормирования.FileContent;
		idКвитанции = ДанныеФормирования.idКвитанции;
		
		ТекКвитанция = Новый Структура;
		ТекКвитанция.Вставить("Content", ДанныеОтветнойКвитанции);
		ТекКвитанция.Вставить("idКвитанции", idКвитанции);
		ТекКвитанция.Вставить("КвитанцияСсылка", КвитанцияСсылка);
		ТекКвитанция.Вставить("ДанныеОтветнойКвитанции", ДанныеОтветнойКвитанции);
		ТекКвитанция.Вставить("ДанныеПодписанта", ДанныеПодписанта);
		
		МассивДанных.Добавить(Новый Структура("Данные,ИмяПоляДД,Представление", ТекКвитанция, "Content.Content", ДанныеОтветнойКвитанции.Filename));
		
	КонецЦикла;
	
	Если Не Ответ.Успех Тогда
		
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Ответ.Журнал);
		Если ККСНГ_ДокументооборотКлиент.ПроверитьОчиститьAuthCookie(ОрганизацияЭДО, ПараметрыАвторизации) Тогда // Если истекла AuthCookie, то нет смысла продолжать
			МассивДанных = Новый Массив;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КонтрагентыЭДО", КонтрагентЭДОКвитанции);
	ДополнительныеПараметры.Вставить("ОрганизацияЭДО", ОрганизацияЭДО);
	ДополнительныеПараметры.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
	ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("Сертификат", Сертификат);
	
	ПередПодписанием = Новый ОписаниеОповещения("ПередПодписаниемДанныхКвитанций", ЭтотОбъект, ДополнительныеПараметры);
	ПослеПодписания = Новый ОписаниеОповещения("ПодписатьДанныеКвитанцииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если МассивДанных.Количество() > 0 Тогда
		ДанныеНаПодпись = Новый Структура("МассивДанных, Представление", МассивДанных, "Ответные квитанции");
		ККСНГ_ЭлектроннаяПодписьКлиент.ПодписатьДвоичныеДанные(ДанныеНаПодпись, ПараметрыАвторизации, ОрганизацияЭДО, "Подписание ответных квитанций", ПослеПодписания, ПередПодписанием);
	Иначе
		ВыполнитьОбработкуОповещения(ПослеПодписания, Новый Структура("Успех", Ложь));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается перед подписанием массива ИОП для отправки их в Курьер
//
//  Параметры				 - 	 - Структура
//  	* ОписаниеДанных       - Структура
//  	* Оповещение
//  ДополнительныеПараметры	 - 	 - Структура:
//  	* КонтрагентыЭДО - Соответствие - получаем контрагента по квитанции для заполнения МЧД
//  	* ПрофильНастройкиЭДО - СправочникСсылка.ККСНГ_Организации
//  	* ПараметрыАвторизации - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
Процедура ПередПодписаниемДанныхКвитанций(Параметры, ДополнительныеПараметры) Экспорт
	
	Перем ПереданныйСертификат, ВыбранныйСертификат, Сертификат;
	Перем ПараметрыАвторизации, ОрганизацияЭДО, КонтрагентыЭДО;
	Перем НаборДанных, ЭлементНабораДанных, КвитанцияСсылка, КонтрагентЭДО;
	Перем ЗапросДанныхПодписанта, ПоследняяОшибка, ТекстСообщения;
	Перем MchdData, ЗапросДанныеКвитанции, ДанныеФормирования;
	
	ПереданныйСертификат = Параметры.ОписаниеДанных.ВыбранныйСертификат;
	
	Если ПереданныйСертификат.Свойство("Ссылка") Тогда
		ВыбранныйСертификат = ПереданныйСертификат.Ссылка;
	Иначе
		ВыбранныйСертификат = ПереданныйСертификат;
	КонецЕсли;
	
	ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
	КонтрагентыЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "КонтрагентыЭДО");
	ОрганизацияЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОрганизацияЭДО");
	Сертификат = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Сертификат"); // Сертификат из параметров авторизации
	
	НаборДанных = Новый Массив;
	Если Параметры.ОписаниеДанных.Свойство("НаборДанных") Тогда
		НаборДанных = Параметры.ОписаниеДанных.НаборДанных;
	Иначе
		НаборДанных.Добавить(Параметры.ОписаниеДанных);
	КонецЕсли;
	
	Если ВыбранныйСертификат <> Сертификат Тогда
		
		Для каждого ЭлементНабораДанных Из НаборДанных Цикл
			
			КвитанцияСсылка = ЭлементНабораДанных.КвитанцияСсылка;
			КонтрагентЭДО = КонтрагентыЭДО.Получить(КвитанцияСсылка);
			
			// Машиночитаемая доверенность
			ЗапросДанныхПодписанта = ККСНГ_ОтправкаЭДВызовСервера.ПолучитьДанныеПодписанта(ОрганизацияЭДО, КонтрагентЭДО, ВыбранныйСертификат);
			Если Не ЗапросДанныхПодписанта.Успех Тогда
				
				ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныхПодписанта.Журнал);
				Если ПоследняяОшибка <> Неопределено Тогда
					ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				Иначе
					ТекстСообщения = "Не удалось получить данные подписанта: неизвестная ошибка";
				КонецЕсли;
				Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
				
				Прервать;
				
			КонецЕсли;
			
			ЭлементНабораДанных.Вставить("ДанныеПодписанта", ЗапросДанныхПодписанта.Результат);
			
			// Данные МЧД для создания квитанций
			Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "НеОтправлять") <> 0 Тогда
				
				MchdData = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_MchdData");
				MchdData.Uuid = ЭлементНабораДанных.ДанныеПодписанта.МЧД.Номер;
				MchdData.StartDate = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ДатаНачала;
				
				Если СтрСравнить(ЭлементНабораДанных.ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
					MchdData.MchdViewType = "Meta";
					MchdData.AccessMode = ЭлементНабораДанных.ДанныеПодписанта.МЧД.ИнформационнаяСистема;
				Иначе
					MchdData.MchdViewType = "File";
				КонецЕсли;
				
			КонецЕсли;
			
			ЗапросДанныеКвитанции = ККСНГ_КвитанцииВызовСервера.СформироватьОтветнуюКвитанциюНаСервере(КвитанцияСсылка, ПараметрыАвторизации, MchdData);
			Если Не ЗапросДанныеКвитанции.Успех Тогда
				
				ПоследняяОшибка = ККСНГ_ЛогированиеКлиентСервер.ПоследняяОшибкаЖурнала(ЗапросДанныеКвитанции.Журнал);
				Если ПоследняяОшибка <> Неопределено Тогда
					ТекстСообщения = ККСНГ_ЛогированиеКлиентСервер.ТекстСообщения(ПоследняяОшибка);
				Иначе
					ТекстСообщения = "Не удалось сформировать ответную квитанцию: неизвестная ошибка";
				КонецЕсли;
				Параметры.Вставить("ОписаниеОшибки", ТекстСообщения);
				
				Прервать;
			КонецЕсли;
			
			ДанныеФормирования = ПолучитьИзВременногоХранилища(ЗапросДанныеКвитанции.Результат);
			
			ЭлементНабораДанных.Вставить("Content", ДанныеФормирования.FileContent);
			ЭлементНабораДанных.Вставить("ДанныеОтветнойКвитанции", ДанныеФормирования.FileContent);
			ЭлементНабораДанных.Вставить("Данные", ДанныеФормирования.FileContent.Content);
			ЭлементНабораДанных.Вставить("idКвитанции", ДанныеФормирования.idКвитанции);
			ЭлементНабораДанных.Вставить("КвитанцияСсылка", КвитанцияСсылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.Оповещение, Параметры);
	
КонецПроцедуры

// Вызывается после подписи массива ИОП для отправки их в Курьер 
//
// Параметры:
//	Результат    - Структура - Результат подписания.
//	ДопПараметры - структура - параметры вызова ОтправитьОтветНаКвитанцию()
//
Процедура ПодписатьДанныеКвитанцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Перем ЭлектронныеДокументы, ПараметрыАвторизации, ОрганизацияЭДО, ИмяКоманды, УникальныйИдентификатор;
	Перем ТекКвитанция, SignedContent, СвойстваПодписи, Подпись, SignatureMchd;
	Перем Доверенность, АдресДанныхВХранилище, ТекКвитанцияСсылка, РезультатОтправки;
	Перем ОсновнойДокумент, Параметры, ОписаниеОповещенияОЗавершении;
	
	Если Результат.Успех Тогда
		
		ЭлектронныеДокументы = Новый Массив;
		
		ПараметрыАвторизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыАвторизации");
		ОрганизацияЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОрганизацияЭДО");
		ИмяКоманды = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ИмяКоманды");
		УникальныйИдентификатор = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "УникальныйИдентификатор");
		
		Для каждого ТекКвитанция Из Результат.НаборДанных Цикл
			
			SignedContent = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignedContent");
			
			СвойстваПодписи = ККСНГ_ДокументооборотКлиентСервер.СвойстваПодписиИзРезультатаПодписания(ТекКвитанция);
			Подпись = СвойстваПодписи.Подпись;
			
			ЗаполнитьЗначенияСвойств(SignedContent, ТекКвитанция.ДанныеОтветнойКвитанции);
			SignedContent.Вставить("Signature", Подпись);
			
			// Машиночитаемая доверенность
			Если СтрСравнить(ТекКвитанция.ДанныеПодписанта.ВариантОтправкиМЧД, "Метаданные") = 0 Тогда
				
				SignedContent.MchdUuid = ТекКвитанция.ДанныеПодписанта.МЧД.Номер;
				SignedContent.MchdAccessMode = ТекКвитанция.ДанныеПодписанта.МЧД.ИнформационнаяСистема;
				
				Если Не ПустаяСтрока(ТекКвитанция.ДанныеПодписанта.МЧД.ИННДоверителя) Тогда
					SignedContent.MchdInn = ТекКвитанция.ДанныеПодписанта.МЧД.ИННДоверителя;
				КонецЕсли;
				
				Если Не ПустаяСтрока(ТекКвитанция.ДанныеПодписанта.МЧД.ИННПредставителя) Тогда
					SignedContent.MchdConfidantInn = ТекКвитанция.ДанныеПодписанта.МЧД.ИННПредставителя;
				КонецЕсли;
				
				Для каждого Доверенность Из ТекКвитанция.ДанныеПодписанта.МЧД.Цепочка Цикл
					
					SignatureMchd =  ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
					
					SignatureMchd.MchdUuid = Доверенность.Номер;
					SignatureMchd.MchdAccessMode = Доверенность.ИнформационнаяСистема;
					
					Если Не ПустаяСтрока(Доверенность.ИННДоверителя) Тогда
						SignatureMchd.MchdInn = Доверенность.ИННДоверителя;
					КонецЕсли;
					
					Если Не ПустаяСтрока(Доверенность.ИННПредставителя) Тогда
						SignatureMchd.MchdConfidantInn = Доверенность.ИННПредставителя;
					КонецЕсли;
					
					SignedContent.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если СтрСравнить(ТекКвитанция.ДанныеПодписанта.ВариантОтправкиМЧД, "Пакет") = 0 Тогда
				
				SignedContent.MchdFileName = ТекКвитанция.ДанныеПодписанта.МЧД.ИмяФайлаДоверенности;
				SignedContent.MchdFile = ТекКвитанция.ДанныеПодписанта.МЧД.ФайлДоверенности;
				SignedContent.MchdSignature = ТекКвитанция.ДанныеПодписанта.МЧД.ФайлПодписи;
				
				Для каждого Доверенность Из ТекКвитанция.ДанныеПодписанта.МЧД.Цепочка Цикл
					
					Если Доверенность.ЕстьФайлДоверенности И Доверенность.ЕстьФайлПодписи Тогда
						
						SignatureMchd = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруПоТипуXDTO("type_SignatureMchdIdentify");
						
						SignatureMchd.MchdFileName = Доверенность.ИмяФайлаДоверенности;
						SignatureMchd.MchdFile = Доверенность.ФайлДоверенности;
						SignatureMchd.MchdSignature = Доверенность.ФайлПодписи;
						
						SignedContent.Chain.SignatureMchdIdentify.Добавить(SignatureMchd);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			АдресДанныхВХранилище = ПоместитьВоВременноеХранилище(SignedContent);
			
			ТекКвитанцияСсылка = ТекКвитанция.КвитанцияСсылка;
			РезультатОтправки = ККСНГ_КвитанцииВызовСервера.ОтправитьКвитанциюНаСервере(ТекКвитанция.idКвитанции, ТекКвитанцияСсылка, ОрганизацияЭДО, АдресДанныхВХранилище, ПараметрыАвторизации);
			
			Если РезультатОтправки.Успех Тогда
				
				ОсновнойДокумент = РезультатОтправки.Результат.ОсновнойДокумент;
				Если ЭлектронныеДокументы.Найти(ОсновнойДокумент) = Неопределено Тогда
					ЭлектронныеДокументы.Добавить(ОсновнойДокумент);
				КонецЕсли;
				
				ОповеститьОбИзменении(РезультатОтправки.Результат.Квитанция);
				Оповестить("ОтправленаКвитанция", РезультатОтправки.Результат);
				
			Иначе
				// показать ошибки при отправке
				ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Квитанция не отправлена: %1", ТекКвитанцияСсылка));
				ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатОтправки.Журнал, "-1");
			КонецЕсли;
			
			ККСНГ_ДокументооборотКлиент.ОбновитьЭлектронныеДокументыПоДаннымИзКурьера(ЭлектронныеДокументы, ОрганизацияЭДО, ПараметрыАвторизации);
			Для каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
				Оповестить("ПослеКомандыСФЕРАКурьер", , ЭлектронныйДокумент);
			КонецЦикла;
			
		КонецЦикла;
		
		Параметры = Новый Структура("Результат", ИмяКоманды);
		Оповестить("Все квитанции подписаны", Параметры, УникальныйИдентификатор);
		
	Иначе
		Оповестить("ОбновитьДоступностьКомандКурьера");
	КонецЕсли;
	
	ОписаниеОповещенияОЗавершении = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ОписаниеОповещенияОЗавершении", Неопределено);
	
	Если ОписаниеОповещенияОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Результат.Успех);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти