
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.ДатаЗагрузки) Тогда
			ЗаписьРегистра.ДатаЗагрузки = ТекущаяДата;	
		КонецЕсли;
				
		ЗаписьРегистра.ДатаОбработки = ТекущаяДата;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
