#Область ПрограммныйИнтерфейс

// Формирование электронного документа в формате XML
//
// Параметры:
//   ДанныеДокумента - Структура - Данные заполнения электронного документа XML
//								   Описание см. ККСНГ_ЭлектронныеДокументы.СтруктураДанныхДокумента
//   ДанныеФормата - Структура - Структура формата электронного документа
//								 Описание см. ККСНГ_ПМ_ПолучениеДанныхВызовСервера.ПолучитьДанныеФорматаДокументаЭД
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - Сформированная и заполненная структура для создания документа XML 
//
Функция СоздатьXML(ДанныеДокумента, ДанныеФормата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	МодифицированПередОтправкой = Ложь;
	СтандартнаяОбработка = Истина;
	
	ЗаполнитьДанныеТранспорнойНакладнойДляМаркированногоПива(ДанныеДокумента, ДанныеФормата);
	
	ЗапросОбработчикПередФормированием = ВыполнитьОбработчикПередФормированием(ДанныеДокумента, ДанныеФормата, СтандартнаяОбработка);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросОбработчикПередФормированием.Журнал, Ложь);
	
	Если Не ЗапросОбработчикПередФормированием.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	РезультатЗапроса = ЗапросОбработчикПередФормированием.Результат;
	Если РезультатЗапроса <> Неопределено Тогда
		
		МодифицированПередОтправкой = Истина;
		
		Если ТипЗнч(РезультатЗапроса) = Тип("Структура") Тогда
			ДанныеДокумента = РезультатЗапроса;
		ИначеЕсли Не СтандартнаяОбработка Тогда // TODO реально ли изменилась структура
			Ответ.Результат = РезультатЗапроса;
			Ответ.Успех = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		
		Если ДанныеФормата.Идентификатор = "УПД_2024" Тогда
			ЗапросСтруктурыДокумента = ПолучитьXMLДляУПД2024(ДанныеДокумента, ДанныеФормата);
		ИначеЕсли ДанныеФормата.Идентификатор = "УПД_2019" Тогда
			ЗапросСтруктурыДокумента = ПолучитьXMLДляУПД2019(ДанныеДокумента, ДанныеФормата);
		ИначеЕсли ДанныеФормата.Идентификатор = "УКД_2020" Тогда 
			ЗапросСтруктурыДокумента = ПолучитьXMLДляУКД2020(ДанныеДокумента, ДанныеФормата);
		ИначеЕсли ДанныеФормата.Идентификатор = "BILL" Тогда
			ЗапросСтруктурыДокумента = ПолучитьXMLДляСчета(ДанныеДокумента, ДанныеФормата);
		ИначеЕсли ДанныеФормата.Идентификатор = "UVHD_BILL" Тогда
			ЗапросСтруктурыДокумента = ПолучитьXMLДляСчетаУВХД(ДанныеДокумента, ДанныеФормата);
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не реализовано формирование электронного документа по формату: " + ДанныеФормата.ВерсияФормата, "");
			Возврат Ответ;
		КонецЕсли;
		
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСтруктурыДокумента.Журнал, Ложь);
		
		Если ЗапросСтруктурыДокумента.Успех Тогда
			
			СтруктураДокумента = ЗапросСтруктурыДокумента.Результат; 
			
			ЗапросОбработчикПослеФормирования = ВыполнитьОбработчикПослеФормирования(СтруктураДокумента, ДанныеДокумента, ДанныеФормата);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросОбработчикПослеФормирования.Журнал, Ложь);
			
			Если ЗапросОбработчикПослеФормирования.Успех Тогда
				
				// Данные были обновлены в обработчике
				Если ТипЗнч(ЗапросОбработчикПослеФормирования.Результат) = Тип("Структура") Тогда
					// TODO  реально ли изменилась структура
					СтруктураДокумента = ЗапросОбработчикПослеФормирования.Результат;
					МодифицированПередОтправкой = Истина;
				КонецЕсли;
				
				Если ДанныеФормата.Идентификатор = "UVHD_BILL" Тогда
					ЗапросXML = ККСНГ_XDTOКлиентСервер.ПолучитьXMLПоСтруктуре(СтруктураДокумента, ДанныеФормата.ПространствоИмен, "Request", , Истина, "windows-1251", Истина, Истина);
					ЗапросXML.Результат = СтрЗаменить(ЗапросXML.Результат, " lang=", " xml:lang=");
				Иначе
					// Удаляем из структуры ЭД пустые значения для корректного формирования XML
					УдалитьНеопределеноИзСтруктуры(СтруктураДокумента);
					ЗапросXML = ККСНГ_XDTOКлиентСервер.ПолучитьXMLПоСтруктуре(СтруктураДокумента, ДанныеФормата.ПространствоИмен, "Файл", , Истина, "windows-1251", Истина, Истина);
				КонецЕсли;
				
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросXML.Журнал, Ложь);
				
				Если ЗапросXML.Успех Тогда
					Ответ.Результат = ЗапросXML.Результат;
					Ответ.Успех = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДокумента.Вставить("МодифицированПередОтправкой", МодифицированПередОтправкой);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеXML

#Область Формат970

// Формирует и заполняет структуру документа формата ФНС (приказ 970)
// Приказ ФНС России от 19.12.2023 № ЕД-7-26/970@ (https://www.nalog.gov.ru/rn77/about_fts/docs/14414412)
//
// Параметры:
//   ДанныеДокумента - Структура - Данные заполнения электронного документа XML
//								   Описание см. ККСНГ_ЭлектронныеДокументы.СтруктураДанныхДокумента
//   ДанныеФормата - Структура - Структура формата электронного документа
//								 Описание см. ККСНГ_ПМ_ПолучениеДанныхВызовСервера.ПолучитьДанныеФорматаДокументаЭД
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - Сформированная и заполненная структура для создания документа XML 
//
// Пример:
//	Ответ:
//		Журнал - Массив - Стек выполняемых действий
//		КодОшибки -	Неопределено	
//		Результат -	Структура - Структура
//			ВерсПрог - Строка - "Модуль ЭДО 0.29.0"
//			ВерсФорм - Строка - "5.02"
//			Документ - Структура
//			ИдФайл - Строка - "ON_NSCHFDOPPR_2BK-6670217835-1682_2BK-3436001618-91083_20240618_77D97046-9F3C-4C8B-94DE-6835DD0CC063_0_0_0_0_0_00"
//			СвУчДокОбор - Структура
//			ИдОтпр - Строка - "2BK-6670217835-1682"
//			ИдПол - Строка - "2BK-3436001618-91083_20240618"
//			СвОЭДОтпр - Структура
//			ИННЮЛ - Строка - "7801392271"
//			ИдЭДО - Строка - "2BK"
//			НаимОрг - Строка - "ООО СберКорус (2BK)"
//		Успех - Булево - Истина
//
Функция ПолучитьXMLДляУПД2024(ДанныеДокумента, ДанныеФормата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если (ДанныеДокумента.ЭтоСФ И ДанныеФормата.ФункцияУПД = "ДОП") Или (Не ДанныеДокумента.ЭтоСФ И ДанныеФормата.ФункцияУПД <> "ДОП") Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка данных формата ЭДО.", "XM-00001");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.КодЭДОПолучателя) Тогда 
		ТекстОшибки = "Не заполнен код ЭДО организации: " + Строка(ДанныеДокумента.ОтправительЭД);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00002", , ДанныеДокумента.ОтправительЭД);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.КодЭДООтправителя) Тогда 
		ТекстОшибки = "Не заполнен код ЭДО контрагента: " + Строка(ДанныеДокумента.ПолучательЭД);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00003", , ДанныеДокумента.ПолучательЭД);
	КонецЕсли;
	
	СтруктураДокумента = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл", ДанныеФормата.ПространствоИмен);
	
	// Заполнение основных данных файла
	Прослеживаемость = ?(ДанныеДокумента.ЕстьПрослеживание, "1", "0");
	Маркировка = ?(ДанныеДокумента.ЕстьМаркировка, "1", "0");
	АлкогольнаяПродукция = ?(ДанныеДокумента.АлкогольнаяПродукция, "1", "0");
	ТабачнаяПродукция = ?(ДанныеДокумента.ТабачнаяПродукция, "1", "0");
	Нефтепродукты = ?(ДанныеДокумента.Нефтепродукты, "1", "0");
	ГосударственныйКонтроль = ДанныеДокумента.ГосударственныйКонтроль;
	
	Если Не ЗначениеЗаполнено(ГосударственныйКонтроль) Тогда
		ГосударственныйКонтроль = "00";
	КонецЕсли;
	
	ДатаФормированияПоФормату = Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд");
	УИДВВерхнемРегистре = ВРег(Новый УникальныйИдентификатор);
	
	ИдФайл = СтрШаблон("ON_NSCHFDOPPR_%1_%2_%3_%4_%5_%6_%7_%8_%9_%10",
						ДанныеДокумента.КодЭДОПолучателя,
						ДанныеДокумента.КодЭДООтправителя,
						ДатаФормированияПоФормату,
						УИДВВерхнемРегистре,
						Прослеживаемость,
						Маркировка,
						АлкогольнаяПродукция,
						ТабачнаяПродукция,
						Нефтепродукты,
						ГосударственныйКонтроль);
	
	СтруктураДокумента.ВерсПрог = Лев(ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НаименованиеВерсииМодуля(), 40);
	СтруктураДокумента.ВерсФорм = "5.03";
	СтруктураДокумента.ИдФайл = ИдФайл;
	
	ДанныеДокумента.Вставить("ИдФайл", ИдФайл);
	
	// Заполнение шапки документа
	Документ = СтруктураДокумента.Документ;
	Документ.УИД = ""; // Пока не заполняем
	Документ.КНД = "1115131";
	Документ.Функция = ДанныеФормата.ФункцияУПД;
	
	Если ДанныеФормата.ФункцияУПД <> "СЧФ" Тогда
		
		Документ.ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
		
		Если ДанныеФормата.ФункцияУПД = "СЧФДОП" Тогда
			Документ.НаимДокОпр = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
		ИначеЕсли ДанныеФормата.ФункцияУПД = "ДОП" Тогда
			Документ.НаимДокОпр = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)";
		Иначе
			Документ.НаимДокОпр = Неопределено;
		КонецЕсли;
		
	Иначе
		Документ.НаимДокОпр = Неопределено;
		Документ.ПоФактХЖ = Неопределено;
	КонецЕсли;
	
	Документ.НаимЭконСубСост = ДанныеДокумента.СоставительДокументаНаименование;
	
	// Заполнение сведений о счете-фактуре
	СведенияОСчетФактуре = Документ.СвСчФакт;
	
	СведенияОСчетФактуре.НомерДок = ДанныеДокумента.Номер;
	Если Не ЗначениеЗаполнено(СведенияОСчетФактуре.НомерДок) И ДанныеФормата.ФункцияУПД = "ДОП" Тогда
		СведенияОСчетФактуре.НомерДок = "б/н";
	КонецЕсли;
	
	СведенияОСчетФактуре.ДатаДок = Формат(ДанныеДокумента.Дата, "ДФ=дд.ММ.гггг");
	Документ.ДатаИнфПр = Формат(ДанныеДокумента.Дата, "ДФ=дд.ММ.гггг");
	Документ.ВремИнфПр = Формат(ДанныеДокумента.Дата, "ДФ=ЧЧ.мм.сс");
	
	// Заполнение данных исправления
	Если (ДанныеДокумента.ДокументСсылка.Метаданные().ПолноеИмя() = "Документ.КорректировкаРеализации" И ДанныеФормата.ФункцияУПД = "ДОП") Или ДанныеДокумента.ЭтоИсправление Тогда
		ДанныеИсправления = СведенияОСчетФактуре.ИспрДок;
		ДанныеИсправления.НомИспр  = ДанныеДокумента.НомерИсправления;
		ДанныеИсправления.ДатаИспр = Формат(ДанныеДокумента.ДатаИсправления, "ДФ=дд.ММ.гггг");
		
		СведенияОСчетФактуре.ИмяФайлИспрПрод = ""; // !!!
		СведенияОСчетФактуре.ИмяФайлИспрПок = ""; // !!!
		
	Иначе
		СведенияОСчетФактуре.ИспрДок = Неопределено;
	КонецЕсли;
	
	// Заполнение сведений о продавце
	Если ДанныеДокумента.Продавцы.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного продавца.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00040", , ДанныеДокумента.ДокументСсылка);
	КонецЕсли;
	
	Для каждого ТекПродавец Из ДанныеДокумента.Продавцы Цикл
		СведенияОПродавце = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("УчастникТип", ДанныеФормата.ПространствоИмен);
		ЗаполнитьСведенияОбУчастнике970(СведенияОПродавце, ТекПродавец, ТекПродавец.ЮридическийАдрес, ДанныеФормата, Ответ.Журнал);
		СведенияОСчетФактуре.СвПрод.Добавить(СведенияОПродавце);
	КонецЦикла;
	
	// Заполнение сведений о покупателе
	Если ДанныеДокумента.Покупатели.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного покупателя.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00028", , ДанныеДокумента.ДокументСсылка);
	КонецЕсли;
	
	Для каждого ТекПокупатель Из ДанныеДокумента.Покупатели Цикл
		СведенияОПокупателе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("УчастникТип", ДанныеФормата.ПространствоИмен);
		ЗаполнитьСведенияОбУчастнике970(СведенияОПокупателе, ТекПокупатель, ТекПокупатель.ЮридическийАдрес, ДанныеФормата, Ответ.Журнал);
		СведенияОСчетФактуре.СвПокуп.Добавить(СведенияоПокупателе);
	КонецЦикла;
	
	// Заполнение сведений о грузоотправителе и грузополучателе
	ЗаполнитьСведенияПоОтправителюПолучателю970(СведенияОСчетФактуре, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);
	
	// Заполнение сведений о платежно-расчетном документе
	Если ДанныеФормата.ФункцияУПД <> "ДОП" Тогда
		
		СвПРД = СведенияОСчетФактуре.СвПРД;
		
		Для каждого ПРД Из ДанныеДокумента.ПлатежноРасчетныеДокументы Цикл
			
			СтруктураПРД = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.СвПРД", ДанныеФормата.ПространствоИмен);
			СтруктураПРД.НомерПРД = ?(ЗначениеЗаполнено(ПРД.Номер), ПРД.Номер, Неопределено);
			СтруктураПРД.ДатаПРД = Формат(ПРД.Дата, "ДФ=дд.ММ.гггг");
			
			СвПРД.Добавить(СтруктураПРД);
			
		КонецЦикла;
		
		Если СвПРД.Количество() = 0 Тогда
			СвПРД = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение сведений о валюте
	ЕдиницаДенежногоИзмерения = СведенияОСчетФактуре.ДенИзм;
	ЕдиницаДенежногоИзмерения.КодОКВ = ДанныеДокумента.СведенияОВалюте.Код;
	ЕдиницаДенежногоИзмерения.НаимОКВ = ?(ЗначениеЗаполнено(ДанныеДокумента.СведенияОВалюте.Наименование), ДанныеДокумента.СведенияОВалюте.Наименование, Неопределено);
	ЕдиницаДенежногоИзмерения.КурсВал = ?(ЗначениеЗаполнено(ДанныеДокумента.СведенияОВалюте.Курс), ДанныеДокумента.СведенияОВалюте.Курс, Неопределено);
	
	// Заполнение обстоятельств формирования счета-фактуры
	ДопСвФХЖ1 = СведенияОСчетФактуре.ДопСвФХЖ1;
	Если ДанныеДокумента.ЭтоАванс Тогда
		ДопСвФХЖ1.СпОбстФСЧФ = "2";
	КонецЕсли;
	
	ДокПодтвОтгр = СведенияОСчетФактуре.ДокПодтвОтгрНом;
	
	Если Не ДанныеДокумента.ЭтоАванс Тогда
		
		Если ДанныеФормата.ФункцияУПД = "СЧФДОП" Тогда
			ЗаполнитьДокументыПодтвержденияОтгрузки970(ДокПодтвОтгр, ДанныеФормата, Документ.НаимДокОпр, СведенияОСчетФактуре.НомерДок, СведенияОСчетФактуре.ДатаДок);
		Иначе
			Для каждого ТекПодтверждение Из ДанныеДокумента.ДокументыПодтвержденияОтгрузки Цикл
				ЗаполнитьДокументыПодтвержденияОтгрузки970(ДокПодтвОтгр, ДанныеФормата, ТекПодтверждение.Наименование, ТекПодтверждение.Номер, ТекПодтверждение.Дата);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДокПодтвОтгр.Количество() = 0 Тогда
		ДокПодтвОтгр = Неопределено;
	КонецЕсли;
	
	// Заполнение таблицы товаров
	ЗаполнитьТоварыУслугиФормат970(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);
	
	// Заполнение сведений о передаче
	ЗаполнитьСведенияОПередаче970(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(Документ.СвПродПер) Или ДанныеФормата.ФункцияУПД = "СЧФ" Тогда
		Документ.СвПродПер = Неопределено;
	КонецЕсли;
	
	// Заполнение подписанта
	Подписант = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.Подписант", ДанныеФормата.ПространствоИмен);
	Подписант.СпосПодтПолном = "1";
	ФИО = Подписант.ФИО;
	ФИО.Фамилия = "-";
	ФИО.Имя = "-";
	ФИО.Отчество = "-";
	Документ.Подписант.Добавить(Подписант);
	
	// Заполнение информационных полей ФХЖ1
	Для каждого ИнфополеФХЖ1 Из ДанныеДокумента.ИнфополяФХЖ1 Цикл
		ТекстИнф = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ИнфПолФХЖ1.ТекстИнф", ДанныеФормата.ПространствоИмен);
		ЗаполнитьЗначенияСвойств(ТекстИнф, ИнфополеФХЖ1);
		Если ЗначениеЗаполнено(ТекстИнф.Идентиф) Тогда
			СведенияОСчетФактуре.ИнфПолФХЖ1.ТекстИнф.Добавить(ТекстИнф);
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал)) Тогда
		Ответ.Результат = СтруктураДокумента;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура ЗаполнитьДанныеТранспорнойНакладнойДляМаркированногоПива(ДанныеДокумента, ДанныеФормата)
	
	Перем ФункцияУПД, РеквизитыТТН, ТранспортнаяНакладная, РеквизитыРеализации;
	
	ФункцияУПД = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФормата, "ФункцияУПД");
	
	Если ФункцияУПД = "ДОП" Или ФункцияУПД = "СЧФДОП" Тогда
		Если ККСНГ_ОтправкаЭДВызовСервера.ЕстьМаркировкаПива(ДанныеДокумента) Тогда
			
			РеквизитыТТН = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("ТранспортнаяНакладная", "ККСНГ_DOCUMENT_1C");
			Для каждого ТранспортнаяНакладная Из ДанныеДокумента.ТранспортныеНакладные Цикл
				ЗаполнитьЗначенияСвойств(РеквизитыТТН, ТранспортнаяНакладная);
				Прервать;
			КонецЦикла;
			Если Не ЗначениеЗаполнено(РеквизитыТТН.Номер) Тогда
				РеквизитыРеализации = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИмеющегосяРеквизитаОбъекта(ДанныеДокумента.ДокументРеализации, "Номер,Дата");
				РеквизитыТТН.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыРеализации["Номер"], Истина, Ложь);
				РеквизитыТТН.Дата = РеквизитыРеализации["Дата"];
			КонецЕсли;
			
			ВставитьИнфополеФХЖ1(ДанныеДокумента.ИнфополяФХЖ1, "НомерПеревозДок", РеквизитыТТН.Номер);
			ВставитьИнфополеФХЖ1(ДанныеДокумента.ИнфополяФХЖ1, "ДатаПеревозДок", Формат(РеквизитыТТН.Дата, "ДФ=dd.MM.yyyy"));
			ВставитьИнфополеФХЖ1(ДанныеДокумента.ИнфополяФХЖ1, "РегНомер", ?(ПустаяСтрока(РеквизитыТТН.РегНомер), "-", РеквизитыТТН.РегНомер));
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Формат820

// Формирует и заполняет структуру документа формата ФНС (приказ 820)
// Приказ от 19.12.2018 № ММВ-7-15/820@ (https://www.nalog.ru/rn77/about_fts/docs/8335278)
//
// Параметры:
//   ДанныеДокумента - Структура - Данные заполнения электронного документа XML
//								   Описание см. ККСНГ_ЭлектронныеДокументы.СтруктураДанныхДокумента
//   ДанныеФормата - Структура - Структура формата электронного документа
//								 Описание см. ККСНГ_ПМ_ПолучениеДанныхВызовСервера.ПолучитьДанныеФорматаДокументаЭД
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - Сформированная и заполненная структура для создания документа XML 
//
// Пример:
//	Ответ:
//		Журнал - Массив - Стек выполняемых действий
//		КодОшибки -	Неопределено	
//		Результат -	Структура - Структура
//			ВерсПрог - Строка - "Модуль ЭДО 0.29.0"
//			ВерсФорм - Строка - "5.01"
//			Документ - Структура
//			ИдФайл - Строка - "ON_NSCHFDOPPR_2BK-7733624370-51140_2BK-2222791653-51141_20200814_7EA68098-90F4-49DD-84D1-D6E6E05CD3E4"
//			СвУчДокОбор - Структура
//			ИдОтпр - Строка - "2BK-2222791653-51141"
//			ИдПол - Строка - "2BK-7733624370-51140"
//			СвОЭДОтпр - Структура
//			ИННЮЛ - Строка - "7801392271"
//			ИдЭДО - Строка - "2BK"
//			НаимОрг - Строка - "ООО СберКорус (2BK)"
//		Успех - Булево - Истина
//
Функция ПолучитьXMLДляУПД2019(ДанныеДокумента, ДанныеФормата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если (ДанныеДокумента.ЭтоСФ И ДанныеФормата.ФункцияУПД = "ДОП") Или (Не ДанныеДокумента.ЭтоСФ И ДанныеФормата.ФункцияУПД <> "ДОП") Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка данных формата ЭДО.", "XM-00001");
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.КодЭДОПолучателя) Тогда 
		ТекстОшибки = "Не заполнен код ЭДО организации: " + Строка(ДанныеДокумента.ОтправительЭД);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00002", , ДанныеДокумента.ОтправительЭД);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.КодЭДООтправителя) Тогда 
		ТекстОшибки = "Не заполнен код ЭДО контрагента: " + Строка(ДанныеДокумента.ПолучательЭД);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00003", , ДанныеДокумента.ПолучательЭД);
	КонецЕсли;
	
	СтруктураДокумента = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл", ДанныеФормата.ПространствоИмен);
	
	// Заполнение основных данных файла
	ДатаФормирования = ТекущаяДатаСеанса();
	
	УточнениеИмениФайла = "";
	Если ДанныеДокумента.ЕстьМаркировка Тогда
		УточнениеИмениФайла = "MARK";
	ИначеЕсли ДанныеДокумента.ЕстьПрослеживание Тогда
		УточнениеИмениФайла = "PROS";
	КонецЕсли;
	
	ДатаФормированияПоФормату = Формат(ДатаФормирования, "ДФ=ггггММдд");
	УИДВВерхнемРегистре = ВРег(Новый УникальныйИдентификатор);
	
	ИдФайл = СтрШаблон("ON_NSCHFDOPPR%1_%2_%3_%4_%5",
						УточнениеИмениФайла,
						ДанныеДокумента.КодЭДОПолучателя,
						ДанныеДокумента.КодЭДООтправителя,
						ДатаФормированияПоФормату,
						УИДВВерхнемРегистре);
	
	СтруктураДокумента.ВерсПрог = Лев(ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НаименованиеВерсииМодуля(), 40);
	СтруктураДокумента.ВерсФорм = "5.01";
	СтруктураДокумента.ИдФайл = ИдФайл;
	
	ДанныеДокумента.Вставить("ИдФайл", ИдФайл);
	
	// Заполнение сведений об участниках и операторе ЭДО
	СведенияОбУчастниках = СтруктураДокумента.СвУчДокОбор;
	СведенияОбУчастниках.ИдОтпр = ДанныеДокумента.КодЭДООтправителя;
	СведенияОбУчастниках.ИдПол = ДанныеДокумента.КодЭДОПолучателя;
	
	ПрофильНастроекЭДО = ККСНГ_ЭлектронныеДокументы.ПрофильНастроекЭДОКорусКонсалтингСНГ();
	
	СведенияОбОператоре = СведенияОбУчастниках.СвОЭДОтпр;
	СведенияОбОператоре.НаимОрг = ПрофильНастроекЭДО.ОператорЭДО;
	СведенияОбОператоре.ИННЮЛ = ПрофильНастроекЭДО.ОператорЭДОИНН;
	СведенияОбОператоре.ИдЭДО = ПрофильНастроекЭДО.ОператорЭДОИд;
	
	// Заполнение шапки документа
	Документ = СтруктураДокумента.Документ;
	Документ.КНД = "1115131";
	Документ.Функция = ДанныеФормата.ФункцияУПД;
	
	Если ДанныеФормата.ФункцияУПД <> "СЧФ" Тогда
		
		Документ.ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
		
		Если ДанныеФормата.ФункцияУПД = "СЧФДОП" Тогда
			Документ.НаимДокОпр = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
		ИначеЕсли ДанныеФормата.ФункцияУПД = "ДОП" Тогда
			Документ.НаимДокОпр = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)";
		Иначе
			Документ.НаимДокОпр = Неопределено;
		КонецЕсли;
		
	Иначе
		Документ.НаимДокОпр = Неопределено;
		Документ.ПоФактХЖ = Неопределено;
	КонецЕсли;
	
	Документ.ДатаИнфПр = Формат(ДатаФормирования, "ДФ=дд.ММ.гггг");
	Документ.ВремИнфПр = Формат(ДатаФормирования, "ДФ=ЧЧ.мм.сс");
	
	Документ.НаимЭконСубСост = ДанныеДокумента.СоставительДокументаНаименование;
	
	Документ.ОснДоверОргСост = Неопределено;
	Документ.СоглСтрДопИнф = Неопределено;
	
	// Заполнение сведений о счете-фактуре
	СвСчФакт = Документ.СвСчФакт;
	СвСчФакт.НомерСчФ = ДанныеДокумента.Номер;
	СвСчФакт.ДатаСчФ = Формат(ДанныеДокумента.Дата, "ДФ=дд.ММ.гггг");
	
	Если (ДанныеДокумента.ДокументСсылка.Метаданные().ПолноеИмя() = "Документ.КорректировкаРеализации" И ДанныеФормата.ФункцияУПД = "ДОП") Или ДанныеДокумента.ЭтоИсправление Тогда             
		
		//СвСчФакт.ДатаСчФ = ДанныеДокумента.ДатаИсходногоДокумента;
		ДанныеИсправления = СвСчФакт.ИспрСчФ;
		ДанныеИсправления.НомИспрСчФ  = ДанныеДокумента.НомерИсправления;
		ДанныеИсправления.ДатаИспрСчФ = Формат(ДанныеДокумента.ДатаИсправления, "ДФ=дд.ММ.гггг");
		
	Иначе
		СвСчФакт.ИспрСчФ = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СвСчФакт.НомерСчФ) И ДанныеФормата.ФункцияУПД = "ДОП" Тогда
		СвСчФакт.НомерСчФ = "б/н";
	КонецЕсли;
	
	// Заполнение сведений о продавце
	Если ДанныеДокумента.Продавцы.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного продавца.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00040", , ДанныеДокумента.ДокументСсылка);
	КонецЕсли;
	Для каждого ТекПродавец Из ДанныеДокумента.Продавцы Цикл
		СведенияОПродавце = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("УчастникТип", ДанныеФормата.ПространствоИмен);
		ЗаполнитьСведенияОбУчастнике(СведенияОПродавце, ТекПродавец, ТекПродавец.ЮридическийАдрес, ДанныеФормата, Ответ.Журнал);
		СвСчФакт.СвПрод.Добавить(СведенияОПродавце);
	КонецЦикла;
	
	// Заполнение сведений о покупателе
	Если ДанныеДокумента.Покупатели.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного покупателя.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00028", , ДанныеДокумента.ДокументСсылка);
	КонецЕсли;
	Для каждого ТекПокупатель Из ДанныеДокумента.Покупатели Цикл
		СведенияОПокупателе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("УчастникТип", ДанныеФормата.ПространствоИмен);
		ЗаполнитьСведенияОбУчастнике(СведенияОПокупателе, ТекПокупатель, ТекПокупатель.ЮридическийАдрес, ДанныеФормата, Ответ.Журнал);
		СвСчФакт.СвПокуп.Добавить(СведенияоПокупателе);
	КонецЦикла;
	
	Если ДанныеФормата.ФункцияУПД <> "ДОП" Тогда
		
		СвПРД = СвСчФакт.СвПРД;
		
		Для каждого ПРД Из ДанныеДокумента.ПлатежноРасчетныеДокументы Цикл
			
			СтруктураПРД = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.СвПРД", ДанныеФормата.ПространствоИмен);
			СтруктураПРД.НомерПРД = ?(ЗначениеЗаполнено(ПРД.Номер), ПРД.Номер, Неопределено); 
			СтруктураПРД.ДатаПРД = Формат(ПРД.Дата, "ДФ=дд.ММ.гггг");
			
			СвПРД.Добавить(СтруктураПРД);
			
		КонецЦикла;
		
		Если СвПРД.Количество() = 0 Тогда
			СвПРД = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ДопСвФХЖ = СвСчФакт.ДопСвФХЖ1;
	
	// Заполнение сведений о валюте
	СвСчФакт.КодОКВ = ДанныеДокумента.СведенияОВалюте.Код;
	ДопСвФХЖ.НаимОКВ = ?(ЗначениеЗаполнено(ДанныеДокумента.СведенияОВалюте.Наименование), ДанныеДокумента.СведенияОВалюте.Наименование, Неопределено);
	ДопСвФХЖ.КурсВал = ?(ЗначениеЗаполнено(ДанныеДокумента.СведенияОВалюте.Курс), ДанныеДокумента.СведенияОВалюте.Курс, Неопределено);
	
	// Заполнение обстоятельств формирования счета-фактуры
	Если ДанныеФормата.ФункцияУПД = "СЧФ" Тогда
		Если ЗначениеЗаполнено(ДанныеДокумента.ОбстоятельстваФормированияСФ) И ДанныеДокумента.ОбстоятельстваФормированияСФ >= 1 И ДанныеДокумента.ОбстоятельстваФормированияСФ <= 3 Тогда
			ДопСвФХЖ.ОбстФормСЧФ = Формат(ДанныеДокумента.ОбстоятельстваФормированияСФ, "ЧН=; ЧГ=");
		ИначеЕсли ДанныеДокумента.ЭтоАванс Тогда
			ДопСвФХЖ.ОбстФормСЧФ = "2";
		ИначеЕсли ДанныеДокумента.ЭтоСводныйСчетФактура Тогда
			ДопСвФХЖ.ОбстФормСЧФ = "3";
		Иначе
			ДопСвФХЖ.ОбстФормСЧФ = "1";
		КонецЕсли;
	ИначеЕсли (ДанныеФормата.ФункцияУПД = "ДОП" Или ДанныеФормата.ФункцияУПД = "СЧФДОП") И ЗначениеЗаполнено(ДанныеДокумента.ОбстоятельстваФормированияСФ)
					И ДанныеДокумента.ОбстоятельстваФормированияСФ > 3 И ДанныеДокумента.ОбстоятельстваФормированияСФ <= 8 Тогда
			ДопСвФХЖ.ОбстФормСЧФ = Формат(ДанныеДокумента.ОбстоятельстваФормированияСФ, "ЧН=; ЧГ=");
	КонецЕсли;
	
	// Заполнение сведений о гос. контракте
	СведенияОГосЗакупках = ДанныеДокумента.СведенияОГосЗакупках;
	ДопСвФХЖ.ИдГосКон = ?(ЗначениеЗаполнено(СведенияОГосЗакупках.ИдентификаторГосКонтракта), СведенияОГосЗакупках.ИдентификаторГосКонтракта, Неопределено);
	
	ИнформацияОГосЗакупках = ДопСвФХЖ.ИнфПродГосЗакКазн;
	ИнформацияОГосЗакупках.ДатаГосКонт = Формат(СведенияОГосЗакупках.ДатаГосКонтракта, "ДФ=дд.ММ.гггг");
	ИнформацияОГосЗакупках.НомерГосКонт = СведенияОГосЗакупках.НомерГосКонтракта;
	ИнформацияОГосЗакупках.ЛицСчетПрод = СведенияОГосЗакупках.НомерЛицевогоСчетаПродавца;
	ИнформацияОГосЗакупках.КодПродБюджКласс = СведенияОГосЗакупках.КодБюджетнойКлассификацииПродавца;
	ИнформацияОГосЗакупках.КодЦелиПрод = СведенияОГосЗакупках.КодЦели;
	ИнформацияОГосЗакупках.КодКазначПрод = СведенияОГосЗакупках.КазначействоПродавцаКод;
	ИнформацияОГосЗакупках.НаимКазначПрод = СведенияОГосЗакупках.КазначействоПродавцаНаименование;
	
	Если ЗначениеЗаполнено(ДопСвФХЖ.ИдГосКон) И (Не ЗначениеЗаполнено(ИнформацияОГосЗакупках.ДатаГосКонт) Или Не ЗначениеЗаполнено(ИнформацияОГосЗакупках.НомерГосКонт)) Тогда
		ТекстОшибки = "Не заполнен номер или дата государственного контракта для счет-фактуры: " + Строка(ДанныеДокумента.СсылкаСчетаФактуры);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00004", , ДанныеДокумента.СсылкаСчетаФактуры);
	КонецЕсли;
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДопСвФХЖ) Тогда
		ДопСвФХЖ = Неопределено;
	КонецЕсли;
	
	ДокПодтвОтгр = СвСчФакт.ДокПодтвОтгр;
	
	Для каждого ТекПодтверждение Из ДанныеДокумента.ДокументыПодтвержденияОтгрузки Цикл
		
		СтруктураДокПодтв = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ДокПодтвОтгр", ДанныеФормата.ПространствоИмен);
		СтруктураДокПодтв.НаимДокОтгр = ?(ЗначениеЗаполнено(ТекПодтверждение.Наименование), ТекПодтверждение.Наименование, Неопределено);
		СтруктураДокПодтв.НомДокОтгр = ?(ЗначениеЗаполнено(ТекПодтверждение.Номер), ТекПодтверждение.Номер, Неопределено); 
		СтруктураДокПодтв.ДатаДокОтгр = Формат(ТекПодтверждение.Дата, "ДФ=дд.ММ.гггг");
		
		ДокПодтвОтгр.Добавить(СтруктураДокПодтв);
		
	КонецЦикла;
	
	Если ДокПодтвОтгр.Количество() = 0 Тогда
		ДокПодтвОтгр = Неопределено;
	КонецЕсли;
	
	МассивИнфоФХЖ1 = ДанныеДокумента.ИнфополяФХЖ1;
	
	Если МассивИнфоФХЖ1.Количество() Тогда
		СвСчФакт.ИнфПолФХЖ1.ТекстИнф = МассивИнфоФХЖ1;
	Иначе
		СвСчФакт.ИнфПолФХЖ1 = Неопределено;
	КонецЕсли;
	
	// Заполнение таблицы товаров
	ЗаполнитьТоварыУслугиФормат820(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);
	
	ЗаполнитьСведенияПоОтправителюПолучателю(СвСчФакт, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);
	
	// Заполнение сведений о передаче
	ЗаполнитьСведенияОПередаче(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(Документ.СвПродПер) И ДанныеФормата.ФункцияУПД = "СЧФ" Тогда
		Документ.СвПродПер = Неопределено;
	КонецЕсли;
	
	// Заполнение подписанта
	Подписант = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.Подписант", ДанныеФормата.ПространствоИмен);
	Подписант.ОблПолн = "5";
	
	Если ДанныеДокумента.СведенияОбОтправителеЭД.ЭтоЮрЛицо Тогда
		Подписант.Статус  = "1";
		Подписант.ОснПолн = "Должностные обязанности";
	Иначе
		Подписант.Статус  = "4";
		Подписант.ОснПолн = ДанныеДокумента.СведенияОбОтправителеЭД.СвидетельствоРегистрацииИП;
	КонецЕсли;
	
	ФЛ = Подписант.ФЛ;
	ФЛ.ФИО.Фамилия = "-";
	ФЛ.ФИО.Имя = "-";
	ФЛ.ФИО.Отчество = "-";
	
	Документ.Подписант.Добавить(Подписант);
	
	Если ПустаяСтрока(ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал)) Тогда
		Ответ.Результат = СтруктураДокумента;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область Формат736

// Формирует и заполняет структуру документа формата ФНС (приказ 736)
// Приказ от 12.10.2020 № ЕД-7-26/736@ (https://www.nalog.ru/rn77/about_fts/docs/10223010/)
//
// Параметры:
//   ДанныеДокумента - Структура - Данные заполнения электронного документа XML
//								   Описание см. ККСНГ_ЭлектронныеДокументы.СтруктураДанныхДокумента
//   ДанныеФормата - Структура - Структура формата электронного документа
//								 Описание см. ККСНГ_ПМ_ПолучениеДанныхВызовСервера.ПолучитьДанныеФорматаДокументаЭД
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - Сформированная и заполненная структура для создания документа XML 
//
Функция ПолучитьXMLДляУКД2020(ДанныеДокумента, ДанныеФормата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ДанныеСоответствуютФормату = ДанныеСоответствуютФорматуУКД(ДанныеДокумента, ДанныеФормата, Ответ);
	Если Не ДанныеСоответствуютФормату Тогда
		Возврат Ответ;
	КонецЕсли;
	
	СтруктураДокумента = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл", ДанныеФормата.ПространствоИмен);
	
	// Заполнение основных данных файла
	ДатаФормирования = ТекущаяДатаСеанса();
	
	УточнениеИмениФайла = "";
	Если ДанныеДокумента.ЕстьМаркировка Тогда
		УточнениеИмениФайла = "MARK";
	ИначеЕсли ДанныеДокумента.ЕстьПрослеживание Тогда
		УточнениеИмениФайла = "PROS";
	КонецЕсли;
	
	ИдФайл = СтрШаблон("ON_NKORSCHFDOPPR%1_%2_%3_%4_%5",
						УточнениеИмениФайла,
						ДанныеДокумента.КодЭДОПолучателя,
						ДанныеДокумента.КодЭДООтправителя,
						Формат(ДатаФормирования, "ДФ=ггггММдд"),
						ВРег(Новый УникальныйИдентификатор));
	
	СтруктураДокумента.ВерсПрог = Лев(ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НаименованиеВерсииМодуля(), 40);
	СтруктураДокумента.ВерсФорм = "5.01";
	СтруктураДокумента.ИдФайл = ИдФайл;
	
	ДанныеДокумента.Вставить("ИдФайл", ИдФайл);
	
	// Заполнение сведений об участниках и операторе ЭДО
	СведенияОбУчастниках = СтруктураДокумента.СвУчДокОбор;
	СведенияОбУчастниках.ИдОтпр = ДанныеДокумента.КодЭДООтправителя;
	СведенияОбУчастниках.ИдПол = ДанныеДокумента.КодЭДОПолучателя;
	
	ПрофильНастроекЭДО = ККСНГ_ЭлектронныеДокументы.ПрофильНастроекЭДОКорусКонсалтингСНГ();
	
	СведенияОбОператоре = СведенияОбУчастниках.СвОЭДОтпр;
	СведенияОбОператоре.НаимОрг = ПрофильНастроекЭДО.ОператорЭДО;
	СведенияОбОператоре.ИННЮЛ = ПрофильНастроекЭДО.ОператорЭДОИНН;
	СведенияОбОператоре.ИдЭДО = ПрофильНастроекЭДО.ОператорЭДОИд;
	
	// Заполнение шапки документа
	Документ = СтруктураДокумента.Документ;
	Документ.КНД = "1115133";
	Документ.Функция = ДанныеФормата.ФункцияУПД;
	
	ЗаполнитьПредставлениеДокументаУКД(Документ, ДанныеФормата);
	
	Документ.ДатаИнфПр = Формат(ДатаФормирования, "ДФ=дд.ММ.гггг");
	Документ.ВремИнфПр = Формат(ДатаФормирования, "ДФ=ЧЧ.мм.сс");
	Документ.НаимЭконСубСост = ДанныеДокумента.СоставительДокументаНаименование;
	
	Документ.ОснДоверОргСост = Неопределено;
	
	// Заполнение сведений о счете-фактуре
	СвКСчФ = Документ.СвКСчФ;
	СвКСчФ.НомерКСчФ = ДанныеДокумента.Номер;
	СвКСчФ.ДатаКСчФ = Формат(ДанныеДокумента.Дата, "ДФ=дд.ММ.гггг");
	
	ЗаполнитьДанныеИсправленияУКД(ДанныеДокумента, ДанныеФормата, СвКСчФ);
	
	// Заполнение данных по счет-фактурам основаниям 
	МассивСЧФ = Документ.СвКСчФ.СчФ;
	ЗаполнитьДанныеСЧФУКД(Документ, ДанныеФормата, ДанныеДокумента, МассивСЧФ);
	
	// Заполнение сведений о продавце
	Если ДанныеДокумента.Продавцы.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного продавца.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00040", , ДанныеДокумента.ДокументСсылка);
	Иначе
		ЗаполнитьСведенияОбУчастнике(СвКСчФ.СвПрод, ДанныеДокумента.Продавцы[0], ДанныеДокумента.Продавцы[0].ЮридическийАдрес,
		ДанныеФормата, Ответ.Журнал);
	КонецЕсли;
	
	// Заполнение сведений о покупателе
	Если ДанныеДокумента.Покупатели.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного покупателя.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00028", , ДанныеДокумента.ДокументСсылка);
	Иначе
		ЗаполнитьСведенияОбУчастнике(СвКСчФ.СвПокуп, ДанныеДокумента.Покупатели[0], ДанныеДокумента.Покупатели[0].ЮридическийАдрес,
		ДанныеФормата, Ответ.Журнал);
	КонецЕсли;
	
	ДопСвФХЖ = СвКСчФ.ДопСвФХЖ1;
	
	// Заполнение сведений о валюте
	СвКСчФ.КодОКВ = ДанныеДокумента.СведенияОВалюте.Код;
	ДопСвФХЖ.НаимОКВ = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "СведенияОВалюте.Наименование");
	ДопСвФХЖ.КурсВал = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "СведенияОВалюте.Курс");
	
	// Заполнение сведений о гос. контракте
	ДопСвФХЖ.ИдГосКон = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "СведенияОГосЗакупках.ИдентификаторГосКонтракта");
	
	Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДопСвФХЖ) Тогда
		ДопСвФХЖ = Неопределено;
	КонецЕсли;
	
	Если ДанныеДокумента.ИнфополяФХЖ1.Количество() Тогда
		СвКСчФ.ИнфПолФХЖ1.ТекстИнф = ДанныеДокумента.ИнфополяФХЖ1;
	КонецЕсли;
	
	// Заполнение таблицы товаров
	ЗаполнитьТоварыУслугиФорматУКД736(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, Ответ.Журнал);	
	
	// Заполнение cодержания события 
	СодержаниеСобытия = Документ.СодФХЖ3;
	СодержаниеСобытия.СодОпер = "Корректировка документа"; 
	
	//Заполнение оснований корректировки
	ОснованияКорректировки = ДанныеДокумента.ОснованияКорректировки;
	Если ОснованияКорректировки.Количество() = 0 Тогда 
		ОснКор = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СодФХЖ3.ДокумОснКор", ДанныеФормата.ПространствоИмен);
		ОснКор.НаимОсн = "Без документа-основания";
		СодержаниеСобытия.ДокумОснКор.Добавить(ОснКор);
	КонецЕсли;
	
	Для каждого Основание Из ОснованияКорректировки Цикл
		ОснКор = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СодФХЖ3.ДокумОснКор", ДанныеФормата.ПространствоИмен);
		
		ОснКор.НаимОсн = Основание.Наименование;
		Если Основание.Наименование = "Отсутствует" Тогда
			ОснКор.НаимОсн = "Без документа-основания";
		КонецЕсли;
		ОснКор.НомОсн = Основание.Номер;
		ОснКор.ДатаОсн = Формат(Основание.Дата, "ДФ=дд.ММ.гггг");
		ОснКор.ДопСвОсн = Основание.ДопСведения;
		
		СодержаниеСобытия.ДокумОснКор.Добавить(ОснКор);
	КонецЦикла;
	
	//Заполнение оснований передачи
	ДокументыПередачи = ДанныеДокумента.ДокументыПередачи;
	Если ДокументыПередачи.Количество() = 0 Тогда 
		ПередатДокум = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СодФХЖ3.ПередатДокум", ДанныеФормата.ПространствоИмен);
		ПередатДокум.НаимОсн = "Без документа-основания";
		СодержаниеСобытия.ПередатДокум.Добавить(ПередатДокум);
	КонецЕсли;
	
	Для каждого ТекДокумент Из ДокументыПередачи Цикл
		ПередатДокум = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СодФХЖ3.ПередатДокум", ДанныеФормата.ПространствоИмен);
		
		ПередатДокум.НаимОсн = ТекДокумент.Наименование;
		ПередатДокум.НомОсн = ТекДокумент.Номер;
		ПередатДокум.ДатаОсн = Формат(ТекДокумент.Дата, "ДФ=дд.ММ.гггг");
		ПередатДокум.ДопСвОсн = ТекДокумент.ДопСведения;
		ПередатДокум.ИдФайлОсн = "";
		
		СодержаниеСобытия.ПередатДокум.Добавить(ПередатДокум);
	КонецЦикла;
	
	// Заполнение подписанта
	Подписант = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.Подписант", ДанныеФормата.ПространствоИмен);
	Подписант.ОблПолн = "6";
	
	Если ДанныеДокумента.СведенияОбОтправителеЭД.ЭтоЮрЛицо Тогда
		Подписант.Статус  = "1";
		Подписант.ОснПолн = "Должностные обязанности";
	Иначе
		Подписант.Статус  = "4";
		Подписант.ОснПолн = ДанныеДокумента.СведенияОбОтправителеЭД.СвидетельствоРегистрацииИП;
	КонецЕсли;
	
	ФЛ = Подписант.ФЛ;
	ФЛ.ФИО.Фамилия = "-";
	ФЛ.ФИО.Имя = "-";
	ФЛ.ФИО.Отчество = "-";
	
	Документ.Подписант.Добавить(Подписант);
	
	Если ПустаяСтрока(ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал)) Тогда
		Ответ.Результат = СтруктураДокумента;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область Счет

// Формирует и заполняет структуру счет-фактуры 
//
// Параметры:
//   ДанныеДокумента - Структура - Данные заполнения электронного документа XML
//								   Описание см. ККСНГ_ЭлектронныеДокументы.СтруктураДанныхДокумента
//   ДанныеФормата - Структура - Структура формата электронного документа
//								 Описание см. ККСНГ_ПМ_ПолучениеДанныхВызовСервера.ПолучитьДанныеФорматаДокументаЭД
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - Сформированная и заполненная структура для создания документа XML 
//
Функция ПолучитьXMLДляСчета(ДанныеДокумента, ДанныеФормата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	СтруктураДокумента = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл", ДанныеФормата.ПространствоИмен);
	
	// Заполнение основных данных файла
	ДатаФормирования = ТекущаяДатаСеанса();
	ИдФайл = СтрШаблон("BILL_%1_%2_%3_%4",
						ДанныеДокумента.КодЭДОПолучателя,
						ДанныеДокумента.КодЭДООтправителя,
						Формат(ДатаФормирования, "ДФ=ггггММдд"),
						ВРег(Новый УникальныйИдентификатор));
	
	СтруктураДокумента.ВерсПрог = Лев(ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.НаименованиеВерсииМодуля(), 40);
	СтруктураДокумента.ВерсФорм = "1.01";
	СтруктураДокумента.ИдФайл = ИдФайл;
	
	ДанныеДокумента.Вставить("ИдФайл", ИдФайл);
	
	// Заполнение сведений об участниках и операторе ЭДО
	СведенияОбУчастниках = СтруктураДокумента.СвУчДокОбор;
	СведенияОбУчастниках.ИдОтпр = ДанныеДокумента.КодЭДООтправителя;
	СведенияОбУчастниках.ИдПок = ДанныеДокумента.КодЭДОПолучателя;
	
	ПрофильНастроекЭДО = ККСНГ_ЭлектронныеДокументы.ПрофильНастроекЭДОКорусКонсалтингСНГ();
	
	СведенияОбОператоре = СведенияОбУчастниках.СвОЭДОтпр;
	СведенияОбОператоре.НаимОрг = ПрофильНастроекЭДО.ОператорЭДО;
	СведенияОбОператоре.ИННЮЛ = ПрофильНастроекЭДО.ОператорЭДОИНН;
	СведенияОбОператоре.ИдЭДО = ПрофильНастроекЭДО.ОператорЭДОИд;
	
	// Заполнение шапки документа
	Документ = СтруктураДокумента.Документ;
	Документ.Тип = "02";
	
	СвСч = Документ.СвСч;
	СвСч.НомерСч = ДанныеДокумента.Номер;
	СвСч.ДатаСч = Формат(ДанныеДокумента.Дата , "ДФ=дд.ММ.гггг");
	СвСч.КодОКВ = ДанныеДокумента.СведенияОВалюте.Код;
	
	МассивДопРеквизитов = ККСНГ_ЭлектронныеДокументы.ПолучитьИнфоПоляМассивом(ДанныеДокумента.ДокументСсылка, "Идентиф", "Значен");
	Если Не МассивДопРеквизитов = Неопределено Тогда
		СвСч.ИнфПол.ТекстИнф = МассивДопРеквизитов;
	Иначе
		СвСч.ИнфПол = Неопределено;
	КонецЕсли;
	
	// Заполнение сведений о продавце
	Если ДанныеДокумента.Продавцы.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного продавца.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00040", , ДанныеДокумента.ДокументСсылка);
		Возврат Ответ;
	КонецЕсли;
	ЗаполнитьСведенияОбУчастникеСчета(СвСч.СвПрод, ДанныеДокумента.Продавцы[0], ДанныеДокумента.Продавцы[0].ЮридическийАдрес,
	ДанныеФормата, Ответ.Журнал);
	
	// Заполнение сведений о покупателе
	Если ДанныеДокумента.Покупатели.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного покупателя.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00028", , ДанныеДокумента.ДокументСсылка);
		Возврат Ответ;
	КонецЕсли;
	ДанныеПокупателя = ДанныеДокумента.Покупатели[0];
	ЗаполнитьСведенияОбУчастникеСчета(СвСч.СвПокуп, ДанныеПокупателя, ДанныеПокупателя.ЮридическийАдрес, ДанныеФормата, Ответ.Журнал);
	
	// Платежные реквизиты
	ЗаполнитьПлатежныеРеквизитыСчета(СвСч.РеквПрод, ДанныеДокумента.Продавцы[0], Ответ.Журнал);
	
	ЗаполнитьТоварыУслугиФорматСчета(Документ, ДанныеДокумента, ДанныеФормата, Ответ);
	
	// Заполнение подписанта
	Подписант = Документ.Подписант;
	Если ДанныеДокумента.СведенияОбОтправителеЭД.ЭтоЮрЛицо Тогда
		
		ЮЛ = Подписант.ЮЛ;
		ЮЛ.ИННЮЛ = ДанныеДокумента.СведенияОбОтправителеЭД.ИНН;
		
		ЮЛ.ФИО.Фамилия = "-";
		ЮЛ.ФИО.Имя = "-";
		ЮЛ.ФИО.Отчество = "-";
		
	Иначе
		
		ИП = Подписант.ИП;
		ИП.ИННФЛ = ДанныеДокумента.СведенияОбОтправителеЭД.ИНН;
		Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОбОтправителеЭД.СвидетельствоРегистрацииИП) Тогда
			ИП.СвГосРегИП = ДанныеДокумента.СведенияОбОтправителеЭД.СвидетельствоРегистрацииИП;
		Иначе
			ИП.СвГосРегИП = "-";
		КонецЕсли;
		
		ИП.ФИО.Фамилия = "-";
		ИП.ФИО.Имя = "-";
		ИП.ФИО.Отчество = "-";
		
	КонецЕсли;
	
	Если ПустаяСтрока(ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал)) Тогда
		Ответ.Результат = СтруктураДокумента;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СчетУВХД

// Формирует и заполняет структуру счета на оплату по бизнес-процессу УВХД
//
// Параметры:
//   ДанныеДокумента - Структура - Данные заполнения электронного документа XML
//								   Описание см. ККСНГ_ЭлектронныеДокументы.СтруктураДанныхДокумента
//   ДанныеФормата - Структура - Структура формата электронного документа
//								 Описание см. ККСНГ_ПМ_ПолучениеДанныхВызовСервера.ПолучитьДанныеФорматаДокументаЭД
//
// Возвращаемое значение:
//   Структура - Описание см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//		* Результат - Структура - Сформированная и заполненная структура для создания документа XML 
//
Функция ПолучитьXMLДляСчетаУВХД(ДанныеДокумента, ДанныеФормата) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	// Заполнение основных данных файла
	ДатаФормирования = ТекущаяДатаСеанса();
	ИдФайл = СтрШаблон("BILL_%1_%2_%3_%4",
						ДанныеДокумента.КодЭДООтправителя,
						ДанныеДокумента.КодЭДОПолучателя,
						Формат(ДатаФормирования, "ДФ=ггггММдд"),
						ВРег(Новый УникальныйИдентификатор));
	
	ДанныеДокумента.Вставить("ИдФайл", ИдФайл);
	
	Если ДанныеДокумента.Продавцы.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного продавца.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00040", , ДанныеДокумента.ДокументСсылка);
		Возврат Ответ;
	КонецЕсли;
	
	Если ДанныеДокумента.Покупатели.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите в документе хотя бы одного покупателя.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00028", , ДанныеДокумента.ДокументСсылка);
		Возврат Ответ;
	КонецЕсли;
	
	// Заполнение структуры документа
	СтруктураДокумента = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Request", ДанныеФормата.ПространствоИмен);
	
	ЗаполнитьЗаголовокСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата, Ответ.Журнал);
	ЗаполнитьДетальнуюИнформациюСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата);
	ЗаполнитьИтоговуюИнформациюСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата);
	
	ПроверитьЗаполнениеСчетаУВХД(СтруктураДокумента, ДанныеФормата, Ответ.Журнал);
	
	Если ПустаяСтрока(ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал)) Тогда
		Ответ.Результат = СтруктураДокумента;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область Разное

Процедура ВставитьИнфополеФХЖ1(СписокПолей, Идентификатор, Значение) Экспорт
	
	Перем Поле;
	
	Если ТипЗнч(СписокПолей) <> Тип("Массив") Или ПустаяСтрока(Идентификатор) Или ПустаяСтрока(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Поле Из СписокПолей Цикл
		Если ТипЗнч(Поле) = Тип("Структура") И Поле.Свойство("Идентиф") И Поле.Свойство("Значен") И СтрСравнить(Поле.Идентиф, Идентификатор) = 0 Тогда
			Поле.Значен = Значение;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Поле = Новый Структура;
	Поле.Вставить("Идентиф", Идентификатор);
	Поле.Вставить("Значен", Значение);
	СписокПолей.Добавить(Поле);
	
КонецПроцедуры

Функция РазобратьШтрикодОбъемноСортовогоУчета(Штрихкод) Экспорт
	
	Перем Ответ, Результат;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Результат = Новый Структура;
	Результат.Вставить("Префикс", Сред(Штрихкод, 1, 2));
	Результат.Вставить("ГТИН", Сред(Штрихкод, 3, 14));
	Результат.Вставить("Суффикс", Сред(Штрихкод, 17,2));
	Результат.Вставить("Количество", Сред(Штрихкод, 19));
	
	Если Не ПустаяСтрока(Результат.Количество) И СтрШаблон("02%(1)37%(2)", Результат.ГТИН, Результат.Количество) = Штрихкод Тогда
		Ответ.Результат = Результат;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СобратьШтрикодОбъемноСортовогоУчета(ГТИН, Количество) Экспорт
	
	Если ТипЗнч(Количество) = Тип("Число") Тогда
		КоличествоСтрокой = Формат(Количество, "ЧГ=0");
	Иначе
		КоличествоСтрокой = СокрЛП(Количество);
	КонецЕсли;
	
	Возврат "(02)" + ГТИН + "(37)" + КоличествоСтрокой;
	
КонецФункции

Процедура ВыделитьКодыМаркировкиОбъемноСортовогоУчета(СведенияОМаркировке, ТаблицаКодовМаркировки) Экспорт
	
	Перем ШтрихкодыОбъемноСортовогоУчета;
	Перем ИндивидуальныеУпаковки, ОбъемноСортовойУчет;
	Перем Строка, НоваяСтрока, СтрокиДляУдаления;
	Перем НайденКодОСУ, ДанныеУчета;
	
	// Проверка входных параметров
	
	ИндивидуальныеУпаковки = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОМаркировке, "ИндивидуальныеУпаковки");
	Если ТипЗнч(ИндивидуальныеУпаковки) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	Если ИндивидуальныеУпаковки.Колонки.Найти("Код") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаКодовМаркировки) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	Если ТаблицаКодовМаркировки.Колонки.Найти("ВидУпаковки") = Неопределено Или ТаблицаКодовМаркировки.Колонки.Найти("ЗначениеШтрихкода") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполненение списка штрихкодов объемно-сортового учета в таблице кодов маркировки
	
	ШтрихкодыОбъемноСортовогоУчета = Новый Массив;
	ВидыУпаковок = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьЗначенияПеречисления("ВидыУпаковокИС");
	
	Для каждого Строка Из ТаблицаКодовМаркировки Цикл
		Если СтрСравнить(ВидыУпаковок[Строка.ВидУпаковки], "ОбъемноСортовойУчет") = 0 Тогда
			ШтрихкодыОбъемноСортовогоУчета.Добавить(Строка.ЗначениеШтрихкода);
		КонецЕсли;
	КонецЦикла;
	
	// Перенос штрихкодов объемно-сортового учета из таблицы индивидуальных упаковок в отдельную таблицу
	
	Если ШтрихкодыОбъемноСортовогоУчета.Количество() > 0 Тогда
		
		ОбъемноСортовойУчет = ИндивидуальныеУпаковки.СкопироватьКолонки();
		СтрокиДляУдаления = Новый Массив;
		
		Для каждого Строка Из ИндивидуальныеУпаковки Цикл
			
			НайденКодОСУ = ШтрихкодыОбъемноСортовогоУчета.Найти(Строка.Код) <> Неопределено; // Поиск по полному штрихкоду
			Если Не НайденКодОСУ Тогда
				// Поиск по ГТИН
				ДанныеУчета = РазобратьШтрикодОбъемноСортовогоУчета(Строка.Код);
				Если ДанныеУчета.Успех Тогда
					НайденКодОСУ = ШтрихкодыОбъемноСортовогоУчета.Найти(ДанныеУчета.Результат.ГТИН) <> Неопределено;
				КонецЕсли;
			КонецЕсли;
			
			Если НайденКодОСУ Тогда
				НоваяСтрока = ОбъемноСортовойУчет.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				СтрокиДляУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Строка Из СтрокиДляУдаления Цикл
			ИндивидуальныеУпаковки.Удалить(Строка);
		КонецЦикла;
		
		Если ОбъемноСортовойУчет.Количество() > 0 Тогда
			СведенияОМаркировке.Вставить("ККСНГ_ОбъемноСортовойУчет", ОбъемноСортовойУчет);
		КонецЕсли;
		
		Если ИндивидуальныеУпаковки.Количество() = 0 Тогда
			СведенияОМаркировке.Удалить("ИндивидуальныеУпаковки");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиФормированияЭД

// Рекурсивно заполняет значения свойств одной структуры данных значениями другой структуры данных
//
// Параметры:
//   Приемник - Структура - Заполняемая структура данных
//   Источник - Структура, ФиксированнаяСтруктура - Структура данных заполнения
//
// Возвращаемое значение:
//   Структура - Заполненная структура данных приемника
//
Функция ЗаполнитьЗначенияСвойствСтруктуры(Приемник, Источник) Экспорт
	
	Для каждого Элемент Из Источник Цикл
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Приемник, Элемент.Ключ, Null) <> Null Тогда
			Приемник[Элемент.Ключ] = СкопироватьЗначенияСтруктурыРекурсивно(Элемент.Значение, Приемник);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

// Рекурсивно копирует и заполняет значения свойств одной структуры данных в другую структуру данных
//
// Параметры:
//   Источник - Произвольный - Структура данных заполнения
//   СтруктураПриемник - Структура - Заполняемая структура данных
//
// Возвращаемое значение:
//   Структура - Заполненная структура данных приемника
//
Функция СкопироватьЗначенияСтруктурыРекурсивно(Источник, СтруктураПриемник) Экспорт
	
	Перем Приемник, ТипИсточника;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("Структура") Тогда
		Приемник = ЗаполнитьЗначенияСвойствСтруктуры(Источник, СтруктураПриемник);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

#КонецОбласти

// Проверяет адрес на соответствие формату
//
// Параметры:
//   Адрес - Структура - содержит:
//		* Город - Строка, Неопределено
//		* Дом - Строка, Неопределено
//		* Индекс - Строка, Неопределено
//		* Кварт - Строка, Неопределено
//		* КодГАР - Строка, Неопределено
//		* КодРегион - Строка, Неопределено
//		* КодСтраны - Строка, Неопределено
//		* Корпус - Строка, Неопределено
//		* НаселПункт - Строка, Неопределено
//		* Представление - Строка, Неопределено
//		* Район - Строка, Неопределено
//		* Улица - Строка, Неопределено
// 	ПространствоИмен - Строка - Пространство имен XDTO-пакета, содержащий проверяемый тип объекта
//	ТипXDTO - Строка - Проверяемый тип объекта в XDTO-пакете
//  ЖурналЛогирования - Массив - Журнал лога
//
// Возвращаемое значение:
//   Булево - Результат проверки соответствия адреса требуемому формату
//
Функция ПроверитьСоответствиеПолейАдресаФормату(Адрес, ПространствоИмен, ТипXDTO, ЖурналЛогирования) Экспорт
	
	Попытка
		
		АдресПроверки = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Адрес);
		
		ОбъектXDTO = ККСНГ_XDTOКлиентСервер.СоздатьОбъектXDTO(ПространствоИмен, ТипXDTO);
		
		УдалитьНеопределеноИзСтруктуры(АдресПроверки);
		
		ЗаполнитьЗначенияСвойств(ОбъектXDTO, АдресПроверки);
		
		ОбъектXDTO.Проверить();
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		Если СтрНайти(НРег(ОписаниеОшибки), "несоответствие фасету") = 0 Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Ошибка формирования XML", "XM-00034", ОписаниеОшибки);
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Процедура УдалитьНеопределеноИзСтруктуры(Структура)
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		УдалитьНеопределеноИзСтруктурыВидаСтруктура(Структура);
	ИначеЕсли ТипЗнч(Структура) = Тип("Массив") Тогда
		УдалитьНеопределеноИзСтруктурыВидаМассив(Структура);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНеопределеноИзСтруктурыВидаМассив(Структура)
	
	Индекс = Структура.ВГраница();
	Пока Индекс >= 0 Цикл
		Элемент = Структура[Индекс];
		Если Элемент = Неопределено Или (ТипЗнч(Элемент) = Тип("Строка") И ПустаяСтрока(Элемент)) Тогда
			Структура.Удалить(Индекс);
		Иначе
			УдалитьНеопределеноИзСтруктуры(Элемент);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНеопределеноИзСтруктурыВидаСтруктура(Структура)
	
	Для каждого КлючЗначение Из Структура Цикл
		
		Если КлючЗначение.Значение = Неопределено Или (ТипЗнч(КлючЗначение.Значение) = Тип("Строка") И ПустаяСтрока(КлючЗначение.Значение)) Тогда
			Структура.Удалить(КлючЗначение.Ключ);
		ИначеЕсли ТипЗнч(КлючЗначение.Значение) = Тип("Структура") Или ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			УдалитьНеопределеноИзСтруктуры(КлючЗначение.Значение);
			Если КлючЗначение.Значение.Количество() = 0 Тогда
				Структура.Удалить(КлючЗначение.Ключ);
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ФормированиеXML

#Область Формат970

Процедура ЗаполнитьСведенияПоОтправителюПолучателю970(СвСчФакт, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)
	
	Перем Грузоотправитель, Грузополучатель, Участник;
	
	Если Не ДанныеДокумента.ЭтоАванс И Не ДанныеДокумента.ТолькоУслуги Тогда
		
		// Заполнение адресов участников 1/2
		Для каждого Участник Из ДанныеДокумента.Продавцы Цикл
			Грузоотправитель = Участник; // По умолчанию берем продавца
			Прервать;
		КонецЦикла;
		
		// Заполнение сведений о грузоотправителе
		Если ДанныеДокумента.Грузоотправители.Количество() > 0 Тогда
			Для каждого ТекГрузоотправитель Из ДанныеДокумента.Грузоотправители Цикл
				СведенияОГрузоотправителе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ГрузОт", ДанныеФормата.ПространствоИмен);
				Если ТекГрузоотправитель.ОнЖе Тогда
					СведенияОГрузоотправителе.ОнЖе = "он же";
					СведенияОГрузоотправителе.ГрузОтпр = Неопределено;
				Иначе
					СведенияОГрузоотправителе.ОнЖе = Неопределено;
					ЗаполнитьСведенияОбУчастнике970(СведенияОГрузоотправителе.ГрузОтпр, ТекГрузоотправитель, ТекГрузоотправитель.ФактическийАдрес, ДанныеФормата, ЖурналЛогирования, Ложь, "грузоотправителя");
					Грузоотправитель = ТекГрузоотправитель;
				КонецЕсли;
				СвСчФакт.ГрузОт.Добавить(СведенияОГрузоотправителе);
			КонецЦикла;
		Иначе
			СведенияОГрузоотправителе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ГрузОт", ДанныеФормата.ПространствоИмен);
			СведенияОГрузоотправителе.ОнЖе = "он же";
			СведенияОГрузоотправителе.ГрузОтпр = Неопределено;
			СвСчФакт.ГрузОт.Добавить(СведенияОГрузоотправителе);
		КонецЕсли;
		
		// Заполнение сведений о грузополучателе
		Если ДанныеДокумента.Грузополучатели.Количество() > 0 Тогда
			Для каждого ТекГрузополучатель Из ДанныеДокумента.Грузополучатели Цикл
				СведенияОГрузополучателе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("УчастникТип", ДанныеФормата.ПространствоИмен);
				ЗаполнитьСведенияОбУчастнике970(СведенияОГрузополучателе, ТекГрузополучатель, ТекГрузополучатель.ФактическийАдрес, ДанныеФормата, ЖурналЛогирования, Ложь, "грузополучателя");
				СвСчФакт.ГрузПолуч.Добавить(СведенияОГрузополучателе);
				Грузополучатель = ТекГрузополучатель;
			КонецЦикла;
		Иначе
			СвСчФакт.ГрузПолуч = Неопределено;
		КонецЕсли;
		
		// Заполнение адресов участников 2/2
		Если (ДанныеФормата.ФункцияУПД = "ДОП" Или ДанныеФормата.ФункцияУПД = "СЧФДОП") И ККСНГ_ОтправкаЭДВызовСервера.ЕстьМаркировкаПива(ДанныеДокумента) Тогда
			Если Грузоотправитель <> Неопределено И Не Грузоотправитель.ЭтоЮрЛицо Тогда
				КодГар = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Грузоотправитель.ФактическийАдрес, "КодГАР");
				Если ЗначениеЗаполнено(КодГар) Тогда
					ВставитьИнфополеФХЖ1(ДанныеДокумента.ИнфополяФХЖ1, "Продавец_ФиасИД", КодГар);
				КонецЕсли;
			КонецЕсли;
			Если Грузополучатель <> Неопределено И Не Грузополучатель.ЭтоЮрЛицо Тогда
				КодГар = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Грузополучатель.ФактическийАдрес, "КодГАР");
				Если ЗначениеЗаполнено(КодГар) Тогда
					ВставитьИнфополеФХЖ1(ДанныеДокумента.ИнфополяФХЖ1, "Покупатель_ФиасИД", КодГар);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		СвСчФакт.ГрузОт = Неопределено;
		СвСчФакт.ГрузПолуч = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументыПодтвержденияОтгрузки970(ДокументыОтгрузки, ДанныеФормата, НаименованиеДокумента, НомерДокумента, ДатаДокумента)
	
	Перем СтруктураДокПодтв;
	
	СтруктураДокПодтв = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ДокПодтвОтгрНом", ДанныеФормата.ПространствоИмен);
	
	СтруктураДокПодтв.РеквНаимДок = НаименованиеДокумента;
	СтруктураДокПодтв.РеквНомерДок = ?(ЗначениеЗаполнено(НомерДокумента), НомерДокумента, Неопределено);
	СтруктураДокПодтв.РеквДатаДок = Формат(ДатаДокумента, "ДФ=дд.ММ.гггг");
	
	ДокументыОтгрузки.Добавить(СтруктураДокПодтв);
	
КонецПроцедуры

Процедура ЗаполнитьТоварыУслугиФормат970(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)
	
	Перем ЕдиницаИзмерения;
	
	Если ДанныеДокумента.ТоварыУслуги.Количество() = 0 Тогда
		Если ДанныеФормата.ФункцияУПД = "СЧФ" Или ДанныеФормата.ФункцияУПД = "СЧФДОП" Тогда
			ТекстОшибки = "В документе отсутствую товары и услуги.";
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00038",, ДанныеДокумента.ДокументСсылка);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НомерСтроки = 1;
	ДокументБезНДС = Истина;
	
	Для каждого СтрокаНоменклатуры Из ДанныеДокумента.ТоварыУслуги Цикл
		
		СведТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов", ДанныеФормата.ПространствоИмен);
		
		СведТов.НомСтр = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		
		СведТов.НаимТов = ?(ПустаяСтрока(СтрокаНоменклатуры.Содержание), СтрокаНоменклатуры.Наименование, СтрокаНоменклатуры.Содержание);
		
		Если Не ДанныеДокумента.ЭтоАванс Тогда
			
			КодОКЕИ = СокрЛП(СтрокаНоменклатуры.КодОКЕИ);
			ЧисловойКодОКЕИ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПривестиКЧислу(КодОКЕИ);
			Если ЧисловойКодОКЕИ Тогда
				
				РезультатПроверкиОКЕИ = КорректностьОКЕИ(КодОКЕИ);
				Если РезультатПроверкиОКЕИ.Успех = Истина Тогда
					
					// Проверяем наличие кода ОКЕИ в классификаторе
					Если ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбъектМетаданныхЕстьВКонфигурации("Справочник", "КлассификаторЕдиницИзмерения") Тогда // Справочник в БП
						ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодОКЕИ);
					ИначеЕсли ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбъектМетаданныхЕстьВКонфигурации("Справочник", "УпаковкиЕдиницыИзмерения") Тогда // Справочник в ERP
						ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(КодОКЕИ);
					Иначе
						ЕдиницаИзмерения = КодОКЕИ;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ЕдиницаИзмерения) И ЗначениеЗаполнено(СтрокаНоменклатуры.Количество) Тогда
						
						СведТов.ОКЕИ_Тов = КодОКЕИ;
						СведТов.НаимЕдИзм = СокрЛП(СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения);
						СведТов.КолТов = Формат(СтрокаНоменклатуры.Количество, "ЧРД=.; ЧН=0; ЧГ=0");
						СведТов.ЦенаТов = ?(ЗначениеЗаполнено(СтрокаНоменклатуры.Цена), Формат(СтрокаНоменклатуры.Цена, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"), Неопределено);
						
					КонецЕсли;
					
				Иначе
					
					ОписаниеОшибкиОКЕИ = "Некорректный код по ОКЕИ единицы измерения %1, строка №%2, товар %3: ";
					ОписаниеОшибкиОКЕИ = СтрШаблон(ОписаниеОшибкиОКЕИ, СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения, СтрокаНоменклатуры.НомерСтроки, СведТов.НаимТов);
					ОписаниеОшибкиОКЕИ = ОписаниеОшибкиОКЕИ + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатПроверкиОКЕИ.Журнал);
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиОКЕИ, "XM-00037",, СтрокаНоменклатуры.НоменклатураСсылка.ЕдиницаИзмерения);
					
				КонецЕсли;
				
			КонецЕсли;
			
			СведТов.СтТовБезНДС = ?(ЗначениеЗаполнено(СтрокаНоменклатуры.СуммаБезНДС), Формат(СтрокаНоменклатуры.СуммаБезНДС, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0"), Неопределено);
			
		КонецЕсли;
		
		СведТов.НалСт = СтрокаНоменклатуры.СтавкаНДССтрокой;
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.СуммаСНДС) Тогда
			СведТов.СтТовУчНал = Формат(СтрокаНоменклатуры.СуммаСНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		КонецЕсли;
		
		// Заполнение доп. сведений о товаре
		ДопСведТов = СведТов.ДопСведТов;
		
		СведенияОДекларации = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.СвДТ", ДанныеФормата.ПространствоИмен);
		СведенияОДекларации.КодПроисх = СтрокаНоменклатуры.КодСтраныПроисхождения;
		
		ЭтоПрослеживаемыйТовар = ЗаполнитьСведенияОПрослеживаемостиФормат970(ДопСведТов, СтрокаНоменклатуры, ДанныеФормата.ПространствоИмен, ЖурналЛогирования);
		НомерГТД = ?(ЭтоПрослеживаемыйТовар, "Прослеж", СокрЛП(СтрокаНоменклатуры.НомерГТД));
		
		СведенияОДекларации.НомерДТ = ?(СтрДлина(НомерГТД) > 29, Лев(НомерГТД, 29), НомерГТД);
		Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(СведенияОДекларации) Тогда
			СведТов.СвДТ.Добавить(СведенияОДекларации);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОДекларации.КодПроисх) Тогда
			
			Если ЗначениеЗаполнено(СтрокаНоменклатуры.НаименованиеСтраныПроисхождения) Тогда
				ДопСведТов.КрНаимСтрПр.Добавить(СтрокаНоменклатуры.НаименованиеСтраныПроисхождения);
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено наименование страны происхождения с кодом """ + СтрокаНоменклатуры.КодСтраныПроисхождения + """", "XM-00006",, ДанныеДокумента.ДокументСсылка);
			КонецЕсли;
			
		КонецЕсли;
		
		ДопСведТов.ХарактерТов = СтрокаНоменклатуры.ХарактеристикаНаименование;
		ДопСведТов.АртикулТов = СтрокаНоменклатуры.Артикул;
		ДопСведТов.КодТов = СтрокаНоменклатуры.Код;
		ДопСведТов.КодКат = СтрокаНоменклатуры.КодКаталога;
		ДопСведТов.КодВидТов = ?(ЗначениеЗаполнено(СтрокаНоменклатуры.КодТНВЭД), СтрокаНоменклатуры.КодТНВЭД, Неопределено);
		
		// Заполнение данных маркировки
		Если ДанныеДокумента.ЕстьМаркировка Тогда
			
			СведенияОМаркировке = СтрокаНоменклатуры.СведенияОМаркировке;
			
			Если СведенияОМаркировке.Свойство("ККСНГ_ОбъемноСортовойУчет") И ЗначениеЗаполнено(СведенияОМаркировке.ККСНГ_ОбъемноСортовойУчет) Тогда
				ДопСведТов.ГТИН = "";
				Количество = 0;
				Для каждого СтрокаКода Из СведенияОМаркировке.ККСНГ_ОбъемноСортовойУчет Цикл
					ДанныеУчета = РазобратьШтрикодОбъемноСортовогоУчета(СтрокаКода.Код);
					Если ДанныеУчета.Успех Тогда
						ДопСведТов.ГТИН = ДанныеУчета.Результат.ГТИН;
						Количество = Количество + ККСНГ_ОбщегоНазначенияКлиентСервер.СтрокаВЧисло(ДанныеУчета.Результат.Количество);
					КонецЕсли;
				КонецЦикла;
				ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
				ТекНомСредИдентТов.КолВедМарк = Формат(Количество, "ЧН=0; ЧГ=0");
				ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
			КонецЕсли;
			
			Если СведенияОМаркировке.Свойство("ИндивидуальныеУпаковки") И ЗначениеЗаполнено(СведенияОМаркировке.ИндивидуальныеУпаковки) Тогда
				ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
				Для каждого СтрокаКода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
					ТекНомСредИдентТов.НомУпак.Добавить(СтрокаКода.Код);
				КонецЦикла;
				ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
			КонецЕсли;
			
			Если СведенияОМаркировке.Свойство("КонтрольныеИдентификационныеЗнаки") И ЗначениеЗаполнено(СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки) Тогда
				ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
				Для каждого СтрокаКода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
					ТекНомСредИдентТов.КИЗ.Добавить(СтрокаКода.Код);
				КонецЦикла;
				ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
			КонецЕсли;
			
			Если СведенияОМаркировке.Свойство("ТранспортныеУпаковки") И ЗначениеЗаполнено(СведенияОМаркировке.ТранспортныеУпаковки) Тогда
				Для каждого СтрокаКода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
					ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
					ТекНомСредИдентТов.ИдентТрансУпак = СтрокаКода.Код;
					ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СведТов.НалСт = "без НДС" Тогда
			СведТов.СумНал.БезНДС = "без НДС";
		Иначе
			ДокументБезНДС = Ложь;
			СведТов.СумНал.СумНал = Формат(СтрокаНоменклатуры.СуммаНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		КонецЕсли;
		
		// Заполнение доп. сведений о товаре
		ДопСведТов.ПрТовРаб = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьПризнакТоварРабота(СтрокаНоменклатуры.ТипНоменклатуры);
		
		Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДопСведТов) Тогда
			ЗаполнитьЗначенияСвойств(СведТов.ДопСведТов, ДопСведТов);
		КонецЕсли;
		
		МассивИнфоФХЖ2 = СтрокаНоменклатуры.ИнфополяФХЖ2;
		
		Если МассивИнфоФХЖ2.Количество() Тогда
			СведТов.ИнфПолФХЖ2 = МассивИнфоФХЖ2;
		Иначе
			СведТов.ИнфПолФХЖ2 = Неопределено;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СведТов.НаимТов) И ДопСведТов <> Неопределено И Не ЗначениеЗаполнено(ДопСведТов.ХарактерТов) И Не ЗначениеЗаполнено(ДопСведТов.АртикулТов) И Не ЗначениеЗаполнено(ДопСведТов.КодТов) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Должно быть заполнено одно из свойств: наименование, код, артикул, характеристика товара", "XM-00007",, СтрокаНоменклатуры.НоменклатураСсылка);
		КонецЕсли;
		
		СтруктураДокумента.Документ.ТаблСчФакт.СведТов.Добавить(СведТов);
		
	КонецЦикла;
	
	// Заполнение итоговых сумм
	ВсегоОпл = СтруктураДокумента.Документ.ТаблСчФакт.ВсегоОпл;
	ВсегоОпл.СтТовУчНалВсего = Формат(ДанныеДокумента.ВсегоСНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	
	Если НЕ ЗначениеЗаполнено(ВсегоОпл.СтТовУчНалВсего) Тогда
		ВсегоОпл.ДефСтТовУчНалВсего = "-";
	КонецЕсли;
	
	Если Не ДанныеДокумента.ЭтоАванс Тогда
		ВсегоОпл.СтТовБезНДСВсего = Формат(ДанныеДокумента.ВсегоБезНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	КонецЕсли;
	
	Если ДокументБезНДС Тогда
		ВсегоОпл.СумНалВсего.СумНал = Неопределено;
		ВсегоОпл.СумНалВсего.БезНДС = "без НДС";
	Иначе
		ВсегоОпл.СумНалВсего.СумНал = Формат(ДанныеДокумента.ВсегоНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		ВсегоОпл.СумНалВсего.БезНДС = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПередаче970(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)
	
	ЗаполнитьСведенияОПередачеНаимнованиеОснования970(ДанныеДокумента, ДанныеФормата, ЖурналЛогирования, СтруктураДокумента);
	
	// Заполнение сведений о передаче товаров, услуг, работ
	СвПер = СтруктураДокумента.Документ.СвПродПер.СвПер;
	СвПер.СодОпер = ДанныеДокумента.СодержаниеОперации;
	
	Если ДанныеФормата.ФункцияУПД = "ДОП" Или ДанныеФормата.ФункцияУПД = "СЧФДОП" Тогда
		СвПер.ДатаПер = Формат(ДанныеДокумента.ДатаОтгрузки, "ДФ=дд.ММ.гггг");
	КонецЕсли;
	
	СвЛицПер = СвПер.СвЛицПер;
	
	Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО) Тогда
		Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОЛицеПередавшемТовар.Должность) Тогда
			
			РабОргПрод = СвЛицПер.РабОргПрод;
			ЗаполнитьЗначенияСвойств(РабОргПрод.ФИО, ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО);
			РабОргПрод.Должность = ДанныеДокумента.СведенияОЛицеПередавшемТовар.Должность;
			СвЛицПер.ИнЛицо = Неопределено;
			
		Иначе
			
			ФЛПер = СвЛицПер.ИнЛицо.ФЛПер;
			
			ФЛПер.ИННФЛПер = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента.СведенияОЛицеПередавшемТовар, "ИНН");
			ФЛПер.ФИО.Фамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО, "Фамилия");
			ФЛПер.ФИО.Имя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО, "Имя");
			ФЛПер.ФИО.Отчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО, "Отчество");
			
			Если Не ЗначениеЗаполнено(ФЛПер.ИННФЛПер) И ДанныеФормата.ФункцияУПД <> "СЧФ" Тогда
				ФИОФизЛица = ККСНГ_ОбщегоНазначенияКлиентСервер.СоединитьСтрокиСПробелом(ФЛПер.ФИО.Фамилия, ФЛПер.ФИО.Имя, ФЛПер.ФИО.Отчество);
				ТекстОшибки = СтрШаблон("Не удалось заполнить сведения о лице, передавшем товар. Проверьте заполнение должности, ИНН физ.лица (%1)", ФИОФизЛица);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00008", , ДанныеДокумента.ДокументСсылка);
			КонецЕсли;
			
			СвЛицПер.РабОргПрод = Неопределено;
			
		КонецЕсли;
	КонецЕсли;
	
	СведенияОТранспортировке = Новый Массив;
	Для каждого ТранспортнаяНакладная Из ДанныеДокумента.ТранспортныеНакладные Цикл
		ПредставлениеТранспортнаяНакладная = СтрШаблон("Транспортная накладная № %1 от %2", ТранспортнаяНакладная.Номер, Формат(ТранспортнаяНакладная.Дата, "ДЛФ=ДД"));
		СведенияОТранспортировке.Добавить(ПредставлениеТранспортнаяНакладная);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОТранспортировкеИГрузе) Тогда
		СведенияОТранспортировке.Добавить(ДанныеДокумента.СведенияОТранспортировкеИГрузе);
	КонецЕсли;
	
	СвПер.Тран.СвТран = СтрСоединить(СведенияОТранспортировке, ", ");
	
	// Сведения о передаче вещи, изготовленной по договору подряда. Пока не заполняем.
	СвПер.СвПерВещи = Неопределено;
	
	МассивИнфоФХЖ3 = ДанныеДокумента.ИнфополяФХЖ3;
	
	Если МассивИнфоФХЖ3.Количество() Тогда
		СтруктураДокумента.Документ.СвПродПер.ИнфПолФХЖ3.ТекстИнф = МассивИнфоФХЖ3;
	Иначе
		СтруктураДокумента.Документ.СвПродПер.ИнфПолФХЖ3 = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПередачеНаимнованиеОснования970(ДанныеДокумента, ДанныеФормата, ЖурналЛогирования, СтруктураДокумента)
	
	Перем ОснПер, ТекстОшибки;
	
	Если ДанныеДокумента.ОснованияПередачи.Количество() = 0 Тогда
		СтруктураДокумента.Документ.СвПродПер.СвПер.БезДокОснПер = 1;
	КонецЕсли;
	
	Для каждого ДокументПередачи Из ДанныеДокумента.ОснованияПередачи Цикл
		
		ОснПер = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвПродПер.СвПер.ОснПер", ДанныеФормата.ПространствоИмен);
		ОснПер.РеквНомерДок = ?(ЗначениеЗаполнено(ДокументПередачи.Номер), ДокументПередачи.Номер, "Без номера");
		
		Если ЗначениеЗаполнено(ДокументПередачи.Дата) Тогда
			ОснПер.РеквДатаДок = Формат(ДокументПередачи.Дата, "ДФ=дд.ММ.гггг");
		Иначе
			ТекстОшибки = "Не заполнена дата основания передачи " + Строка(ДокументПередачи.Ссылка);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00008", , ДокументПередачи.Ссылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументПередачи.Наименование) Тогда
			ОснПер.РеквНаимДок = ДокументПередачи.Наименование;
		Иначе
			ТекстОшибки = "Не заполнено наименование основания передачи " + Строка(ДокументПередачи.Ссылка);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00009", , ДокументПередачи.Ссылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументПередачи.ДопСведения) Тогда
			ОснПер.РеквДопСведДок = ДокументПередачи.ДопСведения;
		КонецЕсли;
		
		СтруктураДокумента.Документ.СвПродПер.СвПер.ОснПер.Добавить(ОснПер);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОбУчастнике970(Приемник, Источник, Адрес, ДанныеФормата, ЖурналЛогирования, ЮридическийАдрес = Истина, ТипУчастникаЭДО = Неопределено)
	
	Перем АдресДляЗаполнения, УчастникЭДО;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		Если Приемник.Свойство("КодОПФ") Тогда
			Приемник.КодОПФ = Источник.Ссылка.КодОКОПФ;
		КонецЕсли;
		
		Если Приемник.Свойство("ПолнНаимОПФ") Тогда
			Приемник.ПолнНаимОПФ = Источник.Ссылка.НаименованиеОКОПФ;
		КонецЕсли;
		
		Если Приемник.Свойство("СокрНаим") Тогда
			Приемник.СокрНаим = Источник.Ссылка.НаименованиеСокращенное;
		КонецЕсли;
	КонецЕсли;
	
	Приемник.СтруктПодр = Источник.СтруктурноеПодразделение;
	ИдСв = Приемник.ИдСв;
	
	Если Источник.ЭтоЮрЛицо Тогда // Заполнение данных юрлица
		
		Если Источник.Резидент Тогда
			
			СвЮЛУч = ИдСв.СвЮЛУч;
			
			Если Не ЗначениеЗаполнено(Источник.ПолноеНаименование) Тогда
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено наименование юр.лица """ + Источник.Представление + """", "XM-00026", , Источник.Ссылка);
			Иначе
				СвЮЛУч.НаимОрг = Источник.ПолноеНаименование;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Источник.ИНН) Тогда
				ОписаниеОшибкиИНН = "";
				
				Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.ИННСоответствуетТребованиям(Источник.ИНН, Источник.ЭтоЮрЛицо, ОписаниеОшибкиИНН) Тогда
					ОписаниеОшибкиИНН = "Ошибка заполнения ИНН юр.лица """ + Источник.Представление + """. " + ОписаниеОшибкиИНН;
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиИНН, "XM-00027",, Источник.Ссылка);
				Иначе
					СвЮЛУч.ИННЮЛ = Источник.ИНН;
				КонецЕсли;
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнен ИНН юр. лица """ + Источник.Представление + """.", "XM-00027", , Источник.Ссылка);
				СвЮЛУч.ИННЮЛ = Неопределено;
			КонецЕсли;
			
			СвЮЛУч.КПП = Источник.КПП;
			
		Иначе // Не состоит на налоговом учёте.
			
			СвИнНеУч = ИдСв.СвИнНеУч;
			
			СвИнНеУч.Наим = Источник.ПолноеНаименование;
			СвИнНеУч.ИдСтат = "ИО";
			СвИнНеУч.КодСтр = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ЮридическийАдрес, "КодСтраны");
			СвИнНеУч.Идентиф = ?(Не ПустаяСтрока(Источник.КодВСтранеРегистрации), Источник.КодВСтранеРегистрации, Источник.ИНН);
			
			// Заполнение страны происхождения
			Если ЗначениеЗаполнено(СвИнНеУч.КодСтр) Тогда
				ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
				СтранаСсылка = ОбщийМодульПринятиеКУчету.НайтиСтрануМира(СвИнНеУч.КодСтр);
				Если ТипЗнч(СтранаСсылка) = Тип("СправочникСсылка.СтраныМира") И Не СтранаСсылка.Пустая() Тогда
					СвИнНеУч.НаимСтран = СтранаСсылка.Наименование;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе // физ. лицо
		
		СвИП = ИдСв.СвИП;
		Если ЗначениеЗаполнено(Источник.ИНН) Тогда
			ОписаниеОшибкиИНН = "";
			
			Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.ИННСоответствуетТребованиям(Источник.ИНН, Источник.ЭтоЮрЛицо, ОписаниеОшибкиИНН) Тогда
				ОписаниеОшибкиИНН = "Ошибка заполнения ИНН физ.лица """ + Источник.Представление + """. "  + ОписаниеОшибкиИНН;
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиИНН, "XM-00029",, Источник.Ссылка);
			Иначе
				СвИП.ИННФЛ = Источник.ИНН;
			КонецЕсли;
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнен ИНН физ.лица """ + Источник.Представление + """.", "XM-00029", , Источник.Ссылка);
			СвИП.ИННФЛ = Неопределено;
		КонецЕсли;
		
		Если СвИП.Свойство("ОГРНИП") И ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
			ЗапросДанныеОрганизации = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДанныеПоОрганизации(Источник.Ссылка);
			Если ЗапросДанныеОрганизации.Успех Тогда
				СвИП.ОГРНИП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗапросДанныеОрганизации.Результат, "ОГРН", Неопределено);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СвИП.ФИО, Источник.ФИО);
		
		СвИП.СвГосРегИП = Источник.СвидетельствоРегистрацииИП;
		
	КонецЕсли;
	
	// Заполнение общей информации
	Приемник.ОКПО = ?(ЗначениеЗаполнено(Источник.КодПоОКПО), Источник.КодПоОКПО, Неопределено);
	
	// Заполнение адреса
	АдресОбязателен = (ДанныеФормата.ФункцияУПД <> "ДОП");
	Если Не ПустаяСтрока(Адрес.КодРегион) И ПроверитьСоответствиеПолейАдресаФормату(Адрес, ДанныеФормата.ПространствоИмен, "АдрРФТип", ЖурналЛогирования) Тогда
		АдрРФ = Приемник.Адрес.АдрРФ;
		ЗаполнитьЗначенияСвойств(АдрРФ, Адрес);
	ИначеЕсли Не ПустаяСтрока(Адрес.КодСтраны) И Не ПустаяСтрока(Адрес.Представление) Тогда
		
		АдрИнф = Приемник.Адрес.АдрИнф;
		АдрИнф.КодСтр = Адрес.КодСтраны;
		АдрИнф.АдрТекст = Лев(СокрЛП(Адрес.Представление), 1000); // Максимальное количество символов 1000
		
		// Заполнение страны происхождения
		Если ЗначениеЗаполнено(Адрес.КодСтраны) Тогда
			ОбщийМодульПринятиеКУчету = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_ПринятиеКУчетуВызовСервера");
			СтранаСсылка = ОбщийМодульПринятиеКУчету.НайтиСтрануМира(Адрес.КодСтраны);
			Если ТипЗнч(СтранаСсылка) = Тип("СправочникСсылка.СтраныМира") И Не СтранаСсылка.Пустая() Тогда
				АдрИнф.НаимСтран = СтранаСсылка.Наименование;
			Иначе
				АдрИнф.НаимСтран = "РОССИЯ";
			КонецЕсли;
		КонецЕсли;
		
	//ИначеЕсли Не ПустаяСтрока(Адрес.КодГАР) Тогда
	//	Приемник.Адрес.КодГАР = Адрес.КодГАР;
	Иначе
		Приемник.Адрес = Неопределено;
		Если АдресОбязателен Тогда
			АдресДляЗаполнения = ?(ЮридическийАдрес = Истина, "юридического", "фактического");
			УчастникЭДО = ?(ТипУчастникаЭДО <> Неопределено, ТипУчастникаЭДО, "участника");
			
			ТекстОшибки = СтрШаблон("Проверьте заполнение %1 адреса %2 %3", АдресДляЗаполнения, УчастникЭДО, Источник.Представление);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00033", , Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение контактной информации
	КонтактныеСведения = Приемник.Контакт;
	
	Если ТипЗнч(Источник.Телефоны) = Тип("Массив") Тогда
		КонтактныеСведения.Тлф = Источник.Телефоны;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Email) = Тип("Массив") Тогда
		КонтактныеСведения.ЭлПочта = Источник.Email;
	КонецЕсли;
	
	Если КонтактныеСведения.Тлф.Количество() = 0 И КонтактныеСведения.ЭлПочта.Количество() = 0 Тогда
		КонтактныеСведения = Неопределено;
	КонецЕсли;
	
	// Заполнение банковских реквизитов
	БанковскиеРеквизиты = Приемник.БанкРекв;
	СвБанк = БанковскиеРеквизиты.СвБанк;
	
	Если ЗначениеЗаполнено(Источник.БанковскийСчет.НомерСчета) Тогда
		
		БанковскиеРеквизиты.НомерСчета = Источник.БанковскийСчет.НомерСчета;
		
		Если ЗначениеЗаполнено(Источник.БанковскийСчет.НаименованиеБанка) Тогда
			СвБанк.НаимБанк = Источник.БанковскийСчет.НаименованиеБанка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Источник.БанковскийСчет.БИК) Тогда
			СвБанк.БИК = Источник.БанковскийСчет.БИК;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Источник.БанковскийСчет.КоррСчет) Тогда
			СвБанк.КорСчет = Источник.БанковскийСчет.КоррСчет;
		КонецЕсли;
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(СвБанк) Тогда
			СвБанк = Неопределено;
		КонецЕсли;
		
	Иначе
		БанковскиеРеквизиты = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьСведенияОПрослеживаемостиФормат970(ДопСведТов, СтрокаНоменклатуры, ПространствоИмен, ЖурналЛогирования)

	СведенияОПрослеживаемости = СтрокаНоменклатуры.СведенияОПрослеживаемости;

	ЭтоПрослеживаемыйТовар = ЗначениеЗаполнено(СведенияОПрослеживаемости);
	Если ЭтоПрослеживаемыйТовар Тогда
		Для каждого СтрокаПрослеживаемости Из СведенияОПрослеживаемости Цикл

			СведПрослеж = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.СведПрослеж", ПространствоИмен);

			СведПрослеж.НомТовПрослеж = СокрЛП(СтрокаПрослеживаемости.НомерТовара);
			Если СтрДлина(СведПрослеж.НомТовПрослеж) > 29 Или СтрДлина(СведПрослеж.НомТовПрослеж) < 25 Тогда
				Событие = СтрШаблон("Номер прослеживаемости: %1 должен содержать от 25 до 29 символов", СведПрослеж.НомТовПрослеж);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, Событие, "XM-00015");
				Продолжить;
			КонецЕсли;

			СведПрослеж.ЕдИзмПрослеж = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияКод);
			СведПрослеж.НаимЕдИзмПрослеж = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияНаименование);
			СведПрослеж.КолВЕдПрослеж = СтрокаПрослеживаемости.Количество;

			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаПрослеживаемости, "СтоимостьБезНДС") Тогда
				СведПрослеж.СтТовБезНДСПрослеж = СтрокаПрослеживаемости.СтоимостьБезНДС;
			Иначе
				СтоимостьТовараБезНДС = (СтрокаНоменклатуры.СуммаСНДС - СтрокаНоменклатуры.СуммаНДС) / СтрокаНоменклатуры.Количество * СведПрослеж.КолВЕдПрослеж;
				СведПрослеж.СтТовБезНДСПрослеж = Окр(СтоимостьТовараБезНДС, 2);
			КонецЕсли;
			
			ДопСведТов.СведПрослеж.Добавить(СведПрослеж);
			
		КонецЦикла;
	КонецЕсли;

	Возврат ЭтоПрослеживаемыйТовар;

КонецФункции

#КонецОбласти

#Область Формат820

Процедура ЗаполнитьСведенияПоОтправителюПолучателю(СвСчФакт, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)
	
	Если Не ДанныеДокумента.ЭтоАванс И Не ДанныеДокумента.ТолькоУслуги Тогда
		
		// Заполнение сведений о грузоотправителе
		Если ДанныеДокумента.Грузоотправители.Количество() > 0 Тогда
			Для каждого ТекГрузоотправитель Из ДанныеДокумента.Грузоотправители Цикл
				СведенияОГрузоотправителе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ГрузОт", ДанныеФормата.ПространствоИмен);
				Если ТекГрузоотправитель.ОнЖе Тогда
					СведенияОГрузоотправителе.ОнЖе = "он же";
					СведенияОГрузоотправителе.ГрузОтпр = Неопределено;
				Иначе
					СведенияОГрузоотправителе.ОнЖе = Неопределено;
					ЗаполнитьСведенияОбУчастнике(СведенияОГрузоотправителе.ГрузОтпр, ТекГрузоотправитель, ТекГрузоотправитель.ФактическийАдрес, ДанныеФормата, ЖурналЛогирования, Ложь, "грузоотправителя");
				КонецЕсли;
				СвСчФакт.ГрузОт.Добавить(СведенияОГрузоотправителе);
			КонецЦикла;
		Иначе
			СведенияОГрузоотправителе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвСчФакт.ГрузОт", ДанныеФормата.ПространствоИмен);
			СведенияОГрузоотправителе.ОнЖе = "он же";
			СведенияОГрузоотправителе.ГрузОтпр = Неопределено;
			СвСчФакт.ГрузОт.Добавить(СведенияОГрузоотправителе);
		КонецЕсли;
		
		// Заполнение сведений о грузополучателе
		Если ДанныеДокумента.Грузополучатели.Количество() > 0 Тогда
			
			Для каждого ТекГрузополучатель Из ДанныеДокумента.Грузополучатели Цикл
				СведенияОГрузополучателе = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("УчастникТип", ДанныеФормата.ПространствоИмен);
				ЗаполнитьСведенияОбУчастнике(СведенияОГрузополучателе, ТекГрузополучатель, ТекГрузополучатель.ФактическийАдрес, ДанныеФормата, ЖурналЛогирования, Ложь, "грузополучателя");
				СвСчФакт.ГрузПолуч.Добавить(СведенияОГрузополучателе);
			КонецЦикла;
			
		Иначе 
			СвСчФакт.ГрузПолуч = Неопределено;
		КонецЕсли;
		
	Иначе
		СвСчФакт.ГрузОт = Неопределено;
		СвСчФакт.ГрузПолуч = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыУслугиФормат820(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)
	
	Если ДанныеДокумента.ТоварыУслуги.Количество() = 0 Тогда
		Если ДанныеФормата.ФункцияУПД = "СЧФ" Или ДанныеФормата.ФункцияУПД = "СЧФДОП" Тогда
			ТекстОшибки = "В документе отсутствую товары и услуги.";
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00038",, ДанныеДокумента.ДокументСсылка);
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	НомерСтроки = 1;
	ДокументБезНДС = Истина;

	Для каждого СтрокаНоменклатуры Из ДанныеДокумента.ТоварыУслуги Цикл
		
		СведТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов", ДанныеФормата.ПространствоИмен);
		
		СведТов.НомСтр = НомерСтроки;  
		НомерСтроки = НомерСтроки + 1;
		
		СведТов.НаимТов = ?(ПустаяСтрока(СтрокаНоменклатуры.Содержание), СтрокаНоменклатуры.Наименование, СтрокаНоменклатуры.Содержание);
		
		КодОКЕИ = СокрЛП(СтрокаНоменклатуры.КодОКЕИ);
		ЧисловойКодОКЕИ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПривестиКЧислу(КодОКЕИ);
		
		Если ЧисловойКодОКЕИ Тогда
			РезультатПроверкиОКЕИ = КорректностьОКЕИ(КодОКЕИ);
			Если РезультатПроверкиОКЕИ.Успех = Истина Тогда
				СведТов.ОКЕИ_Тов = КодОКЕИ;
			Иначе 
				ОписаниеОшибкиОКЕИ = НСтр("ru = 'Некорректный код по ОКЕИ единицы измерения %1, строка №%2, товар %3: '");
				ОписаниеОшибкиОКЕИ = СтрШаблон(ОписаниеОшибкиОКЕИ, СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения, СтрокаНоменклатуры.НомерСтроки, СведТов.НаимТов);
				ОписаниеОшибкиОКЕИ = ОписаниеОшибкиОКЕИ + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатПроверкиОКЕИ.Журнал);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиОКЕИ, "XM-00037",, СтрокаНоменклатуры.НоменклатураСсылка.ЕдиницаИзмерения);
			КонецЕсли;
		Иначе
			СведТов.ДефОКЕИ_Тов = "-";
		КонецЕсли; 
		
		СведТов.КолТов = Формат(СтрокаНоменклатуры.Количество, "ЧГ=0;ЧРД=.;ЧН=0");
		СведТов.ЦенаТов = Формат(СтрокаНоменклатуры.Цена, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0");
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.СуммаСНДС) Тогда
			СведТов.СтТовУчНал  = Формат(СтрокаНоменклатуры.СуммаСНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		Иначе
			СведТов.ДефСтТовУчНал = "-";
		КонецЕсли;
		
		Если ДанныеДокумента.ЭтоСФ И ДанныеДокумента.ЭтоАванс Тогда
			СведТов.СтТовБезНДС = "0";
		Иначе
			СведТов.СтТовБезНДС = Формат(СтрокаНоменклатуры.СуммаБезНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		КонецЕсли;
		
		СведТов.НалСт = СтрокаНоменклатуры.СтавкаНДССтрокой;
		СведТов.Акциз.БезАкциз = "без акциза";
		
		Если СведТов.НалСт = "без НДС" Тогда
			СведТов.СумНал.БезНДС = "без НДС";
		Иначе
			ДокументБезНДС = Ложь;
			СведТов.СумНал.СумНал = Формат(СтрокаНоменклатуры.СуммаНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		КонецЕсли;
		
		// Заполнение доп. сведений о товаре
		ДопСведТов = СведТов.ДопСведТов;
		ДопСведТов.ПрТовРаб = ККСНГ_СтруктурированныеДокументыВызовСервера.ПолучитьПризнакТоварРабота(СтрокаНоменклатуры.ТипНоменклатуры);
		
		Если ЧисловойКодОКЕИ Тогда
			Если ЗначениеЗаполнено(СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения) Тогда
				ДопСведТов.НаимЕдИзм = СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения;
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено наименование единицы измерения с кодом """ + КодОКЕИ + """", "XM-00005");
			КонецЕсли;
		КонецЕсли;
		
		Если (ДанныеФормата.ФункцияУПД = "СЧФ" Или ДанныеФормата.ФункцияУПД = "СЧФДОП")
			И Не ЗначениеЗаполнено(ДопСведТов.НаимЕдИзм) Тогда
			ДопСведТов.НаимЕдИзм = "-";
		КонецЕсли;

		ДопСведТов.КрНаимСтрПр	= СтрокаНоменклатуры.НаименованиеСтраныПроисхождения;
		ДопСведТов.ХарактерТов	= СтрокаНоменклатуры.ХарактеристикаНаименование;
		//ДопСведТов.СортТов 	= СтрокаНоменклатуры.Качество;
		ДопСведТов.АртикулТов	= СтрокаНоменклатуры.Артикул;
		ДопСведТов.КодТов		= СтрокаНоменклатуры.Код;
		ДопСведТов.КодКат		= СтрокаНоменклатуры.КодКаталога;
		ДопСведТов.КодВидТов	= ?(ЗначениеЗаполнено(СтрокаНоменклатуры.КодТНВЭД), СтрокаНоменклатуры.КодТНВЭД, Неопределено);
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.КодСтраныПроисхождения) И Не ЗначениеЗаполнено(ДопСведТов.КрНаимСтрПр) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено наименование страны происхождения с кодом """ + СтрокаНоменклатуры.КодСтраныПроисхождения + """", "XM-00006",, ДанныеДокумента.ДокументСсылка);
		КонецЕсли;
		
		Если ДанныеДокумента.ЕстьМаркировка Тогда
			СведенияОМаркировке = СтрокаНоменклатуры.СведенияОМаркировке;
			Если СведенияОМаркировке.Свойство("ККСНГ_ОбъемноСортовойУчет") И ЗначениеЗаполнено(СведенияОМаркировке.ККСНГ_ОбъемноСортовойУчет) Тогда
				ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
				Для каждого СтрокаКода Из СведенияОМаркировке.ККСНГ_ОбъемноСортовойУчет Цикл
					ТекНомСредИдентТов.НомУпак.Добавить(СтрокаКода.Код);
				КонецЦикла;
				ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
			КонецЕсли;
			Если СведенияОМаркировке.Свойство("ИндивидуальныеУпаковки") И ЗначениеЗаполнено(СведенияОМаркировке.ИндивидуальныеУпаковки) Тогда
				ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
				Для каждого СтрокаКода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
					ТекНомСредИдентТов.НомУпак.Добавить(СтрокаКода.Код);
				КонецЦикла;
				ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
			КонецЕсли;
			Если СведенияОМаркировке.Свойство("КонтрольныеИдентификационныеЗнаки") И ЗначениеЗаполнено(СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки) Тогда
				ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
				Для каждого СтрокаКода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
					ТекНомСредИдентТов.КИЗ.Добавить(СтрокаКода.Код);
				КонецЦикла;
				ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
			КонецЕсли;
			Если СведенияОМаркировке.Свойство("ТранспортныеУпаковки") И ЗначениеЗаполнено(СведенияОМаркировке.ТранспортныеУпаковки) Тогда
				Для каждого СтрокаКода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
					ТекНомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ДанныеФормата.ПространствоИмен);
					ТекНомСредИдентТов.ИдентТрансУпак = СтрокаКода.Код;
					ДопСведТов.НомСредИдентТов.Добавить(ТекНомСредИдентТов);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		ЭтоПрослеживаемыйТовар = ЗаполнитьСведенияОПрослеживаемостиФормат820(ДопСведТов, СтрокаНоменклатуры, ДанныеФормата.ПространствоИмен);
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДопСведТов) Тогда
			СведТов.ДопСведТов.Добавить(ДопСведТов);
		КонецЕсли;
		
		// Заполнение сведений о таможенной декларации
		СвТД = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.СвТД", ДанныеФормата.ПространствоИмен);
		
		НомерГТД = ?(ЭтоПрослеживаемыйТовар, "Прослеж", СокрЛП(СтрокаНоменклатуры.НомерГТД));
		СвТД.НомерТД = ?(СтрДлина(НомерГТД) > 29, Лев(НомерГТД, 29), НомерГТД);
		
		Если ПустаяСтрока(СтрокаНоменклатуры.КодСтраныПроисхождения) Тогда
			СвТД.ДефКодПроисх = "-";
		Иначе
			СвТД.КодПроисх = СтрокаНоменклатуры.КодСтраныПроисхождения;
		КонецЕсли; 
		
		СведТов.СвТД.Добавить(СвТД);
		
		МассивИнфоФХЖ2 = СтрокаНоменклатуры.ИнфополяФХЖ2;
		
		Если МассивИнфоФХЖ2.Количество() Тогда
			СведТов.ИнфПолФХЖ2 = МассивИнфоФХЖ2;
		Иначе
			СведТов.ИнфПолФХЖ2 = Неопределено;
		КонецЕсли;
				
		Если Не ЗначениеЗаполнено(СведТов.НаимТов) 
			И ДопСведТов <> Неопределено 
			И Не ЗначениеЗаполнено(ДопСведТов.ХарактерТов)
			И Не ЗначениеЗаполнено(ДопСведТов.АртикулТов)
			И Не ЗначениеЗаполнено(ДопСведТов.КодТов) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Должно быть заполнено одно из свойств: наименование, код, артикул, характеристика товара", "XM-00007",, СтрокаНоменклатуры.НоменклатураСсылка);
		КонецЕсли;
		
		СтруктураДокумента.Документ.ТаблСчФакт.СведТов.Добавить(СведТов);
		
	КонецЦикла;
	
	// Заполнение итоговых сумм
	ВсегоОпл = СтруктураДокумента.Документ.ТаблСчФакт.ВсегоОпл;
	ВсегоОпл.СтТовУчНалВсего = Формат(ДанныеДокумента.ВсегоСНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	
	Если Не ЗначениеЗаполнено(ВсегоОпл.СтТовУчНалВсего) Тогда
		ВсегоОпл.ДефСтТовУчНалВсего = "-";
	КонецЕсли;
	
	Если ДанныеДокумента.ЭтоАванс Тогда
		ВсегоОпл.СтТовБезНДСВсего = "0";
	Иначе
		ВсегоОпл.СтТовБезНДСВсего = Формат(ДанныеДокумента.ВсегоБезНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	КонецЕсли;
		
	Если ДокументБезНДС Тогда
		ВсегоОпл.СумНалВсего.СумНал = Неопределено;
		ВсегоОпл.СумНалВсего.БезНДС = "без НДС";
	Иначе
		ВсегоОпл.СумНалВсего.СумНал = Формат(ДанныеДокумента.ВсегоНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		ВсегоОпл.СумНалВсего.БезНДС = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьСведенияОПрослеживаемостиФормат820(ДопСведТов, СтрокаНоменклатуры, ПространствоИмен)
	
	СведенияОПрослеживаемости = СтрокаНоменклатуры.СведенияОПрослеживаемости;
	ЭтоПрослеживаемыйТовар = ЗначениеЗаполнено(СведенияОПрослеживаемости);
	Если ЭтоПрослеживаемыйТовар Тогда
		Для каждого СтрокаПрослеживаемости Из СведенияОПрослеживаемости Цикл
			СведПрослеж = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.СведПрослеж", ПространствоИмен);	
			СведПрослеж.НомТовПрослеж = СокрЛП(СтрокаПрослеживаемости.НомерТовара);
			СведПрослеж.ЕдИзмПрослеж = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияКод);
			СведПрослеж.НаимЕдИзмПрослеж = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияНаименование);
			СведПрослеж.КолВЕдПрослеж = СтрокаПрослеживаемости.Количество;
			ДопСведТов.СведПрослеж.Добавить(СведПрослеж);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЭтоПрослеживаемыйТовар;
	
КонецФункции

Процедура ЗаполнитьСведенияОПередаче(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)

	ЗаполнитьСведенияОПередачеНаимнованиеОснования(ДанныеДокумента, ДанныеФормата, ЖурналЛогирования, СтруктураДокумента);

	// Заполнение сведений о передаче товаров, услуг, работ
	СвПер = СтруктураДокумента.Документ.СвПродПер.СвПер;
	СвПер.СодОпер = ДанныеДокумента.СодержаниеОперации;
	СвПер.ДатаПер = Формат(ДанныеДокумента.ДатаОтгрузки, "ДФ=дд.ММ.гггг");
	
	СвЛицПер = СвПер.СвЛицПер;
	
	Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО) Тогда
		
		Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОЛицеПередавшемТовар.Должность) Тогда
			
			РабОргПрод = СвЛицПер.РабОргПрод;						
			ЗаполнитьЗначенияСвойств(РабОргПрод.ФИО, ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО);
			РабОргПрод.Должность = ДанныеДокумента.СведенияОЛицеПередавшемТовар.Должность;
			
			Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОЛицеПередавшемТовар.ОснованиеПолномочий) Тогда
				РабОргПрод.ОснПолн = ДанныеДокумента.СведенияОЛицеПередавшемТовар.ОснованиеПолномочий;
			Иначе
				РабОргПрод.ОснПолн = "Должностные обязанности";
			КонецЕсли;
			
			СвЛицПер.ИнЛицо = Неопределено;

		Иначе 
			ФЛПер = СвЛицПер.ИнЛицо.ФЛПер;
			ЗаполнитьЗначенияСвойств(ФЛПер.ФИО, ДанныеДокумента.СведенияОЛицеПередавшемТовар.ФИО);
			
			СвЛицПер.РабОргПрод = Неопределено;
		КонецЕсли;
				
	КонецЕсли;
	
	СведенияОТранспортировке = Новый Массив;
	
	Для каждого ТранспортнаяНакладная Из ДанныеДокумента.ТранспортныеНакладные Цикл
	
		ТранНакл = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвПродПер.СвПер.ТранГруз.ТранНакл", ДанныеФормата.ПространствоИмен);
		ТранНакл.НомТранНакл = ТранспортнаяНакладная.Номер;
		ТранНакл.ДатаТранНакл = Формат(ТранспортнаяНакладная.Дата, "ДФ=dd.MM.yyyy");
		СвПер.ТранГруз.ТранНакл.Добавить(ТранНакл);
		
		ПредставлениеТранспортнаяНакладная = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Транспортная накладная № %1 от %2'"),
			ТранспортнаяНакладная.Номер, 
			Формат(ТранспортнаяНакладная.Дата, "ДЛФ=ДД"));
		
		СведенияОТранспортировке.Добавить(ПредставлениеТранспортнаяНакладная);
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОТранспортировкеИГрузе) Тогда
		СведенияОТранспортировке.Добавить(ДанныеДокумента.СведенияОТранспортировкеИГрузе);	
	КонецЕсли;
	
	СвПер.ТранГруз.СвТранГруз = СтрСоединить(СведенияОТранспортировке, ", ");
	
	Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДанныеДокумента.Перевозчик) Тогда
		ЗаполнитьСведенияОбУчастнике(СвПер.ТранГруз.Перевозчик, ДанныеДокумента.Перевозчик, ДанныеДокумента.Перевозчик.ЮридическийАдрес, ДанныеФормата, ЖурналЛогирования);
	КонецЕсли;
	
	СвПер.СвПерВещи = Неопределено;
	
	МассивИнфоФХЖ3 = ДанныеДокумента.ИнфополяФХЖ3;
	
	Если МассивИнфоФХЖ3.Количество() Тогда
		СтруктураДокумента.Документ.СвПродПер.ИнфПолФХЖ3.ТекстИнф = МассивИнфоФХЖ3;
	Иначе
		СтруктураДокумента.Документ.СвПродПер.ИнфПолФХЖ3 = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПередачеНаимнованиеОснования(ДанныеДокумента, ДанныеФормата, ЖурналЛогирования, СтруктураДокумента)

	Для каждого ДокументПередачи Из ДанныеДокумента.ОснованияПередачи Цикл
		
		ОснПер = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвПродПер.СвПер.ОснПер", ДанныеФормата.ПространствоИмен);
		
		ОснПер.НомОсн = ДокументПередачи.Номер;
		
		Если ЗначениеЗаполнено(ДокументПередачи.Дата) Тогда
			ОснПер.ДатаОсн = Формат(ДокументПередачи.Дата, "ДФ=дд.ММ.гггг");			
		Иначе
			ТекстОшибки = "Не заполнена дата основания передачи " + Строка(ДокументПередачи.Ссылка);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00008", , ДокументПередачи.Ссылка);
		КонецЕсли;
		
		ОснПер.НаимОсн = ДокументПередачи.Наименование;
		
		Если ЗначениеЗаполнено(ДокументПередачи.ДопСведения) Тогда
			ОснПер.ДопСвОсн = ДокументПередачи.ДопСведения;
		КонецЕсли;
		
		Если ПустаяСтрока(ОснПер.НаимОсн) Тогда
			ОснПер.НаимОсн = "Договор";
		КонецЕсли;
		
		СтруктураДокумента.Документ.СвПродПер.СвПер.ОснПер.Добавить(ОснПер);
		
	КонецЦикла;
	
	Если ДанныеДокумента.ОснованияПередачи.Количество() = 0 Тогда
		ОснПер = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвПродПер.СвПер.ОснПер", ДанныеФормата.ПространствоИмен);
		Если ДанныеФормата.Идентификатор = "УПД_501" ИЛИ ДанныеФормата.Идентификатор = "УПД_502" Тогда
			ОснПер.НаимОсн = "Отсутствует";
		Иначе
			ОснПер.НаимОсн = "Без документа-основания";
		КонецЕсли;
		СтруктураДокумента.Документ.СвПродПер.СвПер.ОснПер.Добавить(ОснПер);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Формат736

Процедура ЗаполнитьТоварыУслугиФорматУКД736(СтруктураДокумента, ДанныеДокумента, ДанныеФормата, ЖурналЛогирования)
	
	НомерСтроки = 1;
	ДокументБезНДСДо = Истина;
	ДокументБезНДСПосле = Истина;
	ТабТоварыУслуги = ДанныеДокумента.ТоварыУслуги;
	ЗаполненаМаркировка = Ложь;
	
	Для каждого СтрокаНоменклатуры Из ТабТоварыУслуги Цикл
		
		СведТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблКСчФ.СведТов", ДанныеФормата.ПространствоИмен);
		
		СведТов.ПорНомТовВСЧФ = НомерСтроки;
		СведТов.НомСтр = НомерСтроки;
		
		СведТов.НаимТов = ?(ПустаяСтрока(СтрокаНоменклатуры.Содержание), СтрокаНоменклатуры.Наименование, СтрокаНоменклатуры.Содержание);
		
		Если Не ЗначениеЗаполнено(СведТов.НаимТов) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено представление номенклатуры", "XM-00024",, СтрокаНоменклатуры.НоменклатураСсылка);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.КодОКЕИ) Тогда
			РезультатПроверкиОКЕИ = КорректностьОКЕИ(СтрокаНоменклатуры.КодОКЕИ);
			Если РезультатПроверкиОКЕИ.Успех = Истина Тогда
				СведТов.ОКЕИ_ТовДо = СтрокаНоменклатуры.КодОКЕИ;
				СведТов.ОКЕИ_ТовПосле = СтрокаНоменклатуры.КодОКЕИ;
			Иначе
				ОписаниеОшибкиОКЕИ = "Некорректный код по ОКЕИ единицы измерения %1, строка №%2, товар %3: ";
				ОписаниеОшибкиОКЕИ = СтрШаблон(ОписаниеОшибкиОКЕИ, 
				СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения, СтрокаНоменклатуры.НомерСтроки, СведТов.НаимТов);
				ОписаниеОшибкиОКЕИ = ОписаниеОшибкиОКЕИ
					+ ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатПроверкиОКЕИ.Журнал);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиОКЕИ, "XM-00037",, СтрокаНоменклатуры.НоменклатураСсылка.ЕдиницаИзмерения);
			КонецЕсли;
		КонецЕсли; 
		
		Если СтрокаНоменклатуры.КоличествоДо > 0 Тогда
			СведТов.КолТовДо = Формат(СтрокаНоменклатуры.КоличествоДо, "ЧГ=0;ЧРД=.;ЧН=0");
		КонецЕсли;
		
		Если СтрокаНоменклатуры.Количество > 0 Тогда
			СведТов.КолТовПосле = Формат(СтрокаНоменклатуры.Количество, "ЧГ=0;ЧРД=.;ЧН=0");
		КонецЕсли;
		
		СведТов.ЦенаТовДо = СтрокаНоменклатуры.ЦенаДо;
		СведТов.ЦенаТовПосле = СтрокаНоменклатуры.Цена;
		
		Если ЗначениеЗаполнено(СтрокаНоменклатуры.СтавкаНДССтрокой) Тогда
			СведТов.НалСтДо = СтрокаНоменклатуры.СтавкаНДССтрокой;
			СведТов.НалСтПосле = СтрокаНоменклатуры.СтавкаНДССтрокой;
		КонецЕсли;
		
		СтТовБезНДС = СведТов.СтТовБезНДС; 
		
		СтТовБезНДС.СтоимДоИзм = Формат(СтрокаНоменклатуры.СуммаБезНДСДо, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		СтТовБезНДС.СтоимПослеИзм = Формат(СтрокаНоменклатуры.СуммаБезНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		Если СтрокаНоменклатуры.РазницаСНДСУвеличение > 0 Тогда
			СтТовБезНДС.СтоимУвел = Формат(СтрокаНоменклатуры.РазницаБезНДСУвеличение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");				
		ИначеЕсли СтрокаНоменклатуры.РазницаСНДСУменьшение > 0 Тогда
			СтТовБезНДС.СтоимУм = Формат(СтрокаНоменклатуры.РазницаБезНДСУменьшение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");				
		КонецЕсли;
		
		СтТовУчНал = СведТов.СтТовУчНал;
		СтТовУчНал.СтоимДоИзм = Формат(СтрокаНоменклатуры.СуммаСНДСДо, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		СтТовУчНал.СтоимПослеИзм = Формат(СтрокаНоменклатуры.СуммаСНДС, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		Если СтрокаНоменклатуры.РазницаСНДСУвеличение > 0 Тогда
			СтТовУчНал.СтоимУвел = Формат(СтрокаНоменклатуры.РазницаСНДСУвеличение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");				
		ИначеЕсли СтрокаНоменклатуры.РазницаСНДСУменьшение > 0 Тогда
			СтТовУчНал.СтоимУм = Формат(СтрокаНоменклатуры.РазницаСНДСУменьшение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");				
		КонецЕсли;
		
		СведТов.АкцизДо.БезАкциз = "без акциза";
		СведТов.АкцизПосле.БезАкциз = "без акциза";
		
		Если СведТов.НалСтПосле = "без НДС" Тогда
			СведТов.СумНалПосле.БезНДС = "без НДС";
		Иначе
			СведТов.СумНалПосле.СумНДС = Формат(СтрокаНоменклатуры.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0");
			ДокументБезНДСПосле = Ложь;
		КонецЕсли;	
		
		Если СведТов.НалСтДо = "без НДС" Тогда
			СведТов.СумНалДо.БезНДС = "без НДС";
		Иначе
			СведТов.СумНалДо.СумНДС = Формат(СтрокаНоменклатуры.СуммаНДСДо, "ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0");
			ДокументБезНДСДо = Ложь;
		КонецЕсли;	
		
		СумНалРазн = СведТов.СумНалРазн;
		Если СтрокаНоменклатуры.РазницаНДСУвеличение > 0 Тогда
			СумНалРазн.СумУвел = Формат(СтрокаНоменклатуры.РазницаНДСУвеличение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		ИначеЕсли СтрокаНоменклатуры.РазницаНДСУменьшение > 0 Тогда
			СумНалРазн.СумУм = Формат(СтрокаНоменклатуры.РазницаНДСУменьшение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		Иначе
			Если СтрСравнить(СведТов.НалСтДо, "без ндс") = 0 Или СтрСравнить(СведТов.НалСтДо, "0%") = 0 Тогда
				Если ЗначениеЗаполнено(СтТовУчНал.СтоимУвел) Тогда
					СумНалРазн.СумУвел = "0.00";
				ИначеЕсли ЗначениеЗаполнено(СтТовУчНал.СтоимУм) Тогда
					СумНалРазн.СумУм = "0.00";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МассивИнфоФХЖ2 = СтрокаНоменклатуры.ИнфополяФХЖ2;
		
		Если МассивИнфоФХЖ2.Количество() Тогда
			СведТов.ИнфПолФХЖ2 = МассивИнфоФХЖ2;
		Иначе
			СведТов.ИнфПолФХЖ2 = Неопределено;
		КонецЕсли;
		
		// Заполнение сведений о маркировке
		Если ДанныеДокумента.ЕстьМаркировка Тогда
			ЗаполнитьСведенияОМаркировкеФормат736(СведТов.НомСредИдентТовДо, СтрокаНоменклатуры.СведенияОМаркировкеДо,
			ДанныеФормата.ПространствоИмен, ЗаполненаМаркировка);
			ЗаполнитьСведенияОМаркировкеФормат736(СведТов.НомСредИдентТовПосле, СтрокаНоменклатуры.СведенияОМаркировкеПосле,
			ДанныеФормата.ПространствоИмен, ЗаполненаМаркировка);	
		КонецЕсли;
		
		ЗаполнитьСведенияОПрослеживаемостиФормат736(СведТов, СтрокаНоменклатуры, ДанныеФормата.ПространствоИмен);
		
		// Заполнение доп.сведений о товарах
		ДопСведТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблКСчФ.СведТов.ДопСведТов", ДанныеФормата.ПространствоИмен);
		ДопСведТов.АртикулТов = СтрокаНоменклатуры.Артикул;
		ДопСведТов.КодВидТов = ?(ЗначениеЗаполнено(СтрокаНоменклатуры.КодТНВЭД), СтрокаНоменклатуры.КодТНВЭД, Неопределено);
		ДопСведТов.КодТов = СтрокаНоменклатуры.Код;
		ДопСведТов.НаимЕдИзмДо = СтрокаНоменклатуры.НаименованиеЕдиницыИзмеренияДо;
		ДопСведТов.НаимЕдИзмПосле = СтрокаНоменклатуры.НаименованиеЕдиницыИзмерения;
		ДопСведТов.СортТов = Неопределено;
		ДопСведТов.ХарактерТов = СтрокаНоменклатуры.ХарактеристикаНаименование;
		
		СведТов.ДопСведТов = ДопСведТов;
		
		СтруктураДокумента.Документ.ТаблКСчФ.СведТов.Добавить(СведТов);
		
		// Исключение из формирования электронного документа строк без изменений сумм налога и стоимости товара.
		// Для налоговой ставки(до изменения) "НДС исчисляется налоговым агентом" пустые значения допустимы согласно приказа.
		Если СокрЛП(НРег(СведТов.НалСтДо)) <> ("ндс исчисляется налоговым агентом") Тогда
			
			ПроверкаПройдена = Истина;
			Если НЕ (ЗначениеЗаполнено(СтТовУчНал.СтоимУвел) ИЛИ ЗначениеЗаполнено(СтТовУчНал.СтоимУм)) Тогда
				ТекстСообщения = СтрШаблон("В строке %1 корректировочного документа %2 не заданы значения изменения стоимости товара СтТовУчНал - [СтоимУвел], [СтоимУм]", НомерСтроки, ДанныеДокумента.ДокументСсылка);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(ЖурналЛогирования, ТекстСообщения, , ДанныеДокумента.ДокументСсылка);
				ПроверкаПройдена = Ложь;
			КонецЕсли;
			
			Если НЕ (ЗначениеЗаполнено(СумНалРазн.СумУвел) ИЛИ ЗначениеЗаполнено(СумНалРазн.СумУм)) Тогда
				ТекстСообщения = СтрШаблон("В строке %1 корректировочного документа %2 не заданы значения изменения суммы налога СумНалРазн - [СумУвел], [СумУм]", НомерСтроки, ДанныеДокумента.ДокументСсылка);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(ЖурналЛогирования, ТекстСообщения, , ДанныеДокумента.ДокументСсылка);
				ПроверкаПройдена = Ложь;
			КонецЕсли;
			
			Если ПроверкаПройдена = Ложь Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Если ДанныеДокумента.ЕстьМаркировка И Не ЗаполненаМаркировка Тогда
		ОписаниеОшибки = "Не удалось заполнить сведения о маркировке товаров до и после. Необходимо обновить конфигурацию базы данных.";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибки, "MK-00911",, ДанныеДокумента.ДокументСсылка);		
	КонецЕсли;
	
	ВсегоУвел = СтруктураДокумента.Документ.ТаблКСчФ.ВсегоУвел;
	ВсегоУм = СтруктураДокумента.Документ.ТаблКСчФ.ВсегоУм;
	
	ВсегоУвел.СтТовБезНДСВсего = Формат(ДанныеДокумента.ВсегоБезНДСУвеличение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	ВсегоУм.СтТовБезНДСВсего = Формат(ДанныеДокумента.ВсегоБезНДСУменьшение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	
	ВсегоУвел.СтТовУчНалВсего = Формат(ДанныеДокумента.ВсегоСНДСУвеличение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	ВсегоУм.СтТовУчНалВсего = Формат(ДанныеДокумента.ВсегоСНДСУменьшение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");	
	
	Если ДокументБезНДСДо И ДокументБезНДСПосле Тогда
		ВсегоУвел.СумНал.БезНДС = "без НДС";	
		ВсегоУм.СумНал.БезНДС = "без НДС";	
	Иначе
		ВсегоУвел.СумНал.СумНДС = Формат(ДанныеДокумента.ВсегоНДСУвеличение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
		ВсегоУм.СумНал.СумНДС = Формат(ДанныеДокумента.ВсегоНДСУменьшение, "ЧГ=0;ЧРД=.;ЧН=0;ЧДЦ=2");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПрослеживаемостиФормат736(СведТов, СтрокаНоменклатуры, ПространствоИмен)
	
	СведенияОПрослеживаемости = СтрокаНоменклатуры.СведенияОПрослеживаемости;
	ЭтоПрослеживаемыйТовар = ЗначениеЗаполнено(СведенияОПрослеживаемости);
	Если ЭтоПрослеживаемыйТовар Тогда
		Для каждого СтрокаПрослеживаемости Из СведенияОПрослеживаемости Цикл
			СведПрослеж = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблКСчФ.СведТов.СведПрослеж", ПространствоИмен);	
			СведПрослеж.НомТовПрослеж = СокрЛП(СтрокаПрослеживаемости.НомерТовара);
			СведПрослеж.ЕдИзмПрослеж = СокрЛП(СтрокаПрослеживаемости.ЕдиницаИзмеренияКод);
			
			ИзмененияВКоличестве = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблКСчФ.СведТов.СведПрослеж.ИзмКолЕдПТ", ПространствоИмен);
			ИзмененияВКоличестве.КолТовЕдПТДо = СтрокаПрослеживаемости.КоличествоТовараДоИзменения;
			ИзмененияВКоличестве.КолТовЕдПТПосле = СтрокаПрослеживаемости.КоличествоТовараПослеИзменения;
			
			Если ИзмененияВКоличестве.КолТовЕдПТДо <> ИзмененияВКоличестве.КолТовЕдПТПосле Тогда
				
				ЗначениеРазницы = СтрокаПрослеживаемости.КоличествоТовараУвеличение;
				Если ЗначениеЗаполнено(ЗначениеРазницы) Тогда
					ИзмененияВКоличестве.КолТовЕдПТУвел = ЗначениеРазницы;
				Иначе
					ЗначениеРазницы = СтрокаПрослеживаемости.КоличествоТовараУменьшение;
					ИзмененияВКоличестве.КолТовЕдПТУм = ЗначениеРазницы;
				КонецЕсли;
				СведПрослеж.ИзмКолЕдПТ = ИзмененияВКоличестве;
				
			КонецЕсли;
			
			СведТов.СведПрослеж.Добавить(СведПрослеж);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеФормат736(СведТовНомСредИдентТов, СведенияОМаркировке, ПространствоИмен, ЗаполненаМаркировка)
	
	Перем НомСредИдентТов, СтрокаКода, СписокКодовОСУ;
	
	Если ТипЗнч(СведенияОМаркировке) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СведенияОМаркировке.Свойство("ТранспортныеУпаковки") И ЗначениеЗаполнено(СведенияОМаркировке.ТранспортныеУпаковки) Тогда
		Для каждого СтрокаКода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
			НомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("НомСредИдТовТип", ПространствоИмен);
			НомСредИдентТов.ИдентТрансУпак = СтрокаКода.Код;
			СведТовНомСредИдентТов.Добавить(НомСредИдентТов);
			ЗаполненаМаркировка = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если СведенияОМаркировке.Свойство("КонтрольныеИдентификационныеЗнаки") И ЗначениеЗаполнено(СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки) Тогда
		НомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("НомСредИдТовТип", ПространствоИмен);
		Для каждого СтрокаКода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
			НомСредИдентТов.КИЗ.Добавить(СтрокаКода.Код);
		КонецЦикла;
		СведТовНомСредИдентТов.Добавить(НомСредИдентТов);
		ЗаполненаМаркировка = Истина;
	КонецЕсли;
	
	Если СведенияОМаркировке.Свойство("ККСНГ_ОбъемноСортовойУчет") Тогда
		СписокКодовОСУ = СведенияОМаркировке.ККСНГ_ОбъемноСортовойУчет;
	ИначеЕсли СведенияОМаркировке.Свойство("ИндивидуальныеУпаковки") Тогда
		СписокКодовОСУ = СведенияОМаркировке.ИндивидуальныеУпаковки;
	Иначе
		СписокКодовОСУ = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокКодовОСУ) И ТипЗнч(СписокКодовОСУ) = Тип("ТаблицаЗначений") Тогда
		НомСредИдентТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("НомСредИдТовТип", ПространствоИмен);
		Для каждого СтрокаКода Из СписокКодовОСУ Цикл
			НомСредИдентТов.НомУпак.Добавить(СтрокаКода.Код);
		КонецЦикла;
		СведТовНомСредИдентТов.Добавить(НомСредИдентТов);
		ЗаполненаМаркировка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УКД

Функция ДанныеСоответствуютФорматуУКД(ДанныеДокумента, ДанныеФормата, Ответ)
	
	Если (ДанныеДокумента.ЭтоСФ И ДанныеФормата.ФункцияУПД = "ДИС") Или (Не ДанныеДокумента.ЭтоСФ И ДанныеФормата.ФункцияУПД <> "ДИС") Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка данных формата ЭДО.", "XM-00021");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.КодЭДОПолучателя) Тогда 
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не заполнен код ЭДО организации: " + Строка(ДанныеДокумента.ОтправительЭД), "XM-00022");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.КодЭДООтправителя) Тогда 
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не заполнен код ЭДО конрагента: " + Строка(ДанныеДокумента.ПолучательЭД), "XM-00023");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьПредставлениеДокументаУКД(Документ, ДанныеФормата)
	
	Если ДанныеФормата.ФункцияУПД <> "КСЧФ" Тогда
		
		Если ДанныеФормата.Идентификатор = "УКД_2020" Тогда
			Документ.ПоФактХЖ = "Документ, подтверждающий согласие (факт уведомления) покупателя на изменение стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
		Иначе
			Документ.ПоФактХЖ = "Документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав";
		КонецЕсли;
		
		Если ДанныеФормата.ФункцияУПД = "КСЧФДИС" Тогда
			Документ.НаимДокОпр = "Корректировочный счет-фактура и документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав.";
		ИначеЕсли ДанныеФормата.ФункцияУПД = "ДИС" Тогда
			Документ.НаимДокОпр = "Документ об изменении стоимости отгруженных товаров (выполненных работ, оказанных услуг), переданных имущественных прав.";
		Иначе
			Документ.НаимДокОпр = Неопределено;
		КонецЕсли;
		
	Иначе
		
		Документ.ПоФактХЖ = Неопределено;
		Документ.НаимДокОпр = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеИсправленияУКД(ДанныеДокумента, ДанныеФормата, СвКСчФ)
	
	Если (ДанныеФормата.ФункцияУПД = "ДИС" И ДанныеДокумента.ВидКорректировки <> "СогласованноеИзменение") Или ДанныеДокумента.ЭтоИсправление Тогда
		
		ДанныеИсправления = СвКСчФ.ИспрКСчФ;
		ДанныеИсправления.НомИспрКСчФ  = ДанныеДокумента.НомерИсправления;
		ДанныеИсправления.ДатаИспрКСчФ = Формат(ДанныеДокумента.ДатаИсправления, "ДФ=дд.ММ.гггг");
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДанныеИсправления) Тогда
			ДанныеИсправления = Неопределено;
		КонецЕсли;
		
	Иначе 
		СвКСчФ.ИспрКСчФ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСЧФУКД(Документ, ДанныеФормата, ДанныеДокумента, МассивСЧФ)
	
	Счф = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвКСчФ.СчФ", ДанныеФормата.ПространствоИмен);
	Счф.НомерСчФ = ДанныеДокумента.НомерИсходногоДокумента;
	Счф.ДатаСчФ = Формат(ДанныеДокумента.ДатаИсходногоДокумента, "ДФ=дд.ММ.гггг");
	
	Если ДанныеФормата.ФункцияУПД = "ДИС"  И ДанныеДокумента.ВидКорректировки <> "СогласованноеИзменение" Тогда
		
		ДанныеИсправления = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.СвКСчФ.СчФ.ИспрСчФ", ДанныеФормата.ПространствоИмен);;
		ДанныеИсправления.НомИспрСчФ  = ДанныеДокумента.НомерИсправления;
		ДанныеИсправления.ДатаИспрСчФ = Формат(ДанныеДокумента.ДатаИсправления, "ДФ=дд.ММ.гггг");
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(ДанныеИсправления) Тогда
			Счф.ИспрСчФ = Неопределено;
		Иначе
			Счф.ИспрСчФ.Добавить(ДанныеИсправления);
		КонецЕсли;
		
	Иначе
		
		СчФ.ИспрСчФ = Неопределено;
		
	КонецЕсли;
	
	МассивСчф.Добавить(Счф);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеФорматы

#Область Счет

Процедура ЗаполнитьПлатежныеРеквизитыСчета(Приемник, Источник, ЖурналСообщений)
	
	БанковскийСчет = Источник.БанковскийСчет;
	
	Если ЗначениеЗаполнено(БанковскийСчет.НомерСчета) Тогда
		Приемник.Счет = БанковскийСчет.НомерСчета;
		
		Банк = БанковскийСчет.Банк;
		
		Если ЗначениеЗаполнено(Банк) Тогда
			
			// БИК
			Если ЗначениеЗаполнено(БанковскийСчет.БИК) Тогда
				Приемник.Банк.БИК = БанковскийСчет.БИК;
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен БИК банка " + Строка(Банк), "XM-00014",, Банк);
			КонецЕсли;
			
			// НаимБанк
			Если ЗначениеЗаполнено(БанковскийСчет.НаименованиеБанка) Тогда
				Приемник.Банк.НаимБанк = БанковскийСчет.НаименованиеБанка;
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнено наменование банка " + Строка(Банк), "XM-00014",, Банк);
			КонецЕсли;
			
			// КоррСчет
			Если ЗначениеЗаполнено(БанковскийСчет.КоррСчет) Тогда
				Приемник.Банк.Счет = БанковскийСчет.КоррСчет;
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен корр. счет банка " + Строка(Банк), "XM-00014",, Банк);
			КонецЕсли;
			
			// Город
			Если ЗначениеЗаполнено(БанковскийСчет.ГородБанка) Тогда
				Приемник.Банк.Город = БанковскийСчет.ГородБанка;
			Иначе
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен город банка " + Строка(Банк), "XM-00014",, Банк);
			КонецЕсли;
			
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен банк счета " + БанковскийСчет.Представление, "XM-00014",, Банк);	
		КонецЕсли;
		
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен номер банковского счета " + БанковскийСчет.Представление, "XM-00014",, Банк);
		//ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен банковский счет", "XM-00014");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСведенияОбУчастникеСчета(Приемник, Источник, Адрес, ДанныеФормата, ЖурналСообщений)
	
	ИдСв = Приемник.ИдСв;
	
	Если Источник.ЭтоЮрЛицо Тогда // Заполнение данных юрлица
		
		СвЮЛ = ИдСв.СвЮЛ;
		СвЮЛ.НаимОрг = СокрЛП(Источник.ПолноеНаименование);
		Если Не ЗначениеЗаполнено(Источник.ПолноеНаименование) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнено полное наименование юр. лица " + Строка(Источник.Ссылка), "XM-00013",, Источник.Ссылка);
		КонецЕсли;
		СвЮЛ.ИННЮЛ = Источник.ИНН;
		Если Не ЗначениеЗаполнено(Источник.ИНН) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен ИНН юр. лица " + Строка(Источник.Ссылка), "XM-00010",, Источник.Ссылка);
		КонецЕсли;
		СвЮЛ.КПП = Источник.КПП;
		
	Иначе // физ. лицо
		
		СвФЛ = ИдСв.СвФЛ;
		СвФЛ.ИННФЛ = Источник.ИНН;
		Если Не ЗначениеЗаполнено(Источник.ИНН) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, "Не заполнен ИНН физ. лица " + Строка(Источник.Ссылка), "XM-00011",, Источник.Ссылка);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СвФЛ.ФИОИП, Источник.ФИО);
		
	КонецЕсли;
	
	// Заполнение адреса
	Если Не ПустаяСтрока(Адрес.КодРегион) И ПроверитьСоответствиеПолейАдресаФормату(Адрес, ДанныеФормата.ПространствоИмен, "АдрРФТип", ЖурналСообщений) Тогда
		АдрРФ = Приемник.Адрес.АдрРФ;
		ЗаполнитьЗначенияСвойств(АдрРФ, Адрес);
	ИначеЕсли Не ПустаяСтрока(Адрес.КодСтраны) И Не ПустаяСтрока(Адрес.Представление) Тогда
		АдрИнф = Приемник.Адрес.АдрИно;
		АдрИнф.КодСтр = Адрес.КодСтраны;
		АдрИнф.АдрТекст = Лев(СокрЛП(Адрес.Представление), 1000); // Максимальное количество символов 1000
	Иначе
		Приемник.Адрес = Неопределено;
		ТекстОшибки = "Проверьте заполнение юридического адреса участника " + Строка(Источник.Ссылка);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, ТекстОшибки, "XM-00012",, Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыУслугиФорматСчета(Документ, ДанныеДокумента, ДанныеФормата, Ответ)
	
	// Табличная часть
	СтТовБезНДСВсего = 0;
	СтТовУчНалВсего  = 0;
	СумНДС = 0;
	БезНДС = Истина;
	
	СведенияТаблицыСч = Документ.ТаблСч.СведТов;
	Для Каждого СтрСчета Из ДанныеДокумента.ТоварыУслуги Цикл
		
		СтрокаСведТов = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Файл.Документ.ТаблСч.СведТов", ДанныеФормата.ПространствоИмен);
		
		СтрокаСведТов.КолТов = СтрСчета.Количество;
		СтрокаСведТов.НаимТов = СтрСчета.Наименование;
		СтрокаСведТов.НомСтр = СтрСчета.НомерСтроки;
		ТекОКЕИ = СокрЛП(СтрСчета.КодОКЕИ);
		
		Если ЗначениеЗаполнено(ТекОКЕИ) Тогда
			РезультатПроверкиОКЕИ = КорректностьОКЕИ(ТекОКЕИ);
			Если РезультатПроверкиОКЕИ.Успех = Истина Тогда
				СтрокаСведТов.ОКЕИ_Тов = ТекОКЕИ;
			Иначе 
				ОписаниеОшибкиОКЕИ = НСтр("ru = 'Некорректный код по ОКЕИ единицы измерения %1, строка №%2, товар %3: '");
				ОписаниеОшибкиОКЕИ = СтрШаблон(ОписаниеОшибкиОКЕИ, 
				СтрСчета.НаименованиеЕдиницыИзмерения, СтрСчета.НомерСтроки, СтрокаСведТов.НаимТов);
				ОписаниеОшибкиОКЕИ = ОписаниеОшибкиОКЕИ + ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатПроверкиОКЕИ.Журнал);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибкиОКЕИ, "XM-00037",, ДанныеДокумента.ДокументСсылка);
			КонецЕсли;
		КонецЕсли;
		
		СтрокаСведТов.СтТовБезНДС = СтрСчета.СуммаБезНДС;
		СтрокаСведТов.СтТовУчНал = СтрСчета.СуммаСНДС;
		Если СокрЛП(НРег(СтрСчета.СтавкаНДССтрокой)) = "без ндс" Тогда
			СтрокаСведТов.СумНал.БезНДС = "без НДС";
			СтрокаСведТов.НалСт = "без НДС";
		Иначе
			СтрокаСведТов.СумНал.СумНДС = Формат(СтрСчета.СуммаНДС, "ЧГ=0;ЧРД=.;ЧН=0");
			СтрокаСведТов.НалСт = СтрСчета.СтавкаНДССтрокой;
			БезНДС = Ложь;
		КонецЕсли;
		
		СтрокаСведТов.ЦенаТов = СтрСчета.Цена;
		
		СтТовБезНДСВсего = СтТовБезНДСВсего + СтрСчета.СуммаБезНДС;
		СтТовУчНалВсего  = СтТовУчНалВсего + СтрСчета.СуммаСНДС;
		СумНДС = СумНДС + СтрСчета.СуммаНДС;
		
		СведенияТаблицыСч.Добавить(СтрокаСведТов);
		
	КонецЦикла;
	
	ВсегоОпл = Документ.ТаблСч.ВсегоОпл;
	
	ВсегоОпл.СтТовБезНДСВсего = СтТовБезНДСВсего;
	ВсегоОпл.СтТовУчНалВсего  = СтТовУчНалВсего;
	Если БезНДС Тогда
		ВсегоОпл.СумНалВсего.БезНДС = "без НДС";
	Иначе
		ВсегоОпл.СумНалВсего.СумНДС = Формат(СумНДС, "ЧГ=0;ЧРД=.;ЧН=0");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СчетУВХД

Процедура ЗаполнитьЗаголовокСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата, ЖурналСообщений)
	
	СтруктураЗаголовкаДокумента = СтруктураДокумента.InvoiceDetailRequest.InvoiceDetailRequestHeader;
	СтруктураЗаголовкаДокумента.invoiceID = ДанныеДокумента.ИдФайл;
	СтруктураЗаголовкаДокумента.invoiceDate = ТекущаяДатаСеанса();
	СтруктураЗаголовкаДокумента.purpose = "standard"; 
	СтруктураЗаголовкаДокумента.operation = "new";
	
	РеквизитыСчета = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураЗаголовкаДокумента, "Extrinsic", Новый Массив());
	РеквизитыСчета.Добавить(РеквизитСчетаУВХД("Num_invoice", ДанныеДокумента.Номер, ДанныеФормата));
	РеквизитыСчета.Добавить(РеквизитСчетаУВХД("Date_invoice", Формат(ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"), ДанныеФормата));
	
	ЗаполнитьСведенияОбУчастникахСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата, ЖурналСообщений);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОбУчастникахСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата, ЖурналСообщений)
	
	СведенияОбУчастниках = СтруктураДокумента.InvoiceDetailRequest.InvoiceDetailRequestHeader.InvoicePartner;
	СведенияОбУчастниках.Добавить(ПолучитьСведенияОбУчастникеСчетаУВХД("billTo", ДанныеДокумента.Продавцы[0], ДанныеФормата, ЖурналСообщений)); // role="billTo" для получателя
	СведенияОбУчастниках.Добавить(ПолучитьСведенияОбУчастникеСчетаУВХД("remitTo", ДанныеДокумента.Покупатели[0], ДанныеФормата, ЖурналСообщений)); // role="remitTo" для отправителя
	
КонецПроцедуры

Функция ПолучитьСведенияОбУчастникеСчетаУВХД(РольУчастника, ДанныеУчастника, ДанныеФормата, ЖурналСообщений)
	
	Сведения = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Request.InvoiceDetailRequest.InvoiceDetailRequestHeader.InvoicePartner", ДанныеФормата.ПространствоИмен);
	Адрес = ДанныеУчастника.ЮридическийАдрес;
	
	Сведения.Contact.role = РольУчастника;
	Сведения.Contact.Name.__content = ДанныеУчастника.Представление;
	АдресПредставление = СокрЛП(СтрЗаменить(Адрес.Представление, Адрес.Индекс + ",", ""));
	Сведения.Contact.PostalAddress = АдресУчастникаСчетаУВХД(ДанныеФормата, Адрес.Индекс, Адрес.Город, АдресПредставление, "Российская Федерация");
	
	Реквизиты = Сведения.Contact.Extrinsic;
	Реквизиты.Добавить(РеквизитУчастникаСчетаУВХД("INN", ДанныеУчастника.ИНН, ДанныеФормата));	
	Если ДанныеУчастника.ЭтоЮрЛицо Тогда
		Реквизиты.Добавить(РеквизитУчастникаСчетаУВХД("KPP", ДанныеУчастника.КПП, ДанныеФормата));	
	КонецЕсли;
	
	Если РольУчастника = "billTo" Тогда
		
		БанковскийСчетОтправителя = ДанныеУчастника.БанковскийСчет;
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(БанковскийСчетОтправителя) Тогда
			СобытиеОшибки = "Не заполнен банковский счет организации-отправителя.";
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, СобытиеОшибки, "ACC-00001");
		Иначе 
			ПроверяемыеРеквизиты = Новый Соответствие;
			ПроверяемыеРеквизиты.Вставить("БИК", БанковскийСчетОтправителя.БИК);
			ПроверяемыеРеквизиты.Вставить("наименование банка", БанковскийСчетОтправителя.НаименованиеБанка);
			ПроверяемыеРеквизиты.Вставить("номер счета", БанковскийСчетОтправителя.НомерСчета);
			ПроверяемыеРеквизиты.Вставить("корреспондентский счет", БанковскийСчетОтправителя.КоррСчет);
			Для каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
				Если Не ЗначениеЗаполнено(ПроверяемыйРеквизит.Значение) Тогда
					СобытиеОшибки = СтрШаблон("Не заполнен обязательный реквизит ""%1"" банковского счета организации-отправителя.", ПроверяемыйРеквизит.Ключ);
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, СобытиеОшибки, "ACC-00002");	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Реквизиты.Добавить(РеквизитУчастникаСчетаУВХД("BIK", БанковскийСчетОтправителя.БИК, ДанныеФормата));	
		Реквизиты.Добавить(РеквизитУчастникаСчетаУВХД("NameBank", БанковскийСчетОтправителя.НаименованиеБанка, ДанныеФормата));
		Реквизиты.Добавить(РеквизитУчастникаСчетаУВХД("IBAN", БанковскийСчетОтправителя.НомерСчета, ДанныеФормата));
		Реквизиты.Добавить(РеквизитУчастникаСчетаУВХД("CorrAcc", БанковскийСчетОтправителя.КоррСчет, ДанныеФормата));
		
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

Процедура ЗаполнитьДетальнуюИнформациюСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата)
	
	ЗаполнитьСведенияОДоговореУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата);
	ЗаполнитьСведенияОТоварахУслугахУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОДоговореУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата)
	
	//СведенияОДоговорах = СтруктураДокумента.InvoiceDetailRequest.InvoiceDetailOrder.InvoiceDetailOrderInfo;
	//СведенияОДоговорах.OrderReference.DocumentReference.payloadID = ""; 
	//СведенияОДоговорах.MasterAgreementReference.DocumentReference.payloadID = "";
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОТоварахУслугахУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата)
	
	СведенияОТоварахУслугах = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДокумента, "InvoiceDetailRequest.InvoiceDetailOrder.InvoiceDetailItem", Новый Массив());
	
	Валюта = ВалютаСчетаУВХД(ДанныеДокумента.СведенияОВалюте);
	
	Для каждого Стр Из ДанныеДокумента.ТоварыУслуги Цикл
		
		СведениеОТовареУслуге = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Request.InvoiceDetailRequest.InvoiceDetailOrder.InvoiceDetailItem", ДанныеФормата.ПространствоИмен);
		
		СведениеОТовареУслуге.invoiceLineNumber = Стр.НомерСтроки;
		СведениеОТовареУслуге.quantity = Стр.Количество;
		СведениеОТовареУслуге.UnitOfMeasure = СокрЛП(Стр.КодОКЕИ);
		СведениеОТовареУслуге.UnitPrice.Money.currency = Валюта;
		СведениеОТовареУслуге.UnitPrice.Money.__content = Стр.Цена;
		СведениеОТовареУслуге.SubtotalAmount.Money.currency = Валюта;
		СведениеОТовареУслуге.SubtotalAmount.Money.__content = Стр.СуммаСНДС;
		СведениеОТовареУслуге.Tax.Money.currency = Валюта;
		СведениеОТовареУслуге.Tax.Money.__content = Стр.СуммаНДС;
		СведениеОТовареУслуге.Tax.Description.__content = Стр.СтавкаНДССтрокой;
		СведениеОТовареУслуге.Distribution.__content = Стр.Наименование;
		
		СведенияОТоварахУслугах.Добавить(СведениеОТовареУслуге);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИтоговуюИнформациюСчетаУВХД(ДанныеДокумента, СтруктураДокумента, ДанныеФормата)
	
	СведенияОбИтогах = СтруктураДокумента.InvoiceDetailRequest.InvoiceDetailSummary;
	Если ДанныеДокумента.ТоварыУслуги.Количество() Тогда
		
		Валюта = ДанныеДокумента.СведенияОВалюте.Наименование;
		ТоварыУслуги = ДанныеДокумента.ТоварыУслуги;
		
		СведенияОбИтогах.SubtotalAmount.Money.currency = Валюта;
		СведенияОбИтогах.SubtotalAmount.Money.__content = ТоварыУслуги.Итог("СуммаСНДС");
		
		СведенияОбИтогах.TotalAmountWithoutTax.Money.currency = Валюта;
		СведенияОбИтогах.TotalAmountWithoutTax.Money.__content = ТоварыУслуги.Итог("СуммаБезНДС");
		
		СведенияОбИтогах.Tax.Money.currency = Валюта;
		СведенияОбИтогах.Tax.Money.__content = ТоварыУслуги.Итог("СуммаНДС");
		СведенияОбИтогах.Tax.Description.__content = ТоварыУслуги[0].СтавкаНДССтрокой;
		
	КонецЕсли;
	
КонецПроцедуры

Функция АдресУчастникаСчетаУВХД(ДанныеФормата, Индекс, Город, Улица, СтранаПредставление, СтранаКод = "RU")
	
	Адрес = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("PostalAddressType", ДанныеФормата.ПространствоИмен);
	Адрес.Street = Улица;
	Адрес.City = Город;
	Адрес.PostalCode = Индекс;
	Адрес.Country.__content = СтранаПредставление;
	Адрес.Country.isoCountryCode = СтранаКод;
	
	Возврат Адрес;
	
КонецФункции

Функция РеквизитСчетаУВХД(Имя, Значение, ДанныеФормата)
	
	Реквизит = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Request.InvoiceDetailRequest.InvoiceDetailRequestHeader.Extrinsic", ДанныеФормата.ПространствоИмен);
	Реквизит.name = Имя;
	Реквизит.__content = Строка(Значение);
	
	Возврат Реквизит;
	
КонецФункции

Функция РеквизитУчастникаСчетаУВХД(Имя, Значение, ДанныеФормата)
	
	Реквизит = ККСНГ_APIКурьер.ПолучитьСтруктуруПоТипуXDTO("Request.InvoiceDetailRequest.InvoiceDetailRequestHeader.InvoicePartner.Contact.Extrinsic", ДанныеФормата.ПространствоИмен);
	Реквизит.name = Имя;
	Реквизит.__content = Строка(Значение);
	
	Возврат Реквизит;
	
КонецФункции

Процедура ПроверитьЗаполнениеСчетаУВХД(СтруктураДокумента, ДанныеФормата, ЖурналСообщений)
	
	СписокПроверяемыхРеквизитов = Новый Массив();
	
	// Реквизиты счета
	ПроверяемыеРеквизитыСчета = Новый Соответствие();
	ПроверяемыеРеквизитыСчета.Вставить("Num_invoice", ПроверяемыйРеквизитУВХД("Номер счета"));
	ПроверяемыеРеквизитыСчета.Вставить("Date_invoice", ПроверяемыйРеквизитУВХД("Дата счета"));
	СписокПроверяемыхРеквизитов.Добавить(ПроверяемыеРеквизитыСчета);
	
	РеквизитыСчета = СтруктураДокумента.InvoiceDetailRequest.InvoiceDetailRequestHeader.Extrinsic;
	Для каждого РеквизитСчета Из РеквизитыСчета Цикл
		ИмяРеквизита = РеквизитСчета.name;
		ПроверяемыйРеквизит = ПроверяемыеРеквизитыСчета.Получить(ИмяРеквизита);
		Если Не ПроверяемыйРеквизит = Неопределено Тогда
			ЗначениеРеквизита = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитСчета, "__content");
			ПроверяемыйРеквизит.Заполнен = ЗначениеЗаполнено(ЗначениеРеквизита);
			ПроверяемыйРеквизит.Найден = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Участники счета
	УчастникиСчета = СтруктураДокумента.InvoiceDetailRequest.InvoiceDetailRequestHeader.InvoicePartner;
	Для каждого УчастникСчета Из УчастникиСчета Цикл
		
		ПроверяемыеРеквизитыУчастниковСчета = Новый Соответствие();
		ПроверяемыеРеквизитыУчастниковСчета.Вставить("INN", ПроверяемыйРеквизитУВХД("ИНН"));
		//ПроверяемыеРеквизитыУчастниковСчета.Вставить("IBAN", ПроверяемыйРеквизитУВХД("Номер счета"));
		//ПроверяемыеРеквизитыУчастниковСчета.Вставить("BIK", ПроверяемыйРеквизитУВХД("БИК"));
		//ПроверяемыеРеквизитыУчастниковСчета.Вставить("NameBank", ПроверяемыйРеквизитУВХД("Наименование банка"));
		СписокПроверяемыхРеквизитов.Добавить(ПроверяемыеРеквизитыУчастниковСчета);
		
		// Реквизиты участника счета
		ИмяУчастника = УчастникСчета.Contact.Name.__content;
		РеквизитыУчастникаСчета = УчастникСчета.Contact.Extrinsic;
		Для каждого РеквизитУчастникаСчета Из РеквизитыУчастникаСчета Цикл
			ИмяРеквизита = РеквизитУчастникаСчета.name;
			ПроверяемыйРеквизит = ПроверяемыеРеквизитыУчастниковСчета.Получить(ИмяРеквизита);
			Если Не ПроверяемыйРеквизит = Неопределено Тогда
				ЗначениеРеквизита = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитУчастникаСчета, "__content");
				ПроверяемыйРеквизит.Заполнен = ЗначениеЗаполнено(ЗначениеРеквизита);
				ПроверяемыйРеквизит.Найден = Истина;
			КонецЕсли;
		КонецЦикла;
		
		// Адрес участника счета
		АдресУчастника = УчастникСчета.Contact.PostalAddress;
		
		ПроверяемыеРеквизитыАдресаУчастника = Новый Соответствие();
		ПроверяемыеРеквизитыАдресаУчастника.Вставить("City", ПроверяемыйРеквизитУВХД("Город"));
		ПроверяемыеРеквизитыАдресаУчастника.Вставить("Street", ПроверяемыйРеквизитУВХД("Улица"));
		ПроверяемыеРеквизитыАдресаУчастника.Вставить("PostalCode", ПроверяемыйРеквизитУВХД("Индекс"));
		ПроверяемыеРеквизитыАдресаУчастника.Вставить("Country.__content", ПроверяемыйРеквизитУВХД("Страна"));
		СписокПроверяемыхРеквизитов.Добавить(ПроверяемыеРеквизитыАдресаУчастника);
		
		Для каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизитыАдресаУчастника Цикл
			ДанныеПроверки = ПроверяемыйРеквизит.Значение;
			ЗначениеРеквизита = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(АдресУчастника, ПроверяемыйРеквизит.Ключ, NULL);
			ДанныеПроверки.Заполнен = ЗначениеЗаполнено(ЗначениеРеквизита);
			ДанныеПроверки.Найден = Не (ЗначениеРеквизита = NULL);
		КонецЦикла;
		
	КонецЦикла;
	
	// Анализ заполнения реквизитов и заполнение журнала сообщений
	Для каждого ПроверяемыеРеквизиты Из СписокПроверяемыхРеквизитов Цикл
		Для каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
			ДанныеПроверки = ПроверяемыйРеквизит.Значение;
			Если Не ДанныеПроверки.Найден Тогда
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, СтрШаблон("Не найден обязательный реквизит счета ""%1""", ДанныеПроверки.Синоним), "XM-00051");	
			ИначеЕсли Не ДанныеПроверки.Заполнен Тогда
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналСообщений, СтрШаблон("Не заполнен обязательный реквизит счета ""%1""", ДанныеПроверки.Синоним), "XM-00052");	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверяемыйРеквизитУВХД(Синоним)
	
	Возврат Новый Структура("Синоним, Найден, Заполнен", Синоним, Ложь, Ложь);
	
КонецФункции

Функция ВалютаСчетаУВХД(СведенияОВалюте)
	
	СоответствияКодовВалютыНаименованиям = Новый Соответствие();
	СоответствияКодовВалютыНаименованиям.Вставить("643", "RUB");
	СоответствияКодовВалютыНаименованиям.Вставить("978", "EUR");
	СоответствияКодовВалютыНаименованиям.Вставить("840", "USD");
	
	НаименованиеВалюты = СоответствияКодовВалютыНаименованиям.Получить(СведенияОВалюте.Код);
	Если НаименованиеВалюты = Неопределено Тогда
		НаименованиеВалюты = СведенияОВалюте.Наименование;
	КонецЕсли;
	
	Возврат НаименованиеВалюты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

Процедура ЗаполнитьСведенияОбУчастнике(Приемник, Источник, Адрес, ДанныеФормата, ЖурналЛогирования, ЮридическийАдрес = Истина, ТипУчастникаЭДО = Неопределено)
	
	Перем АдресДляЗаполнения, УчастникЭДО;
	
	Приемник.СтруктПодр = Источник.СтруктурноеПодразделение;
	
	ИдСв = Приемник.ИдСв;
	
	Если Источник.ЭтоЮрЛицо Тогда // Заполнение данных юрлица
		
		Если Источник.Резидент Тогда
			
			СвЮЛУч = ИдСв.СвЮЛУч;
			
			Если Не ЗначениеЗаполнено(Источник.ПолноеНаименование) Тогда
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено наименование юр.лица """ + Источник.Представление + """", "XM-00026", , Источник.Ссылка);
			Иначе
				СвЮЛУч.НаимОрг = Источник.ПолноеНаименование;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Источник.ИНН) Тогда
				ОписаниеОшибкиИНН = "";
				
				Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.ИННСоответствуетТребованиям(Источник.ИНН, Источник.ЭтоЮрЛицо, ОписаниеОшибкиИНН) Тогда
					ОписаниеОшибкиИНН = "Ошибка заполнения ИНН юр.лица """ + Источник.Представление + """. " + ОписаниеОшибкиИНН;
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиИНН, "XM-00027",, Источник.Ссылка);
				Иначе
					СвЮЛУч.ИННЮЛ = Источник.ИНН;
				КонецЕсли;
				
			ИначеЕсли СвЮЛУч.Свойство("ДефИННЮЛ") Тогда // 820 приказ
				СвЮЛУч.ДефИННЮЛ = "-";
			Иначе// 189 приказ
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнен ИНН юр. лица """ + Источник.Представление + """.", "XM-00027", , Источник.Ссылка);
				СвЮЛУч.ИННЮЛ = Неопределено;
			КонецЕсли; 
			
			СвЮЛУч.КПП	= Источник.КПП;
			
		Иначе // Не состоит на налоговом учёте.
			
			ИдСв.СвИнНеУч.НаимОрг = Источник.ПолноеНаименование;
			
		КонецЕсли;
		
	Иначе // физ. лицо
		
		СвИП = ИдСв.СвИП;
		
		Если ЗначениеЗаполнено(Источник.ИНН) Тогда
			
			ОписаниеОшибкиИНН = "";
			
			Если Не ККСНГ_ОбщегоНазначенияКлиентСервер.ИННСоответствуетТребованиям(Источник.ИНН, Источник.ЭтоЮрЛицо, ОписаниеОшибкиИНН) Тогда
				ОписаниеОшибкиИНН = "Ошибка заполнения ИНН физ.лица """ + Источник.Представление + """. "  + ОписаниеОшибкиИНН;
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ОписаниеОшибкиИНН, "XM-00029",, Источник.Ссылка);
			Иначе
				СвИП.ИННФЛ = Источник.ИНН;
			КонецЕсли;
			
		ИначеЕсли СвИП.Свойство("ДефИННФЛ") Тогда // 820 приказ
			СвИП.ДефИННФЛ = "-";
		Иначе// 189 приказ
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнен ИНН физ.лица """ + Источник.Представление + """.", "XM-00029", , Источник.Ссылка);
			СвИП.ИННФЛ = Неопределено;
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(СвИП.ФИО, Источник.ФИО);
		
		СвИП.СвГосРегИП = Источник.СвидетельствоРегистрацииИП;	
		
		// Обязателен только для продавца ИП.
		Если ПустаяСтрока(Источник.СвидетельствоРегистрацииИП) И ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнены данные свидетельства о гос. регистрации организации " + Источник.Представление, "XM-00030",, Источник.Ссылка);
		КонецЕсли;	
		
		Если ПустаяСтрока(СвИП.ФИО.Фамилия) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнена фамилия " + Источник.Представление, "XM-00031",, Источник.Ссылка);
		КонецЕсли;	
		
		Если ПустаяСтрока(СвИП.ФИО.Имя) Тогда
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, "Не заполнено имя " + Источник.Представление, "XM-00032",, Источник.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение общей информации
	Приемник.ОКПО = ?(ЗначениеЗаполнено(Источник.КодПоОКПО), Источник.КодПоОКПО, Неопределено);
	
	АдресОбязателен = (ДанныеФормата.ФункцияУПД <> "ДОП");
	
	// Заполнение адреса
	Если Не ПустаяСтрока(Адрес.КодРегион) И ПроверитьСоответствиеПолейАдресаФормату(Адрес, ДанныеФормата.ПространствоИмен, "АдрРФТип", ЖурналЛогирования) Тогда
		
		АдрРФ = Приемник.Адрес.АдрРФ;
		ЗаполнитьЗначенияСвойств(АдрРФ, Адрес);
		
	ИначеЕсли Не ПустаяСтрока(Адрес.КодСтраны) И Не ПустаяСтрока(Адрес.Представление) Тогда
		
		АдрИнф = Приемник.Адрес.АдрИнф;
		// TODO: В получение данных для БП добавить "альтернативный" метод определения кода страны через ПолучитьКодСтраныАльтернативныйМетод()
		АдрИнф.КодСтр   = Адрес.КодСтраны;
		АдрИнф.АдрТекст = Лев(СокрЛП(Адрес.Представление), 1000); // Максимальное количество символов 1000
		
	ИначеЕсли Не ПустаяСтрока(Адрес.КодГАР) Тогда
		
		Приемник.Адрес.КодГАР = Адрес.КодГАР;
		
	Иначе
		
		Приемник.Адрес = Неопределено;
		
		Если АдресОбязателен Тогда
			
			АдресДляЗаполнения = ?(ЮридическийАдрес = Истина, "юридического", "фактического"); 
			УчастникЭДО = ?(ТипУчастникаЭДО <> Неопределено, ТипУчастникаЭДО, "участника"); 
			
			ТекстОшибки = СтрШаблон("Проверьте заполнение %1 адреса %2 %3", АдресДляЗаполнения, УчастникЭДО, Источник.Представление);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(ЖурналЛогирования, ТекстОшибки, "XM-00033", , Источник.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение контактной информации
	КонтактныеСведения = Приемник.Контакт;
	
	Если ТипЗнч(Источник.Телефоны) = Тип("Массив") И Источник.Телефоны.Количество() > 0 Тогда
		КонтактныеСведения.Тлф = Источник.Телефоны[0];
	КонецЕсли;
	
	Если ТипЗнч(Источник.Телефоны) = Тип("Массив") И Источник.Email.Количество() > 0 Тогда
		КонтактныеСведения.ЭлПочта = Источник.Email[0];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтактныеСведения.Тлф) И Не ЗначениеЗаполнено(КонтактныеСведения.ЭлПочта) Тогда
		КонтактныеСведения = Неопределено;
	КонецЕсли;
	
	// Заполнение банковских реквизитов
	БанковскиеРеквизиты = Приемник.БанкРекв;
	СвБанк = БанковскиеРеквизиты.СвБанк;
	
	Если ЗначениеЗаполнено(Источник.БанковскийСчет.НомерСчета) Тогда
		
		БанковскиеРеквизиты.НомерСчета = Источник.БанковскийСчет.НомерСчета;
		
		Если ЗначениеЗаполнено(Источник.БанковскийСчет.НаименованиеБанка) Тогда
			СвБанк.НаимБанк = Источник.БанковскийСчет.НаименованиеБанка;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Источник.БанковскийСчет.БИК) Тогда
			СвБанк.БИК = Источник.БанковскийСчет.БИК;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Источник.БанковскийСчет.КоррСчет) Тогда
			СвБанк.КорСчет = Источник.БанковскийСчет.КоррСчет;
		КонецЕсли;
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СтруктураПустая(СвБанк) Тогда
			СвБанк = Неопределено;
		КонецЕсли;
		
	Иначе
		БанковскиеРеквизиты = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция КорректностьОКЕИ(ПроверяемыйОКЕИ)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Истина;
	
	ДлинаОКЕИ = СтрДлина(ПроверяемыйОКЕИ);
	Если ДлинаОКЕИ <> 3 И ДлинаОКЕИ <> 4 Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, НСтр("ru = 'Код по ОКЕИ должен состоять либо из 3, либо из 4 цифр.'"), "XM-00035");
		Ответ.Успех = Ложь;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // КорректностьОКЕИ()

#КонецОбласти

#Область ОбработчикиФормированияЭД

Функция ПолучитьОбработчикФормированияЭД(ПрофильОрганизации, ИмяОбработчика = "")
	
	ОбработчикЭДСсылка = ПрофильОрганизации.ПодключаемыйМодуль;
	
	Если Не ПустаяСтрока(ИмяОбработчика) И ИмяОбработчика = "ОбработчикПослеФормированияЭД" Тогда
		Если Не ПрофильОрганизации.ОбработчикПослеФормированияЭД.Пустая() Тогда
			ОбработчикЭДСсылка = ПрофильОрганизации.ОбработчикПослеФормированияЭД;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбработчикЭДСсылка) Тогда
		ОбработчикЭД = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбработчикЭДСсылка);
	КонецЕсли;
	
	Возврат ОбработчикЭД;
	
КонецФункции

Функция ВыполнитьОбработчикПередФормированием(ДанныеДокумента, ДанныеФормата, СтандартнаяОбработка)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Истина;
	
	Попытка
		ОбработчикЭД = ПолучитьОбработчикФормированияЭД(ДанныеДокумента.ПрофильОрганизации);
	Исключение
		
		ОписаниеОшибки = "Ошибка получения клиентского обработчика перед формированием XML. " + ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, "XM-00053");
		Ответ.Успех = Ложь;
		
		Возврат Ответ;
		
	КонецПопытки;
	
	Если Не ОбработчикЭД = Неопределено Тогда
		
		Отказ = Ложь;
		ОписаниеОшибки = "";
		
		Попытка
			
			ДанныеДокументаОбработчик = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеДокумента);
			ДанныеФорматаОбработчик = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеФормата);
			
			РезультатОбработки = ОбработчикЭД.ВыполнитьАлгоритмПередФормированием(ДанныеДокументаОбработчик, ДанныеФорматаОбработчик, СтандартнаяОбработка, Отказ, ОписаниеОшибки);
			
			Если Не ТипЗнч(Отказ) = Тип("Булево") Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Некорректный тип значения в параметре ""Отказ"".";
			КонецЕсли;
			
			Если Не ТипЗнч(СтандартнаяОбработка) = Тип("Булево") Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Некорректный тип значения в параметре ""СтандартнаяОбработка"".";
			КонецЕсли;
			
			Если Отказ Тогда
				ТекстОшибки = "Ошибка выполнения клиентского обработчика перед формированием XML. " + Строка(ОписаниеОшибки);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00050");
			ИначеЕсли СтандартнаяОбработка Тогда
				
				Если ТипЗнч(РезультатОбработки) = Тип("Структура") Или РезультатОбработки = Неопределено Тогда
					Ответ.Результат = РезультатОбработки;
				Иначе
					Отказ = Истина;
					ТекстОшибки = "Ошибка выполнения клиентского обработчика перед формированием XML. Тип выходного параметра ""ДанныеДокумента"" не соответствует ожидаемому - ""Структура"".";
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00051");
				КонецЕсли;
				
			Иначе
				
				// TODO сделать валидацию XML ???
				Если ТипЗнч(РезультатОбработки) = Тип("Строка") И Не ПустаяСтрока(РезультатОбработки) Тогда
					Ответ.Результат = РезультатОбработки;
				Иначе
					Отказ = Истина;
					ТекстОшибки = "Ошибка выполнения клиентского обработчика перед формированием XML. Ошибка выходного параметра - ожидается сформированный текст XML.";
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00051");
				КонецЕсли;
				
			КонецЕсли;
			
			Ответ.Успех = Не Отказ;
			
		Исключение
			Ответ.Успех = Ложь;
			ТекстОшибки = "Ошибка выполнения клиентского обработчика перед формированием XML. " + ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00052");
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ВыполнитьОбработчикПослеФормирования(СтруктураДокумента, ДанныеДокумента, ДанныеФормата)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	Ответ.Успех = Истина;
	
	Попытка
		ОбработчикЭД = ПолучитьОбработчикФормированияЭД(ДанныеДокумента.ПрофильОрганизации, "ОбработчикПослеФормированияЭД");
	Исключение
		
		ОписаниеОшибки = "Ошибка получения клиентского обработчика после формирования XML. " + ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки, "XM-00053");
		Ответ.Успех = Ложь;
		
		Возврат Ответ;
		
	КонецПопытки;
	
	Если Не ОбработчикЭД = Неопределено Тогда
		
		Отказ = Ложь;
		ОписаниеОшибки = "";
		
		Попытка
			
			СтруктураДокументаОбработчик = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураДокумента);
			ДанныеДокументаОбработчик = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеДокумента);
			ДанныеФорматаОбработчик = ККСНГ_ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеФормата);
			
			РезультатОбработки = ОбработчикЭД.ВыполнитьАлгоритмПослеФормирования(СтруктураДокументаОбработчик, ДанныеДокументаОбработчик, ДанныеФорматаОбработчик, Отказ, ОписаниеОшибки);
			
			Если Не ТипЗнч(Отказ) = Тип("Булево") Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Некорректный тип значения в параметре ""Отказ"".";
			КонецЕсли;
			
			Если Отказ Тогда
				ТекстОшибки = "Ошибка выполнения клиентского обработчика после формированием XML. " + Строка(ОписаниеОшибки);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00050");
			ИначеЕсли ТипЗнч(РезультатОбработки) = Тип("Структура") Или РезультатОбработки = Неопределено Тогда
				Ответ.Результат = РезультатОбработки;
			Иначе // Ошибка выходного параметра
				Отказ = Истина;
				ТекстОшибки = "Ошибка выполнения клиентского обработчика после формирования XML. Тип выходного параметра не соответствует ожидаемому - ""Структура"".";
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00053");
			КонецЕсли;
			
			Ответ.Успех = НЕ Отказ;
			
		Исключение
			Ответ.Успех = Ложь;
			ТекстОшибки = "Ошибка выполнения клиентского обработчика после формирования XML. " + ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "XM-00054");
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти
