
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ККСНГ_ПодключаемыеМодулиКлиент.РаботаСПодключаемымиМодулямиДоступна() Тогда
		
		ОткрытьФорму("РегистрСведений.ККСНГ_СвязанныеДокументы.ФормаСписка", 
						, 
						ПараметрыВыполненияКоманды.Источник, 
						ПараметрыВыполненияКоманды.Уникальность, 
						ПараметрыВыполненияКоманды.Окно, 
						ПараметрыВыполненияКоманды.НавигационнаяСсылка);
						
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
