#Область ПрограммныйИнтерфейс

#Область МиграцияДоверенностиИзНастроекВСправочник

// Миграция настроек машиночитаемых доверенностей из регистра в справочник
//
Процедура ПеренестиМашиночитаемыеДоверенностиИзНастроекВСправочник() Экспорт
	
	Перем Ответ;
	Перем Доверенность, ДоверенностьОбъект, ДоверенностьСсылка, ЗаполнениеДоверенности;
	Перем ИдентификаторНастройки, Комментарий, МенеджерЗаписи, НастройкиМЧД, НастройкиМЧДПоОрганизации;
	Перем НоваяСтрока, ОрганизацияЭДО, ПараметрыОтбора, СписокДоверенностей;
	Перем СтрокаКУдалению, СтрокаНастроек, СтрокиКУдалению, СтрокиНастроек;
	Перем ОписаниеТипов, СертификатСсылка, СвойстваСертификата;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ИдентификаторНастройки = РегистрыСведений.ККСНГ_Настройки.УИД_НастройкаМЧД();
	НастройкиМЧД = РегистрыСведений.ККСНГ_Настройки.ПолучитьЗначение(ИдентификаторНастройки);
	
	Если НастройкиМЧД.Успех И ТипЗнч(НастройкиМЧД.Результат) = Тип("Соответствие") Тогда
		
		Для каждого НастройкиМЧДПоОрганизации Из НастройкиМЧД.Результат Цикл
			
			ОрганизацияЭДО = НастройкиМЧДПоОрганизации.Ключ;
			Если ТипЗнч(ОрганизацияЭДО) <> Тип("СправочникСсылка.ККСНГ_Организации") Или ОрганизацияЭДО.ПолучитьОбъект() = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СписокДоверенностей = НастройкиМЧДПоОрганизации.Значение;
			Если ТипЗнч(СписокДоверенностей) <> Тип("ТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			
			// Пропускаем доверенности с истекшим сроком
			СтрокиКУдалению = Новый Массив;
			Для каждого Доверенность Из СписокДоверенностей Цикл
				Если ПустаяСтрока(Доверенность.НомерДоверенности) Или Доверенность.ДатаОкончания < ТекущаяДатаСеанса() Тогда
					СтрокиКУдалению.Добавить(Доверенность);
				КонецЕсли;
			КонецЦикла;
			Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
				СписокДоверенностей.Удалить(СтрокаКУдалению);
			КонецЦикла;
			
			// Сортируем МЧД, чтобы с файлами оказались на первом месте
			ОписаниеТипов = Новый ОписаниеТипов("Булево");
			СписокДоверенностей.Колонки.Добавить("ЕстьФайлДоверенности", ОписаниеТипов);
			СписокДоверенностей.Колонки.Добавить("ЕстьФайлПодписи", ОписаниеТипов);
			
			Для каждого Доверенность Из СписокДоверенностей Цикл
				Если ТипЗнч(Доверенность.ДанныеФайлаДоверенности) = Тип("ДвоичныеДанные") Тогда
					Доверенность.ЕстьФайлДоверенности = Истина;
				КонецЕсли;
				Если ТипЗнч(Доверенность.ДанныеФайлаПодписи) = Тип("ДвоичныеДанные") Тогда
					Доверенность.ЕстьФайлПодписи = Истина;
				КонецЕсли;
			КонецЦикла;
			
			СписокДоверенностей.Сортировать("ЕстьФайлДоверенности Убыв, ЕстьФайлПодписи Убыв");
			
			Для каждого Доверенность Из СписокДоверенностей Цикл
				
				// Пропускаем уже созданные доверенности
				ДоверенностьСсылка = Справочники.ККСНГ_МашиночитаемыеДоверенности.НайтиПоКоду(Доверенность.НомерДоверенности, , , ОрганизацияЭДО);
				Если ЗначениеЗаполнено(ДоверенностьСсылка) Тогда
					Продолжить;
				КонецЕсли;
				
				// Читаем доверенность
				Если Доверенность.ЕстьФайлДоверенности Тогда
					
					// Парсим доверенность
					ЗаполнениеДоверенности = ККСНГ_МашиночитаемыеДоверенности.ПолучитьСведенияОДоверенностиИПодписи(Доверенность.ДанныеФайлаДоверенности);
					ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаполнениеДоверенности.Журнал);
					
					Если Не ЗаполнениеДоверенности.Успех Тогда
						Продолжить;
					КонецЕсли;
					
					ДоверенностьОбъект = ЗаполнениеДоверенности.Результат;
					
					Если Доверенность.ЕстьФайлПодписи Тогда
						ДоверенностьОбъект.ФайлПодписи = Новый ХранилищеЗначения(Доверенность.ДанныеФайлаПодписи, Новый СжатиеДанных(9));
						ДоверенностьОбъект.ЕстьФайлПодписи = Истина;
					КонецЕсли;
					
				Иначе // Доверенность добавлена вручную
					
					ДоверенностьОбъект = Справочники.ККСНГ_МашиночитаемыеДоверенности.СоздатьЭлемент();
					ДоверенностьОбъект.Код = Доверенность["НомерДоверенности"];
					ДоверенностьОбъект.ДатаНачала = Доверенность["ДатаВыдачи"];
					ДоверенностьОбъект.ДатаОкончания = Доверенность["ДатаОкончания"];
					ДоверенностьОбъект.ИнформационнаяСистема = Доверенность["СведенияОбИнформационнойСистеме"];
					
				КонецЕсли;
				
				ДоверенностьОбъект.Владелец = ОрганизацияЭДО;
				
				// Найдем все сертификаты по номеру доверенности и заполним у текущей
				ПараметрыОтбора = Новый Структура("НомерДоверенности", Доверенность.НомерДоверенности);
				СтрокиНастроек = СписокДоверенностей.НайтиСтроки(ПараметрыОтбора);
				Для каждого СтрокаНастроек Из СтрокиНастроек Цикл
					
					НоваяСтрока = ДоверенностьОбъект.Сертификаты.Добавить();
					НоваяСтрока.Отпечаток = СтрокаНастроек.Отпечаток;
					НоваяСтрока.Наименование = СтрокаНастроек.Наименование;
					
					СертификатСсылка = СтрокаНастроек.СертификатЭП;
					Если ТипЗнч(СертификатСсылка) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") И Не СертификатСсылка.Пустая() Тогда
						
						ДвоичныеДанныеСертификата = СертификатСсылка.ДанныеСертификата.Получить();
						СертификатКриптографии = Новый СертификатКриптографии(ДвоичныеДанныеСертификата);
						СвойстваСертификата = ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПолучитьСвойстваСертификата(СертификатКриптографии);
						
						НоваяСтрока.Наименование = СвойстваСертификата.ОбщееИмя;
						НоваяСтрока.Сертификат = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеВСтрокуXML(СертификатСсылка);
						
					КонецЕсли;
					
				КонецЦикла;
				
				// Записываем доверенность
				Попытка
					ДоверенностьОбъект.Записать();
				Исключение
					Комментарий = ОписаниеОшибки();
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка записи машиночитаемой доверенности", "MCHD-00001", Комментарий);
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Обновляем иерархию по всем доверенностям
		ККСНГ_МашиночитаемыеДоверенности.ОбновитьИерархиюДоверенностей();
		
	КонецЕсли;
	
	Попытка
		
		// Удаление старой настройки
		МенеджерЗаписи = РегистрыСведений.ККСНГ_Настройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = ИдентификаторНастройки;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
	Исключение
		Комментарий = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка удаления настройки МЧД", "MCHD-00002", Комментарий);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьСтруктуруДанныхМЧД() Экспорт
	
	Перем Результат;
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Номер", "");
	Результат.Вставить("ДатаНачала", '00010101');
	Результат.Вставить("ИННДоверителя", "");
	Результат.Вставить("ИННПредставителя", "");
	Результат.Вставить("ИнформационнаяСистема", "");
	Результат.Вставить("ИмяФайлаДоверенности", "");
	Результат.Вставить("ФайлДоверенности", "");
	Результат.Вставить("ФайлПодписи", "");
	Результат.Вставить("ЕстьФайлДоверенности", Ложь);
	Результат.Вставить("ЕстьФайлПодписи", Ложь);
	Результат.Вставить("Цепочка", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

// Возвращает доступные варианты отправки доверенности
// 
// Возвращаемое значение:
//  СписокЗначений - доступные варианты
//
Функция ДоступныеВариантыОтправкиДоверенности() Экспорт
	
	Перем Результат;
	
	Результат = Новый СписокЗначений;
	Результат.Добавить("НеОтправлять", "Не отправлять");
	Результат.Добавить("Метаданные", "Номер доверенности и сведения об инф. системе");
	Результат.Добавить("Пакет", "Файлы доверенности и подписи");
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат проверки на необходимость наличия доверенности на подпись.
//
// Параметры:
//  ОрганизацияЭДО		 - СправочникСсылка.ККСНГ_Организации	 - ОрганизацияЭДО
//  СвойстваСертификата	 - Структура							 - см. ККСНГ_ЭлектроннаяПодписьКлиентСервер.ПолучитьСвойстваСертификата()
// 
// Возвращаемое значение:
//  Булево - Истина, если для подписи требуется МЧД
//
Функция ТребуетсяМашиночитаемаяДоверенность(ОрганизацияЭДО, СвойстваСертификата) Экспорт
	
	Перем Результат, ЗапросДанныхОрганизации;
	Перем ИНН, ОГРНИП, ОГРН;
	
	// МЧД по умолчанию требуется
	Результат = Истина;
	
	ИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСертификата, "ИНН");
	ОГРНИП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСертификата, "ОГРНИП");
	ОГРН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваСертификата, "ОГРН");
	
	Если ЗначениеЗаполнено(ОГРНИП) Или ЗначениеЗаполнено(ОГРН) Тогда
		// МЧД не требуется для сертификата ЮЛ или ИП
		Результат = Ложь;
	Иначе
		ЗапросДанныхОрганизации = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДанныеПоОрганизации(ОрганизацияЭДО.Организация);
		Если ЗапросДанныхОрганизации.Успех Тогда
			// МЧД не требуется для сертификата физ. лица самого ИП
			Результат = ИНН <> ЗапросДанныхОрганизации.Результат.ИНН;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает настроенный для контрагента вариант отправки МЧД
//  Если настройка у контрагента отсутсвует, возвращается настройка организации-владельца
//
// Параметры:
//  КонтрагентЭДО	 - СправочникСсылка.ККСНГ_Контрагенты, СправочникСсылка.ККСНГ_Организации	 - контрагент или организация ЭДО, для которого необходимо получить вариант отправки МЧД
// 
// Возвращаемое значение:
//  Строка - Настроенный вариант отправки
//
Функция ПолучитьВариантОтправкиДоверенности(КонтрагентЭДО) Экспорт
	
	Перем ВариантОтправкиМЧД, ДоступныеВарианты;
	
	Результат = "Метаданные";
	ДоступныеВарианты = ДоступныеВариантыОтправкиДоверенности();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_Контрагенты.ВариантОтправкиМЧД КАК ВариантОтправкиМЧД
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|ГДЕ
	|	ККСНГ_Контрагенты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ККСНГ_Организации.ВариантОтправкиМЧД
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты КАК ККСНГ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ПО ККСНГ_Контрагенты.Владелец = ККСНГ_Организации.Ссылка
	|ГДЕ
	|	ККСНГ_Контрагенты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ККСНГ_Организации.ВариантОтправкиМЧД
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|ГДЕ
	|	ККСНГ_Организации.Ссылка = &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", КонтрагентЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ДоступныеВарианты.НайтиПоЗначению(Выборка.ВариантОтправкиМЧД) <> Неопределено Тогда
			Результат = Выборка.ВариантОтправкиМЧД;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Обновляет родителей подчиненной доверенности
//
// Параметры:
//  ОбъектМЧД	 - СправочникОбъект.ККСНГ_МашиночитаемыеДоверенности - Объект справочника
// 
// Возвращаемое значение:
//  МассивДоверенностей - Массив
//
Процедура ОбновитьИерархиюДоверенностей(ОрганизацияЭДО = Неопределено) Экспорт
	
	Перем ТекстЗапроса, Запрос, Выборка;
	Перем БлокировкаДанных, ЭлементБлокировки, ОбъектДоверенности;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЧД.Ссылка КАК Ссылка,
	|	МЧД.Родитель КАК Родитель,
	|	ЕСТЬNULL(РодительскиеМЧД.Ссылка, ЕСТЬNULL(КорневыеМЧД.Ссылка, МЧД.Родитель)) КАК НовыйРодитель
	|ИЗ
	|	Справочник.ККСНГ_МашиночитаемыеДоверенности КАК МЧД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_МашиночитаемыеДоверенности КАК РодительскиеМЧД
	|		ПО (МЧД.Владелец = РодительскиеМЧД.Владелец)
	|			И (МЧД.НомерДоверенностиОснования = РодительскиеМЧД.Код)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_МашиночитаемыеДоверенности КАК КорневыеМЧД
	|		ПО (МЧД.Владелец = КорневыеМЧД.Владелец)
	|			И (МЧД.НомерПервоначальнойДоверенности = КорневыеМЧД.Код)
	|ГДЕ
	|	(&Владелец = Неопределено Или МЧД.Владелец = &Владелец)
	|	И МЧД.Родитель <> ЕСТЬNULL(РодительскиеМЧД.Ссылка, ЕСТЬNULL(КорневыеМЧД.Ссылка, МЧД.Родитель))";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", ОрганизацияЭДО);
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.ККСНГ_МашиночитаемыеДоверенности");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектДоверенности = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектДоверенности.Родитель = Выборка.НовыйРодитель;
			ОбъектДоверенности.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// Получает действующую доверенность по организации и отпечатку сертификата согласно варианту отправки
//
// Параметры:
//  ОрганизацияЭДО	 - СправочникСсылка.ККСНГ_Организации - организация для получения МЧД
//  ДанныеСертификата	 - Структура - данные сертификата электронной подписи
//  ВариантОтправки		 - Строка - вариант отправки МЧД (НеОтправлять, Метаданные, Пакет)
// 
// Возвращаемое значение:
// Ссылка - СправочникСсылка.ККСНГ_МашиночитаемыеДоверенности - действующая доверенность
//
Функция ПолучитьДействующуюДоверенность(ОрганизацияЭДО, ОтпечатокСертификата, ПроверятьНаличиеФайлов = Ложь) Экспорт
	
	Перем Ответ, Выборка, ТекстЗапроса, Запрос;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Поиск актуальной машиночитаемой доверенности");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ККСНГ_МашиночитаемыеДоверенности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_МашиночитаемыеДоверенности КАК ККСНГ_МашиночитаемыеДоверенности
	|ГДЕ
	|	ККСНГ_МашиночитаемыеДоверенности.Владелец = &ОрганизацияЭДО
	|	И ККСНГ_МашиночитаемыеДоверенности.Сертификаты.Отпечаток = &ОтпечатокСертификата
	|	И ККСНГ_МашиночитаемыеДоверенности.ПометкаУдаления = ЛОЖЬ
	|	И ККСНГ_МашиночитаемыеДоверенности.ДатаНачала <= &ТекущаяДата
	|	И ККСНГ_МашиночитаемыеДоверенности.ДатаОкончания >= &ТекущаяДата
	|	И ВЫБОР
	|			КОГДА &ПроверятьНаличиеФайлов
	|				ТОГДА ККСНГ_МашиночитаемыеДоверенности.ЕстьФайлДоверенности
	|						И ККСНГ_МашиночитаемыеДоверенности.ЕстьФайлПодписи
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ККСНГ_МашиночитаемыеДоверенности.ДатаНачала УБЫВ";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОрганизацияЭДО", ОрганизацияЭДО);
	Запрос.УстановитьПараметр("ОтпечатокСертификата", ОтпечатокСертификата);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПроверятьНаличиеФайлов", ПроверятьНаличиеФайлов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ.Результат = Выборка.Ссылка;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Получает данные доверенности по ссылке на справочник
//
// Параметры:
//  Доверенность - СправочникСсылка.ККСНГ_МашиночитаемыеДоверенности - машиночитаемая доверенность
// 
// Возвращаемое значение:
//  Структура - см. ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьДанныеДоверенностиПоСсылке(Доверенность) Экспорт
	
	Перем Ответ;
	Перем ТекстЗапроса, Запрос, Выборка;
	Перем Результат, ЗапросДанныхДоверенности, ДанныеРодительскойДоверенности, ДоверенностьЦепочки;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Заполнение данных доверенности для отправки");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ККСНГ_МашиночитаемыеДоверенности.Ссылка КАК Ссылка,
	|	ККСНГ_МашиночитаемыеДоверенности.Родитель КАК Родитель,
	|	ККСНГ_МашиночитаемыеДоверенности.Владелец КАК ОрганизацияЭДО,
	|	ККСНГ_МашиночитаемыеДоверенности.Код КАК Номер,
	|	ККСНГ_МашиночитаемыеДоверенности.ДатаНачала КАК ДатаНачала,
	|	ККСНГ_МашиночитаемыеДоверенности.ИННДоверителя КАК ИННДоверителя,
	|	ККСНГ_МашиночитаемыеДоверенности.ИнформационнаяСистема КАК ИнформационнаяСистема,
	|	ККСНГ_МашиночитаемыеДоверенности.ИмяФайлаДоверенности КАК ИмяФайлаДоверенности,
	|	ККСНГ_МашиночитаемыеДоверенности.ЕстьФайлДоверенности КАК ЕстьФайлДоверенности,
	|	ККСНГ_МашиночитаемыеДоверенности.ЕстьФайлПодписи КАК ЕстьФайлПодписи,
	|	ККСНГ_МашиночитаемыеДоверенности.ФайлДоверенности КАК ХранилищеФайлаДоверенности,
	|	ККСНГ_МашиночитаемыеДоверенности.ФайлПодписи КАК ХранилищеФайлаПодписи,
	|	ККСНГ_МашиночитаемыеДоверенностиПредставители.ИНН КАК ИННПредставителя
	|ИЗ
	|	Справочник.ККСНГ_МашиночитаемыеДоверенности КАК ККСНГ_МашиночитаемыеДоверенности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_МашиночитаемыеДоверенности.Представители КАК ККСНГ_МашиночитаемыеДоверенностиПредставители
	|		ПО (ККСНГ_МашиночитаемыеДоверенностиПредставители.Ссылка = ККСНГ_МашиночитаемыеДоверенности.Ссылка)
	|ГДЕ
	|	ККСНГ_МашиночитаемыеДоверенности.Ссылка = &Доверенность";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Доверенность", Доверенность);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не найдена машиночитаемая доверенность", "MCHD-000023", , Доверенность);
		Возврат Ответ;
	КонецЕсли;
	
	Результат = ПолучитьСтруктуруДанныхМЧД();
	
	// Заполняем основные реквизиты доверенности
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	// Заполняем данные файлов доверенности и подписи, если они есть
	Если Выборка.ЕстьФайлДоверенности Тогда
		Результат.ФайлДоверенности = Выборка.ХранилищеФайлаДоверенности.Получить();
	КонецЕсли;
	Если Выборка.ЕстьФайлПодписи Тогда
		Результат.ФайлПодписи = Выборка.ХранилищеФайлаПодписи.Получить();
	КонецЕсли;
	
	// Заполняем цепочку доверенностей при передоверии
	Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
		
		ЗапросДанныхДоверенности = ПолучитьДанныеДоверенностиПоСсылке(Выборка.Родитель);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныхДоверенности.Журнал);
		
		Если ЗапросДанныхДоверенности.Успех Тогда
			
			ДанныеРодительскойДоверенности = ЗапросДанныхДоверенности.Результат;
			
			// Добавляем родительскую доверенность в цепочку
			Результат.Цепочка.Добавить(ДанныеРодительскойДоверенности);
			
			// Копируем цепочку родительской доверенности
			Для каждого ДоверенностьЦепочки Из ДанныеРодительскойДоверенности.Цепочка Цикл
				Результат.Цепочка.Добавить(ДоверенностьЦепочки);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.Результат = Результат;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЧтениеДанных

Функция ПолучитьСведенияОДоверенностиИПодписи(ДвоичныеДанные) Экспорт
	
	Перем Ответ;
	Перем ЗапросДанных, ЗапросФайлов, СодержимоеФайлов;
	Перем ОбъектДоверенность;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросФайлов = ПолучитьФайлыДоверенностиИПодписи(ДвоичныеДанные);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросФайлов.Журнал);
	
	Если Не ЗапросФайлов.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	СодержимоеФайлов = ЗапросФайлов.Результат;
	
	// Чтение данных доверенности из двоичных данных
	ЗапросДанных = ПрочитатьДоверенность(СодержимоеФайлов.ФайлДоверенности);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанных.Журнал);
	
	Если Не ЗапросДанных.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ОбъектДоверенность = ЗапросДанных.Результат;
	
	Если ТипЗнч(СодержимоеФайлов.ФайлДоверенности) = Тип("ДвоичныеДанные") Тогда 
		ОбъектДоверенность.ФайлДоверенности = Новый ХранилищеЗначения(СодержимоеФайлов.ФайлДоверенности, Новый СжатиеДанных(9));
		ОбъектДоверенность.ЕстьФайлДоверенности = Истина;
	КонецЕсли;
	
	Если ТипЗнч(СодержимоеФайлов.ФайлПодписи) = Тип("ДвоичныеДанные") Тогда
		ОбъектДоверенность.ФайлПодписи = Новый ХранилищеЗначения(СодержимоеФайлов.ФайлПодписи, Новый СжатиеДанных(9));
		ОбъектДоверенность.ЕстьФайлПодписи = Истина;
	КонецЕсли;
	
	Ответ.Результат = ОбъектДоверенность;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

// Заполняет общую структуру данных МЧД
//
// Параметры:
//  Содержимое	 - Строка	 - Адрес временного хранилища
// 
// Возвращаемое значение:
//  Структура - Готовая структура данных МЧД с файлами подписи и доверенности
//
Функция ПолучитьФайлыДоверенностиИПодписи(ДвоичныеДанные) Экспорт
	
	Перем Ответ, Результат;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если ККСНГ_ОбщегоНазначения.ЭтоZipАрхив(ДвоичныеДанные) Тогда
		Ответ = ПрочитатьZipАрхивДоверенности(ДвоичныеДанные);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("ФайлДоверенности", ДвоичныеДанные);
		Результат.Вставить("ФайлПодписи", Неопределено);
		
		Ответ.Результат = Результат;
		Ответ.Успех = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеДанных

Функция ПрочитатьZipАрхивДоверенности(ДвоичныеДанные)
	
	Перем Ответ;
	Перем РасширенияФайлов, ИзвлечениеФайлов, НаборыФайлов;
	Перем ФайлыДоверенностей, ФайлДоверенности, ФайлыПодписей, ФайлПодписи;
	Перем Результат;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	РасширенияФайлов = Новый Массив;
	РасширенияФайлов.Добавить("xml");
	РасширенияФайлов.Добавить("p7s, sig, sign, sgn");
	
	// Извлечение файлов из архива по заданному набору расширений
	ИзвлечениеФайлов = ККСНГ_ОбщегоНазначения.ИзвлечьФайлыИзZipАрхива(ДвоичныеДанные, РасширенияФайлов);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ИзвлечениеФайлов.Журнал);
	
	Если Не ИзвлечениеФайлов.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	НаборыФайлов = ИзвлечениеФайлов.Результат;
	
	ФайлыДоверенностей = НаборыФайлов[0];
	ФайлыПодписей = НаборыФайлов[1];
	
	// Получение двоичных данных файла доверенности
	Если ФайлыДоверенностей.Количество() = 1 Тогда // В архиве один файл XML
		ФайлДоверенности = ФайлыДоверенностей[0];
	ИначеЕсли ФайлыДоверенностей.Количество() = 0 Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "В архиве не найден XML-файл доверенности", "MCHD-00006");
		Возврат Ответ;
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "В архиве найдено несколько XML-файлов доверенности", "MCHD-00007");
		Возврат Ответ;
	КонецЕсли;
	
	// Получение двоичных данных файла подписи
	Если ФайлыПодписей.Количество() = 1 Тогда // В архиве одина подпись
		
		Если ЗначениеЗаполнено(ФайлыПодписей[0]) Тогда
			ФайлПодписи = ФайлыПодписей[0];
		КонецЕсли;
		
	ИначеЕсли ФайлыПодписей.Количество() = 0 Тогда
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "В архиве не найден файл подписи");
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "В архиве найдено несколько файлов подписи", "MCHD-00008");
		Возврат Ответ;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ФайлДоверенности", ФайлДоверенности);
	Результат.Вставить("ФайлПодписи", ФайлПодписи);
	
	Ответ.Результат = Результат;
	Ответ.Успех = Истина;
	
	Возврат Ответ;
	
КонецФункции

Функция ПрочитатьДоверенность(Содержимое)
	
	Перем Ответ;
	Перем СодержимоеМЧД, ДокументDOM, Комментарий, ТекстСообщения;
	Перем ЗапросПараметровЧтенияМЧД, ПараметрыЧтенияМЧД, ТекстXML;
	Перем ФабрикаXDTO, ТипXDTO, ОбъектXDTO, ЗаполнениеДоверенности;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	// Проверка входных параметров
	Если ТипЗнч(Содержимое) = Тип("Строка") И ЭтоАдресВременногоХранилища(Содержимое) Тогда
		СодержимоеМЧД = ПолучитьИзВременногоХранилища(Содержимое);
	Иначе
		СодержимоеМЧД = Содержимое;
	КонецЕсли;
	
	Если ТипЗнч(СодержимоеМЧД) <> Тип("ДвоичныеДанные") Тогда
		ТекстСообщения = "Неверный тип значения параметра Содержимое";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "MCHD-00001");
		Возврат Ответ;
	КонецЕсли;
	
	// Чтение текста XML доверенности в ДокументDOM
	Попытка
		ДокументDOM = ККСНГ_ОбщегоНазначения.ПолучитьДокументDOMПоXML(СодержимоеМЧД);
	Исключение
		
		Комментарий = ОписаниеОшибки();
		ТекстСообщения = "Не удалось прочитать текст XML доверенности";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "MCHD-00011", Комментарий);
		Возврат Ответ;
		
	КонецПопытки;
	
	// Определяем версию формата доверенности
	ЗапросПараметровЧтенияМЧД = ОпределитьПараметрыЧтенияДоверенности(ДокументDOM);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПараметровЧтенияМЧД.Журнал);
	
	Если Не ЗапросПараметровЧтенияМЧД.Успех Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ПараметрыЧтенияМЧД = ЗапросПараметровЧтенияМЧД.Результат;
	
	// Получаем текст XML доверенности с установленным пространством имен
	ТекстXML = ККСНГ_ОбщегоНазначения.ЗаполнитьПространствоИменИПолучитьXML(ДокументDOM, ПараметрыЧтенияМЧД.ПространствоИмен);
	
	// Создаем фабрику XDTO для чтения доверенности
	ФабрикаXDTO = ККСНГ_ОбщегоНазначения.СоздатьФабрикуXDTOПоОбщемуМакету(ПараметрыЧтенияМЧД.ИмяОбщегоМакета);
	ТипXDTO = ККСНГ_ОбщегоНазначения.ПолучитьТипXDTOКорневогоСвойства(ФабрикаXDTO, ПараметрыЧтенияМЧД.ПространствоИмен, ПараметрыЧтенияМЧД.ИмяКорневогоЭлемента);
	
	// Чтение доверенности в объект XDTO
	Попытка
		ОбъектXDTO = ККСНГ_ОбщегоНазначения.ПолучитьОбъектXDTOПоXML(ТекстXML, ТипXDTO, ФабрикаXDTO);
	Исключение
		
		Комментарий = ОписаниеОшибки();
		ТекстСообщения = "Не удалось прочитать текст XML доверенности";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "MCHD-00012", Комментарий);
		Возврат Ответ;
		
	КонецПопытки;
	
	ЗаполнениеДоверенности = ЗаполнитьДоверенностьПоОбъектуXDTO(ОбъектXDTO);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаполнениеДоверенности.Журнал);
	
	Ответ.Результат = ЗаполнениеДоверенности.Результат;
	Ответ.Успех = ЗаполнениеДоверенности.Успех;
	
	Возврат Ответ;
	
КонецФункции

Функция ОпределитьПараметрыЧтенияДоверенности(ДокументDOM)
	
	Перем Ответ;
	Перем Результат, ВерсияФормата, ТекстСообщения;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Результат = Новый Структура;
	Результат.Вставить("ВерсияФормата", "");
	Результат.Вставить("ИмяКорневогоЭлемента", "");
	Результат.Вставить("ИмяОбщегоМакета", "");
	Результат.Вставить("ПространствоИмен", "");
	
	ВерсияФормата = ДокументDOM.ЭлементДокумента.ПолучитьАтрибут("ВерсФорм");
	
	Если ТипЗнч(ВерсияФормата) = Тип("Строка") Тогда
		
		Если СтрСравнить(ВерсияФормата, "001") = 0 Тогда
			
			Результат.ИмяОбщегоМакета = "ККСНГ_XSD_МЧД_001";
			Результат.ПространствоИмен = "ON_DOVBB_1_928_00_01_01_01";
			
		ИначеЕсли СтрСравнить(ВерсияФормата, "002") = 0 Тогда
			
			Результат.ИмяОбщегоМакета = "ККСНГ_XSD_МЧД_002";
			Результат.ПространствоИмен = "ON_DOVBB_1_928_00_01_02_01";
			
		ИначеЕсли СтрСравнить(ВерсияФормата, "EMCHD_1") = 0 Тогда
			
			Результат.ИмяОбщегоМакета = "ККСНГ_XSD_МЧД_003";
			Результат.ПространствоИмен = "urn://x-artefacts/EMCHD_1";
			
		Иначе
			
			ТекстСообщения = СтрШаблон("Неизвестная версия формата МЧД: %1", ВерсияФормата);
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "MCHD-00003");
			Возврат Ответ;
			
		КонецЕсли;
		
		Результат.ВерсияФормата = ВерсияФормата;
		Результат.ИмяКорневогоЭлемента = ДокументDOM.ЭлементДокумента.ИмяЭлемента;
		
		Ответ.Результат = Результат;
		Ответ.Успех = Истина;
		
	Иначе
		
		ТекстСообщения = "Не удалось получить версию формата МЧД из файла";
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстСообщения, "MCHD-00004");
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗаполнитьДоверенностьПоОбъектуXDTO(ОбъектXDTO)
	
	Перем Ответ;
	Перем Доверенность, ВерсияФормата, Комментарий;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Доверенность = ККСНГ_ОбщегоНазначения.ПолучитьСтруктуруПоОбъектуXDTO(ОбъектXDTO);
	ВерсияФормата = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверенность, "ВерсФорм");
	
	Если СтрСравнить(ВерсияФормата, "001") = 0 Тогда
		
		Ответ.Результат = ЗаполнитьДоверенностьПоXML_001(Доверенность);
		Ответ.Успех = Истина;
		
	ИначеЕсли СтрСравнить(ВерсияФормата, "002") = 0 Тогда
		
		Ответ.Результат = ЗаполнитьДоверенностьПоXML_002(Доверенность);
		Ответ.Успех = Истина;
		
	ИначеЕсли СтрСравнить(ВерсияФормата, "EMCHD_1") = 0 Тогда
		
		Ответ.Результат = ЗаполнитьДоверенностьПоXML_003(Доверенность);
		Ответ.Успех = Истина;
		
	Иначе
		
		Комментарий = СтрШаблон("Неизвестная версия формата: '%1'", ВерсияФормата);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Не удалось прочитать XML доверенности", "MCHD-00021", Комментарий);
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

Функция ПолучитьДанныеЮридическогоЛица(Данные)
	
	Перем Результат;
	
	Результат = СтруктураДанныхУчастника();
	Результат.Наименование =  ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "НаимОрг", "");
	Результат.ИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ИННЮЛ", "");
	Результат.КПП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "КПП", "");
	Результат.ОГРН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ОГРН", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеИндивидуальногоПредпринимателя(Данные)
	
	Перем Результат, ФизическоеЛицо;
	
	Результат = СтруктураДанныхУчастника();
	
	Результат.Наименование = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "НаимИП", "");
	Если ПустаяСтрока(Результат.Наименование) Тогда
		ФизическоеЛицо = ПолучитьДанныеФизическогоЛица(Данные);
		Результат.Наименование = ФизическоеЛицо.Наименование;
	КонецЕсли;
	
	Результат.ИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ИННФЛ", "");
	Результат.ОГРН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ОГРНИП", "");
	Результат.СНИЛС = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "СНИЛС", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеФизическогоЛица(Данные)
	
	Перем Результат;
	Перем ФИОФизическогоЛица, Фамилия, Имя, Отчество;
	
	Результат = СтруктураДанныхУчастника();
	Результат.ИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ИННФЛ", "");
	Результат.СНИЛС = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "СНИЛС", "");
	Результат.ОГРН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ОГРНИП");
	
	ФИОФизическогоЛица = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ФИО");
	Если ФИОФизическогоЛица = Неопределено Тогда // Для формата 003 ФИО заполняем из сведений о физ.лице
		ФИОФизическогоЛица = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "СведФЛ.ФИО");
	КонецЕсли;
	
	Фамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФИОФизическогоЛица, "Фамилия");
	Имя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФИОФизическогоЛица, "Имя");
	Отчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФИОФизическогоЛица, "Отчество");
	
	Результат.Наименование = ККСНГ_ОбщегоНазначенияКлиентСервер.СоединитьСтрокиСПробелом(Фамилия, Имя, Отчество);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеИностраннойОрганизации(Данные)
	
	Перем Результат;
	
	Результат = СтруктураДанныхУчастника();
	Результат.Наименование = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "НаимИО");
	Результат.ИНН = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ИННЮЛ", "");
	Результат.КПП = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "КПП", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПолномочия(Полномочия)
	
	Перем Результат;
	Перем Полномочие, НовоеПолномочие;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(Полномочия) = Тип("Массив") Тогда
		
		Для каждого Полномочие Из Полномочия Цикл
			
			НовоеПолномочие = СтруктураПолномочий();
			
			НовоеПолномочие.Код = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочие, "КодПолн", "");
			НовоеПолномочие.Текст = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочие, "СодержПолн", "");
			
			Если ПустаяСтрока(НовоеПолномочие.Текст) Тогда
				НовоеПолномочие.Текст = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочие, "ТекстПолн", "");
			КонецЕсли;
			
			Результат.Добавить(НовоеПолномочие);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область СтруктурыДанных

Функция СтруктураПолномочий()
	
	Перем Результат;
	
	Результат = Новый Структура;
	Результат.Вставить("Код", "");
	Результат.Вставить("Текст", "");
	
	Возврат Результат;
	
КонецФункции

// Формирует новые данные участника (доверителя или представителя)
// 
// Возвращаемое значение:
//  Структура - Новые данные участника: 
// * ТипУчастника - Строка
// * ИНН - Строка
// * КПП - Строка
// * ОГРН - Строка
// * СНИЛС - Строка - в формате 999-999-999 99
Функция СтруктураДанныхУчастника()
	
	Перем Результат;
	
	Результат = Новый Структура();
	Результат.Вставить("Наименование", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("СНИЛС", "");
	Результат.Вставить("Подписанты", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Формат_001

Функция ЗаполнитьДоверенностьПоXML_001(ДанныеДоверенности)
	
	Перем ДоверенностьОбъект;
	Перем ИдентификаторФайла, СведенияОДоверенности;
	Перем СведенияОДоверителях, СведенияОПредставителях, СведенияОПолномочиях;
	Перем Доверители, Доверитель, НоваяСтрока, Представители, Представитель, Полномочия, Полномочие;
	
	ДоверенностьОбъект = Справочники.ККСНГ_МашиночитаемыеДоверенности.СоздатьЭлемент();
	
	СведенияОДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.СвДов");
	
	ДоверенностьОбъект.Код = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "НомДовер");
	ДоверенностьОбъект.ДатаНачала = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "ДатаВыдДовер");
	ДоверенностьОбъект.ДатаОкончания = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "ДатаКонДовер");
	ДоверенностьОбъект.ИнформационнаяСистема = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СведСистОтм");
	
	ИдентификаторФайла = СтрШаблон("ON_DOVBB_%1_%2", Формат(ДоверенностьОбъект.ДатаНачала, "ДФ=yyyyMMdd"), ДоверенностьОбъект.Код);
	ДоверенностьОбъект.ИмяФайлаДоверенности = СтрШаблон("%1.xml", ИдентификаторФайла);
	
	СведенияОДоверителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.СвДоверит");
	СведенияОПредставителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.СвУпПред");
	СведенияОПолномочиях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.СвПолн");
	
	Доверители = ПолучитьДоверителей_001(СведенияОДоверителях);
	Для каждого Доверитель Из Доверители Цикл
		НоваяСтрока = ДоверенностьОбъект.Доверители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Доверитель, , "Подписанты");
		НоваяСтрока.Подписанты = ККСНГ_ОбщегоНазначения.СтрокаJSON(Доверитель.Подписанты);
	КонецЦикла;
	
	// Заполняем ИНН первоначального доверителя (первого в списке)
	Для каждого Доверитель Из Доверители Цикл
		ДоверенностьОбъект.ИННДоверителя = Доверитель.ИНН;
		Прервать;
	КонецЦикла;
	
	// Заполняем представителей
	Представители = ПолучитьПредставителей_001(СведенияОПредставителях);
	Для каждого Представитель Из Представители Цикл
		НоваяСтрока = ДоверенностьОбъект.Представители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Представитель);
	КонецЦикла;
	
	// Заполняем полномочия
	Полномочия = ПолучитьПолномочия(СведенияОПолномочиях);
	Для каждого Полномочие Из Полномочия Цикл
		НоваяСтрока = ДоверенностьОбъект.Полномочия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Полномочие);
	КонецЦикла;
	
	Возврат ДоверенностьОбъект;
	
КонецФункции

Функция ПолучитьДоверителей_001(СведенияОДоверителях)
	
	Перем Результат, Доверитель, СведенияОДоверителе;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(СведенияОДоверителях) = Тип("Массив") Тогда
		Для каждого Доверитель Из СведенияОДоверителях Цикл
			СведенияОДоверителе = ПолучитьСведенияДоверителя_001(Доверитель);
			Результат.Добавить(СведенияОДоверителе);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияДоверителя_001(Доверитель)
	
	Перем ТипУчастника;
	Перем ЮридическоеЛицо, ИндивидуальныйПредприниматель, ФизическоеЛицо, ИностраннаяОрганизация;
	Перем Участник, Подписанты, Подписант, Фамилия, Имя, Отчество, ДанныеПодписанта;
	
	ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ТипДовер");
	
	Если ТипУчастника = "ЮЛ" Тогда // Юридическое лицо
		
		ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "РосОргДовер");
		Участник = ПолучитьДанныеЮридическогоЛица(ЮридическоеЛицо);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда // Индивидуальный предприниматель
		
		ИндивидуальныйПредприниматель= ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ИПДовер");
		Участник = ПолучитьДанныеИндивидуальногоПредпринимателя(ИндивидуальныйПредприниматель);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда // Физическое лицо 
		
		ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ФЛДовер");
		Участник = ПолучитьДанныеФизическогоЛица(ФизическоеЛицо);
		
	ИначеЕсли ТипУчастника = "ИО" Тогда // Иностранная организация (Филиал иностранной организации)
		
		ИностраннаяОрганизация = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ИнОргДовер");
		Участник = ПолучитьДанныеИностраннойОрганизации(ИностраннаяОрганизация);
		
	Иначе
		Участник = СтруктураДанныхУчастника();
	КонецЕсли;
	
	Подписанты = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "Подписант");
	
	// Заполняем подписантов
	Участник.Подписанты = Новый Массив;
	Если ТипЗнч(Подписанты) = Тип("Массив") Тогда
		
		Для каждого Подписант Из Подписанты Цикл
			
			Фамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Фамилия");
			Имя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Имя");
			Отчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Отчество");
			
			ДанныеПодписанта = СтруктураДанныхУчастника();
			ДанныеПодписанта.Наименование = ККСНГ_ОбщегоНазначенияКлиентСервер.СоединитьСтрокиСПробелом(Фамилия, Имя, Отчество);
			
			Участник.Подписанты.Добавить(ДанныеПодписанта);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция ПолучитьПредставителей_001(СведенияОПредставителях)
	
	Перем Результат;
	Перем Представители, Представитель, СведенияОПредставителе;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(СведенияОПредставителях) = Тип("Массив") Тогда
		Для каждого Представители Из СведенияОПредставителях Цикл
			
			СведенияОПредставителе = ПолучитьСведенияПредставителя_001(Представители);
			Для каждого Представитель Из СведенияОПредставителе Цикл
				Результат.Добавить(Представитель);
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияПредставителя_001(Представители)
	
	Перем Результат;
	Перем СведенияОПредставителях, Представитель, ТипУчастника, Участник;
	Перем ЮридическоеЛицо, ИндивидуальныйПредприниматель, ФизическоеЛицо;
	
	Результат = Новый Массив;
	
	СведенияОПредставителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представители, "СвПред");
	ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представители, "ТипПред");
	
	Если ТипЗнч(СведенияОПредставителях) = Тип("Массив") Тогда
		
		Для каждого Представитель Из СведенияОПредставителях Цикл
			
			Если ТипУчастника = "ЮЛ" Тогда // Юридическое лицо
				
				ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "СвОрг");
				Участник = ПолучитьДанныеЮридическогоЛица(ЮридическоеЛицо);
				
			ИначеЕсли ТипУчастника = "ИП" Тогда // Индивидуальный предприниматель
				
				ИндивидуальныйПредприниматель = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "СведИП");
				Участник = ПолучитьДанныеИндивидуальногоПредпринимателя(ИндивидуальныйПредприниматель);
				
			ИначеЕсли ТипУчастника = "ФЛ" Тогда // Физическое лицо
				
				ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "СведФизЛ");
				Участник = ПолучитьДанныеФизическогоЛица(ФизическоеЛицо);
				
			Иначе
				Участник = СтруктураДанныхУчастника();
			КонецЕсли;
			
			Результат.Добавить(Участник);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Формат_002

Функция ЗаполнитьДоверенностьПоXML_002(ДанныеДоверенности)
	
	Перем ДоверенностьОбъект;
	Перем ИдентификаторФайла, СведенияОДоверенности, СведенияОПередоверии;
	Перем СведенияОДоверителях, СведенияОДоверителяхПерв, СведенияОПредставителях, СведенияОПолномочиях;
	Перем Доверители, Доверитель, НоваяСтрока, Представители, Представитель, Полномочия, Полномочие;
	
	ДоверенностьОбъект = Справочники.ККСНГ_МашиночитаемыеДоверенности.СоздатьЭлемент();
	
	ИдентификаторФайла = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "ИдФайл");
	
	СведенияОДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Довер");
	СведенияОПередоверии = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Передов");
	
	Если СведенияОПередоверии = Неопределено Тогда
		
		СведенияОДоверителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СвДоверит");
		СведенияОДоверителяхПерв = СведенияОДоверителях;
		
		СведенияОПредставителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СвУпПред");
		СведенияОПолномочиях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СвПолн");
		
		СведенияОДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СвДов");
		
	Иначе
		
		СведенияОДоверителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвЛицПередПолн");
		СведенияОДоверителяхПерв = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвДовПер.СвОснДовер.СвДовер0");
		
		СведенияОПредставителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвЛицПолучПолн");
		СведенияОПолномочиях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПолн");
		
		ДоверенностьОбъект.НомерДоверенностиОснования = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвДовПер.НомДоверN");
		ДоверенностьОбъект.НомерПервоначальнойДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвДовПер.СвОснДовер.НомДовер0");
		
		СведенияОДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвДовПер.СвПереДовер");
		
	КонецЕсли;
	
	ДоверенностьОбъект.ИмяФайлаДоверенности = СтрШаблон("%1.xml", ИдентификаторФайла);
	ДоверенностьОбъект.Код = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "НомДовер");
	ДоверенностьОбъект.ДатаНачала = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "ДатаВыдДовер");
	ДоверенностьОбъект.ДатаОкончания = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "ДатаКонДовер");
	ДоверенностьОбъект.ИнформационнаяСистема = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СведСистОтм");
	
	Доверители = ПолучитьДоверителей_002(СведенияОДоверителях);
	Для каждого Доверитель Из Доверители Цикл
		НоваяСтрока = ДоверенностьОбъект.Доверители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Доверитель, , "Подписанты");
		НоваяСтрока.Подписанты = ККСНГ_ОбщегоНазначения.СтрокаJSON(Доверитель.Подписанты);
	КонецЦикла;
	
	// Заполняем ИНН первоначального доверителя (первого в списке)
	Если СведенияОДоверителяхПерв <> СведенияОДоверителях Тогда
		Доверители = ПолучитьДоверителей_002(СведенияОДоверителяхПерв);
	КонецЕсли;
	Для каждого Доверитель Из Доверители Цикл
		ДоверенностьОбъект.ИННДоверителя = Доверитель.ИНН;
		Прервать;
	КонецЦикла;
	
	// Заполняем представителей
	Представители = ПолучитьПредставителей_002(СведенияОПредставителях);
	Для каждого Представитель Из Представители Цикл
		НоваяСтрока = ДоверенностьОбъект.Представители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Представитель);
	КонецЦикла;
	
	// Заполняем полномочия
	Полномочия = ПолучитьПолномочия(СведенияОПолномочиях);
	Для каждого Полномочие Из Полномочия Цикл
		НоваяСтрока = ДоверенностьОбъект.Полномочия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Полномочие);
	КонецЦикла;
	
	Возврат ДоверенностьОбъект;
	
КонецФункции

Функция ПолучитьДоверителей_002(СведенияОДоверителях)
	
	Перем Результат, Доверитель, СведенияОДоверителе;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(СведенияОДоверителях) = Тип("Массив") Тогда
		Для каждого Доверитель Из СведенияОДоверителях Цикл
			СведенияОДоверителе = ПолучитьСведенияДоверителя_002(Доверитель);
			Результат.Добавить(СведенияОДоверителе);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияДоверителя_002(Доверитель)
	
	Перем ПервоначальнаяДоверенность, ТипУчастника;
	Перем ЮридическоеЛицо, ИностраннаяОрганизация, ИндивидуальныйПредприниматель, ФизическоеЛицо;
	Перем Участник, Подписант, Фамилия, Имя, Отчество, ДанныеПодписанта;
	
	ПервоначальнаяДоверенность = Истина;
	
	ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ТипДовер");
	
	Если ТипУчастника = Неопределено Тогда
		ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ТипЛицПрдПолн");
		ПервоначальнаяДоверенность = Ложь;
	КонецЕсли;
	
	Если ТипУчастника = "ЮЛ" Тогда // Юридическое лицо
		
		ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, ?(ПервоначальнаяДоверенность, "РосОргДовер.СвРосОрг", "РосОргПрдПолн"));
		Если ЮридическоеЛицо = Неопределено И ПервоначальнаяДоверенность Тогда // Доверитель первоначальной доверенности при передоверии
			ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "РосОргДовер");
		КонецЕсли;
		
		Участник = ПолучитьДанныеЮридическогоЛица(ЮридическоеЛицо);
		
	ИначеЕсли ТипУчастника = "ИО" Тогда // Иностранная организация (Филиал иностранной организации)
		
		ИностраннаяОрганизация = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ИнОргДовер.СвИнОрг");
		Если ИностраннаяОрганизация = Неопределено Тогда // Доверитель первоначальной доверенности при передоверии
			ИностраннаяОрганизация = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ИнОргДовер");
		КонецЕсли;
		
		Участник = ПолучитьДанныеИностраннойОрганизации(ИностраннаяОрганизация);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда // Индивидуальный предприниматель
		
		ИндивидуальныйПредприниматель = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, ?(ПервоначальнаяДоверенность, "ИПДовер", "ИППрдПолн"));
		Участник = ПолучитьДанныеИндивидуальногоПредпринимателя(ИндивидуальныйПредприниматель);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда // Физическое лицо
		
		ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, ?(ПервоначальнаяДоверенность, "ФЛДовер", "ФЛПрдПолн"));
		Участник = ПолучитьДанныеФизическогоЛица(ФизическоеЛицо);
		
	Иначе
		Участник = СтруктураДанныхУчастника();
	КонецЕсли;
	
	// Заполняем подписантов
	Подписант = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "Подписант");
	
	Участник.Подписанты = Новый Массив;
	Если ТипЗнч(Подписант) = Тип("Структура") Тогда
		
		Фамилия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Фамилия");
		Имя = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Имя");
		Отчество = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Отчество");
		
		ДанныеПодписанта = СтруктураДанныхУчастника();
		ДанныеПодписанта.Наименование = ККСНГ_ОбщегоНазначенияКлиентСервер.СоединитьСтрокиСПробелом(Фамилия, Имя, Отчество);
		
		Участник.Подписанты.Добавить(ДанныеПодписанта);
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция ПолучитьПредставителей_002(СведенияОПредставителях)
	
	Перем Результат;
	Перем Представитель, СведенияОПредставителе;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(СведенияОПредставителях) = Тип("Массив") Тогда
		Для каждого Представитель Из СведенияОПредставителях Цикл
			СведенияОПредставителе = ПолучитьСведенияПредставителя_002(Представитель);
			Результат.Добавить(СведенияОПредставителе);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияПредставителя_002(Представитель)
	
	Перем ТипУчастника, Участник;
	Перем ЮридическоеЛицо, ИндивидуальныйПредприниматель, ФизическоеЛицо;
	
	ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "ТипПред");
	
	Если ТипУчастника = "ЮЛ" Тогда // Юридическое лицо
		
		ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "СвОрг.СвОрг");
		Участник = ПолучитьДанныеЮридическогоЛица(ЮридическоеЛицо);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда // Индивидуальный предприниматель
		
		ИндивидуальныйПредприниматель = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "СведИП");
		Участник = ПолучитьДанныеИндивидуальногоПредпринимателя(ИндивидуальныйПредприниматель);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда // Физическое лицо
		
		ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "СведФизЛ");
		Участник = ПолучитьДанныеФизическогоЛица(ФизическоеЛицо);
		
	Иначе
		
		Участник = СтруктураДанныхУчастника();
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

#КонецОбласти

#Область Формат_003

Функция ЗаполнитьДоверенностьПоXML_003(ДанныеДоверенности)
	
	Перем ДоверенностьОбъект;
	Перем ИдентификаторФайла, СведенияОДоверенности, СведенияОПередоверии;
	Перем СведенияОДоверителях, СведенияОПредставителях, СведенияОПолномочиях;
	Перем Доверители, Доверитель, НоваяСтрока, Представители, Представитель, Полномочия, Полномочие;
	
	ДоверенностьОбъект = Справочники.ККСНГ_МашиночитаемыеДоверенности.СоздатьЭлемент();
	
	ИдентификаторФайла = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "ИдФайл");
	
	СведенияОДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Довер.СвДов");
	СведенияОПередоверии = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Передов");
	
	Если СведенияОПередоверии = Неопределено Тогда
		
		СведенияОДоверителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Довер.СвДоверит");
		
		СведенияОПредставителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Довер.СвУпПред");
		СведенияОПолномочиях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДоверенности, "Документ.Довер.СвПолн");
		
	Иначе
		
		СведенияОДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПереДовер");
		СведенияОДоверителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПередПолн");
		
		СведенияОПредставителях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПолучПолн");
		СведенияОПолномочиях = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПолн");
		
		ДоверенностьОбъект.НомерДоверенностиОснования = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПередов.НомДоверN");
		ДоверенностьОбъект.НомерПервоначальнойДоверенности = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПередоверии, "СвПервДовер.НомДоверПерв");
		
	КонецЕсли;
	
	ДоверенностьОбъект.ИмяФайлаДоверенности = СтрШаблон("%1.xml", ИдентификаторФайла);
	ДоверенностьОбъект.Код = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "НомДовер");
	ДоверенностьОбъект.ДатаНачала = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "ДатаВыдДовер");
	ДоверенностьОбъект.ДатаОкончания = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СрокДейст");
	ДоверенностьОбъект.ИнформационнаяСистема = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверенности, "СведСист");
	
	Доверители = ПолучитьДоверителей_003(СведенияОДоверителях);
	Для каждого Доверитель Из Доверители Цикл
		НоваяСтрока = ДоверенностьОбъект.Доверители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Доверитель, , "Подписанты");
		НоваяСтрока.Подписанты = ККСНГ_ОбщегоНазначения.СтрокаJSON(Доверитель.Подписанты);
	КонецЦикла;
	
	// Заполняем ИНН доверителя (первого в списке)
	Для каждого Доверитель Из Доверители Цикл
		ДоверенностьОбъект.ИННДоверителя = Доверитель.ИНН;
		Прервать;
	КонецЦикла;
	
	// Заполняем представителей
	Представители = ПолучитьПредставителей_003(СведенияОПредставителях);
	Для каждого Представитель Из Представители Цикл
		НоваяСтрока = ДоверенностьОбъект.Представители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Представитель);
	КонецЦикла;
	
	// Заполняем полномочия
	Полномочия = ПолучитьПолномочия_003(СведенияОПолномочиях);
	Для каждого Полномочие Из Полномочия Цикл
		НоваяСтрока = ДоверенностьОбъект.Полномочия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Полномочие);
	КонецЦикла;
	
	Возврат ДоверенностьОбъект;
	
КонецФункции

Функция ПолучитьДоверителей_003(СведенияОДоверителях)
	
	Перем Результат, Доверитель, СведенияОДоверителе;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(СведенияОДоверителях) = Тип("Массив") Тогда
		Для каждого Доверитель Из СведенияОДоверителях Цикл
			СведенияОДоверителе = ПолучитьСведенияДоверителя_003(Доверитель);
			Результат.Добавить(СведенияОДоверителе);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияДоверителя_003(Доверитель)
	
	Перем ПервоначальнаяДоверенность, СведенияОДоверителе, ТипУчастника;
	Перем ЮридическоеЛицо, ИностраннаяОрганизация, ИндивидуальныйПредприниматель, ФизическоеЛицо;
	Перем Участник, Подписанты, Подписант, СведенияОПодписантах, СведенияОПодписанте;
	
	Подписанты = Новый Массив;
	ПервоначальнаяДоверенность = Истина;
	
	СведенияОДоверителе = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "Доверит");
	ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ТипДоверит");
	
	Если СведенияОДоверителе = Неопределено Тогда
		СведенияОДоверителе = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ПередПолн");
		ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Доверитель, "ТипПерПолн");
		ПервоначальнаяДоверенность = Ложь;
	КонецЕсли;
	
	Если ТипУчастника = "1" Тогда // Юридическое лицо
		
		ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, ?(ПервоначальнаяДоверенность, "РосОргДовер.СвРосОрг", "РосОргПерПолн.СвРосОрг"));
		Участник = ПолучитьДанныеЮридическогоЛица(ЮридическоеЛицо);
		Подписанты = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, ?(ПервоначальнаяДоверенность, "РосОргДовер.ЛицоБезДов", "РосОргПерПолн.ЛицоБезДов"));
		
	ИначеЕсли ТипУчастника = ?(ПервоначальнаяДоверенность, "2", "5") Тогда // Иностранная организация (Филиал иностранной организации)
		
		ИностраннаяОрганизация = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, ?(ПервоначальнаяДоверенность, "ИнОргДовер.СвИнОрг", "ИнПерПолн.СвИнОрг"));
		Участник = ПолучитьДанныеИностраннойОрганизации(ИностраннаяОрганизация);
		Подписанты = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, ?(ПервоначальнаяДоверенность, "ИнОргДовер.СвРукОП", "ИнПерПолн.СвРукОП"));
		
	ИначеЕсли ТипУчастника = ?(ПервоначальнаяДоверенность, "3", "2") Тогда // Индивидуальный предприниматель
		
		ИндивидуальныйПредприниматель = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, ?(ПервоначальнаяДоверенность, "ИПДовер", "ИППерПолн"));
		Участник = ПолучитьДанныеИндивидуальногоПредпринимателя(ИндивидуальныйПредприниматель);
		Подписанты.Добавить(ИндивидуальныйПредприниматель);
		
	ИначеЕсли ТипУчастника = ?(ПервоначальнаяДоверенность, "4", "3") Тогда // Физическое лицо
		
		ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, ?(ПервоначальнаяДоверенность, "ФЛДовер", "ФЛПерПолн"));
		Участник = ПолучитьДанныеФизическогоЛица(ФизическоеЛицо);
		Подписанты.Добавить(ФизическоеЛицо);
		
	ИначеЕсли ТипУчастника = "4" Тогда // Филиал для передоверенности
		
		Филиал = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, "ФилПерПолн.СвФил");
		Участник = ПолучитьДанныеЮридическогоЛица(Филиал);
		ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОДоверителе, "ФилПерПолн.СвРукФил");
		Подписанты.Добавить(ФизическоеЛицо);
		
	Иначе
		Участник = СтруктураДанныхУчастника();
	КонецЕсли;
	
	// Заполняем подписантов
	Участник.Подписанты = Новый Массив;
	Если ТипЗнч(Подписанты) = Тип("Массив") Тогда
		Для каждого Подписант Из Подписанты Цикл
			СведенияОПодписантах = ПолучитьСведенияОПодписантах_003(Подписант);
			Для каждого СведенияОПодписанте Из СведенияОПодписантах Цикл
				Участник.Подписанты.Добавить(СведенияОПодписанте);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция ПолучитьСведенияОПодписантах_003(Подписант)
	
	Перем Результат;
	Перем СведенияОУчастнике, СведенияОУчастниках;
	
	Результат = Новый Массив;
	
	// Физическое лицо
	СведенияОУчастнике = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "СвФЛ");
	
	// Индивидуальный предприниматель
	Если СведенияОУчастнике = Неопределено Тогда
		СведенияОУчастнике = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "СведФЛ");
	КонецЕсли;
	
	// Физическое лицо сам доверитель
	Если СведенияОУчастнике = Неопределено Тогда
		СведенияОУчастнике = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "СведФИО");
	КонецЕсли;
	
	Если СведенияОУчастнике <> Неопределено Тогда
		Результат.Добавить(ПолучитьДанныеФизическогоЛица(СведенияОУчастнике));
	КонецЕсли;
	
	// Индивидуальный предприниматель
	СведенияОУчастнике = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "СвИП");
	Если СведенияОУчастнике <> Неопределено Тогда
		Результат.Добавить(ПолучитьДанныеФизическогоЛица(СведенияОУчастнике));
	КонецЕсли;
	
	// Юридическое лицо
	СведенияОУчастниках = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "СВЮЛ.СвФЛ");
	Если ТипЗнч(СведенияОУчастниках) = Тип("Массив") Тогда
		Для каждого СведенияОУчастнике Из СведенияОУчастниках Цикл
			Результат.Добавить(ПолучитьДанныеФизическогоЛица(СведенияОУчастнике));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредставителей_003(СведенияОПредставителях)
	
	Перем Результат;
	Перем Представитель, СведенияОПредставителе;
	
	Результат = Новый Массив;
	
	Если ТипЗнч(СведенияОПредставителях) = Тип("Массив") Тогда
		Для каждого Представитель Из СведенияОПредставителях Цикл
			СведенияОПредставителе = ПолучитьСведенияПредставителя_003(Представитель);
			Результат.Добавить(СведенияОПредставителе);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияПредставителя_003(Представитель)
	
	Перем СведенияОПредставителе, ТипУчастника, Участник;
	Перем ЮридическоеЛицо, ИндивидуальныйПредприниматель, ФизическоеЛицо, ФилиалЮридическогоЛица, ФилиалИностраннойОрганизации;
	
	СведенияОПредставителе = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "Пред");
	ТипУчастника = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Представитель, "ТипПред");
	
	Если ТипУчастника = "1" Тогда // Юридическое лицо
		
		ЮридическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПредставителе, "СведОрг");
		Участник = ПолучитьДанныеЮридическогоЛица(ЮридическоеЛицо);
		
	ИначеЕсли ТипУчастника = "2" Тогда // Индивидуальный предприниматель
		
		ИндивидуальныйПредприниматель = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПредставителе, "СведИП");
		Участник = ПолучитьДанныеИндивидуальногоПредпринимателя(ИндивидуальныйПредприниматель);
		
	ИначеЕсли ТипУчастника = "3" Тогда // Физическое лицо
		
		ФизическоеЛицо = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПредставителе, "СведФизЛ");
		Участник = ПолучитьДанныеФизическогоЛица(ФизическоеЛицо);
		
	ИначеЕсли ТипУчастника = "4" Тогда // Филиал юридического лица
		
		ФилиалЮридическогоЛица = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПредставителе, "СведФилиал");
		Участник = ПолучитьДанныеЮридическогоЛица(ФилиалЮридическогоЛица);
		
	ИначеЕсли ТипУчастника = "5" Тогда // Филиал иностранной организации
		
		ФилиалИностраннойОрганизации = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПредставителе, "СведИО");
		Участник = ПолучитьДанныеИностраннойОрганизации(ФилиалИностраннойОрганизации);
		
	Иначе
		Участник = СтруктураДанныхУчастника();
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция ПолучитьПолномочия_003(Полномочия)
	
	Перем Результат;
	Перем ТипПолномочий, МашиночитаемыеПолномочия, Полномочие;
	
	Результат = Новый Массив;
	
	ТипПолномочий = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочия, "ТипПолн");
	
	Если ТипПолномочий = "0" Тогда // Текстовые полномочия
		
		Полномочие = СтруктураПолномочий();
		Полномочие.Текст = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочия, "ТекстПолн");
		Результат.Добавить(Полномочие);
		
	ИначеЕсли ТипПолномочий = "1" Тогда // Машиночитаемые полномочия
		
		МашиночитаемыеПолномочия = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочия, "МашПолн");
		Если ТипЗнч(МашиночитаемыеПолномочия) = Тип("Массив") Тогда
			Для каждого Полномочие Из МашиночитаемыеПолномочия Цикл
				
				Полномочия = СтруктураПолномочий();
				Полномочия.Код = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочие, "КодПолн");
				Полномочия.Текст = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Полномочие, "НаимПолн");
				Результат.Добавить(Полномочия);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти