
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ЗаголовокФормы, СписокВыбора, ОграничениеДлины;
	Перем КвалификаторыСтроки, ОрганичениеТипа;
	
	ЗаголовокФормы = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Заголовок", "");
	
	Если Не ПустаяСтрока(ЗаголовокФормы) Тогда
		ЭтотОбъект.Заголовок = ЗаголовокФормы;
	КонецЕсли;
	
	Элементы.ТекстКомментария.Подсказка = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Подсказка", "");
	ОграничениеДлины = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОграничениеДлины");
	
	Если ТипЗнч(ОграничениеДлины) = Тип("Число") И ОграничениеДлины > 0 Тогда
		КвалификаторыСтроки = Новый КвалификаторыСтроки(ОграничениеДлины);
		ОрганичениеТипа = Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);
		Элементы.ТекстКомментария.ОграничениеТипа = ОрганичениеТипа;
	КонецЕсли;
	
	СписокВыбора = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СписокВыбора");
	
	Если ТипЗнч(СписокВыбора) = Тип("Массив") Или ТипЗнч(СписокВыбора) = Тип("СписокЗначений") Тогда
		Для каждого Элемент Из СписокВыбора Цикл
			
			Если ТипЗнч(Элемент) = Тип("Строка") Тогда
				Элементы.ТекстКомментария.СписокВыбора.Добавить(Элемент);
			ИначеЕсли ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений") Тогда
				Элементы.ТекстКомментария.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Элементы.ТекстКомментария.СписокВыбора.Количество() > 0 Тогда
		
		ЭтотОбъект.ТекстКомментария = Элементы.ТекстКомментария.СписокВыбора[0];
		Элементы.ТекстКомментария.КнопкаВыпадающегоСписка = Истина;
		
		Элементы.ТекстКомментария.Высота = 1;
		Элементы.ТекстКомментария.МногострочныйРежим = Ложь;
		
		Если ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "РежимВыбораИзСписка") = Истина Тогда
			Элементы.ТекстКомментария.РежимВыбораИзСписка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстКомментарияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Элементы.ОК.Доступность = Не ПустаяСтрока(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстКомментарияПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ТекстКомментария);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Элементы.ОК.Доступность = Не ПустаяСтрока(ЭтотОбъект.ТекстКомментария);
	
КонецПроцедуры

#КонецОбласти