
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрофильНастройкиЭДО = Параметры.ПрофильНастройкиЭДО;
	Контрагент = Параметры.Контрагент;
	Отбор = Параметры.Отбор;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачатьЗагрузкуСпискаДокументов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборДоговораНачало(ВыбраннаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборДоговораНачало(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСписокДокументов(Команда)
	НачатьЗагрузкуСпискаДокументов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьЗагрузкуСпискаДокументов()
	
	Список.Очистить();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаСпискаДокументовПродолжение", ЭтотОбъект);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаСпискаДокументовПродолжение(РезультатАвторизации, ДополнительныеПараметры) Экспорт
	
	ПараметрыАвторизации = РезультатАвторизации.Результат;
	Если Не ПараметрыАвторизации = Неопределено Тогда
		 ЗагрузитьСписокДокументовНаСервере(ПараметрыАвторизации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокДокументовНаСервере(ПараметрыАвторизации)
	
	Фильтр = Новый Структура();
	Фильтр.Вставить("Folder", "Processed");   
	Фильтр.Вставить("ParticipantId", Контрагент.ИдентификаторСК);
	Фильтр.Вставить("DocumentTypeCode", "AGREEMENT");
	Фильтр.Вставить("StatusId", 6);
			
	// TODO: Удалить отборы по периоду. Нужны были для оптимизации выборки.
	//Фильтр.Вставить("From", НачалоМесяца(ТекущаяДата()));
	//Фильтр.Вставить("To", КонецДня(ТекущаяДата()));
	
	ЗапросСписокДокументов = ККСНГ_APIКурьер.v1_DocumentList(ПараметрыАвторизации, Фильтр);
	Если ЗапросСписокДокументов.Успех Тогда
		
		СписокДокументов = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗапросСписокДокументов.Результат, "Document", Новый Массив());
		Для каждого СтрокаДокумент Из СписокДокументов Цикл
			
			Если Не ПрофильНастройкиЭДО.ИдентификаторСК = СтрокаДокумент.ReceiverId Тогда
				Продолжить;	
			КонецЕсли;
			
			ЗапросСвойствоДокумента = ККСНГ_ЭлектронныеДокументыВызовСервера.ПолучитьДополнительноеСвойствоДокумента(ПараметрыАвторизации, СтрокаДокумент.Id, "business process");
			СвойствоДокументаЗначение = ЗапросСвойствоДокумента.Результат;
			Если Не ВРег(СвойствоДокументаЗначение) = "UVHD" Тогда
				Продолжить;		
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Список.Добавить(), СтрокаДокумент);
			
		КонецЦикла;
		
		ИсключитьСопоставленныеДоговоры = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ИсключитьСопоставленныеДоговоры", Ложь);
		Если ИсключитьСопоставленныеДоговоры Тогда
			ОтобратьНеСопоставленныеДоговоры();			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьНеСопоставленныеДоговоры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурьерДоговорыУВХД.Id КАК Id,
	|	КурьерДоговорыУВХД.Description КАК Description
	|ПОМЕСТИТЬ втКурьерДоговорыУВХД
	|ИЗ
	|	&КурьерДоговорыУВХД КАК КурьерДоговорыУВХД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыДоговорыУВХД.ДоговорУВХД.Id КАК Id
	|ПОМЕСТИТЬ втВыбранныеДоговорыУВХД
	|ИЗ
	|	Справочник.ККСНГ_Контрагенты.ДоговорыУВХД КАК КонтрагентыДоговорыУВХД
	|ГДЕ
	|	НЕ КонтрагентыДоговорыУВХД.ДоговорУВХД = ЗНАЧЕНИЕ(Справочник.ККСНГ_ЭлектронныеДокументы.ПустаяСсылка)
	|	И НЕ КонтрагентыДоговорыУВХД.Ссылка = &КонтрагентСсылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументы.Id
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка В(&ВыбранныеДоговорыУВХД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурьерДоговорыУВХД.Id КАК Id,
	|	КурьерДоговорыУВХД.Description КАК Description
	|ИЗ
	|	втКурьерДоговорыУВХД КАК КурьерДоговорыУВХД
	|		ПОЛНОЕ СОЕДИНЕНИЕ втВыбранныеДоговорыУВХД КАК втВыбранныеДоговорыУВХД
	|		ПО КурьерДоговорыУВХД.Id = втВыбранныеДоговорыУВХД.Id
	|ГДЕ
	|	втВыбранныеДоговорыУВХД.Id ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("КурьерДоговорыУВХД", Список.Выгрузить());
	Запрос.УстановитьПараметр("ВыбранныеДоговорыУВХД", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ВыбранныеДоговоры", Новый Массив()));
	Запрос.УстановитьПараметр("КонтрагентСсылка", ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "КонтрагентСсылка", Неопределено));
	
	Список.Очистить();
	Список.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДоговораНачало(ВыбраннаяСтрока)
	
	ТекущиеДанные = Список.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ДокументИд = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Id);
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ДокументИд", ДокументИд);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДокументаЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации(ПрофильНастройкиЭДО, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДокументаЗавершение(РезультатАвторизации, ДополнительныеПараметры) Экспорт
	
	ПараметрыАвторизации = РезультатАвторизации.Результат;
	Если Не ПараметрыАвторизации = Неопределено Тогда
		
		ДокументИд = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ДокументИд");
		ЗапросЗагрузкаДокумента = ККСНГ_ДокументооборотВызовСервера.ЗаписатьЭлектронныйДокументПоДаннымИзКурьера(ДокументИд, ПрофильНастройкиЭДО, ПараметрыАвторизации);
		
		Закрыть(ЗапросЗагрузкаДокумента.Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти








