
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыАвторизации = Неопределено;
	Параметры.Свойство("ПараметрыАвторизации", ПараметрыАвторизации);
	
	Параметры.Свойство("token", token);
	
	Если ЗначениеЗаполнено(token) 
		И ПараметрыАвторизации <> Неопределено Тогда
		
		РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionGetSubscriptionDetails(ПараметрыАвторизации, token);
			
		Если РезультатЗапроса.Успех Тогда
			СтруктураПодписка = РезультатЗапроса.Результат;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураПодписка);
		Иначе
			Ошибка = ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(РезультатЗапроса.Журнал);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные о подписке " + Ошибка);
		КонецЕсли; 
			
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
