#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьСКД();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСКД(НастройкиКомпоновкиДанных = Неопределено)
	
	Перем СхемаКомпоновки;
	
	ККСНГ_РаботаСКонтрагентамиВызовСервера.ИнициализоватьСхемуКомпоновкиДанныхДляПоискаКонтрагентов(СхемаКомпоновки, КомпоновщикНастроекКомпоновкиДанных, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Перем Настройка;
	
	Настройка = ЭтотОбъект.КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	РегистрыСведений.ККСНГ_Настройки.СохранитьНастройкуПоискаКонтрагентов(Настройка);
	
КонецПроцедуры

#КонецОбласти
