
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыОшибок = Неопределено;
	Если Параметры.Свойство("АдресТаблицыОшибок", АдресТаблицыОшибок) Тогда
		Ошибки = ПолучитьИзВременногоХранилища(АдресТаблицыОшибок);
		ЗначениеВРеквизитФормы(Ошибки, "ТаблицаОшибок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФорматЛога = "XLS";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	Для каждого Строка Из ТаблицаОшибок Цикл
		Строка.Обработать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	Для каждого Строка Из ТаблицаОшибок Цикл
		Строка.Обработать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	ТаблицаОшибокКопия = ТаблицаОшибок;
	АдресТаблицыОшибок = АдресТаблицыОшибок(ТаблицаОшибокКопия);
	
	Закрыть(Новый Структура("АдресТаблицыОшибок", АдресТаблицыОшибок));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлЛога(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Формат = ФорматЛога();
	ИмяФайла = ИмяФайлаЛога();
	РасширениеФайла = РасширениеФайлаЛога();
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Заголовок = "Сохранение лога";
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяФайла;
	ДиалогОткрытияФайла.Расширение = РасширениеФайла;
	Фильтр = "(*." + РасширениеФайла + ")|*." + РасширениеФайла;
	ДиалогОткрытияФайла.Фильтр = Фильтр;	
	
	ДопДанные = Новый Структура;
	ДопДанные.Вставить("Формат", Формат);
	
	Оповещение = Новый ОписаниеОповещения("СформироватьФайлЛогаЗавершение", ЭтотОбъект, ДопДанные);	 
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ИмяФайлаЛога()

	ТекущаяДата = ККСНГ_ОбщегоНазначенияВызовСервера.ТекущаяДатаВремяСеанса();
	
	ГодСтрока   = СтрЗаменить(Формат(ТекущаяДата, "ДФ=yyyy-MM-dd"), "-", "_");
	ВремяСтрока = СтрЗаменить(Формат(ТекущаяДата, "ДЛФ=В"), ":", "_");
	ИмяФайла    = "Log_" + ГодСтрока + "_" + ВремяСтрока + "." + ФорматЛога;
		
	Возврат ИмяФайла;

КонецФункции

&НаКлиенте
Функция ФорматЛога()

	ТипЛога = ?(ФорматЛога = "XLS", ТипФайлаТабличногоДокумента.XLS, ТипФайлаТабличногоДокумента.HTML);
		
	Возврат ТипЛога;

КонецФункции

&НаКлиенте
Функция РасширениеФайлаЛога()

	РасширениеФайлаЛога = ?(ФорматЛога = "XLS", "XLS", "HTML");
		
	Возврат РасширениеФайлаЛога;

КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьТаблицуОшибок(ТаблицаОшибокКопия)

	ТаблицаОшибок = ДанныеФормыВЗначение(ТаблицаОшибокКопия, Тип("ТаблицаЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.НомерДокумента КАК НомерДокумента,
	|	Таблица.ДатаДокумента КАК ДатаДокумента,
	|	Таблица.ИННОтправителя КАК ИННОтправителя,
	|	Таблица.ИННПолучателя КАК ИННПолучателя,
	|	Таблица.ТипДокумента КАК ТипДокумента,
	|	Таблица.ВерсияФормата КАК ВерсияФормата,
	|	Таблица.ОтветСервера КАК ОтветСервера,
	|	Таблица.ТекстСообщения КАК ТекстСообщения,
	|	Таблица.Обработать КАК Обработать,
	|	Таблица.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	Таблица.ТекстСообщенияБезДокумента КАК ТекстСообщенияБезДокумента
	|ПОМЕСТИТЬ Ошибки
	|ИЗ
	|	&ТаблицаОшибок КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ошибки.НомерДокумента КАК НомерДокумента,
	|	Ошибки.ДатаДокумента КАК ДатаДокумента,
	|	Ошибки.ИННОтправителя КАК ИННОтправителя,
	|	Ошибки.ИННПолучателя КАК ИННПолучателя,
	|	Ошибки.ТипДокумента КАК ТипДокумента,
	|	Ошибки.ВерсияФормата КАК ВерсияФормата,
	|	Ошибки.ОтветСервера КАК ОтветСервера,
	|	Ошибки.ТекстСообщения КАК ТекстСообщения,
	|	Ошибки.Обработать КАК Обработать,
	|	Ошибки.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	Ошибки.ТекстСообщенияБезДокумента КАК ТекстСообщенияБезДокумента
	|ИЗ
	|	Ошибки КАК Ошибки
	|ГДЕ
	|	Ошибки.Обработать";
	Запрос.УстановитьПараметр("ТаблицаОшибок", ТаблицаОшибок);
	
	ТаблицаОшибок = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаОшибок;
	
КонецФункции

&НаКлиенте
Процедура СформироватьФайлЛогаЗавершение(Результат, ДопДанные) Экспорт
	
	ТаблицаОшибокКопия = ТаблицаОшибок;
	МакетЛогаОшибок = МакетЛогаОшибок(ТаблицаОшибокКопия);

	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		
		ПолноеИмяФайла = Результат[0];
		МакетЛогаОшибок.Записать(ПолноеИмяФайла, ДопДанные.Формат);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
		ОткрытиеПапки = Новый ОписаниеОповещения("ОткрытиеПапкиНаКлиенте", ЭтотОбъект, ДопПараметры);
		
		ПоказатьОповещениеПользователя(, ОткрытиеПапки, "Сохранен в " + ПолноеИмяФайла);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеПапкиНаКлиенте(Параметры) Экспорт

	ЗапуститьПриложение(Параметры.ПолноеИмяФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресТаблицыОшибок(ТаблицаОшибокКопия)

	ТаблицаОшибок = ОбработатьТаблицуОшибок(ТаблицаОшибокКопия);
	АдресТаблицыОшибок = ПоместитьВоВременноеХранилище(ТаблицаОшибок);
	
	Возврат АдресТаблицыОшибок;
	
КонецФункции

&НаСервереБезКонтекста
Функция МакетЛогаОшибок(ТаблицаОшибокКопия)

	ТаблицаОшибок = ОбработатьТаблицуОшибок(ТаблицаОшибокКопия);
	
	МакетЛогаОшибок = ККСНГ_ЛогированиеВызовСервера.ПолучитьТабличныйДокументОписанияЛогов(ТаблицаОшибок);		

	Возврат МакетЛогаОшибок;
	
КонецФункции

#КонецОбласти
