#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, доступно ли действие маски действий СФЕРА Курьер
//
// Возвращаемое значение: 
//
// Ложь,Истина - Булево - Доступность действия
//
Функция ДействиеДоступно(СтрокаДействие) Экспорт
	
	СписокНедоступныхДействий = Новый Соответствие();
	СписокНедоступныхДействий.Вставить("Add", "");
	СписокНедоступныхДействий.Вставить("Trash", "");
	СписокНедоступныхДействий.Вставить("Edit", "");
	СписокНедоступныхДействий.Вставить("Delete", "");
	СписокНедоступныхДействий.Вставить("EditableRoute", "");
	СписокНедоступныхДействий.Вставить("SubstituteSigner", "");
	СписокНедоступныхДействий.Вставить("PackageRouteSync", "");
	СписокНедоступныхДействий.Вставить("AcceptWithoutSign", "");
	СписокНедоступныхДействий.Вставить("RemoveFromPackage", "");
	СписокНедоступныхДействий.Вставить("SignReplyTicket", "");
	СписокНедоступныхДействий.Вставить("CreateSignatureTicket", "");
	
	// Временно убрал AvoidanceRequest,AcceptAvoidance,AssignableToSelf,RejectWithTicket
	
	Возврат СписокНедоступныхДействий.Получить(СтрокаДействие) = Неопределено;
	
КонецФункции // ДействиеДоступно

#КонецОбласти