
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Элемент Из Параметры.СписокПользователей Цикл
		Элементы.Пользователь.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	ОписаниеОшибки = Параметры.ОписаниеОшибки;
		
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Элементы.ДекорацияОшибкаПодробности.Видимость = Ложь;	
	КонецЕсли;
	
	Экран = Параметры.Экран;
		
	ПользовательПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Элементы.Войти.Доступность = (НЕ ПустаяСтрока(Пользователь) И (Экран ИЛИ НЕ ПустаяСтрока(Пароль)));

КонецПроцедуры

&НаКлиенте
Процедура ПарольИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Элементы.Войти.Доступность = (Не ПустаяСтрока(Пользователь) И (Экран ИЛИ НЕ ПустаяСтрока(Текст)));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Войти(Команда)
	
	Если НЕ ПустаяСтрока(Пользователь) 
		И (Экран ИЛИ НЕ ПустаяСтрока(Пароль)) Тогда
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Пользователь", Пользователь);
		ПараметрыЗакрытия.Вставить("Пароль", Пароль);
		ЭтотОбъект.Закрыть(ПараметрыЗакрытия);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОсновнойТекст", "Заблокированную учетную запись можно разблокировать с помощью PUK-кода,"
												+ " полученного в конверте вместе с токеном, или обратиться в службу технической поддержки банка.");
	ПараметрыФормы.Вставить("ОписаниеСсылки", "Для самостоятельной разблокировки перейдите по");
	ПараметрыФормы.Вставить("СсылкаДляПерехода", Параметры.СсылкаДляПерехода);

	ОткрытьФорму("ОбщаяФорма.ККСНГ_VPNKeyTLS_Информация", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти
