#Область ПрограммныйИнтерфейс

// Создает журнал сообщений
//
// Параметры:
//	ИмяГруппы           - Строка
//
// Возвращаемое значение:
//	Массив элементов см.ПолучитьСтруктуруСообщения() если задано имя группы или пустой
//
Функция СоздатьЖурналСообщений(ИмяГруппы = "") Экспорт
	
	ЖурналСообщений = Новый Массив();
	
	Если Не ПустаяСтрока(ИмяГруппы) Тогда
		ДобавитьСообщение(ЖурналСообщений, ИмяГруппы, , 0, , Истина);
	КонецЕсли;
	
	Возврат ЖурналСообщений;
	
КонецФункции

// Добавляет сообщение в журнал сообщений
//
// Параметры:
//	ЖурналСообщений   - Массив
//	Событие           - Строка
//	Комментарий       - Строка
//	Статус            - Число
//	КодОшибки         - Строка
//	ЭтоГруппа         - Булево
//	Данные            - Произвольный
//
// Возвращаемое значение:
//	нет
//
Процедура ДобавитьСообщение(ЖурналСообщений, Знач Событие, Знач Комментарий = "", Знач Статус = 0, Знач КодОшибки = Неопределено, ЭтоГруппа = Ложь, Данные = Неопределено) Экспорт
	
	Сообщение = ПолучитьСтруктуруСообщения();
	
	ЗапрещенныеТермины = СтрРазделить("Курьер, Сфера Курьер, E-invoicing", ",", Ложь);
	Для каждого ТекТермин Из ЗапрещенныеТермины Цикл
		ТекТермин = СокрЛП(ТекТермин);
		Событие = СтрЗаменить(Событие, ТекТермин, "");
		Комментарий = СтрЗаменить(Комментарий, ТекТермин, "");
	КонецЦикла;
	
	Сообщение.Событие     = Событие;
	Сообщение.Комментарий = Комментарий;
	Сообщение.Статус      = Статус;
	Сообщение.КодОшибки   = КодОшибки;
	Сообщение.ЭтоГруппа   = ЭтоГруппа;
	Сообщение.Данные	  = Данные;
	
	ЖурналСообщений.Добавить(Сообщение);
	
КонецПроцедуры

// Добавляет сообщение в журнал сообщений
//
// Параметры:
//	ЖурналСообщений   - Массив
//	Событие           - Строка
//	Комментарий       - Строка
//	Данные            - Произвольный
//
// Возвращаемое значение:
//	нет
//
Процедура ДобавитьИнформацию(ЖурналСообщений, Событие, Комментарий = "", Данные = Неопределено) Экспорт
	
	ДобавитьСообщение(ЖурналСообщений, Событие, Комментарий, 0, , Ложь, Данные);
	
КонецПроцедуры

// Добавляет сообщение в журнал сообщений
//
// Параметры:
//	ЖурналСообщений   - Массив
//	Событие           - Строка
//	Комментарий       - Строка
//	КодОшибки         - Строка
//	Данные            - Произвольный
//
// Возвращаемое значение:
//	нет
//
Процедура ДобавитьОшибку(ЖурналСообщений, Событие, КодОшибки, Комментарий = "", Данные = Неопределено) Экспорт
	
	ДобавитьСообщение(ЖурналСообщений, Событие, Комментарий, -1, КодОшибки, Ложь, Данные);
	
КонецПроцедуры

// Добавляет сообщение в журнал сообщений
//
// Параметры:
//	ЖурналСообщений   - Массив
//	Событие           - Строка
//	Комментарий       - Строка
//	Данные            - Произвольный
//
// Возвращаемое значение:
//	нет
//
Процедура ДобавитьОтладочное(ЖурналСообщений, Событие, Комментарий = "", Данные = Неопределено) Экспорт
	
	ДобавитьСообщение(ЖурналСообщений, Событие, Комментарий, 1, , Ложь, Данные);
	
КонецПроцедуры

// Выводит сообщения пользователю из журнала сообщений
//
// Параметры:
//	ЖурналСообщений   - Массив
//	ФильтрСобытий     - Строка/массив строк
//
// Возвращаемое значение:
//	нет
//
Процедура ЖурналСообщенийВывестиСообщенияПользователю(ЖурналСообщений, Знач ФильтрСобытий = "") Экспорт
	
	Если ТипЗнч(ФильтрСобытий) = Тип("Строка") Тогда
		ФильтрСобытий = СтрРазделить(ФильтрСобытий, ",;", Ложь);
	КонецЕсли;
	
	Для Каждого Сообщение Из ЖурналСообщений Цикл
		
		Если ТипЗнч(Сообщение) = Тип("Массив") Тогда
			
			ЖурналСообщенийВывестиСообщенияПользователю(Сообщение, ФильтрСобытий);
			
		ИначеЕсли ТипЗнч(Сообщение) = Тип("Структура") Тогда
			
			Если ФильтрСобытий.Количество() И ФильтрСобытий.Найти(Строка(Сообщение.Статус)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВывестиСообщениеПользователю(Сообщение);
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выводит сообщения пользователю из объекта сообщения журнала
//
// Параметры:
//	Сообщение         - Структура, см. ПолучитьСтруктуруСообщения()
//
// Возвращаемое значение:
//	нет
//
Процедура ВывестиСообщениеПользователю(Сообщение) Экспорт
	
	СоответствияСтатусов = ПолучитьСоответствияСтатусов();
	ТекСтатус = СоответствияСтатусов.Получить(Сообщение.Статус);
	Если ТекСтатус = Неопределено Тогда
		ТекСтатус = СтатусСообщения.БезСтатуса;
	КонецЕсли;
	
	ВыводимоеСообщение = Новый СообщениеПользователю;
	ВыводимоеСообщение.Текст = ТекстСообщения(Сообщение);
	ВыводимоеСообщение.КлючДанных = Сообщение.Данные;
	ВыводимоеСообщение.Сообщить();
	
КонецПроцедуры

// Выводит последнее сообщение пользователю из журнала со статусом -1
//
// Параметры:
//	ЖурналСообщений   - Массив
//
// Возвращаемое значение:
//	нет
//
Процедура ВывестиПоследнююОшибкуЖурнала(ЖурналСообщений) Экспорт
	
	ПоследняяОшибка = ПоследняяОшибкаЖурнала(ЖурналСообщений);
	Если ЗначениеЗаполнено(ПоследняяОшибка) Тогда
		ВывестиСообщениеПользователю(ПоследняяОшибка);
	КонецЕсли;
	
КонецПроцедуры

// Объединение журналов
//
// Параметры:
//	Приемник                  - Массив приемник
//	Источник                  - Массив для добавления
//	ДревовиднаяКонкатенация   - Булево
//
// Возвращаемое значение:
//	нет
//
Процедура КонкатенироватьЖурналы(Приемник, Источник, ДревовиднаяКонкатенация = Истина) Экспорт
	
	Если ДревовиднаяКонкатенация Тогда
		
		Приемник.Добавить(Источник);
		
	Иначе
		Для Каждого СообщениеНУ Из Источник Цикл
			Приемник.Добавить(СообщениеНУ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Выводит журнал в текстовый документ
//
// Параметры:
//  ЖурналСообщений	 - Структура	 - журнал сообщений, см. СоздатьЖурналСообщений()
//  ФильтрСобытий	 - Строка	 - фильтр по статусам сообщений, может содержать несколько значений, разделенных "," или ";"
//  ФильтрКодыОшибокИсключения	 - Строка	 - исключающие коды ошибок, может содержать несколько значений, разделенных "," или ";"
//
// Возвращаемое значение:
//  ТекстовыйДокумент - результат вывода журнала сообщений
//
Функция ПолучитьЖурналКакТекстовыйДокумент(ЖурналСообщений, Знач ФильтрСобытий = "", Знач КодыОшибокИсключения = "") Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ВывестиСообщенияЖурналаВТекстовыйДокумент(ЖурналСообщений, ТекстовыйДокумент, ФильтрСобытий, КодыОшибокИсключения);
	Возврат ТекстовыйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выводит текст сообщения
//
// Параметры:
//	Сообщение         - Структура, см. ПолучитьСтруктуруСообщения()
//
// Возвращаемое значение:
//	Строка , шаблон Дата_[КодОшибки]_Событие_Комментарий
//
Функция ТекстСообщения(Сообщение) Экспорт
	
	ТекстСобытия = Сообщение.Событие;
	Если Не ПустаяСтрока(Сообщение.КодОшибки) Тогда
		ТекстСобытия = "[" + Сообщение.КодОшибки + "] " + ТекстСобытия;
	КонецЕсли;
	
	СтрокаСообщения = СтрШаблон("%1: %2", Сообщение.Дата, ТекстСобытия);
	
	Если Не ПустаяСтрока(Сообщение.Комментарий) Тогда
		СтрокаСообщения = СтрокаСообщения + Символы.ПС + Сообщение.Комментарий;
	КонецЕсли;
	
	Возврат СтрокаСообщения;
	
КонецФункции

// Выводит текст последнего сообщения журнала со статусом -1 или по фильтру
//
// Параметры:
//	ЖурналСообщений   - Массив
//	КодОшибки         - Строка - Искомый код
//
// Возвращаемое значение:
//	Строка или Неопределено
//
Функция ПоследняяОшибкаЖурнала(ЖурналСообщений, КодОшибки = "") Экспорт
	
	Результат = Неопределено;
	Для Каждого Сообщение Из ЖурналСообщений Цикл
		
		ТекРезультатОшибки = Неопределено;
		
		Если ТипЗнч(Сообщение) = Тип("Массив") Тогда
			
			ТекРезультатОшибки = ПоследняяОшибкаЖурнала(Сообщение, КодОшибки);
			
		ИначеЕсли ТипЗнч(Сообщение) = Тип("Структура") Тогда
			
			Если Строка(Сообщение.Статус) = "-1" Тогда
				ТекРезультатОшибки = Сообщение;
			КонецЕсли;
			
		Иначе
			
			ТекРезультатОшибки = Неопределено;
			
		КонецЕсли;
		
		Если ТекРезультатОшибки <> Неопределено
			И ОбновитьОшибкуСУчетомФильтра(Результат, КодОшибки, ТекРезультатОшибки.КодОшибки) Тогда
			
			Результат = ТекРезультатОшибки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выводит параметр Событие последнего сообщения журнала со статусом -1 или по фильтру
//
// Параметры:
//	ЖурналСообщений   - Массив
//	КодОшибки         - Строка - Искомый код
//
// Возвращаемое значение:
//	Строка
//
Функция ОписаниеПоследнейОшибки(ЖурналСообщений, КодОшибки = "") Экспорт
	ОписаниеОшибки = "";
	
	Сообщение = ПоследняяОшибкаЖурнала(ЖурналСообщений, КодОшибки);
	
	Если Сообщение <> Неопределено Тогда
		ОписаниеОшибки = ТекстСообщения(Сообщение); // Сообщение.Событие;
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоответствияСтатусов()
	
	СоответствияСтатусов = Новый Соответствие();
	
	СоответствияСтатусов.Вставить(-1, СтатусСообщения.Важное);
	СоответствияСтатусов.Вставить( 0, СтатусСообщения.Информация);
	СоответствияСтатусов.Вставить( 1, СтатусСообщения.БезСтатуса);
	
	Возврат СоответствияСтатусов;
	
КонецФункции

Функция ПолучитьСтруктуруСообщения()
	
	СообщениеЛога = Новый Структура();
	
	// Даты, время, время в милисекундах
	СообщениеЛога.Вставить("Уровень", 1);
	СообщениеЛога.Вставить("Дата", ККСНГ_ОбщегоНазначенияВызовСервера.ТекущаяДатаВремяСеанса());
	СообщениеЛога.Вставить("ДатаВМиллисекундах", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	// Компьютер, пользователь, приложение
	СообщениеЛога.Вставить("ИмяКомпьютера");
	СообщениеЛога.Вставить("Пользователь");
	СообщениеЛога.Вставить("ИмяПриложения");
	ТекСеанс = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСтруктуруТекущегоСеансаИнформационнойБазы();
	ЗаполнитьЗначенияСвойств(СообщениеЛога, ТекСеанс, "ИмяКомпьютера, Пользователь, ИмяПриложения");
	
	// Остальные поля
	СообщениеЛога.Вставить("Событие");
	СообщениеЛога.Вставить("Комментарий");
	СообщениеЛога.Вставить("Статус");	// ........-1............0...........1............
										// (-)  (ошибка) (информационное) (отладочное)  (+)
	СообщениеЛога.Вставить("КодОшибки");
	СообщениеЛога.Вставить("ЭтоГруппа");
	
	СообщениеЛога.Вставить("Данные");
	
	Возврат СообщениеЛога;
	
КонецФункции

Функция ПолучитьСтрокуСообщения(Сообщение)
	
	СоответствияСтатусов = ПолучитьСоответствияСтатусов();
	ТекСтатус = СоответствияСтатусов.Получить(Сообщение.Статус);
	Если ТекСтатус = Неопределено Тогда
		ТекСтатус = СтатусСообщения.БезСтатуса;
	КонецЕсли;
	
	ТекстСобытия = Сообщение.Событие;
	Если Не ПустаяСтрока(Сообщение.КодОшибки) Тогда
		ТекстСобытия = "[" + Сообщение.КодОшибки + "] " + ТекстСобытия;
	КонецЕсли;
	
	СтрокаСообщения = СтрШаблон("%1: %2", Формат(Сообщение.Дата, "ДЛФ=DT"), ТекстСобытия);
	
	Если Не ПустаяСтрока(Сообщение.Комментарий) Тогда
		СтрокаСообщения = СтрокаСообщения + Символы.ПС + Сообщение.Комментарий;
	КонецЕсли;
	
	Если ТекСтатус = СтатусСообщения.Информация Тогда
		Префикс = "·" + Символы.Таб;
	ИначеЕсли ТекСтатус = СтатусСообщения.Важное Тогда
		Префикс = "‼" + Символы.Таб;
	Иначе
		Префикс = "•" + Символы.Таб;
	КонецЕсли;
	
	СтрокаСообщения = Префикс + СтрЗаменить(СтрокаСообщения, Символы.ПС, Символы.ПС + " 	                     ");
	Возврат СокрЛП(СтрокаСообщения);
	
КонецФункции

Функция ОбновитьОшибкуСУчетомФильтра(Результат, КодОшибки, ТекРезультатКодОшибки)
	
	Если Результат = Неопределено // Это первая ошибка, берем обязательно
		Или ПустаяСтрока(КодОшибки) // Нет фильтра по коду ошибки, обновляем результат ошибки
		Или (Не ПустаяСтрока(КодОшибки) // Задан фильтр по коду ошибки, проверяем соответствие:
		И (КодОшибки = ТекРезультатКодОшибки // 1. в более поздней ошибке
		Или КодОшибки <> Результат.КодОшибки)) Тогда // 2. в сохраненном результате
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Выводит журнал в текстовый документ
//
// Параметры:
//  ЖурналСообщений	 - Структура/Массив
//  ТекстовыйДокумент - результат вывода журнала сообщений
//  ФильтрСобытий	 - Строка	 - фильтр по статусам сообщений, может содержать несколько значений, разделенных "," или ";"
//  ФильтрКодыОшибокИсключения	 - Строка	 - исключающие коды ошибок, может содержать несколько значений, разделенных "," или ";"
//
Процедура ВывестиСообщенияЖурналаВТекстовыйДокумент(ЖурналСообщений, ТекстовыйДокумент, Знач ФильтрСобытий = "", Знач КодыОшибокИсключения = "")
	
	Перем Сообщение;
	
	Если ТипЗнч(ФильтрСобытий) <> Тип("Массив") Тогда
		Если ТипЗнч(ФильтрСобытий) = Тип("Строка") Тогда
			ФильтрСобытий = СтрРазделить(ФильтрСобытий, ",;", Ложь);
		Иначе
			ФильтрСобытий = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(КодыОшибокИсключения) <> Тип("Массив") Тогда
		Если ТипЗнч(КодыОшибокИсключения) = Тип("Строка") Тогда
			КодыОшибокИсключения = СтрРазделить(КодыОшибокИсключения, ",;", Ложь);
		Иначе
			КодыОшибокИсключения = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Сообщение Из ЖурналСообщений Цикл
		
		Если ТипЗнч(Сообщение) = Тип("Массив") Тогда
			// Вложенный журнал
			ВывестиСообщенияЖурналаВТекстовыйДокумент(Сообщение, ТекстовыйДокумент, ФильтрСобытий, КодыОшибокИсключения);
		Иначе
			Если ФильтрСобытий.Количество() И ФильтрСобытий.Найти(Строка(Сообщение.Статус)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если КодыОшибокИсключения.Найти(Строка(Сообщение.КодОшибки)) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстовыйДокумент.ДобавитьСтроку(ПолучитьСтрокуСообщения(Сообщение));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти