
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

 	Поля.Добавить("Контрагент");
	Поля.Добавить("Наименование");
 	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры	
	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ Данные.Контрагент.Пустая() Тогда
		
		ЕстьРеквизит = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.УКонтрагентаЕстьРеквизитНаименованиеПолное();
		
		Представление = Данные.Контрагент.Наименование;
		
		Если ЕстьРеквизит Тогда
			Если ЗначениеЗаполнено(Данные.Контрагент.НаименованиеПолное) Тогда
				Представление = Данные.Контрагент.НаименованиеПолное;
			КонецЕсли;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли


