#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Строка(Владелец) + " <-> " + Строка(Контрагент);
	
	Если ПустаяСтрока(ВариантНастройкиОбмена) Тогда
		ВариантНастройкиОбмена = "Использовать настройки организации";
	КонецЕсли;
	
	Если НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ПрофильЭДОДоступенПользователю(Владелец) Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнениеНастроекФХЖ2() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		СкладСсылка = Неопределено;
		Если ДополнительныеСвойства.Свойство("Склад", СкладСсылка) Тогда
			Склад = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойства(СкладСсылка);
		КонецЕсли;
		
		ДоговорСсылка = Неопределено;
		Если ДополнительныеСвойства.Свойство("Договор", ДоговорСсылка) Тогда
			Договор = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойства(ДоговорСсылка);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ПроверитьДублированиеНастроекФХЖ() Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьДублированиеНастроекФХЖ(СообщатьОДублях = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	""Информационные поля ФХЖ1"" КАК ТаблицаНастройки,
	               |	ИнформационныеПоляФХЖ1.Идентификатор КАК Идентификатор,
	               |	ИнформационныеПоляФХЖ1.Документ КАК Документ
	               |ПОМЕСТИТЬ втИнформационныеПоляФХЖ1
	               |ИЗ
	               |	&ИнформационныеПоляФХЖ1 КАК ИнформационныеПоляФХЖ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Информационные поля ФХЖ2"" КАК ТаблицаНастройки,
	               |	ИнформационныеПоляФХЖ2.Идентификатор КАК Идентификатор,
	               |	ИнформационныеПоляФХЖ2.Документ КАК Документ,
	               |	ИнформационныеПоляФХЖ2.ТабличнаяЧасть КАК ТабличнаяЧасть
	               |ПОМЕСТИТЬ втИнформационныеПоляФХЖ2
	               |ИЗ
	               |	&ИнформационныеПоляФХЖ2 КАК ИнформационныеПоляФХЖ2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Информационные поля ФХЖ3"" КАК ТаблицаНастройки,
	               |	ИнформационныеПоляФХЖ3.Идентификатор КАК Идентификатор,
	               |	ИнформационныеПоляФХЖ3.Документ КАК Документ
	               |ПОМЕСТИТЬ втИнформационныеПоляФХЖ3
	               |ИЗ
	               |	&ИнформационныеПоляФХЖ3 КАК ИнформационныеПоляФХЖ3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнформационныеПоляФХЖ1.ТаблицаНастройки КАК ТаблицаНастройки,
	               |	ИнформационныеПоляФХЖ1.Идентификатор КАК Идентификатор,
	               |	ИнформационныеПоляФХЖ1.Документ КАК Документ,
	               |	"""" КАК ТабличнаяЧасть
	               |ПОМЕСТИТЬ втИнформационныеПоляФХЖ
	               |ИЗ
	               |	втИнформационныеПоляФХЖ1 КАК ИнформационныеПоляФХЖ1
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИнформационныеПоляФХЖ2.ТаблицаНастройки,
	               |	ИнформационныеПоляФХЖ2.Идентификатор,
	               |	ИнформационныеПоляФХЖ2.Документ,
	               |	ИнформационныеПоляФХЖ2.ТабличнаяЧасть
	               |ИЗ
	               |	втИнформационныеПоляФХЖ2 КАК ИнформационныеПоляФХЖ2
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИнформационныеПоляФХЖ3.ТаблицаНастройки,
	               |	ИнформационныеПоляФХЖ3.Идентификатор,
	               |	ИнформационныеПоляФХЖ3.Документ,
	               |	""""
	               |ИЗ
	               |	втИнформационныеПоляФХЖ3 КАК ИнформационныеПоляФХЖ3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИнформационныеПоляФХЖ.ТаблицаНастройки КАК ТаблицаНастройки,
	               |	втИнформационныеПоляФХЖ.Идентификатор КАК Идентификатор,
	               |	втИнформационныеПоляФХЖ.Документ КАК Документ,
	               |	втИнформационныеПоляФХЖ.ТабличнаяЧасть КАК ТабличнаяЧасть,
	               |	СУММА(1) КАК Счетчик
	               |ИЗ
	               |	втИнформационныеПоляФХЖ КАК втИнформационныеПоляФХЖ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втИнформационныеПоляФХЖ.Документ,
	               |	втИнформационныеПоляФХЖ.ТабличнаяЧасть,
	               |	втИнформационныеПоляФХЖ.ТаблицаНастройки,
	               |	втИнформационныеПоляФХЖ.Идентификатор
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(1) > 1";
		
	ПараметрыОтбора = Новый Структура("Использовать", Истина);
	
	ТаблицаИнформационныеПоляФХЖ1 = ИнформационныеПоляФХЖ1.Выгрузить(ПараметрыОтбора, "Идентификатор, Документ");
	Запрос.УстановитьПараметр("ИнформационныеПоляФХЖ1", ТаблицаИнформационныеПоляФХЖ1);
	
	ТаблицаИнформационныеПоляФХЖ2 = ИнформационныеПоляФХЖ2.Выгрузить(ПараметрыОтбора, "Идентификатор, Документ, ТабличнаяЧасть");
	Запрос.УстановитьПараметр("ИнформационныеПоляФХЖ2", ТаблицаИнформационныеПоляФХЖ2);
	
	ТаблицаИнформационныеПоляФХЖ3 = ИнформационныеПоляФХЖ3.Выгрузить(ПараметрыОтбора, "Идентификатор, Документ");
	Запрос.УстановитьПараметр("ИнформационныеПоляФХЖ3", ТаблицаИнформационныеПоляФХЖ3);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьДубли = НЕ РезультатЗапроса.Пустой();
	
	Если ЕстьДубли И СообщатьОДублях Тогда
		
		ШаблонСообщения = "Дублируется идентификатор ""%1"" в табличной части ""%2""";
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Идентификатор, Выборка.ТаблицаНастройки);
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат НЕ ЕстьДубли;

КонецФункции

Функция ПроверитьЗаполнениеНастроекФХЖ2()
	
	ЗаполненоКорректно = Истина;	
	
	ШаблонСообщения = "Не заполнена колонка ""%1"" в строке ""%2"" списка ""%3""";
	СинонимТЧФХЖ2 = Метаданные.НайтиПоТипу(ТипЗнч(ИнформационныеПоляФХЖ2)).Синоним;
	
	Для каждого НастройкаФХЖ2 Из ИнформационныеПоляФХЖ2 Цикл
		
		Если НастройкаФХЖ2.Использовать И Не ЗначениеЗаполнено(НастройкаФХЖ2.Формула) Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, "Формула", НастройкаФХЖ2.НомерСтроки, СинонимТЧФХЖ2);
			
			ПутьКРеквизиту = ПутьКТабличнойЧасти("ИнформационныеПоляФХЖ2", НастройкаФХЖ2.НомерСтроки, "Формула");							
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПутьКРеквизиту);							
															
			ЗаполненоКорректно = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗаполненоКорректно;
	
КонецФункции

Функция ПутьКТабличнойЧасти(Знач ИмяТабличнойЧасти, Знач НомерСтроки, Знач ИмяРеквизита) Экспорт

	Возврат ИмяТабличнойЧасти + "[" + Формат(НомерСтроки - 1, "ЧН=0; ЧГ=0") + "]." + ИмяРеквизита;

КонецФункции

#КонецОбласти

#КонецЕсли
