
#Область ПрограммныйИнтерфейс

// Отправляет в СФЕРА Курьер подписанные ИОП
//
// Параметры:
//	АдресДанныхВХранилище - Адрес временного хранилища с массивом подготовленных структур 
//                          	* ИдРодительскойКвитанции - идентификатор квитанции, в ответ на которую сформировано ИОП; 
//                          	* ПодписанныеДанныеКвитанции - SignedContent ИОП
//	ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации
//
// Возвращаемое значение:
//	Ответ - структура ответа
//	
Функция ОтправитьМассивИОП(АдресДанныхВХранилище, ПараметрыАвторизации) Экспорт
	
	Перем Ответ;
	Перем МассивИОП, ИОП, ОтправкаКвитанции;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Добавление ИОП");
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Отправка ИОП");
	
	МассивИОП = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	Для каждого ИОП Из МассивИОП Цикл
		
		ОтправкаКвитанции = ККСНГ_APIКурьер.v1_TicketAdd(ПараметрыАвторизации, ИОП.ИдРодительскойКвитанции, ИОП.ПодписанныеДанныеКвитанции);
		Ответ.Успех = ОтправкаКвитанции.Успех;
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтправкаКвитанции.Журнал, Ложь);
		
	КонецЦикла;
		
	Возврат Ответ;
	
КонецФункции

// Формирует массив ИОП для всех требующих ответа квитанций по списку документов
//
// Параметры:
//	ДанныеЭД - Массив - Данных документов, для которых требуется подписать квитанции
//		Структура:
//        * ИдДокумента - Строка - Идентификатор ЭД (Id)
//		  * ЭтоРоуминг - Булево - Признак ЭД "Роуминг" (IsRoaming)
//	АдресДанныхВХранилище - Адрес временного хранилища для помещения массива структур 
// 							(ИдРодительскойКвитанции - идентификатор квитанции, в ответ 
//							на которую сформировано ИОП, ИОП - FileContent ИОП)  
//	ПараметрыАвторизации - Структура - Параметры авторизации в сервисе Курьер)  
//
// Возвращаемое значение:
//	Ответ - структура ответа
//
Функция СформироватьИОППоДокументамДляПодписания(МассивДокументов, АдресДанныхВХранилище, ПараметрыАвторизации) Экспорт
	
	Перем ДанныеПодписанта;
	
	МассивИОП = Новый Массив;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Формирование ИОП по документу для подписания");
	
	Для каждого ДанныеЭД Из МассивДокументов Цикл
		
		РеквизитыДокумента = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииИКонтрагентаДокумента(ДанныеЭД.ЭДСсылка);
		
		ЗапросНеподписанныхКвитанций = ПолучитьИдНеподписанныхКвитанций(ДанныеЭД.ИдДокумента, ДанныеЭД.ЭтоРоуминг, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросНеподписанныхКвитанций.Журнал, Ложь);
		
		Если ЗапросНеподписанныхКвитанций.Успех Тогда
			
			Ответ.Успех = Истина;
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Формирование ИОП");
			
			Для каждого ИдКвитанции Из ЗапросНеподписанныхКвитанций.Результат Цикл
				
				ОтветИОП = ККСНГ_APIКурьер.v1_TicketCreateReply(ПараметрыАвторизации, ИдКвитанции);
				Если ОтветИОП.Успех Тогда
					FileContent = ОтветИОП.Результат;
					МассивИОП.Добавить(Новый Структура("ИдРодительскойКвитанции, ИОП, РеквизитыДокумента", ИдКвитанции, FileContent, РеквизитыДокумента));
				Иначе
					ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветИОП.Журнал, Ложь);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Результат = ПоместитьВоВременноеХранилище(МассивИОП, АдресДанныхВХранилище);
	
	Возврат Ответ;
	
КонецФункции

// Формирует массив Ид всех требующих ответа квитанций докуманта
//
// Параметры:
//	ИдДокумента - ид документа, по которому проверяется необходимость подписания квитанций
//	ПрофильЭДООрганизации - СправочникСсылка.ККСНГ_Организации
//
// Возвращаемое значение:
//	Ответ - структура ответа (Результат - массив ид квитанций)
//
Функция ПолучитьИдНеподписанныхКвитанций(ИдДокумента, ЭтоРоуминг, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение неподписанных квитанций по документу");
	
	ЗапросКвитанций = ККСНГ_ДокументооборотВызовСервера.ПолучитьСписокКвитанцийПоДокументуИзКурьера(ИдДокумента, ПараметрыАвторизации);
	
	Если ЗапросКвитанций.Успех Тогда
		
		КвитанцииКурьер = ЗапросКвитанций.Результат.TicketDetails;
		КвитанцииТаблица = ПолучитьТаблицуКвитанций(КвитанцииКурьер, ЭтоРоуминг, ПараметрыАвторизации);
		МассивИдКвитанцийИОП = ПолучитьКвитанцииИОП(КвитанцииТаблица);
		
		Ответ.Успех = Истина; 
		Ответ.Результат = МассивИдКвитанцийИОП;
		
	Иначе
		// не получили общий список квитанций
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросКвитанций.Журнал, Ложь);
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Отправка квитанции ответа в СФЕРА Курьер
//  См. https://confluence.esphere.ru/display/SBER/Ticket.CreateReply
//
// Параметры:
//  КвитанцияСсылка		 - 			 - Ссылка ККСНГ_ЭлектронныеДокументы
//  ПараметрыАвторизации - Структура - содержит:
//  * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//  * AuthToken         - Строка - авторизационный токен доступа к API,
//  * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при
//  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//  MchdData			 - Структура - см.https://confluence.esphere.ru/display/SBER/MchdData 			 -
// 
// Возвращаемое значение:
//  Строка, адрес - хранилища ответа в виде Структура idКвитанции, FileContent
//
Функция СформироватьОтветнуюКвитанциюНаСервере(КвитанцияСсылка, ПараметрыАвторизации, MchdData = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Формирование ответной квитанции в сервисе ЭДО");
	
	id = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КвитанцияСсылка, "id", Истина);
	
	ЗапросФормированиеКвитанции = ККСНГ_APIКурьер.v1_TicketCreateReply(ПараметрыАвторизации, id, MchdData);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросФормированиеКвитанции.Журнал, Ложь);
	Если ЗапросФормированиеКвитанции.Успех Тогда
		FileContent = ЗапросФормированиеКвитанции.Результат; // FileContent
		ДанныеОтвета = Новый Структура("idКвитанции, FileContent", id, FileContent);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеОтвета);
		Ответ.Успех = Истина;
		Ответ.Результат = АдресВХранилище;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Отправка квитанции в СФЕРА Курьер
// См. https://confluence.esphere.ru/display/SBER/Ticket.Add
//
// Параметры:
//	idКвитанции            - Число 
//	КвитанцияСсылка        - Ссылка ККСНГ_ЭлектронныеДокументы
//  ПрофильЭДООрганизации  - СправочникСсылка.ККСНГ_Организации, организация-отправитель
//	ПараметрыАвторизации   - Структура - содержит:
//     * СпособАвторизации - ПеречислениеСсылка.ККСНГ_СпособыАвторизацииКурьер
//     * AuthToken         - Строка - авторизационный токен доступа к API,
//     * КонтекстТокена    - Структура - см. ККСНГ_VPNKeyTLSКлиент.ИнициализироватьКонтекст используется при 
//									  СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ТокенСбербанка
//	АдресДанныхВХранилище  - Строка
//
// Возвращаемое значение:
//	 Структура
//    * ОсновнойДокумент
//    * ОтветнаяКвитанция
//    * Квитанция
//
Функция ОтправитьКвитанциюНаСервере(idКвитанции, КвитанцияСсылка, ПрофильНастройкиЭДО, АдресДанныхВХранилище, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Добавление квитанции в сервис ЭДО");
	ПодписанныеДанныеКвитанции = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);

	ЗапросОтправитьКвитанцию = ККСНГ_APIКурьер.v1_TicketAdd(ПараметрыАвторизации, idКвитанции, ПодписанныеДанныеКвитанции);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросОтправитьКвитанцию.Журнал, Ложь);
	
	Если Не ЗапросОтправитьКвитанцию.Успех Тогда  // если квитанция такого типа уже добавлена?
		Возврат Ответ; 
	КонецЕсли;
	
	// получить id квитанции
	ЗапросИдентификаторКвитанции = ККСНГ_APIКурьер.v1_TicketGetTicketIdList(ПараметрыАвторизации, ПодписанныеДанныеКвитанции.FileName);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросИдентификаторКвитанции.Журнал, Ложь);
	
	Если ЗапросИдентификаторКвитанции.Успех Тогда
		МассивИдентификаторов = ЗапросИдентификаторКвитанции.Результат.long;
		Если МассивИдентификаторов.Количество() = 1 Тогда
			ИдентификаторКвитанции = ЗапросИдентификаторКвитанции.Результат.long[0];					
			ОсновнойДокумент = ПолучитьОсновнойДокументПоТранспортномуДокументу(КвитанцияСсылка);
			ЗаписьКвитанции = ККСНГ_ДокументооборотВызовСервера.ЗаписатьКвитанциюПоДаннымИзКурьера(ИдентификаторКвитанции, ОсновнойДокумент, ПараметрыАвторизации);				
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьКвитанции.Журнал, Ложь);
			
			Если ЗаписьКвитанции.Успех Тогда						
				// TODO сделать нормально 
				// изменяем статус квитанции на отвеченную
				Попытка
					ТранспортныйДокументОбъект = КвитанцияСсылка.ПолучитьОбъект();	
					ТранспортныйДокументОбъект.NeedReply = Ложь;
					ТранспортныйДокументОбъект.Записать();
				Исключение
					ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ОписаниеОшибки());
				КонецПопытки;						
				Результат = Новый Структура("ОсновнойДокумент, ОтветнаяКвитанция, Квитанция", ОсновнойДокумент, ЗаписьКвитанции.Результат, КвитанцияСсылка);
				Ответ.Результат = Результат;
				Ответ.Успех = Истина;						
			КонецЕсли;
			
		КонецЕсли;			
	КонецЕсли;	
		
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОсновнойДокументПоТранспортномуДокументу(ТранспортныйДокумент)
	
	ТипЗнчТранспортногоДокумента = ТипЗнч(ТранспортныйДокумент);
	
	Если ТипЗнчТранспортногоДокумента = Тип("СправочникСсылка.ККСНГ_ЭлектронныеДокументы") Тогда
		Возврат ТранспортныйДокумент;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТранспортныйДокумент, "Владелец", Истина);
	КонецЕсли; 
	
КонецФункции

Функция ТребуетсяИОП(Type)
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ВРег("Invoice"));
	МассивТипов.Добавить(ВРег("CorrectionInvoice"));
	МассивТипов.Добавить(ВРег("UpdInvoice"));
	МассивТипов.Добавить(ВРег("UpdInvoiceSellerInfo"));
	МассивТипов.Добавить(ВРег("UpdCorrectionInvoice"));
	МассивТипов.Добавить(ВРег("UpdCorrectionInvoiceSellerInfo"));
	
	Возврат МассивТипов.Найти(ВРег(СокрЛП(Type))) <> Неопределено;
	
КонецФункции

Функция ПолучитьТаблицуКвитанций(КвитанцииСписок, ЭтоРоуминг, ПараметрыАвторизации)
	
	КвитанцииТаблица = Новый ТаблицаЗначений;
	КвитанцииТаблица.Колонки.Добавить("Id");
	КвитанцииТаблица.Колонки.Добавить("Type");
	КвитанцииТаблица.Колонки.Добавить("NeedReply");
	КвитанцииТаблица.Колонки.Добавить("Uuid");
	КвитанцииТаблица.Колонки.Добавить("ParentUuid");
	КвитанцииТаблица.Колонки.Добавить("Direction");
	
	Для Каждого КвитанцияОписание Из КвитанцииСписок Цикл
		
		КвитанцияСтрока = КвитанцииТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(КвитанцияСтрока, КвитанцияОписание);
		
		// Для основного документа в роуминге получаем признак NeedReply отдельно
		Если ЭтоРоуминг И КвитанцияОписание.Type = "Document" Тогда
			ЗапросКвитанцииDocument = ККСНГ_ДокументооборотВызовСервера.ПолучитьКвитанциюИзКурьера(КвитанцияОписание.Id, ПараметрыАвторизации);
			Если ЗапросКвитанцииDocument.Успех Тогда
				КвитанцияСтрока.NeedReply = ЗапросКвитанцииDocument.Результат.NeedReply;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат КвитанцииТаблица;
	
КонецФункции

Функция ПолучитьКвитанцииИОП(Квитанции)
	
	МассивИдКвитанцийИОП = Новый Массив;
	
	Для Каждого Квитанция Из Квитанции Цикл
		
		Если Квитанция.NeedReply = Истина Или ТребуетсяИОП(Квитанция.Type) Тогда
			
			Uuid = Квитанция.Uuid;
			
			НайдИОП = Квитанции.НайтиСтроки(Новый Структура("ParentUuid, Direction", Uuid, "Out"));
			
			Если НайдИОП.Количество() = 0 Тогда
				МассивИдКвитанцийИОП.Добавить(Квитанция.Id);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивИдКвитанцийИОП;
	
КонецФункции

#КонецОбласти 