
#Область ПрограммныйИнтерфейс

// Не используется, проверяет необходимость открытия формы установки безопасного режима
//
// Параметры:
//	Отказ       - Булево, Истина если необходимо настроить безопасный режим
//	ДанныеФормы - УФ
//
Процедура ПриОткрытииФормы(Отказ, ДанныеФормы) Экспорт 
	
	Если ККСНГ_РасширенияКлиент.НужноДонастроитьРасширения() Тогда
		Отказ = Истина;
		ПодключитьОбработчикОжидания("ОткрытьФормуПроверкиБезопасногоРежима", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
