
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.УсловиеОтбора) = Тип("ХранилищеЗначения") Тогда
		УсловиеОтбора = Параметры.УсловиеОтбора.Получить();
	КонецЕсли;	
	
	АдресСхемыКомпоновки = Параметры.АдресСхемыКомпоновки;
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникНастроек);	
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
		
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		ВосстановитьЗначениеНастроек(УсловиеОтбора);	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	НастройкиОтбора = ПолучитьНастройкиОтбора();
	Закрыть(НастройкиОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьЗначениеНастроек(УсловиеОтбора)
			
	Попытка
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(УсловиеОтбора);
	Исключение
		
		ОписаниеОшибки = "Не удалось восстановить настройку отбора. " + ОписаниеОшибки();
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьНастройкиОтбора()
	
	НастройкиОтбора = Новый Структура;
	НастройкиОтбора.Вставить("УсловиеПредставление", Строка(КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор));
	НастройкиОтбора.Вставить("УсловиеЗначение", Новый ХранилищеЗначения(КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки()));
	
	Возврат НастройкиОтбора;
	
КонецФункции	

#КонецОбласти