
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаДопустимыхФорматов = ПолучитьНастройкиФорматовОтправкиТабличногоДокумента();
		
	// Заполнение списка форматов.
	Для Каждого ФорматОтправки Из ТаблицаДопустимыхФорматов Цикл
		ДоступныеФорматыОтправки.Добавить(Строка(ФорматОтправки.ТипФайлаТабличногоДокумента), ФорматОтправки.Представление, Ложь, ФорматОтправки.Картинка);
	КонецЦикла;
	
	Если ДоступныеФорматыОтправки.Количество() Тогда
		ДоступныеФорматыОтправки[0].Пометка = Истина; // По умолчанию выбран только первый формат из списка.
		
	КонецЕсли;
	
	// Заполнение списка доступных неструктурированных типов документов.
	ТипДокументаСписокВыбора = Элементы.ТипДокумента.СписокВыбора;
	СписокНеструктурированныхТипов = Параметры.СписокНеструктурированныхТипов;	
	
	Для каждого ТекТип Из СписокНеструктурированныхТипов Цикл
		ТипДокументаСписокВыбора.Добавить(ТекТип.Значение, ТекТип.Представление);
	КонецЦикла;

	ИмяОбъектаМетаданных = Параметры.ИмяОбъектаМетаданных;
	
	Если НЕ ТаблицаДопустимыхФорматов.Количество() Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения списка допустимых форматов для печатных форм.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	НастроитьДоступностьУпаковатьВАрхив();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ФорматыОтправкиИзНастроек = Настройки["ДоступныеФорматыОтправки"];
	Если ФорматыОтправкиИзНастроек <> Неопределено Тогда
		Для Каждого ДоступныйФормат Из ДоступныеФорматыОтправки Цикл 
			ФорматИзНастроек = ФорматыОтправкиИзНастроек.НайтиПоЗначению(ДоступныйФормат.Значение);
			Если ФорматИзНастроек <> Неопределено Тогда
				ДоступныйФормат.Пометка = ФорматИзНастроек.Пометка;
			КонецЕсли;
		КонецЦикла;
		Настройки.Удалить("ДоступныеФорматыОтправки");
	КонецЕсли;
	
	ТипыДокументовИзНастроек = Настройки["ТипыДокументовОбъектовМетаданных"];
	Если ТипыДокументовИзНастроек <> Неопределено Тогда
		ВыбранныйДляОбъектаТип = ТипыДокументовИзНастроек.Получить(ИмяОбъектаМетаданных);
		Если ВыбранныйДляОбъектаТип <> Неопределено
			И Элементы.ТипДокумента.СписокВыбора.НайтиПоЗначению(ВыбранныйДляОбъектаТип) <> Неопределено Тогда
			ТипДокумента = ВыбранныйДляОбъектаТип;
		КонецЕсли;
	КонецЕсли;
	Если Настройки["ТипДокумента"] <> Неопределено Тогда
		Настройки.Удалить("ТипДокумента");
	КонецЕсли;
	АдресТиповДокументовИзНастроек = ПоместитьВоВременноеХранилище(ТипыДокументовИзНастроек, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Если ЭтоАдресВременногоХранилища(АдресТиповДокументовИзНастроек) Тогда
		ТипыДокументовИзНастроек = ПолучитьИзВременногоХранилища(АдресТиповДокументовИзНастроек);
	КонецЕсли;	

	Если ТипыДокументовИзНастроек = Неопределено Тогда
		ТипыДокументовИзНастроек = Новый Соответствие;
	КонецЕсли;
	Если Не ПустаяСтрока(ТипДокумента) Тогда 
		ТипыДокументовИзНастроек.Вставить(ИмяОбъектаМетаданных, ТипДокумента); 
	КонецЕсли;
	Настройки["ТипыДокументовОбъектовМетаданных"] = ТипыДокументовИзНастроек;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоступныеФорматыОтправкиПометкаПриИзменении(Элемент)
	
	НастроитьДоступностьУпаковатьВАрхив();
	Если Не Элементы.УпаковатьВАрхив.Доступность Тогда
		УпаковатьВАрхив = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	Если ПустаяСтрока(ТипДокумента) Тогда
		
		ТекстСообщения = НСтр("ru = 'Выберите, пожалуйста, тип отправляемого документа в сервисе.'");
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ТипДокумента", , Отказ);
		
	КонецЕсли;
	
	ФорматыОтправки = ВыбранныеФорматы();
	
	Если ФорматыОтправки.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Выберите, пожалуйста, хотя бы один из предложенных форматов.'");
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ДоступныеФорматыОтправкиПометка", , Отказ);
	
	КонецЕсли;
	
	Если Не Отказ Тогда 
		
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("ТипДокумента", ТипДокумента);
		РезультатВыбора.Вставить("УпаковатьВАрхив", УпаковатьВАрхив);
		РезультатВыбора.Вставить("ФорматыОтправки", ФорматыОтправки);
		РезультатВыбора.Вставить("ПереводитьИменаФайловВТранслит", ПереводитьИменаФайловВТранслит);
		
		ОповеститьОВыборе(РезультатВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьДоступностьУпаковатьВАрхив()
	
	Элементы.УпаковатьВАрхив.Доступность = ВыбранныеФорматы().Количество() < 2;
		
КонецПроцедуры

&НаКлиенте
Функция ВыбранныеФорматы()
	
	ФорматыОтправки = Новый Массив;
	
	Для Каждого ДоступныйФормат Из ДоступныеФорматыОтправки Цикл
		Если ДоступныйФормат.Пометка Тогда
			ФорматыОтправки.Добавить(ДоступныйФормат.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФорматыОтправки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкиФорматовОтправкиТабличногоДокумента()
	
	ТаблицаФорматов = Новый ТаблицаЗначений;
	
	МодульУправленияПечатью = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("УправлениеПечатью", Ложь);
	
	Если МодульУправленияПечатью <> Неопределено Тогда
		
		Попытка
			ТаблицаФорматов = МодульУправленияПечатью.НастройкиФорматовСохраненияТабличногоДокумента();	
		Исключение
			ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить допустимые форматы сохранения печатных форм.");
			
		КонецПопытки;	
		
	КонецЕсли;
		
	ОчиститьНедопустимыеФорматыСохраненияПечатныхФорм(ТаблицаФорматов, "pdf,xls,xlsx,ods,docx");
			
	Возврат ТаблицаФорматов;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьНедопустимыеФорматыСохраненияПечатныхФорм(ТаблицаФорматов, ДопустимыеФорматыСтрокой = "")
	
	Если НЕ ТипЗнч(ТаблицаФорматов) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
		
	МассивФорматов = СтрРазделить(ДопустимыеФорматыСтрокой, ",");
	
	Если ТаблицаФорматов.Колонки.Найти("Расширение") <> Неопределено 
		И МассивФорматов.Количество() Тогда
		
		МассивСтрокиКУдалению = Новый Массив;
		
		Для каждого СтрокаФормата Из ТаблицаФорматов Цикл
			
			ТекущийТип = Нрег(СокрЛП(СтрокаФормата.Расширение));
			
			Если МассивФорматов.Найти(ТекущийТип) = Неопределено Тогда
				МассивСтрокиКУдалению.Добавить(СтрокаФормата);
				
			КонецЕсли;
			
		КонецЦикла;
				
		Для каждого ЭлементКУдалению Из МассивСтрокиКУдалению Цикл
			ТаблицаФорматов.Удалить(ЭлементКУдалению);	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
