
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекущееСостояние();
	
	Если ЭтотОбъект.ТребуетсяУстановка Тогда
		
		ОбновитьМодули(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьМодули(Команда)
	
	ЭтотОбъект.ИдетУстановка = Истина;
	ЭтотОбъект.ЕстьОшибки = Ложь;
	ЭтотОбъект.Состояние = "Пожалуйста, подождите...";
	ОбновитьОтображениеФормы();
	
	ПодключитьОбработчикОжидания("УстановитьРасширения", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить(Команда)
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОпределитьТекущееСостояние()
	
	ЭтотОбъект.МодульОтключен = Ложь;
	ЭтотОбъект.НеобходимаПерезагрузка = Ложь;
	ЭтотОбъект.ИдетУстановка = Ложь;
	
	ЭтотОбъект.РезультатПроверки = ККСНГ_ПодключаемыеМодулиВызовСервера.ПроверитьНеобходимостьОбновленияПодключаемыхМодулей();
	ЭтотОбъект.ТребуетсяУстановка = ЭтотОбъект.РезультатПроверки.ПодключаемыеМодулиДляУстановки.Количество();
	
	Если ЭтотОбъект.ТребуетсяУстановка Тогда
		
		Если ЭтотОбъект.СчетчикПопыток = 0 Тогда
			ЭтотОбъект.Состояние = "Для работы требуется обновить подключаемый модуль.";
		Иначе
			ЭтотОбъект.Состояние = "Необходимо запустить обновление повторно.";
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.РезультатПроверки.Отключено Тогда
		
		ЭтотОбъект.МодульОтключен = Истина;
		ЭтотОбъект.Состояние = "Модуль отключен." + Символы.ПС + "Чтобы продолжить работу необходимо установить для модуля флаг ""Активно"" в конфигураторе.";
		
	ИначеЕсли ЭтотОбъект.РезультатПроверки.НеобходимаПерезагрузка Тогда
		
		ЭтотОбъект.НеобходимаПерезагрузка = Истина;
		ЭтотОбъект.Состояние = "Подготовка модулей завершена." + Символы.ПС + "Чтобы продолжить работу с учетом сделанных изменений, необходимо перезапустить программу.";
		
	ИначеЕсли Не ЭтотОбъект.РезультатПроверки.ПоддерживаемаяКонфигурация Тогда
		
		ЭтотОбъект.ЕстьОшибки = Истина;
		ЭтотОбъект.ОписаниеОшибки = "Данная конфигурация не поддерживается!";
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
	Если ЭтотОбъект.ЕстьОшибки Тогда
		ЭтотОбъект.Состояние = "В ходе выполнения возникли ошибки.";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеФормы()
	
	ЭтотОбъект.Элементы.КнопкаОбновитьМодули.Видимость = Ложь;
	ЭтотОбъект.Элементы.ОписаниеОшибки.Видимость = Ложь;
	ЭтотОбъект.Элементы.КнопкаПерезапустить.Видимость = Ложь;
	ЭтотОбъект.Элементы.ОписаниеОшибки.Заголовок = ЭтотОбъект.ОписаниеОшибки;
	ЭтотОбъект.Элементы.Состояние.Заголовок = ЭтотОбъект.Состояние;
	
	Если ЭтотОбъект.ТребуетсяУстановка Тогда
		
		ЭтотОбъект.Элементы.КнопкаОбновитьМодули.Видимость = Не ЭтотОбъект.ИдетУстановка;
		ЭтотОбъект.Элементы.УстановкаКартинка.Картинка = БиблиотекаКартинок.ККСНГ_Внимание;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ИдетУстановка Тогда
		
		ЭтотОбъект.Элементы.УстановкаКартинка.Картинка = БиблиотекаКартинок.ККСНГ_ДлительнаяОперация;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ЕстьОшибки Тогда
		
		ЭтотОбъект.Элементы.УстановкаКартинка.Картинка = БиблиотекаКартинок.ККСНГ_Ошибка;
		ЭтотОбъект.Элементы.ОписаниеОшибки.Видимость = Истина;
		
	КонецЕсли;
	
	Если ЭтотОбъект.НеобходимаПерезагрузка Тогда
		
		ЭтотОбъект.Элементы.КнопкаПерезапустить.Видимость = Истина;
		ЭтотОбъект.Элементы.УстановкаКартинка.Картинка = БиблиотекаКартинок.ККСНГ_Внимание;
		
	КонецЕсли;
	
	Если ЭтотОбъект.МодульОтключен Тогда
		
		Элементы.УстановкаКартинка.Картинка = БиблиотекаКартинок.ККСНГ_Внимание;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущееСостояние()
	
	ОпределитьТекущееСостояние();
	ОбновитьОтображениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширения()
	
	ЭтотОбъект.СчетчикПопыток = ЭтотОбъект.СчетчикПопыток + 1;
	
	ЭтотОбъект.ПодключитьОбработчикОжидания("ОбновитьТекущееСостояние", 0.1, Истина);
	РезультатОбновления = ККСНГ_ПодключаемыеМодулиВызовСервера.УстановитьОбновитьПодключаемыеМодули(ЭтотОбъект.РезультатПроверки.ПодключаемыеМодулиДляУстановки);
	
	ЭтотОбъект.ЕстьОшибки = Не РезультатОбновления.Успех;
	
	Если ЭтотОбъект.ЕстьОшибки Тогда
		
		ЭтотОбъект.ОписаниеОшибки = РезультатОбновления.ОписаниеОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

