
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ Отказ

		И ЗначениеЗаполнено(Объект.Организация)
		И НЕ ККСНГ_ОбщегоНазначенияВызовСервера.ОрганизацияДоступнаПользователю(Объект.Организация) Тогда
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьНавигационнуюСсылкуВложенногоФайла(Объект.Ссылка, ИмяВложенногоФайла, НавигационнаяСсылкаВложенногоФайла);
	ЗаполнитьСписокДокументовУчета();
	ОбновитьДоступностьЭлементовФормы();

	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ПолучитьМассивЭПОбъектаЭДОЗавершение", ЭтотОбъект);
	ККСНГ_ЭлектронныеДокументыКлиент.ПолучитьМассивЭПОбъектаЭДОНаКлиенте(ОписаниеОповещенияЗавершения, Объект.Ссылка, Объект.Type);

	ЭтотОбъект.Заголовок = ККСНГ_ЭлектронныеДокументыКлиент.СформироватьЗаголовокЭлектронногоДокумента(Объект.DocumentTypeCode, 
															Объект.TypeName, Объект.Number, Объект.Date);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыУчета

&НаКлиенте
Процедура ДокументыУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если (Поле = Элементы.ДокументыУчетаДокумент) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьВложенныйФайл(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСохраненияФайлов", ЭтотОбъект);

	Файл = Новый ОписаниеПередаваемогоФайла(ИмяВложенногоФайла, НавигационнаяСсылкаВложенногоФайла);

	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Файл);

	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);

	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДиалогОткрытияФайла, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьМассивЭПОбъектаЭДОЗавершение(МассивЭП, ДопПараметры) Экспорт

	ККСНГ_ЭлектронныеДокументыКлиент.ЗаполнитьТаблицуПодписиНаФорме(ТаблицаПодписи, МассивЭП);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЭлементовФормы()

	ЭтотОбъект.ТолькоПросмотр = Истина;

	Элементы.ГруппаДокументыУчета.Доступность = (ДокументыУчета.Количество() > 0);
	Элементы.ГруппаКомментарий.Доступность = ЗначениеЗаполнено(Объект.Comment);
	Элементы.ГруппаПричинаОтзыва.Доступность = ЗначениеЗаполнено(Объект.RevokeReason);
	Элементы.ГруппаПричинаОтклонения.Доступность = ЗначениеЗаполнено(Объект.RejectReason);
	Элементы.КомандаСохранитьВложенныйФайл.Доступность = Не ПустаяСтрока(НавигационнаяСсылкаВложенногоФайла);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументовУчета()

	ДокументыУчета.Очистить();

	ЗапросДокументов = РегистрыСведений.ККСНГ_СвязанныеДокументы.НайтиЗаписи(Объект.Ссылка);
	
	Если ЗапросДокументов.Успех Тогда
		Для Каждого Документ Из ЗапросДокументов.Результат Цикл
			НоваяСтрока = ДокументыУчета.Добавить();
			НоваяСтрока.Документ = Документ.СвязанныйДокумент;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНавигационнуюСсылкуВложенногоФайла(Ссылка, ИмяВложенногоФайла, НавигационнаяСсылкаВложенногоФайла)

	НавигационнаяСсылкаВложенногоФайла = "";
	ИмяВложенногоФайла = "";

	Если ЗначениеЗаполнено(Ссылка) Тогда

		ВложенныйФайл = Справочники.ККСНГ_ПрисоединенныеФайлы.НайтиПоРеквизиту("Id", 0, , Ссылка);
		Если ЗначениеЗаполнено(ВложенныйФайл) Тогда
			НавигационнаяСсылкаВложенногоФайла = ПолучитьНавигационнуюСсылку(ВложенныйФайл, "Content");
			ИмяВложенногоФайла = ВложенныйФайл.Filename;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохраненияФайлов(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если (ТипЗнч(ПолученныеФайлы) = Тип("Массив")) Тогда
		ПоказатьОповещениеПользователя("Файл успешно сохранен на диске.");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти