#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтправленныеСОшибками = Неопределено;
	Параметры.Свойство("ОтправленныеСОшибками", ОтправленныеСОшибками);
	
	Для Каждого ТекСтрока Из ОтправленныеСОшибками Цикл 
		
		НоваяСтрока = Получатели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		РеквизитыКонтрагента = ККСНГ_ОбщегоНазначенияВызовСервера.ЗначениеИмеющегосяРеквизитаОбъекта(НоваяСтрока.КонтрагентЭДО, "Контрагент.ИНН,Контрагент.КПП");
		
		НоваяСтрока.ИНН = РеквизитыКонтрагента.Получить("ИНН");
		НоваяСтрока.КПП = РеквизитыКонтрагента.Получить("КПП");
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
