
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыАвторизации = Неопределено;
	Параметры.Свойство("ПараметрыАвторизации", ПараметрыАвторизации);
	Параметры.Свойство("token", token);
	
	Если ЗначениеЗаполнено(token) 
		И ПараметрыАвторизации <> Неопределено Тогда
	    Параметры.Свойство("count", count);
		ОбновитьСписокСобытий();		
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьСобытия(Команда)
	
	ВыделенныеСтроки = Элементы.СписокСобытий.ВыделенныеСтроки;
	
	ИдентификаторыСобытий = Новый Массив;
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			СтрокаСобытие = СписокСобытий.НайтиПоИдентификатору(ИдентификаторСтроки);
			ИдентификаторыСобытий.Добавить(СтрокаСобытие.Id);	
		КонецЦикла; 
	ИначеЕсли ВыделенныеСтроки.Количество() = 1 Тогда 
		ТекущиеДанные = Элементы.СписокСобытий.ТекущиеДанные;
		ИдентификаторыСобытий.Добавить(ТекущиеДанные.Id);
	Иначе
		Возврат;
	КонецЕсли; 
	
	УдалитьСобытияНаСервере(ИдентификаторыСобытий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокСобытий()
	
	СписокСобытий.Очистить();
	
	РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionEvents(ПараметрыАвторизации, token, count);
	
	Если РезультатЗапроса.Успех Тогда			
		МассивСтруктурСобытие = РезультатЗапроса.Результат.DocumentEvent;
		
		Для каждого СтруктураСобытие Из МассивСтруктурСобытие Цикл
			НоваяСтрокаСобытие = СписокСобытий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСобытие, СтруктураСобытие);
		КонецЦикла; 
		СписокСобытий.Сортировать("Date Убыв");
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура УдалитьСобытияНаСервере(ИдентификаторыСобытий)
	
	Если ИдентификаторыСобытий.Количество() = 1 Тогда
		РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionDeleteEvent(ПараметрыАвторизации, token, ИдентификаторыСобытий[0]);	
	Иначе
		РезультатЗапроса = ККСНГ_APIКурьер.v2_SubscriptionDeleteEvents(ПараметрыАвторизации, token, ИдентификаторыСобытий);
	КонецЕсли;
	
	Если РезультатЗапроса.Успех Тогда
		ОбновитьСписокСобытий();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("События удалены");
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(РезультатЗапроса.Журнал, "-1");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
