#Область ПрограммныйИнтерфейс

&Вместо("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура ККСНГ_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды)
	
	Перем Команда;
	
	Команда = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИдентификаторКоманды, "Команда");
	Если ТипЗнч(Команда) <> Тип("Строка") Или Не СтрНачинаетсяС(Команда, "ККСНГ_") Тогда
		ПродолжитьВызов(ВнешняяОбработка, ИдентификаторКоманды);
		Возврат;
	КонецЕсли;
	
	Если СтрСравнить(Команда, "ККСНГ_ОбновлениеДанныхИзКурьераПоПодписке") = 0 Тогда
		ККСНГ_РегламентныеЗадания.ОбновлениеДанныхИзКурьераПоПодписке(ИдентификаторКоманды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти