
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьПараметры();
	Элементы.ГруппаСлужебныеНастройки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогВыгрузкиРасширенногоЭкспортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РежимВыбора = РежимДиалогаВыбораФайла.ВыборКаталога;     
	
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимВыбора); 
    ДиалогВыбора.Каталог = КаталогВыгрузкиРасширенногоЭкспорта; 
    ДиалогВыбора.МножественныйВыбор = Ложь;
    ДиалогВыбора.Заголовок = НСтр("ru = 'Выберите каталог выгрузки архивов документов'");  

	ПослеВыбораКаталога = Новый ОписаниеОповещения("ПослеВыбораКаталогаВыгрузкиРасширенногоЭкспорта", ЭтотОбъект);
	ДиалогВыбора.Показать(ПослеВыбораКаталога);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовРасширенногоЭкспортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПослеОтметки = Новый ОписаниеОповещения("ТипыДокументовРасширенногоЭкспортаПослеОтметки", ЭтотОбъект);
	ЗаголовокДиалога = НСтр("ru = 'Типы экспортируемых документов'");
	ТипыДокументовРасширенногоЭкспорта.ПоказатьОтметкуЭлементов(ПослеОтметки, ЗаголовокДиалога);

КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиРасширенногоЭкспортаПриИзменении(Элемент)
	КаталогВыгрузкиРасширенногоЭкспортаПриИзмененииНаСервере();
	Оповестить("ИзменениеНастройкиКаталогВыгрузкиРасширенногоЭкспорта");
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаРасширенногоЭкспортаПриИзменении(Элемент)
	ГруппировкаРасширенногоЭкспортаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовРасширенногоЭкспортаПриИзменении(Элемент)
	ТипыДокументовРасширенногоЭкспортаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтправкуЧерновиковПриИзменении(Элемент)
	ИспользоватьОтправкуЧерновиковПриИзмененииНаСервере();			
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьБизнесПроцессУВХДПриИзменении(Элемент)
	ИспользоватьБизнесПроцессУВХДПриИзмененииНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТестовыйРежимПриИзменении(Элемент)
	ИспользоватьТестовыйРежимПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьПодключаемыеМодулиПриИзменении(Элемент)
	ОбновлятьПодключаемыеМодулиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстаревшиеФорматыЭлектронныхДокументовРазрешеныПриИзменении(Элемент)
	 УстаревшиеФорматыЭлектронныхДокументовРазрешеныПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьПрокси(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ПараметрыПроксиСервера", , ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебныеНастройки(Команда)
	
	ЭтотОбъект.ПоказыватьСлужебныеНастройки = Не ЭтотОбъект.ПоказыватьСлужебныеНастройки;
	
	Элементы.ГруппаСлужебныеНастройки.Видимость = ЭтотОбъект.ПоказыватьСлужебныеНастройки;
	Элементы.КнопкаСлужебныеНастройки.Пометка = ЭтотОбъект.ПоказыватьСлужебныеНастройки;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьПараметры()

	ЭтотОбъект.КаталогВыгрузкиРасширенногоЭкспорта = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.КаталогВыгрузкиРасширенногоЭкспорта();
	ЭтотОбъект.ГруппировкаРасширенногоЭкспорта = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ГруппировкаРасширенногоЭкспорта();
	ЭтотОбъект.ТипыДокументовРасширенногоЭкспорта = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТипыДокументовРасширенногоЭкспорта();
	ЭтотОбъект.ИспользоватьОтправкуЧерновиков = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяОтправкаЧерновиков();
	ЭтотОбъект.ИспользоватьБизнесПроцессУВХД = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяБизнесПроцессУВХД();
	ЭтотОбъект.ИспользоватьТестовыйРежим = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ТестовыйРежим();
	ЭтотОбъект.НеОбновлятьПодключаемыеМодули = Не ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ОбновлятьПодключаемыеМодули();
	ЭтотОбъект.УстаревшиеФорматыЭлектронныхДокументовРазрешены = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.УстаревшиеФорматыЭлектронныхДокументовРазрешены();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаВыгрузкиРасширенногоЭкспорта(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		КаталогВыгрузкиРасширенногоЭкспорта = ВыбранныеФайлы[0];
		КаталогВыгрузкиРасширенногоЭкспортаПриИзмененииНаСервере();
		Оповестить("ИзменениеНастройкиКаталогВыгрузкиРасширенногоЭкспорта");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовРасширенногоЭкспортаПослеОтметки(Список, ДопПараметры) Экспорт
	
	Если Список <> Неопределено Тогда
		ТипыДокументовРасширенногоЭкспортаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КаталогВыгрузкиРасширенногоЭкспортаПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Настройки.УстановитьКаталогВыгрузкиРасширенногоЭкспорта(КаталогВыгрузкиРасширенногоЭкспорта);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе 
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;

	ЗагрузитьПараметры();
	
КонецПроцедуры

&НаСервере
Процедура ГруппировкаРасширенногоЭкспортаПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Настройки.УстановитьГруппировкуРасширенногоЭкспорта(ГруппировкаРасширенногоЭкспорта);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе 
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;

	ЗагрузитьПараметры();
	
КонецПроцедуры

&НаСервере
Процедура ТипыДокументовРасширенногоЭкспортаПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Настройки.УстановитьТипыДокументовРасширенногоЭкспорта(ТипыДокументовРасширенногоЭкспорта);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе 
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;

	ЗагрузитьПараметры();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьОтправкуЧерновиковПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Настройки.УстановитьИспользованиеОтправкиЧерновиков(ИспользоватьОтправкуЧерновиков);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;

	ЗагрузитьПараметры();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьБизнесПроцессУВХДПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Настройки.УстановитьИспользованиеБизнесПроцессаУВХД(ИспользоватьБизнесПроцессУВХД);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;

	ЗагрузитьПараметры();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьТестовыйРежимПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Служебный.УстановитьТестовыйРежим(ЭтотОбъект.ИспользоватьТестовыйРежим);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновлятьПодключаемыеМодулиПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Служебный.УстановитьОбновлениеПодключаемыхМодулей(Не ЭтотОбъект.НеОбновлятьПодключаемыеМодули);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстаревшиеФорматыЭлектронныхДокументовРазрешеныПриИзмененииНаСервере()
	
	ИзменениеНастройки = РегистрыСведений.ККСНГ_Служебный.РазрешитьУстаревшиеФорматыЭлектронныхДокументов(ЭтотОбъект.УстаревшиеФорматыЭлектронныхДокументовРазрешены);
	Если ИзменениеНастройки.Успех Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(ИзменениеНастройки.Журнал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти