
#Область ПрограммныйИнтерфейс

// Инфо по модулям решения 1С Адаптер
//
// Параметры:
//   нет
//
// Возвращаемое значение:
//  Структура
//   ИмяВСервисеОбновлений                 - Строка
//   ИмяРасширения                         - Строка
//   ИмяФайлаРасширения                    - Строка
//   ИмяМакетаНастройкиПодключаемыхМодулей - Строка
//
Функция ИнформацияОПродукте() Экспорт
	
	СтруктураПродукта = Новый Структура();
	
	Если РегистрыСведений.ККСНГ_Служебный.ОбновленияИзТестовогоРепозитория() Тогда
		СтруктураПродукта.Вставить("ИмяВСервисеОбновлений", 				"ККСНГ_Тестовый");
	Иначе				
		СтруктураПродукта.Вставить("ИмяВСервисеОбновлений", 				"ККСНГ_Курьер");		
	КонецЕсли;
	
	СтруктураПродукта.Вставить("ИмяРасширения",         				"ККСНГ_Курьер");
	СтруктураПродукта.Вставить("ИмяФайлаРасширения",					"ККСНГ_Курьер.cfe");
	СтруктураПродукта.Вставить("ИмяМакетаНастройкиПодключаемыхМодулей",	"ККСНГ_НастройкиПодключаемыхМодулей.mxl");
	
	Возврат СтруктураПродукта;
	
КонецФункции

// Проверка наличия обновления на сайте
// см. cnup
//
// Параметры:
//   РежимТест            - Булево
//
// Возвращаемое значение:
// см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//
Функция ПроверитьНаличиеОбновления(РежимТест = Ложь) Экспорт

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Проверка наличия обновлений ККСНГ_Курьер");
	
	ИнформацияОПродукте = ИнформацияОПродукте(); 
	
	ИмяРасширения           = ИнформацияОПродукте.ИмяРасширения;
	ИмяВСервисеОбновлений   = ИнформацияОПродукте.ИмяВСервисеОбновлений;
	ТекущаяВерсияРасширения = ПолучитьТекущуюВерсиюРасширения(ИмяРасширения);
		
	Если ЗначениеЗаполнено(ТекущаяВерсияРасширения) Тогда
		
		ПроверкаНаличияОбновления = UpdateExists(ИмяВСервисеОбновлений, ТекущаяВерсияРасширения, РежимТест);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПроверкаНаличияОбновления.Журнал, Ложь);
		Ответ.Успех         = ПроверкаНаличияОбновления.Успех;
		Ответ.Результат     = ПроверкаНаличияОбновления.Результат;
		
	Иначе 
		ТекстОшибки = "Не удалось найти обновляемое расширение %1.";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяРасширения);					
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00001");	
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Загрузка обновления с сайта
// см. downloadlastproduct
//
// Параметры:
//   РежимТест            - Булево
//
// Возвращаемое значение:
// см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//
Функция ЗагрузитьОбновление(РежимТест = Ложь) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Загрузка обновления ККСНГ_Курьер");
	
	ИнформацияОПродукте = ИнформацияОПродукте(); 
	
	ИмяРасширения = ИнформацияОПродукте.ИмяРасширения;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Имя", ИмяРасширения);

	ПроверкаОбновления = ПроверитьНаличиеОбновления();
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ПроверкаОбновления.Журнал, Ложь);
	
	Если ПроверкаОбновления.Успех Тогда
	
		ЗапросОбновления = GetLastUpdate(ИнформацияОПродукте.ИмяВСервисеОбновлений, РежимТест);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросОбновления.Журнал, Ложь);
		
		Если ЗапросОбновления.Успех Тогда
						  
			ЗапросФайловОбновления = ПакетОбновленияИзАрхива(ЗапросОбновления.Результат);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросФайловОбновления.Журнал, Ложь);
			
			Ответ.Результат = ЗапросФайловОбновления.Результат;
			Ответ.Успех     = ЗапросФайловОбновления.Успех;			
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

// Установка обновления
//
// Параметры:
//	ПакетОбновления  - Структура
//   * ИсторияВерсий      
//   * ОсновнойМодуль 
//   * НастройкиПодключаемыхМодулей 
//   РежимТест       - Булево
//
// Возвращаемое значение:
// см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета
//
Функция УстановитьОбновление(ПакетОбновления, РежимТест = Ложь) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Установка обновлений ККСНГ_Курьер");
	
	ИнформацияОПродукте = ИнформацияОПродукте();	
	ИмяРасширения = ИнформацияОПродукте.ИмяРасширения;
	ОсновноеРасширениеКонфигурации = ПолучитьРасширение(ИмяРасширения);	
	
	Если ОсновноеРасширениеКонфигурации <> Неопределено Тогда
		
		Если ТипЗнч(ПакетОбновления.ОсновнойМодуль) = Тип("ДвоичныеДанные") Тогда
			
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				ОсновноеРасширениеКонфигурации.Записать(ПакетОбновления.ОсновнойМодуль);
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ТекстОшибки = "Не удалось установить расширение %1. " + ОписаниеОшибки;
				ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяРасширения);					
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00002");
				Возврат Ответ;				
			КонецПопытки;
		
		Иначе
			ТекстОшибки = "Не удалось получить данные обновляемого расширения %1.";
			ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяРасширения);					
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00003");
			Возврат Ответ;
		КонецЕсли;
		
	Иначе
		ТекстОшибки = "Не удалось найти обновляемое расширение %1.";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяРасширения);					
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00004");
		Возврат Ответ;
	КонецЕсли;
	
	Если ПакетОбновления.НастройкиПодключаемыхМодулей <> Неопределено Тогда 
		
		ПодключаемыеМодулиДляУстановки = ПакетОбновления.НастройкиПодключаемыхМодулей.ПодключаемыеМодулиДляУстановки;
		УстановкаМодулей = ККСНГ_ПодключаемыеМодулиВызовСервера.УстановитьОбновитьПодключаемыеМодули(ПодключаемыеМодулиДляУстановки);
		
		Если НЕ УстановкаМодулей.Успех Тогда
			ТекстОшибки = УстановкаМодулей.ОписаниеОшибки;					
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;

	Ответ.Успех = Истина;
	Возврат Ответ;
	
КонецФункции
 
#Область ПрограммныйИнтерфейсФоновыхЗаданий

// Проверка наличия обновления с возвратом адреса результата
//
// Параметры:
//	АдресРезультата       - Строка - адрес хранилища загруженного обновления
//   РежимТест            - Булево
//
Процедура ПроверитьНаличиеОбновленияВФоновомЗадании(АдресРезультата, РежимТест = Ложь) Экспорт
	
	Ответ = ПроверитьНаличиеОбновления(РежимТест);
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);
	
КонецПроцедуры

// Загрузка обновления с возвратом адреса результата
//
// Параметры:
//	АдресРезультата       - Строка - адрес хранилища загруженного обновления
//   РежимТест            - Булево
//
Процедура ЗагрузитьОбновлениеВФоновомЗадании(АдресРезультата, РежимТест = Ложь) Экспорт
	
	Ответ = ЗагрузитьОбновление(РежимТест);
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область APIСервисаОбновлений

// Проверяет есть ли на сервисе новая версия продукта.
//
// Параметры:
//	ИмяПродукта 			- строка - Имя расширения.
//	ТекущаяВерсия			- строка - Версия утановленного расширения.
//	РежимТест				- булево - Признак загрузки тестового обновления.
//	Upd_AuthToken			- строка - Авторизационный токен.
//
// Возвращаемое значение: 
//	Результат 				- булево - Истина - на сервисе есть новая версия.
//
Функция UpdateExists(ИмяПродукта, ТекущаяВерсия, РежимТест = Ложь) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса();
	СтруктураЗапроса.Метод = "GET";
	ИмяМетода = "/cnup/" + ИмяПродукта + "/" + ТекущаяВерсия + "/" + ?(РежимТест, "ТЕСТОВЫЙ", "ПРОМЫШЛЕННЫЙ");
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + ИмяМетода;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, Тип("Булево"), "Вызов API сервиса обновлений: " + ИмяМетода);
	
КонецФункции

// Получает с сервиса обновлений двоичные данные zip архива актуальной версии продукта.
//
// Параметры:
//	ИмяПродукта 	- строка - Название продукта на сервисе.
//	РежимТест		- булево - Признак загрузки тестового обновления.
//	Upd_AuthToken		- строка - Авторизационный токен.
//
// Возвращаемое значение: 
//
//	АрхивОбновления 	- ДвоичныеДанные - zip архив актуальной версии продукта.
//
Функция GetLastUpdate(ИмяПродукта, РежимТест = Ложь) Экспорт

	СтруктураЗапроса = ПолучитьСтруктуруЗапроса();
	СтруктураЗапроса.Метод = "GET";
	ИмяМетода = "/downloadlastproduct/" + ИмяПродукта + "/" + ?(РежимТест, "ТЕСТОВЫЙ", "ПРОМЫШЛЕННЫЙ");
	СтруктураЗапроса.Адрес = СтруктураЗапроса.Адрес + ИмяМетода;

	Возврат ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, Тип("ДвоичныеДанные"), "Вызов API сервиса обновлений: " + ИмяМетода);
	
КонецФункции

#КонецОбласти

#Область ПакетОбновления

// Получение обновления
//
// Параметры:
//	ДДАрхиваОбновления       - Двоичные данные
//
// Возвращаемое значение:
//	Структура
//   * ИсторияВерсий      
//   * ОсновнойМодуль 
//   * НастройкиПодключаемыхМодулей 
//
Функция ПакетОбновленияИзАрхива(ДДАрхиваОбновления) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Загрузка обновления ККСНГ_Курьер");

	ПакетОбновления = Новый Структура;
	ПакетОбновления.Вставить("ИсторияВерсий", Неопределено);
	ПакетОбновления.Вставить("ОсновнойМодуль", Неопределено);
	ПакетОбновления.Вставить("НастройкиПодключаемыхМодулей", Неопределено); 
	
	ИмяКаталогаОбновления = ПолучитьИмяВременногоФайла();
		
	// 1. Распаковка архива
	ОбработкаРаспаковки = РаспаковатьАрхивОбновления(ДДАрхиваОбновления, ИмяКаталогаОбновления);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбработкаРаспаковки.Журнал, Ложь);
	Если Не ОбработкаРаспаковки.Успех Тогда
		УдалитьКаталогОбновления(ИмяКаталогаОбновления, Ответ.Журнал);
		Возврат Ответ;
	КонецЕсли;
	
	// 2. Получение двоичных данных основного модуля
	ОбработкаДвоичныхДанныхОсновногоМодуля = ПолучитьДвоичныеДанныеОсновногоМодуля(ИмяКаталогаОбновления);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбработкаДвоичныхДанныхОсновногоМодуля.Журнал, Ложь);
	Если Не ОбработкаДвоичныхДанныхОсновногоМодуля.Успех Тогда
		УдалитьКаталогОбновления(ИмяКаталогаОбновления, Ответ.Журнал);
		Возврат Ответ;
	КонецЕсли;
	ПакетОбновления.ОсновнойМодуль = ОбработкаДвоичныхДанныхОсновногоМодуля.Результат;
	
	// 3. История версий обновления
	ОбработкаИсторииВерсий = ПолучитьИсториюВерсий(ИмяКаталогаОбновления);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбработкаИсторииВерсий.Журнал, Ложь);
	Если ОбработкаИсторииВерсий.Успех Тогда		
		ПакетОбновления.ИсторияВерсий = ОбработкаИсторииВерсий.Результат;
	КонецЕсли;
	
	// 4. Настройки подключаемых модулей
	ОбработкаПолученияНастроек = ПолучитьНастройкиПодключаемыхМодулей(ИмяКаталогаОбновления);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбработкаПолученияНастроек.Журнал, Ложь);	
	Если ОбработкаПолученияНастроек.Успех Тогда
		ПакетОбновления.НастройкиПодключаемыхМодулей = ОбработкаПолученияНастроек.Результат;
	КонецЕсли; 
	
	// 4.1 Получение двоичных данных подключаемых модулей
	Если ПакетОбновления.НастройкиПодключаемыхМодулей <> Неопределено Тогда
		ЗапросДанныхПодключаемыхМодулей = ПолучитьДвоичныеДанныеПодключаемыхМодулей(ИмяКаталогаОбновления,
																					 ПакетОбновления.НастройкиПодключаемыхМодулей.ПодключаемыеМодулиДляУстановки);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросДанныхПодключаемыхМодулей.Журнал, Ложь);	
		Если Не ЗапросДанныхПодключаемыхМодулей.Успех Тогда
			УдалитьКаталогОбновления(ИмяКаталогаОбновления, Ответ.Журнал);
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
		
	УдалитьКаталогОбновления(ИмяКаталогаОбновления, Ответ.Журнал);
	
	Ответ.Результат = ПакетОбновления;
	Ответ.Успех = Истина;
		
	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область ОбработчикиОбновлений

// Устанавливает СпособАвторизации = ApiKey для пустых значений справочника ККСНГ_Организации
//
// Параметры:
//	нет
//
Процедура ОбновитьЭлементыСправочникаККСНГОрганизации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|ГДЕ
	|	ККСНГ_Организации.СпособАвторизации = ЗНАЧЕНИЕ(Перечисление.ККСНГ_СпособыАвторизацииКурьер.ПустаяСсылка)";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ApiKey;
			СправочникОбъект.Записать();
		Исключение
			Продолжить;	
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает значения по умолчанию реквизитов справочника ККСНГ_ЭлектронныеДокументы
//
// Параметры:
//	нет
//
Процедура ОбновитьЭлементыСправочникаККСНГЭлектронныеДокументы() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|ГДЕ
	|	ККСНГ_ЭлектронныеДокументы.ГУИД = """"";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Записать();
		Исключение
			Продолжить;	
		КонецПопытки;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|ГДЕ
	|	НЕ ККСНГ_ЭлектронныеДокументы.ЕстьМаркировка
	|	И ККСНГ_ЭлектронныеДокументы.СтатусЦРПТ <> -1";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.СтатусЦРПТ = -1;
			Объект.Записать();
		Исключение
			Продолжить;	
		КонецПопытки;
	КонецЦикла;
		
КонецПроцедуры

// Запускает ФЗ ОбновитьЭлементыСправочникаККСНГЭлектронныеДокументы()
//
// Параметры:
//	нет
//
Процедура ОбновитьЭлементыСправочникаККСНГЭлектронныеДокументыФоном() Экспорт
	
	Попытка
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ККСНГ_ОбщегоНазначенияВызовСервера.ОбновитьЭлементыСправочникаККСНГЭлектронныеДокументы", ,
													"992e266d-0dae-4884-9de5-b77638dc4594", "Обновление элементов справочника ККСНГ_ЭлектронныеДокументы");
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();	
	КонецПопытки;
		
КонецПроцедуры

// Проверяет необходимость обновления и обновляет список доступных действий для существующих документов
//
// Параметры:
//  нет
// 
//
Процедура ПроверитьИВыполнитьЗаполнениеДоступныхДействийДокументов() Экспорт
	
	Если Не РегистрыСведений.ККСНГ_Служебный.ОбновлятьДоступныеДействияДокументов() Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
		|ГДЕ
		|	НЕ ККСНГ_ЭлектронныеДокументы.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ККСНГ_ЭлектронныеДокументы.ЗаполнитьДоступныеДействияКурьер(ДокументОбъект);
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
		КонецЦикла;
				
		РегистрыСведений.ККСНГ_Служебный.УстановитьОбновлениеДоступныхДействийДокументовЗавершен(Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает значение реквизита "НаправлениеЭД" для элементов справочника "электронные документы"
//
// Параметры:
//	нет
//
Процедура ЗаполнитьНаправлениеЭД() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
		|ГДЕ
		|	ККСНГ_ЭлектронныеДокументы.НаправлениеЭД = &ПустоеНаправлениеЭД";
		
	Запрос.УстановитьПараметр("ПустоеНаправлениеЭД", ПредопределенноеЗначение("Перечисление.ККСНГ_НаправленияЭД.ПустаяСсылка"));	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.НаправлениеЭД = ?(ДокументОбъект.КодЭДОВладельца = ДокументОбъект.SellerCode, 
												Перечисления.ККСНГ_НаправленияЭД.Исходящий, 
														Перечисления.ККСНГ_НаправленияЭД.Входящий);
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ДокументОбъект.Записать();
			Исключение
				Продолжить;	
			КонецПопытки;	
		КонецЦикла;
	КонецЕсли;
	   
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Устанавливает значения по умолчанию для настроек
//
Процедура ЗаполнитьЗначенияНастроекПоУмолчанию() Экспорт
	
	СоответствияНастройкиЗначению = Новый Соответствие();
	СоответствияНастройкиЗначению.Вставить(РегистрыСведений.ККСНГ_Настройки.УИД_ИспользованиеБизнесПроцессаУВХД(), Истина);
	
	НастройкаПроксиСервераПоУмолчанию = Новый Соответствие;
	НастройкаПроксиСервераПоУмолчанию.Вставить("ИспользоватьПрокси", Ложь);
	НастройкаПроксиСервераПоУмолчанию.Вставить("Пользователь", "");
	НастройкаПроксиСервераПоУмолчанию.Вставить("Пароль", "");
	НастройкаПроксиСервераПоУмолчанию.Вставить("Сервер", "");
	НастройкаПроксиСервераПоУмолчанию.Вставить("Порт", "");
	НастройкаПроксиСервераПоУмолчанию.Вставить("ИспользоватьСистемныеНастройки", Ложь);
	НастройкаПроксиСервераПоУмолчанию.Вставить("ИспользоватьАутентификациюОС", Ложь);
	СоответствияНастройкиЗначению.Вставить(РегистрыСведений.ККСНГ_Настройки.УИД_НастройкаПроксиСервера(), НастройкаПроксиСервераПоУмолчанию);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого СоответствиеНастройкиЗначению Из СоответствияНастройкиЗначению Цикл
		ЗапросНаличиеНастройки = РегистрыСведений.ККСНГ_Настройки.ПроверитьНаличиеНастройки(СоответствиеНастройкиЗначению.Ключ);
		Если ЗапросНаличиеНастройки.Успех И Не ЗапросНаличиеНастройки.Результат Тогда
			РегистрыСведений.ККСНГ_Настройки.УстановитьЗначение(СоответствиеНастройкиЗначению.Значение, СоответствиеНастройкиЗначению.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновитьПовторноИспользуемыеЗначения();
		
КонецПроцедуры

// Выполняет заполнение регистра связанных документов в соответствии с новой структурой
//
Процедура ОбновитьДанныеСвязанныхДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ККСНГ_СвязанныеДокументы.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ИЗ
	|	РегистрСведений.ККСНГ_СвязанныеДокументы КАК ККСНГ_СвязанныеДокументы
	|ГДЕ
	|	ККСНГ_СвязанныеДокументы.Удалить_СвязанныйДокумент <> НЕОПРЕДЕЛЕНО
	|		ИЛИ ККСНГ_СвязанныеДокументы.КлючСтроки = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектронныйДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭлектронныйДокумент";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Попытка
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат;
	КонецПопытки;
		
	Пока ВыборкаДокументов.Следующий() Цикл
		
		НачатьТранзакцию();
	
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных();
			
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ККСНГ_СвязанныеДокументы");
			ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ВыборкаДокументов.ЭлектронныйДокумент);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
		
			НаборЗаписей = РегистрыСведений.ККСНГ_СвязанныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ВыборкаДокументов.ЭлектронныйДокумент);
			НаборЗаписей.Прочитать();
			
			ТаблицаЗаписей = НаборЗаписей.Выгрузить();
			ТаблицаЗаписей.Сортировать("Дата УБЫВ, Удалить_СвязанныйДокумент УБЫВ");
			
			Для каждого СтрокаЗаписи Из ТаблицаЗаписей Цикл
				
				Если СтрокаЗаписи.Удалить_СвязанныйДокумент <> Неопределено Тогда
					СтрокаЗаписи.СвязанныйДокумент = СтрокаЗаписи.Удалить_СвязанныйДокумент;
				КонецЕсли;
												
				СтрокаЗаписи.Удалить_СвязанныйДокумент = Неопределено;
				СтрокаЗаписи.КлючСтроки = ТаблицаЗаписей.Индекс(СтрокаЗаписи) + 1;
											
			КонецЦикла;	
			
			НаборЗаписей.Загрузить(ТаблицаЗаписей);
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОписаниеОшибки = ОписаниеОшибки();				                                                                                
		КонецПопытки;
				
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруЗапроса()

	СтруктураЗапроса = ККСНГ_ТранспортHTTPКлиентСервер.ПолучитьСтруктуруЗапроса();

	СтруктураЗапроса.Адрес = "https://update.esphere.ru/api/products";
	
	СтруктураЗапроса.Заголовки.Вставить("Accept", "application/json");
	СтруктураЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	СтруктураЗапроса.Заголовки.Вставить("Accept-Language", "ru");
	СтруктураЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	СтруктураЗапроса.Заголовки.Вставить("Content-Language", "ru");
	СтруктураЗапроса.Заголовки.Вставить("Content-Charset", "utf-8");
	
	Возврат СтруктураЗапроса;

КонецФункции

Функция ВызватьМетодИОбработатьРезультат(СтруктураЗапроса, ТипРезультата = Неопределено, ЗаголовокЖурнала = "")

	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета(ЗаголовокЖурнала);
	
	ККСНГ_ТранспортHTTPКлиентСервер.ЗаполнитьПараметрыПрокси(СтруктураЗапроса);
	
	СтруктураЗапроса.МаксРедиректов = 2;
	ОтветAPI = ККСНГ_ТранспортHTTPКлиентСервер.ВыполнитьHTTPМетод(СтруктураЗапроса);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОтветAPI.Журнал);
	
	Если ОтветAPI.Успех И ТипЗнч(ОтветAPI.Результат) = Тип("HTTPОтвет") Тогда
		
		Попытка

			// Обрабатываем результат
			Если ТипРезультата = Тип("ДвоичныеДанные") Тогда
				
				Ответ.Результат = ОтветAPI.Результат.ПолучитьТелоКакДвоичныеДанные();
				
			Иначе 
				
				СтрокаОтвета = ОтветAPI.Результат.ПолучитьТелоКакСтроку();
				
				Если ТипРезультата = Тип("Булево") Тогда
				
					СтрокаОтвета = СокрЛП(НРег(СтрокаОтвета));
					Если ККСНГ_ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(СтрокаОтвета) Тогда
						Ответ.Результат = Число(СтрокаОтвета) <> 0;
					ИначеЕсли СтрокаОтвета = "true" ИЛИ СтрокаОтвета = "истина" Тогда
						Ответ.Результат = Истина;
					Иначе
						Ответ.Результат = Ложь;
					КонецЕсли;
					
				Иначе 
					Ответ.Результат = СтрокаОтвета;
				КонецЕсли;	
				
			КонецЕсли;
			
			Ответ.Успех = Истина;

		Исключение

			// Не удалось прочитать XML
			ОписаниеОшибки = ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка обработки ответа API сервиса обновлений", "XT-00013", ОписаниеОшибки);

		КонецПопытки;

	ИначеЕсли ОтветAPI.КодОшибки < 500 И ТипЗнч(ОтветAPI.Результат) = Тип("HTTPОтвет") Тогда

		Попытка

			ИсходныеДанные = ОтветAPI.Результат.ПолучитьТелоКакСтроку();
			ОбъектXDTO = ККСНГ_APIКурьер.ПолучитьОбъектXDTO(ИсходныеДанные, "http://www.cc.org/Errors", "BodyRoot", Истина);
			ДанныеОшибки = ККСНГ_APIКурьер.ПолучитьСтруктуруПоОбъектуXDTO(ОбъектXDTO);

			// Пробежим по всем вариантам и добавим в журнал, если есть данные.
			Для Каждого Элемент Из ДанныеОшибки Цикл

				ОписаниеОшибки = Элемент.Значение;

				Если НЕ ТипЗнч(ОписаниеОшибки) = Тип("Структура") Тогда
					Продолжить;
				КонецЕсли;

				КодОшибки = "ER-00000";
				ТекстОшибки = "";
				ОписаниеОшибки.Свойство("ErrorNumber", КодОшибки);
				ОписаниеОшибки.Свойство("Message", ТекстОшибки);
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, КодОшибки);

			КонецЦикла;

		Исключение

			ОписаниеОшибки = ОписаниеОшибки();
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, ОписаниеОшибки,
													"Не удалось прочитать текст ошибки сервиса обновлений.");

		КонецПопытки;
		
	КонецЕсли;

	Возврат Ответ;

КонецФункции

#Область ПакетОбновления

Функция РаспаковатьАрхивОбновления(ДвоичныеДанныеАрхива, ИмяКаталогаОбновления)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Распаковка архива обновления");
		
	Попытка		
		СоздатьКаталог(ИмяКаталогаОбновления);		
	Исключение
		ТекстОшибки = "Не удалось создать каталог временных файлов обновления %1 по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяКаталогаОбновления);		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00002");
		Возврат Ответ;		
	КонецПопытки;
	
	Попытка
		
		ПотокАрхива = ДвоичныеДанныеАрхива.ОткрытьПотокДляЧтения();
		
		Архив = Новый ЧтениеZipФайла(ПотокАрхива);
		Архив.ИзвлечьВсе(ИмяКаталогаОбновления, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		Архив.Закрыть();
		
		ПотокАрхива.Закрыть();
		
	Исключение		
		ТекстОшибки = "Не удалось распаковать архив с обновлением по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00003");
		Возврат Ответ;		
	КонецПопытки;
	
	Ответ.Успех = Истина;
	Возврат Ответ;
	
КонецФункции	

Функция ПолучитьИсториюВерсий(ИмяКаталогаОбновления)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение истории версий");
	
	ТекстДок = Новый ТекстовыйДокумент;	
	ИмяФайлаИстории = ИмяКаталогаОбновления + "\Info.html";
	
	Попытка
		ТекстДок.Прочитать(ИмяФайлаИстории, КодировкаТекста.UTF8);
		Ответ.Результат = ТекстДок.ПолучитьТекст();
	Исключение	
		ТекстОшибки = "Не удалось получить историю версий из файла %1 пакета обновлений по причине: ";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяФайлаИстории) + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());			
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00004");
		Возврат Ответ;
	КонецПопытки;
	
	Ответ.Успех = Истина;
	Возврат Ответ;

КонецФункции

Функция ПолучитьДвоичныеДанныеОсновногоМодуля(ИмяКаталогаОбновления)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение двоичных данных основного модуля");
		
	ИмяФайлаРасширения = ИмяКаталогаОбновления + "\" + ИнформацияОПродукте().ИмяФайлаРасширения;
	ФайлРасширения = Новый Файл(ИмяФайлаРасширения);
	
	Если ФайлРасширения.Существует() Тогда
		
		Попытка
			ДвоичныеДанныеОсновногоМодуля = Новый ДвоичныеДанные(ФайлРасширения.ПолноеИмя);
		Исключение
			ТекстОшибки = "Не удалось получить основного модуля из файла %1 по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон(ТекстОшибки, ФайлРасширения.ПолноеИмя);			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00007");
			Возврат Ответ;	
		КонецПопытки;
		
		Ответ.Результат = ДвоичныеДанныеОсновногоМодуля;
		
	Иначе
		ТекстОшибки = "Не удалось найти файл %1 основного модуля";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяФайлаРасширения);			
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00008");
		Возврат Ответ;	
	КонецЕсли;			
	
	Ответ.Успех = Истина;
	Возврат Ответ; 
	
КонецФункции

Функция ПолучитьНастройкиПодключаемыхМодулей(ИмяКаталогаОбновления)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение списка подключаемых модулей");
	
	ИмяФайлаНастроек = ИмяКаталогаОбновления + "\" + ИнформацияОПродукте().ИмяМакетаНастройкиПодключаемыхМодулей;
	
	Попытка
		ТабДокНастроек = Новый ТабличныйДокумент;
		ТабДокНастроек.Прочитать(ИмяФайлаНастроек, СпособЧтенияЗначенийТабличногоДокумента.Значение);	
				
	Исключение		
		ТекстОшибки = "Не удалось получить список подключаемых модулей из файла %1 пакета обновлений по причине: ";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяФайлаНастроек) + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());			
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00006");
		Возврат Ответ;		
	КонецПопытки;
	
	
	НастройкиПодключаемыхМодулей = ККСНГ_ПодключаемыеМодулиВызовСервера.ПроверитьНеобходимостьОбновленияПодключаемыхМодулей(ТабДокНастроек);
	
	Ответ.Успех = НастройкиПодключаемыхМодулей.ПодключаемыеМодулиДляУстановки.Количество();
	Ответ.Результат = НастройкиПодключаемыхМодулей;
	
	Возврат Ответ;

КонецФункции

Функция ПолучитьДвоичныеДанныеПодключаемыхМодулей(ИмяКаталогаОбновления, МассивПодключаемыхМодулей)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение двоичных данных подключаемых модулей");
	
	// Получение двоичных данных из настроек
	Для Каждого ПодключемыйМодуль Из МассивПодключаемыхМодулей Цикл
		
		ИмяФайлаМакета = ИмяКаталогаОбновления + "\" + ПодключемыйМодуль.ИмяМакета;
		ФайлМакета = Новый Файл(ИмяФайлаМакета);
		
		Если ФайлМакета.Существует() Тогда
			Попытка
				ДвоичныеДанныеПМ = Новый ДвоичныеДанные(ФайлМакета.ПолноеИмя);
			Исключение
				ТекстОшибки = "Не удалось получить подключаемого модуля из файла %1 по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон(ТекстОшибки, ФайлМакета.ПолноеИмя);			
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00007");
				Возврат Ответ;	
			КонецПопытки;
			
			ПодключемыйМодуль.Вставить("ДвоичныеДанные", ДвоичныеДанныеПМ);
			
		Иначе
			ТекстОшибки = "Не удалось найти файл %1 подключаемого модуля";
			ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяФайлаМакета);			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "UD-00008");
			Возврат Ответ;	
		КонецЕсли;
				
	КонецЦикла;
	
	Ответ.Успех = Истина;
	Возврат Ответ; 
	
КонецФункции

Процедура УдалитьКаталогОбновления(ИмяКаталогаОбновления, ЖурналСообщений)
	
	Попытка
		УдалитьФайлы(ИмяКаталогаОбновления);
	Исключение	
		ТекстОшибки = "Не удалось удалить каталог временных файлов обновления %1 по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяКаталогаОбновления);			
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(ЖурналСообщений, ТекстОшибки, "UD-00008");
	КонецПопытки;	

КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПолучитьРасширение(ИмяРасширения)
	
	РасширениеКонфигурации = Неопределено;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Имя", ИмяРасширения);

	УстановитьПривилегированныйРежим(Истина);

	МассивРасширений = РасширенияКонфигурации.Получить(СтруктураОтбора);		
	Если МассивРасширений.Количество() > 0 Тогда
		РасширениеКонфигурации = МассивРасширений[0];		
	КонецЕсли;
	
	Возврат РасширениеКонфигурации;
	
КонецФункции

Функция ПолучитьТекущуюВерсиюРасширения(ИмяРасширения)
	
	ТекущаяВерсия = Неопределено;
	
	РасширениеКонфигурации = ПолучитьРасширение(ИмяРасширения);
	
	Если РасширениеКонфигурации <> Неопределено Тогда
		ТекущаяВерсия = РасширениеКонфигурации.Версия;		
	КонецЕсли;
	
	Возврат ТекущаяВерсия;
	
КонецФункции

#КонецОбласти

#КонецОбласти