
#Область ПрограммныйИнтерфейс

#Область РаботаССертификатами

// Возвращает соответствие кодов ошибок по наименованиям
//
// Параметры:
//  нет
//
// Возвращаемое значение:
// Соответствие , пример "НетАктивногоСертификата", "UC-00001"
//
Функция ОшибкиСертификатаКлючаЭП() Экспорт
	
	ОбрабатываемыеОшибки = Новый Соответствие;
	ОбрабатываемыеОшибки.Вставить("НетАктивногоСертификата", "UC-00001");
	ОбрабатываемыеОшибки.Вставить("ОшибкаЗапросаАктивногоСертификата", "UC-00002"); 
	ОбрабатываемыеОшибки.Вставить("АктивныйСертификатПросрочен", "UC-00003"); 
	ОбрабатываемыеОшибки.Вставить("АктивныйСертификатПокаНеДействует", "UC-00004"); 
	ОбрабатываемыеОшибки.Вставить("НеНайденСертификатЭП", "UC-00005");
	
	Возврат ОбрабатываемыеОшибки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаССертификатами

// Строковое представление периода
//
// Параметры:
//  НачалоДействия - Дата
//  КонецДействия  - Дата
//
// Возвращаемое значение:
// Строка, вид "c " НачалоДействия " по " КонецДействия
//
Функция СрокДействияСертификатаСтрокой(НачалоДействия, КонецДействия) Экспорт
	
	Возврат "С " + Формат(НачалоДействия, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецДействия, "ДФ=dd.MM.yyyy");
	
КонецФункции

// Данные сертификата
//
// Параметры:
//  Сертификат - см. СертификатКриптографии()
//
// Возвращаемое значение:
// Структура
//
Функция ПолучитьСвойстваСертификата(Сертификат) Экспорт
	
	Субъект = Сертификат.Субъект;
	Издатель = Сертификат.Издатель;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("Организация");
	Свойства.Вставить("Должность");
	Свойства.Вставить("Издатель");
	Свойства.Вставить("ДатаНачала");
	Свойства.Вставить("ДатаОкончания");
	Свойства.Вставить("Отпечаток");
	Свойства.Вставить("СерийныйНомер");
	Свойства.Вставить("Представление");
	Свойства.Вставить("ИздательСтруктурой");
	Свойства.Вставить("СубъектСтруктурой");
	
	Свойства.ИздательСтруктурой =  Новый Структура(Сертификат.Издатель);
	Свойства.СубъектСтруктурой = Новый Структура(Сертификат.Субъект);
	
	// ОбщееИмя
	Если Субъект.Свойство("OID2_5_4_4") И Субъект.Свойство("OID2_5_4_42") Тогда
		Свойства.ОбщееИмя = СокрЛП(Субъект.OID2_5_4_4) + " " + СокрЛП(Субъект.OID2_5_4_42);
	ИначеЕсли Субъект.Свойство("OID2_5_4_3") Тогда
		Свойства.ОбщееИмя = СокрЛП(Субъект.OID2_5_4_3);
	ИначеЕсли Субъект.Свойство("CN") Тогда
		Свойства.ОбщееИмя = СокрЛП(Субъект.CN);
	Иначе
		Свойства.ОбщееИмя = "";
	КонецЕсли;
	
	// Организация	
	Если Субъект.Свойство("OID2_5_4_10") Тогда
		Свойства.Организация = СокрЛП(Субъект.OID2_5_4_10);	
	ИначеЕсли Субъект.Свойство("O") Тогда
		Свойства.Организация = СокрЛП(Субъект.O);
	Иначе
		Свойства.Организация = "";
	КонецЕсли;
	
	// Должность
	Если Субъект.Свойство("OID2_5_4_12") Тогда
		Свойства.Должность = СокрЛП(Субъект.OID2_5_4_12);
	ИначеЕсли Субъект.Свойство("OID2_5_4_33") Тогда
		Свойства.Должность = СокрЛП(Субъект.OID2_5_4_33);
	ИначеЕсли Субъект.Свойство("T") Тогда
		Свойства.Должность = СокрЛП(Субъект.T);		
	Иначе
		Свойства.Должность = "";
	КонецЕсли;
	
	// Издатель
	Если Издатель.Свойство("OID2_5_4_10") Тогда
		Свойства.Издатель = СокрЛП(Издатель.OID2_5_4_10);
	ИначеЕсли Издатель.Свойство("O") Тогда
		Свойства.Издатель = СокрЛП(Издатель.O);	
	Иначе
		Свойства.Издатель = "";
	КонецЕсли;
	
	// Остальное
	ЗаполнитьЗначенияСвойств(Свойства, Сертификат, "ДатаНачала, ДатаОкончания");
	Свойства.Отпечаток = ККСНГ_ОбщегоНазначенияКлиентСервер.УдалитьСимволыИзСтроки(ВРег(Сертификат.Отпечаток), " ");
	Свойства.СерийныйНомер = Base64Строка(Сертификат.СерийныйНомер);
	
	// Представление
	Свойства.Представление = Свойства.ОбщееИмя + ", " 
						   + Свойства.Организация + ", "
						   + Свойства.Должность + ", до "
						   + Формат(Свойства.ДатаОкончания, "ДФ=dd.MM.yyyy")
						   + " (" + Свойства.Издатель + ")";
						   
	ОстальныеСвойства = СвойстваСубъектаСертификата(Сертификат);
	ККСНГ_ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Свойства, ОстальныеСвойства, Ложь);
	
	Возврат Свойства;
	
КонецФункции

// Возвращает представление сертификата в справочнике, формируемое
// из представления субъекта (КомуВыдан) и срока действия сертификата.
//
// Параметры:
//   Сертификат   - СертификатКриптографии - сертификат криптографии.
//
// Возвращаемое значение:
//  Строка - представление сертификата в справочнике.
//
Функция ПредставлениеСертификата(Сертификат) Экспорт
	
	Результат = СтрШаблон(НСтр("ru = '%1, до %2';
							|en = '%1, to %2'"),
			ПредставлениеСубъекта(Сертификат),
			Формат(Сертификат.ДатаОкончания, "ДФ=MM.yyyy"));
	
	Возврат Результат;
		
КонецФункции

#Область СубъектСертификата

// Возвращает свойства субъекта сертификата криптографии с учетом их состава (ЮЛ,ИП,ФЛ).
//
// Параметры:
//   Сертификат - СертификатКриптографии - для которого нужно вернуть свойства субъекта.
//
// Возвращаемое значение:
//  Структура - возвращаемое значение, со свойствами:
//     * ОбщееИмя         - Строка - (64) - извлекается из поля CN.
//                          ЮЛ: В зависимости от типа конечного владельца СКПЭП
//                              - наименование организации;
//                              - название автоматизированной системы;
//                              - другое отображаемое имя по требованиям информационной системы.
//                          ФЛ: ФИО.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Страна           - Строка - (2) - извлекается из поля C - двухсимвольный код страны
//                          согласно ГОСТ 7.67-2003 (ИСО 3166-1:1997).
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Регион           - Строка - (128) - извлекается из поля S - наименование субъекта РФ.
//                          ЮЛ: По адресу местонахождения.
//                          ФЛ: По адресу регистрации.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * НаселенныйПункт  - Строка - (128) - извлекается из поля L - наименование населенного пункта.
//                          ЮЛ: По адресу местонахождения.
//                          ФЛ: По адресу регистрации.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Улица            - Строка - (128) - извлекается из поля Street - наименование улицы, дома, офиса.
//                          ЮЛ: По адресу местонахождения.
//                          ФЛ: По адресу регистрации.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Организация      - Строка - (64) - извлекается из поля O.
//                          ЮЛ: Полное или сокращенное наименование организации.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Подразделение    - Строка - (64) - извлекается из поля OU.
//                          ЮЛ: В случае выпуска СКПЭП на должностное лицо - подразделение организации.
//                              Подразделение - это территориальная структурная единица крупной организации,
//                              которое обычно не заполняется в сертификате.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Должность        - Строка - (64) - извлекается из поля T.
//                          ЮЛ: В случае выпуска СКПЭП на должностное лицо - его должность.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * ЭлектроннаяПочта - Строка - (128) - извлекается из поля E - адрес электронной почты.
//                          ЮЛ: адрес электронной почты должностного лица.
//                          ФЛ: адрес электронной почты физического лица.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * ОГРН             - Строка - (13) - извлекается из поля OGRN.
//                          ЮЛ: ОГРН организации.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * ОГРНИП           - Строка - (15) - извлекается из поля OGRNIP.
//                          ИП: ОГРН индивидуального предпринимателя.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * СНИЛС            - Строка - (11) - извлекается из поля SNILS.
//                          ФЛ: СНИЛС
//                          ЮЛ: Не обязательно, в случае выпуска СКПЭП на должностное лицо - его СНИЛС.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * ИНН              - Строка - (12) - извлекается из поля INN.
//                          ФЛ: ИНН.
//                          ИП: ИНН.
//                          ЮЛ: Не обязательно, но может быть заполнен для целей взаимодействия с ФНС.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Фамилия          - Строка - (64) - извлекается из поля SN, если заполнено.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Имя              - Строка - (64) - извлекается из поля GN, если заполнено.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
//     * Отчество         - Строка - (64) - извлекается из поля GN, если заполнено.
//                        - Неопределено - нужное свойство сертификата не найдено.
//
Функция СвойстваСубъектаСертификата(Сертификат) Экспорт
	
	Субъект = Неопределено;
	Если ТипЗнч(Сертификат) = Тип("СертификатКриптографии") Тогда
		Субъект = Сертификат.Субъект;
	КонецЕсли;	
	
	Если ТипЗнч(Субъект) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("Страна");
	Свойства.Вставить("Регион");
	Свойства.Вставить("НаселенныйПункт");
	Свойства.Вставить("Улица");
	Свойства.Вставить("Организация");
	Свойства.Вставить("Подразделение");
	Свойства.Вставить("Должность");
	Свойства.Вставить("ЭлектроннаяПочта");
	Свойства.Вставить("ОГРН");
	Свойства.Вставить("ОГРНИП");
	Свойства.Вставить("СНИЛС");
	Свойства.Вставить("ИНН");
	Свойства.Вставить("Фамилия");
	Свойства.Вставить("Имя");
	Свойства.Вставить("Отчество");
	
	Если Субъект.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.CN);
	КонецЕсли;
	
	Если Субъект.Свойство("C") Тогда
		Свойства.Страна = ПодготовитьСтроку(Субъект.C);
	КонецЕсли;
	
	Если Субъект.Свойство("ST") Тогда
		Свойства.Регион = ПодготовитьСтроку(Субъект.ST);
	КонецЕсли;
	
	Если Субъект.Свойство("L") Тогда
		Свойства.НаселенныйПункт = ПодготовитьСтроку(Субъект.L);
	КонецЕсли;
	
	Если Субъект.Свойство("Street") Тогда
		Свойства.Улица = ПодготовитьСтроку(Субъект.Street);
	КонецЕсли;
	
	Если Субъект.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Субъект.O);
	КонецЕсли;
	
	Если Субъект.Свойство("OU") Тогда
		Свойства.Подразделение = ПодготовитьСтроку(Субъект.OU);
	КонецЕсли;
	
	Если Субъект.Свойство("E") Тогда
		Свойства.ЭлектроннаяПочта = ПодготовитьСтроку(Субъект.E);
	КонецЕсли;
	
	Если Субъект.Свойство("OGRN") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Субъект.OGRN);
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_1") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Субъект.OID1_2_643_100_1);
	Иначе
		Свойства.ОГРН = "";		
	КонецЕсли;
	
	Если Субъект.Свойство("OGRNIP") Тогда
		Свойства.ОГРНИП = ПодготовитьСтроку(Субъект.OGRNIP);
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_5") Тогда
		Свойства.ОГРНИП = ПодготовитьСтроку(Субъект.OID1_2_643_100_5);
	Иначе
		Свойства.ОГРНИП = "";			
	КонецЕсли;
	
	Если Субъект.Свойство("SNILS") Тогда
		Свойства.СНИЛС = ПодготовитьСтроку(Субъект.SNILS);
	ИначеЕсли Субъект.Свойство("OID1_2_643_100_3") Тогда
		Свойства.СНИЛС = ПодготовитьСтроку(Субъект.OID1_2_643_100_3);
	Иначе
		Свойства.СНИЛС = "";			
	КонецЕсли;
	
	Если Субъект.Свойство("INN") Тогда
		Свойства.ИНН = ПодготовитьСтроку(Субъект.INN);
	ИначеЕсли Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
		Свойства.ИНН = ПодготовитьСтроку(Субъект.OID1_2_643_3_131_1_1);
	Иначе
		Свойства.ИНН = "";				
	КонецЕсли;
	
	Если Субъект.Свойство("SN") Тогда // Наличие фамилии (обычно для должностного лица).
		
		// Извлечение ФИО из поля SN и GN.
		Свойства.Фамилия = ПодготовитьСтроку(Субъект.SN);
		
		Если Субъект.Свойство("GN") Тогда
			GivenName = ПодготовитьСтроку(Субъект.GN);
			Позиция = СтрНайти(GivenName, " ");
			Если Позиция = 0 Тогда
				Свойства.Имя = GivenName;
			Иначе
				Свойства.Имя = Лев(GivenName, Позиция - 1);
				Свойства.Отчество = ПодготовитьСтроку(Сред(GivenName, Позиция + 1));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Субъект.Свойство("OGRNIP")            // Признак индивидуального предпринимателя.
	      Или Субъект.Свойство("OID1_2_643_100_5")  // Признак индивидуального предпринимателя.
	      Или Субъект.Свойство("T")                 // Признак должностного лица.
	      Или Субъект.Свойство("OID2_5_4_12")       // Признак должностного лица.
	      Или Субъект.Свойство("SNILS")                                     // Признак физического лица.
	      Или Субъект.Свойство("OID1_2_643_100_3")                          // Признак физического лица.
	      Или ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИННФизЛица(Субъект.Свойство("INN"))                        // Признак физического лица.
	      Или ККСНГ_ОбщегоНазначенияКлиентСервер.ЭтоИННФизЛица(Субъект.Свойство("OID1_2_643_3_131_1_1")) Тогда // Признак физического лица.
		
		Если Свойства.ОбщееИмя <> Свойства.Организация
		   И Не (Субъект.Свойство("T")           И Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.T))
		   И Не (Субъект.Свойство("OID2_5_4_12") И Свойства.ОбщееИмя = ПодготовитьСтроку(Субъект.OID2_5_4_12)) Тогда
			
			// Извлечение ФИО из поля CN.
			Массив = СтрРазделить(Свойства.ОбщееИмя, " ", Ложь);
			                                                                     
			Если Массив.Количество() < 4 Тогда
				Если Массив.Количество() > 0 Тогда
					Свойства.Фамилия = СокрЛП(Массив[0]);
				КонецЕсли;
				Если Массив.Количество() > 1 Тогда
					Свойства.Имя = СокрЛП(Массив[1]);
				КонецЕсли;
				Если Массив.Количество() > 2 Тогда
					Свойства.Отчество = СокрЛП(Массив[2]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Свойства.Фамилия = "";				
		Свойства.Имя = "";
		Свойства.Отчество = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Свойства.Фамилия)
	 Или ЗначениеЗаполнено(Свойства.Имя) Тогда
		
		Если Субъект.Свойство("T") Тогда
			Свойства.Должность = ПодготовитьСтроку(Субъект.T);
		ИначеЕсли Субъект.Свойство("OID2_5_4_12") Тогда
			Свойства.Должность = ПодготовитьСтроку(Субъект.OID2_5_4_12);
		Иначе
			Свойства.Должность = "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

// Возвращает представление субъекта сертификата (КомуВыдан).
//
// Параметры:
//   Сертификат - СертификатКриптографии - сертификат криптографии.
//
// Возвращаемое значение:
//   Строка   - представление субъекта в формате "Фамилия Имя, Организация, Подразделение, Должность".
//              Если ФИО не удалось определить, тогда оно заменяется на ОбщееИмя.
//              Организация, Подразделение и Должность могут отсутствовать, если не указаны или
//              их не удалось определить.
//
Функция ПредставлениеСубъекта(Сертификат, Отчество = Истина) Экспорт
	
	Субъект = СвойстваСубъектаСертификата(Сертификат);
	
	Если ЗначениеЗаполнено(Субъект.Фамилия)
	   И ЗначениеЗаполнено(Субъект.Имя) Тогда
		
		Представление = Субъект.Фамилия + " " + Субъект.Имя;
		
	ИначеЕсли ЗначениеЗаполнено(Субъект.Фамилия) Тогда
		Представление = Субъект.Фамилия;
		
	ИначеЕсли ЗначениеЗаполнено(Субъект.Имя) Тогда
		Представление = Субъект.Имя;
		
	Иначе
		Представление = "";
		
	КонецЕсли;
	
	Если Отчество И ЗначениеЗаполнено(Субъект.Отчество) Тогда
		Представление = Представление + " " + Субъект.Отчество;
	КонецЕсли;
	
	 Если ЗначениеЗаполнено(Представление) Тогда
		Если ЗначениеЗаполнено(Субъект.Организация) Тогда
			Представление = Представление + ", " + Субъект.Организация;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Субъект.Подразделение) Тогда
			Представление = Представление + ", " + Субъект.Подразделение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Субъект.Должность) Тогда
			Представление = Представление + ", " + Субъект.Должность;
		КонецЕсли;
		
	Иначе
		Если ЗначениеЗаполнено(Субъект.ОбщееИмя) Тогда
			Представление = Субъект.ОбщееИмя;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#Область ИздательСертификата

// Возвращает свойства издателя сертификата криптографии. 
//
// Параметры:
//   Сертификат - СертификатКриптографии - для которого нужно вернуть свойства издателя.
//
// Возвращаемое значение:
//  Структура - со свойствами, состав которых зависит от национальной специфики.
//              Пример для Российской Федерации:
//     * ОбщееИмя         - Строка - (64) - извлекается из поля CN - псевдоним удостоверяющего центра.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * Страна           - Строка - (2) - извлекается из поля C - двухсимвольный код страны
//                          согласно ИСО 3166-1:1997 (ГОСТ 7.67-2003).
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * Регион           - Строка - (128) - извлекается из поля S - наименование субъекта РФ
//                          по адресу местонахождения ПАК УЦ.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * НаселенныйПункт  - Строка - (128) - извлекается из поля L - наименование населенного пункта
//                          по адресу местонахождения ПАК УЦ.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * Улица            - Строка - (128) - извлекается из поля Street - наименование улицы, дома, офиса
//                          по адресу местонахождения ПАК УЦ.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * Организация      - Строка - (64) - извлекается из поля O - полное или сокращенное наименование организации.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * Подразделение    - Строка - (64) - извлекается из поля OU - подразделение организации.
//                            Подразделение - это территориальная структурная единица крупной организации,
//                            которое обычно не заполняется в сертификате.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * ЭлектроннаяПочта - Строка - (128) - извлекается из поля E - адрес электронной почты удостоверяющего центра.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * ОГРН             - Строка - (13) - извлекается из поля OGRN - ОГРН организации удостоверяющего центра.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
//     * ИНН              - Строка - (12) - извлекается из поля INN - ИНН организации удостоверяющего центра.
//                        - Неопределено - такое свойство сертификата отсутствует.
//
Функция СвойстваИздателяСертификата(Сертификат) Экспорт
	
	Издатель = Сертификат.Издатель;
	
	Свойства = Новый Структура;
	Свойства.Вставить("ОбщееИмя");
	Свойства.Вставить("Страна");
	Свойства.Вставить("Регион");
	Свойства.Вставить("НаселенныйПункт");
	Свойства.Вставить("Улица");
	Свойства.Вставить("Организация");
	Свойства.Вставить("Подразделение");
	Свойства.Вставить("ЭлектроннаяПочта");
	Свойства.Вставить("ОГРН");
	Свойства.Вставить("ИНН");
	
	Если Издатель.Свойство("CN") Тогда
		Свойства.ОбщееИмя = ПодготовитьСтроку(Издатель.CN);
	КонецЕсли;
	
	Если Издатель.Свойство("C") Тогда
		Свойства.Страна = ПодготовитьСтроку(Издатель.C);
	КонецЕсли;
	
	Если Издатель.Свойство("ST") Тогда
		Свойства.Регион = ПодготовитьСтроку(Издатель.ST);
	КонецЕсли;
	
	Если Издатель.Свойство("L") Тогда
		Свойства.НаселенныйПункт = ПодготовитьСтроку(Издатель.L);
	КонецЕсли;
	
	Если Издатель.Свойство("Street") Тогда
		Свойства.Улица = ПодготовитьСтроку(Издатель.Street);
	КонецЕсли;
	
	Если Издатель.Свойство("O") Тогда
		Свойства.Организация = ПодготовитьСтроку(Издатель.O);
	КонецЕсли;
	
	Если Издатель.Свойство("OU") Тогда
		Свойства.Подразделение = ПодготовитьСтроку(Издатель.OU);
	КонецЕсли;
	
	Если Издатель.Свойство("E") Тогда
		Свойства.ЭлектроннаяПочта = ПодготовитьСтроку(Издатель.E);
	КонецЕсли;
	
	Если Издатель.Свойство("OGRN") Тогда
		Свойства.ОГРН = ПодготовитьСтроку(Издатель.OGRN);
	Иначе
		Если Издатель.Свойство("OID1_2_643_100_1") Тогда
			Свойства.ОГРН = ПодготовитьСтроку(Издатель.OID1_2_643_100_1);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Издатель.Свойство("INN") Тогда
		Свойства.ИНН = ПодготовитьСтроку(Издатель.INN);
	Иначе
		Если Издатель.Свойство("OID1_2_643_3_131_1_1")Тогда
			Свойства.ИНН = ПодготовитьСтроку(Издатель.OID1_2_643_3_131_1_1);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

// Возвращает представление издателя сертификата (КемВыдан).
//
// Параметры:
//   Сертификат - СертификатКриптографии - сертификат криптографии.
//
// Возвращаемое значение:
//   Строка - представление издателя в формате "ОбщееИмя, Организация, Подразделение",
//            Организация и Подразделение могут отсутствовать, если не указаны.
//
Функция ПредставлениеИздателя(Сертификат) Экспорт
	
	Издатель = СвойстваИздателяСертификата(Сертификат);
	
	Представление = "";
	
	Если ЗначениеЗаполнено(Издатель.ОбщееИмя) Тогда
		Представление = Издатель.ОбщееИмя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Издатель.ОбщееИмя)
	   И ЗначениеЗаполнено(Издатель.Организация)
	   И СтрНайти(Издатель.ОбщееИмя, Издатель.Организация) = 0 Тогда
		
		Представление = Издатель.ОбщееИмя + ", " + Издатель.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Издатель.Подразделение) Тогда
		Представление = Представление + ", " + Издатель.Подразделение;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаССертификатами

Функция ПодготовитьСтроку(СтрокаИзСертификата)
	
	Возврат СокрЛП(ККСНГ_ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(СтрокаИзСертификата));
	
КонецФункции

#КонецОбласти

#КонецОбласти