
#Область ОписаниеПеременных

&НаКлиенте
// Указывает на необходимость закрытия текущей формы из-за завершения операции, 
// инициировавшей ее открытие или отмену действия пользователем
Перем ЗакрытьФормуПринудительно Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработчикОжидания", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрытьФормуПринудительно = Неопределено Тогда
		ДействиеОтменено = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ДействиеОтменено = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОжидания()
	
	ВыполнитьОбработкуОповещения(ЭтотОбъект.ОписаниеОповещенияОЗакрытии, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
